
*** Dumping AST Record Layout
         0 | struct __pthread_cond_s::(anonymous at /usr/include/bits/thread-shared-types.h:97:5)
         0 |   unsigned int __low
         4 |   unsigned int __high
           | [sizeof=8, dsize=8, align=4,
           |  nvsize=8, nvalign=4]

*** Dumping AST Record Layout
         0 | union __pthread_cond_s::(anonymous at /usr/include/bits/thread-shared-types.h:94:17)
         0 |   unsigned long long __wseq
         0 |   struct __pthread_cond_s::(anonymous at /usr/include/bits/thread-shared-types.h:97:5) __wseq32
         0 |     unsigned int __low
         4 |     unsigned int __high
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __pthread_internal_list
         0 |   struct __pthread_internal_list * __prev
         8 |   struct __pthread_internal_list * __next
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __pthread_mutex_s
         0 |   int __lock
         4 |   unsigned int __count
         8 |   int __owner
        12 |   unsigned int __nusers
        16 |   int __kind
        20 |   short __spins
        22 |   short __elision
        24 |   struct __pthread_internal_list __list
        24 |     struct __pthread_internal_list * __prev
        32 |     struct __pthread_internal_list * __next
           | [sizeof=40, dsize=40, align=8,
           |  nvsize=40, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __pthread_cond_s::(anonymous at /usr/include/bits/thread-shared-types.h:106:5)
         0 |   unsigned int __low
         4 |   unsigned int __high
           | [sizeof=8, dsize=8, align=4,
           |  nvsize=8, nvalign=4]

*** Dumping AST Record Layout
         0 | union __pthread_cond_s::(anonymous at /usr/include/bits/thread-shared-types.h:103:17)
         0 |   unsigned long long __g1_start
         0 |   struct __pthread_cond_s::(anonymous at /usr/include/bits/thread-shared-types.h:106:5) __g1_start32
         0 |     unsigned int __low
         4 |     unsigned int __high
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __pthread_cond_s
         0 |   union __pthread_cond_s::(anonymous at /usr/include/bits/thread-shared-types.h:94:17) 
         0 |     unsigned long long __wseq
         0 |     struct __pthread_cond_s::(anonymous at /usr/include/bits/thread-shared-types.h:97:5) __wseq32
         0 |       unsigned int __low
         4 |       unsigned int __high
         8 |   union __pthread_cond_s::(anonymous at /usr/include/bits/thread-shared-types.h:103:17) 
         8 |     unsigned long long __g1_start
         8 |     struct __pthread_cond_s::(anonymous at /usr/include/bits/thread-shared-types.h:106:5) __g1_start32
         8 |       unsigned int __low
        12 |       unsigned int __high
        16 |   unsigned int [2] __g_refs
        24 |   unsigned int [2] __g_size
        32 |   unsigned int __g1_orig_size
        36 |   unsigned int __wrefs
        40 |   unsigned int [2] __g_signals
           | [sizeof=48, dsize=48, align=8,
           |  nvsize=48, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __pthread_rwlock_arch_t
         0 |   unsigned int __readers
         4 |   unsigned int __writers
         8 |   unsigned int __wrphase_futex
        12 |   unsigned int __writers_futex
        16 |   unsigned int __pad3
        20 |   unsigned int __pad4
        24 |   int __cur_writer
        28 |   int __shared
        32 |   signed char __rwelision
        33 |   unsigned char [7] __pad1
        40 |   unsigned long __pad2
        48 |   unsigned int __flags
           | [sizeof=56, dsize=56, align=8,
           |  nvsize=56, nvalign=8]

*** Dumping AST Record Layout
         0 | lldiv_t
         0 |   long long quot
         8 |   long long rem
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct msghdr
         0 |   void * msg_name
         8 |   socklen_t msg_namelen
        16 |   struct iovec * msg_iov
        24 |   size_t msg_iovlen
        32 |   void * msg_control
        40 |   size_t msg_controllen
        48 |   int msg_flags
           | [sizeof=56, dsize=56, align=8,
           |  nvsize=56, nvalign=8]

*** Dumping AST Record Layout
         0 | struct in_addr
         0 |   in_addr_t s_addr
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | union in6_addr::(anonymous at /usr/include/netinet/in.h:214:5)
         0 |   uint8_t [16] __u6_addr8
         0 |   uint16_t [8] __u6_addr16
         0 |   uint32_t [4] __u6_addr32
           | [sizeof=16, dsize=16, align=4,
           |  nvsize=16, nvalign=4]

*** Dumping AST Record Layout
         0 | struct sockaddr
         0 |   sa_family_t sa_family
         2 |   char [14] sa_data
           | [sizeof=16, dsize=16, align=2,
           |  nvsize=16, nvalign=2]

*** Dumping AST Record Layout
         0 | struct in6_addr
         0 |   union in6_addr::(anonymous at /usr/include/netinet/in.h:214:5) __in6_u
         0 |     uint8_t [16] __u6_addr8
         0 |     uint16_t [8] __u6_addr16
         0 |     uint32_t [4] __u6_addr32
           | [sizeof=16, dsize=16, align=4,
           |  nvsize=16, nvalign=4]

*** Dumping AST Record Layout
         0 | struct sockaddr_storage
         0 |   sa_family_t ss_family
         2 |   char [118] __ss_padding
       120 |   unsigned long __ss_align
           | [sizeof=128, dsize=128, align=8,
           |  nvsize=128, nvalign=8]

*** Dumping AST Record Layout
         0 | struct sockaddr_in6
         0 |   sa_family_t sin6_family
         2 |   in_port_t sin6_port
         4 |   uint32_t sin6_flowinfo
         8 |   struct in6_addr sin6_addr
         8 |     union in6_addr::(anonymous at /usr/include/netinet/in.h:214:5) __in6_u
         8 |       uint8_t [16] __u6_addr8
         8 |       uint16_t [8] __u6_addr16
         8 |       uint32_t [4] __u6_addr32
        24 |   uint32_t sin6_scope_id
           | [sizeof=28, dsize=28, align=4,
           |  nvsize=28, nvalign=4]

*** Dumping AST Record Layout
         0 | struct timeval
         0 |   __time_t tv_sec
         8 |   __suseconds_t tv_usec
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct String::memo_t
         0 |   volatile uint32_t refcount
         4 |   uint32_t capacity
         8 |   volatile uint32_t dirty
        12 |   char [8] real_data
           | [sizeof=20, dsize=20, align=4,
           |  nvsize=20, nvalign=4]

*** Dumping AST Record Layout
         0 | class IPAddress
         0 |   uint32_t _addr
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | union Timestamp::rep_t
         0 |   int64_t x
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class Timestamp
         0 |   union Timestamp::rep_t _t
         0 |     int64_t x
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct timespec
         0 |   __time_t tv_sec
         8 |   __syscall_slong_t tv_nsec
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class Element::Port
         0 |   class Element * _e
         8 |   int _port
           | [sizeof=16, dsize=12, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | struct String::rep_t
         0 |   const char * data
         8 |   int length
        16 |   struct String::memo_t * memo
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class String
         0 |   struct String::rep_t _r
         0 |     const char * data
         8 |     int length
        16 |     struct String::memo_t * memo
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct TimerSet::heap_element
         0 |   class Timestamp expiry_s
         0 |     union Timestamp::rep_t _t
         0 |       int64_t x
         8 |   class Timer * t
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct pollfd
         0 |   int fd
         4 |   short events
         6 |   short revents
           | [sizeof=8, dsize=8, align=4,
           |  nvsize=8, nvalign=4]

*** Dumping AST Record Layout
         0 | struct SelectSet::SelectorInfo
         0 |   class Element * read
         8 |   class Element * write
        16 |   int pollfd
           | [sizeof=24, dsize=20, align=8,
           |  nvsize=20, nvalign=8]

*** Dumping AST Record Layout
         0 | struct Router::Port
         0 |   int idx
         4 |   int port
           | [sizeof=8, dsize=8, align=4,
           |  nvsize=8, nvalign=4]

*** Dumping AST Record Layout
         0 | struct Router::element_landmark_t
         0 |   uint32_t first_landmarkid
         8 |   class String filename
         8 |     struct String::rep_t _r
         8 |       const char * data
        16 |       int length
        24 |       struct String::memo_t * memo
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | class vector_memory<class sized_array_memory<4> >
         0 |   vector_memory<class sized_array_memory<4> >::type * l_
         8 |   vector_memory::size_type n_
        12 |   vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class Vector<int>
         0 |   class vector_memory<class sized_array_memory<4> > vm_
         0 |     vector_memory<class sized_array_memory<4> >::type * l_
         8 |     vector_memory::size_type n_
        12 |     vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct Router::Connection
         0 |   struct Router::Port [2] p
           | [sizeof=16, dsize=16, align=4,
           |  nvsize=16, nvalign=4]

*** Dumping AST Record Layout
         0 | class atomic_uint32_t
         0 |   uint32_t _val
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct StringAccum::rep_t
         0 |   unsigned char * s
         8 |   int len
        12 |   int cap
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct (anonymous at /usr/include/bits/types/siginfo_t.h:97:3)
         0 |   void * _lower
         8 |   void * _upper
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union sigval
         0 |   int sival_int
         0 |   void * sival_ptr
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union sigaction::(anonymous at /usr/include/bits/sigaction.h:31:5)
         0 |   __sighandler_t sa_handler
         0 |   void (*)(int, siginfo_t *, void *) sa_sigaction
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct _fpxreg
         0 |   unsigned short [4] significand
         8 |   unsigned short exponent
        10 |   unsigned short [3] __glibc_reserved1
           | [sizeof=16, dsize=16, align=2,
           |  nvsize=16, nvalign=2]

*** Dumping AST Record Layout
         0 | struct _xmmreg
         0 |   __uint32_t [4] element
           | [sizeof=16, dsize=16, align=4,
           |  nvsize=16, nvalign=4]

*** Dumping AST Record Layout
         0 | struct _fpstate
         0 |   __uint16_t cwd
         2 |   __uint16_t swd
         4 |   __uint16_t ftw
         6 |   __uint16_t fop
         8 |   __uint64_t rip
        16 |   __uint64_t rdp
        24 |   __uint32_t mxcsr
        28 |   __uint32_t mxcr_mask
        32 |   struct _fpxreg [8] _st
       160 |   struct _xmmreg [16] _xmm
       416 |   __uint32_t [24] __glibc_reserved1
           | [sizeof=512, dsize=512, align=8,
           |  nvsize=512, nvalign=8]

*** Dumping AST Record Layout
         0 | struct _libc_fpxreg
         0 |   unsigned short [4] significand
         8 |   unsigned short exponent
        10 |   unsigned short [3] __glibc_reserved1
           | [sizeof=16, dsize=16, align=2,
           |  nvsize=16, nvalign=2]

*** Dumping AST Record Layout
         0 | struct _libc_xmmreg
         0 |   __uint32_t [4] element
           | [sizeof=16, dsize=16, align=4,
           |  nvsize=16, nvalign=4]

*** Dumping AST Record Layout
         0 | struct ArchiveElement
         0 |   class String name
         0 |     struct String::rep_t _r
         0 |       const char * data
         8 |       int length
        16 |       struct String::memo_t * memo
        24 |   int date
        28 |   int uid
        32 |   int gid
        36 |   int mode
        40 |   class String data
        40 |     struct String::rep_t _r
        40 |       const char * data
        48 |       int length
        56 |       struct String::memo_t * memo
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=64, nvalign=8]

*** Dumping AST Record Layout
         0 | struct StaticNameDB::Entry
         0 |   const char * name
         8 |   uint32_t value
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class NameDB
         0 |   (NameDB vtable pointer)
         8 |   uint32_t _type
        16 |   class String _context
        16 |     struct String::rep_t _r
        16 |       const char * data
        24 |       int length
        32 |       struct String::memo_t * memo
        40 |   size_t _value_size
        48 |   class NameDB * _context_parent
        56 |   class NameDB * _context_sibling
        64 |   class NameDB * _context_child
        72 |   class NameInfo * _installed
           | [sizeof=80, dsize=80, align=8,
           |  nvsize=80, nvalign=8]

*** Dumping AST Record Layout
         0 | class StaticNameDB
         0 |   class NameDB (primary base)
         0 |     (NameDB vtable pointer)
         8 |     uint32_t _type
        16 |     class String _context
        16 |       struct String::rep_t _r
        16 |         const char * data
        24 |         int length
        32 |         struct String::memo_t * memo
        40 |     size_t _value_size
        48 |     class NameDB * _context_parent
        56 |     class NameDB * _context_sibling
        64 |     class NameDB * _context_child
        72 |     class NameInfo * _installed
        80 |   const struct StaticNameDB::Entry * _entries
        88 |   size_t _nentries
           | [sizeof=96, dsize=96, align=8,
           |  nvsize=96, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x56469aa2dc50 <../dummy_inc/click/string.hh:189:5, line:198:5> line:189:12 referenced struct memo_t definition
|-DefinitionData pass_in_registers aggregate standard_layout trivially_copyable pod trivial
| |-DefaultConstructor exists trivial needs_implicit
| |-CopyConstructor simple trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveConstructor exists simple trivial needs_implicit
| |-CopyAssignment trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveAssignment exists simple trivial needs_implicit
| `-Destructor simple irrelevant trivial needs_implicit
|-CXXRecordDecl 0x56469aa2dd68 <col:5, col:12> col:12 implicit struct memo_t
|-FieldDecl 0x56469aa2de08 <line:190:2, col:20> col:20 referenced refcount 'volatile uint32_t':'volatile unsigned int'
|-FieldDecl 0x56469aa2de68 <line:191:2, col:11> col:11 referenced capacity 'uint32_t':'unsigned int'
|-FieldDecl 0x56469aa2dec8 <line:192:2, col:20> col:20 dirty 'volatile uint32_t':'volatile unsigned int'
`-FieldDecl 0x56469aa2df78 <line:197:2, col:18> col:7 real_data 'char [8]'

Layout: <CGRecordLayout
  LLVMType:%"struct.String::memo_t" = type { i32, i32, i32, [8 x i8] }
  NonVirtualBaseLLVMType:%"struct.String::memo_t" = type { i32, i32, i32, [8 x i8] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x56469aa2e280 <../dummy_inc/click/string.hh:204:5, line:208:5> line:204:12 referenced struct rep_t definition
|-DefinitionData pass_in_registers aggregate standard_layout trivially_copyable pod trivial literal
| |-DefaultConstructor exists trivial
| |-CopyConstructor simple trivial has_const_param implicit_has_const_param
| |-MoveConstructor exists simple trivial
| |-CopyAssignment trivial has_const_param implicit_has_const_param
| |-MoveAssignment exists simple trivial
| `-Destructor simple irrelevant trivial
|-CXXRecordDecl 0x56469aa2e398 <col:5, col:12> col:12 implicit struct rep_t
|-FieldDecl 0x56469aa2e440 <line:205:2, col:14> col:14 referenced data 'const char *'
|-FieldDecl 0x56469aa2e4a8 <line:206:2, col:6> col:6 referenced length 'int'
|-FieldDecl 0x56469aa2e538 <line:207:2, col:10> col:10 referenced memo 'String::memo_t *'
|-CXXConstructorDecl 0x56469aa345d0 <line:204:12> col:12 implicit used rep_t 'void () noexcept' inline default trivial
| `-CompoundStmt 0x56469aa34a08 <col:12>
|-CXXConstructorDecl 0x56469aa346d8 <col:12> col:12 implicit used constexpr rep_t 'void (const String::rep_t &) noexcept' inline default trivial
| |-ParmVarDecl 0x56469aa347e8 <col:12> col:12 used 'const String::rep_t &'
| |-CXXCtorInitializer Field 0x56469aa2e440 'data' 'const char *'
| | `-ImplicitCastExpr 0x56469aa36f90 <col:12> 'const char *' <LValueToRValue>
| |   `-MemberExpr 0x56469aa36f60 <col:12> 'const char *const' lvalue .data 0x56469aa2e440
| |     `-DeclRefExpr 0x56469aa36f40 <col:12> 'const String::rep_t' lvalue ParmVar 0x56469aa347e8 '' 'const String::rep_t &'
| |-CXXCtorInitializer Field 0x56469aa2e4a8 'length' 'int'
| | `-ImplicitCastExpr 0x56469aa37020 <col:12> 'int' <LValueToRValue>
| |   `-MemberExpr 0x56469aa36ff0 <col:12> 'const int' lvalue .length 0x56469aa2e4a8
| |     `-DeclRefExpr 0x56469aa36fd0 <col:12> 'const String::rep_t' lvalue ParmVar 0x56469aa347e8 '' 'const String::rep_t &'
| |-CXXCtorInitializer Field 0x56469aa2e538 'memo' 'String::memo_t *'
| | `-ImplicitCastExpr 0x56469aa370b0 <col:12> 'String::memo_t *' <LValueToRValue>
| |   `-MemberExpr 0x56469aa37080 <col:12> 'String::memo_t *const' lvalue .memo 0x56469aa2e538
| |     `-DeclRefExpr 0x56469aa37060 <col:12> 'const String::rep_t' lvalue ParmVar 0x56469aa347e8 '' 'const String::rep_t &'
| `-CompoundStmt 0x56469aa37108 <col:12>
|-CXXConstructorDecl 0x56469aa34888 <col:12> col:12 implicit constexpr rep_t 'void (String::rep_t &&)' inline default trivial noexcept-unevaluated 0x56469aa34888
| `-ParmVarDecl 0x56469aa34998 <col:12> col:12 'String::rep_t &&'
|-CXXDestructorDecl 0x56469aa39ef0 <col:12> col:12 implicit ~rep_t 'void () noexcept' inline default trivial
|-CXXMethodDecl 0x56469aa45908 <col:12> col:12 implicit used constexpr operator= 'String::rep_t &(const String::rep_t &) noexcept' inline default trivial
| |-ParmVarDecl 0x56469aa45a18 <col:12> col:12 used 'const String::rep_t &'
| `-CompoundStmt 0x56469aa45f30 <col:12>
|   |-BinaryOperator 0x56469aa45d48 <col:12> 'const char *' lvalue '='
|   | |-MemberExpr 0x56469aa45d00 <col:12> 'const char *' lvalue ->data 0x56469aa2e440
|   | | `-CXXThisExpr 0x56469aa45cf0 <col:12> 'String::rep_t *' this
|   | `-ImplicitCastExpr 0x56469aa45d30 <col:12> 'const char *' <LValueToRValue>
|   |   `-MemberExpr 0x56469aa45cc0 <col:12> 'const char *const' lvalue .data 0x56469aa2e440
|   |     `-DeclRefExpr 0x56469aa45ca0 <col:12> 'const String::rep_t' lvalue ParmVar 0x56469aa45a18 '' 'const String::rep_t &'
|   |-BinaryOperator 0x56469aa45e10 <col:12> 'int' lvalue '='
|   | |-MemberExpr 0x56469aa45dc8 <col:12> 'int' lvalue ->length 0x56469aa2e4a8
|   | | `-CXXThisExpr 0x56469aa45db8 <col:12> 'String::rep_t *' this
|   | `-ImplicitCastExpr 0x56469aa45df8 <col:12> 'int' <LValueToRValue>
|   |   `-MemberExpr 0x56469aa45d88 <col:12> 'const int' lvalue .length 0x56469aa2e4a8
|   |     `-DeclRefExpr 0x56469aa45d68 <col:12> 'const String::rep_t' lvalue ParmVar 0x56469aa45a18 '' 'const String::rep_t &'
|   |-BinaryOperator 0x56469aa45ed8 <col:12> 'String::memo_t *' lvalue '='
|   | |-MemberExpr 0x56469aa45e90 <col:12> 'String::memo_t *' lvalue ->memo 0x56469aa2e538
|   | | `-CXXThisExpr 0x56469aa45e80 <col:12> 'String::rep_t *' this
|   | `-ImplicitCastExpr 0x56469aa45ec0 <col:12> 'String::memo_t *' <LValueToRValue>
|   |   `-MemberExpr 0x56469aa45e50 <col:12> 'String::memo_t *const' lvalue .memo 0x56469aa2e538
|   |     `-DeclRefExpr 0x56469aa45e30 <col:12> 'const String::rep_t' lvalue ParmVar 0x56469aa45a18 '' 'const String::rep_t &'
|   `-ReturnStmt 0x56469aa45f20 <col:12>
|     `-UnaryOperator 0x56469aa45f08 <col:12> 'String::rep_t' lvalue prefix '*' cannot overflow
|       `-CXXThisExpr 0x56469aa45ef8 <col:12> 'String::rep_t *' this
`-CXXMethodDecl 0x56469aa45a88 <col:12> col:12 implicit constexpr operator= 'String::rep_t &(String::rep_t &&)' inline default trivial noexcept-unevaluated 0x56469aa45a88
  `-ParmVarDecl 0x56469aa45b98 <col:12> col:12 'String::rep_t &&'

Layout: <CGRecordLayout
  LLVMType:%"struct.String::rep_t" = type { i8*, i32, %"struct.String::memo_t"* }
  NonVirtualBaseLLVMType:%"struct.String::rep_t" = type { i8*, i32, %"struct.String::memo_t"* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x56469aa251c0 <../dummy_inc/click/string.hh:19:1, line:304:1> line:19:7 referenced class String definition
|-DefinitionData standard_layout has_user_declared_ctor has_mutable_fields can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor non_trivial user_declared has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveConstructor exists non_trivial user_declared
| |-CopyAssignment non_trivial has_const_param user_declared needs_overload_resolution implicit_has_const_param
| |-MoveAssignment exists non_trivial user_declared
| `-Destructor non_trivial user_declared
|-CXXRecordDecl 0x56469aa252d8 <col:1, col:7> col:7 implicit referenced class String
|-AccessSpecDecl 0x56469aa25368 <col:16, col:22> col:16 public
|-TypedefDecl 0x56469aa253a8 <line:21:5, col:25> col:25 referenced const_iterator 'const char *'
| `-PointerType 0x56469a6f2fd0 'const char *'
|   `-QualType 0x56469a6f2521 'const char' const
|     `-BuiltinType 0x56469a6f2520 'char'
|-TypedefDecl 0x56469aa25430 <line:22:5, col:28> col:28 iterator 'String::const_iterator':'const char *'
| `-TypedefType 0x56469aa25400 'String::const_iterator' sugar
|   |-Typedef 0x56469aa253a8 'const_iterator'
|   `-PointerType 0x56469a6f2fd0 'const char *'
|     `-QualType 0x56469a6f2521 'const char' const
|       `-BuiltinType 0x56469a6f2520 'char'
|-TypedefDecl 0x56469aa255a0 <line:24:5, col:52> col:27 referenced unspecified_bool_type 'int (String::*)() const'
| `-MemberPointerType 0x56469aa25510 'int (String::*)() const'
|   |-RecordType 0x56469aa25250 'String'
|   | `-CXXRecord 0x56469aa251c0 'String'
|   `-ParenType 0x56469aa254b0 'int () const' sugar
|     `-FunctionProtoType 0x56469a9fa050 'int () const' const cdecl
|       `-BuiltinType 0x56469a6f2580 'int'
|-TypedefDecl 0x56469aa25608 <line:27:5, col:21> col:21 referenced intmax_t 'int64_t':'long'
| `-TypedefType 0x56469a84ea10 'int64_t' sugar
|   |-Typedef 0x56469a75b390 'int64_t'
|   `-TypedefType 0x56469a734630 '__int64_t' sugar
|     |-Typedef 0x56469a734208 '__int64_t'
|     `-BuiltinType 0x56469a6f25a0 'long'
|-TypedefDecl 0x56469aa25670 <line:28:5, col:22> col:22 referenced uintmax_t 'uint64_t':'unsigned long'
| `-TypedefType 0x56469a84e930 'uint64_t' sugar
|   |-Typedef 0x56469a75b530 'uint64_t'
|   `-TypedefType 0x56469a7346c0 '__uint64_t' sugar
|     |-Typedef 0x56469a734278 '__uint64_t'
|     `-BuiltinType 0x56469a6f2640 'unsigned long'
|-TypedefDecl 0x56469aa25700 <line:36:5, col:22> col:22 int_large_t 'String::intmax_t':'long'
| `-TypedefType 0x56469aa256d0 'String::intmax_t' sugar
|   |-Typedef 0x56469aa25608 'intmax_t'
|   `-TypedefType 0x56469a84ea10 'int64_t' sugar
|     |-Typedef 0x56469a75b390 'int64_t'
|     `-TypedefType 0x56469a734630 '__int64_t' sugar
|       |-Typedef 0x56469a734208 '__int64_t'
|       `-BuiltinType 0x56469a6f25a0 'long'
|-TypedefDecl 0x56469aa25790 <line:37:5, col:23> col:23 uint_large_t 'String::uintmax_t':'unsigned long'
| `-TypedefType 0x56469aa25760 'String::uintmax_t' sugar
|   |-Typedef 0x56469aa25670 'uintmax_t'
|   `-TypedefType 0x56469a84e930 'uint64_t' sugar
|     |-Typedef 0x56469a75b530 'uint64_t'
|     `-TypedefType 0x56469a7346c0 '__uint64_t' sugar
|       |-Typedef 0x56469a734278 '__uint64_t'
|       `-BuiltinType 0x56469a6f2640 'unsigned long'
|-CXXConstructorDecl 0x56469aa25850 <line:39:5, col:19> col:12 used String 'void ()' inline
|-CXXConstructorDecl 0x56469aa259f8 <line:40:5, col:34> col:12 used String 'void (const String &)' inline
| `-ParmVarDecl 0x56469aa25938 <col:19, col:33> col:33 x 'const String &'
|-CXXConstructorDecl 0x56469aa25ba8 <line:42:5, col:29> col:12 used String 'void (String &&)' inline
| `-ParmVarDecl 0x56469aa25ae8 <col:19, col:28> col:28 x 'String &&'
|-CXXConstructorDecl 0x56469aa25d00 <line:44:5, col:35> col:12 used String 'void (const char *)' inline
| `-ParmVarDecl 0x56469aa25c70 <col:19, col:31> col:31 cstr 'const char *'
|-CXXConstructorDecl 0x56469aa25f18 <line:45:5, col:41> col:12 String 'void (const char *, int)' inline
| |-ParmVarDecl 0x56469aa25dc8 <col:19, col:31> col:31 s 'const char *'
| `-ParmVarDecl 0x56469aa25e48 <col:34, col:38> col:38 len 'int'
|-CXXConstructorDecl 0x56469aa26138 <line:46:5, col:50> col:12 String 'void (const unsigned char *, int)' inline
| |-ParmVarDecl 0x56469aa25fe8 <col:19, col:40> col:40 s 'const unsigned char *'
| `-ParmVarDecl 0x56469aa26068 <col:43, col:47> col:47 len 'int'
|-CXXConstructorDecl 0x56469aa26358 <line:47:5, col:54> col:12 used String 'void (const char *, const char *)' inline
| |-ParmVarDecl 0x56469aa26208 <col:19, col:31> col:31 first 'const char *'
| `-ParmVarDecl 0x56469aa26288 <col:38, col:50> col:50 last 'const char *'
|-CXXConstructorDecl 0x56469aa26578 <line:48:5, col:72> col:12 String 'void (const unsigned char *, const unsigned char *)' inline
| |-ParmVarDecl 0x56469aa26428 <col:19, col:40> col:40 first 'const unsigned char *'
| `-ParmVarDecl 0x56469aa264a8 <col:47, col:68> col:68 last 'const unsigned char *'
|-CXXConstructorDecl 0x56469aa26708 <line:49:5, col:34> col:21 used String 'void (bool)' inline
| `-ParmVarDecl 0x56469aa26640 <col:28, col:33> col:33 x 'bool'
|-CXXConstructorDecl 0x56469aa26888 <line:50:5, col:34> col:21 String 'void (char)' inline
| `-ParmVarDecl 0x56469aa267c8 <col:28, col:33> col:33 c 'char'
|-CXXConstructorDecl 0x56469aa26a18 <line:51:5, col:43> col:21 String 'void (unsigned char)' inline
| `-ParmVarDecl 0x56469aa26950 <col:28, col:42> col:42 c 'unsigned char'
|-CXXConstructorDecl 0x56469aa26b70 <line:52:5, col:26> col:14 String 'void (int)'
| `-ParmVarDecl 0x56469aa26ae0 <col:21, col:25> col:25 x 'int'
|-CXXConstructorDecl 0x56469aa26cc8 <line:53:5, col:31> col:14 String 'void (unsigned int)'
| `-ParmVarDecl 0x56469aa26c38 <col:21, col:30> col:30 x 'unsigned int'
|-CXXConstructorDecl 0x56469aa26e20 <line:54:5, col:27> col:14 String 'void (long)'
| `-ParmVarDecl 0x56469aa26d90 <col:21, col:26> col:26 x 'long'
|-CXXConstructorDecl 0x56469aa26fa8 <line:55:5, col:36> col:14 String 'void (unsigned long)'
| `-ParmVarDecl 0x56469aa26ee8 <col:21, col:35> col:35 x 'unsigned long'
|-CXXConstructorDecl 0x56469aa27138 <line:57:5, col:32> col:14 String 'void (long long)'
| `-ParmVarDecl 0x56469aa27070 <col:21, col:31> col:31 x 'long long'
|-CXXConstructorDecl 0x56469aa272c8 <line:58:5, col:41> col:14 String 'void (unsigned long long)'
| `-ParmVarDecl 0x56469aa27200 <col:21, col:40> col:40 x 'unsigned long long'
|-CXXConstructorDecl 0x56469aa27458 <line:65:5, col:29> col:14 String 'void (double)'
| `-ParmVarDecl 0x56469aa27390 <col:21, col:28> col:28 x 'double'
|-CXXDestructorDecl 0x56469aa27550 <line:67:5, col:20> col:12 used ~String 'void () noexcept' inline
|-CXXMethodDecl 0x56469aa27678 <line:69:5, col:44> col:33 used make_empty 'const String &()' static inline
|-CXXMethodDecl 0x56469aa277f8 <line:70:5, col:52> col:26 used make_uninitialized 'String (int)' static inline
| `-ParmVarDecl 0x56469aa27730 <col:45, col:49> col:49 len 'int'
|-CXXMethodDecl 0x56469aa27948 <line:71:5, col:74> col:26 make_garbage 'String (int)' static inline
| |-ParmVarDecl 0x56469aa278b8 <col:39, col:43> col:43 len 'int'
| `-DeprecatedAttr 0x56469aa27a00 <col:63> "" ""
|-CXXMethodDecl 0x56469aa27b48 <line:72:5, col:54> col:26 make_stable 'String (const char *)' static inline
| `-ParmVarDecl 0x56469aa27a88 <col:38, col:50> col:50 cstr 'const char *'
|-CXXMethodDecl 0x56469aa27d58 <line:73:5, col:60> col:26 make_stable 'String (const char *, int)' static inline
| |-ParmVarDecl 0x56469aa27c08 <col:38, col:50> col:50 s 'const char *'
| `-ParmVarDecl 0x56469aa27c88 <col:53, col:57> col:57 len 'int'
|-CXXMethodDecl 0x56469aa27f78 <line:74:5, col:73> col:26 make_stable 'String (const char *, const char *)' static inline
| |-ParmVarDecl 0x56469aa27e20 <col:38, col:50> col:50 first 'const char *'
| `-ParmVarDecl 0x56469aa27ea0 <col:57, col:69> col:69 last 'const char *'
|-CXXMethodDecl 0x56469aa28258 <line:75:5, col:80> col:19 make_numeric 'String (String::intmax_t, int, bool)' static
| |-ParmVarDecl 0x56469aa28038 <col:32, col:41> col:41 x 'String::intmax_t':'long'
| |-ParmVarDecl 0x56469aa280b8 <col:44, col:55> col:48 base 'int' cinit
| | `-IntegerLiteral 0x56469aa340a0 <col:55> 'int' 10
| `-ParmVarDecl 0x56469aa28130 <col:59, col:76> col:64 uppercase 'bool' cinit
|   `-CXXBoolLiteralExpr 0x56469aa340c0 <col:76> 'bool' true
|-CXXMethodDecl 0x56469aa28538 <line:76:5, col:81> col:19 make_numeric 'String (String::uintmax_t, int, bool)' static
| |-ParmVarDecl 0x56469aa28320 <col:32, col:42> col:42 x 'String::uintmax_t':'unsigned long'
| |-ParmVarDecl 0x56469aa283a0 <col:45, col:56> col:49 base 'int' cinit
| | `-IntegerLiteral 0x56469aa340d0 <col:56> 'int' 10
| `-ParmVarDecl 0x56469aa28418 <col:60, col:77> col:65 uppercase 'bool' cinit
|   `-CXXBoolLiteralExpr 0x56469aa340f0 <col:77> 'bool' true
|-CXXMethodDecl 0x56469aa28640 <line:78:5, col:31> col:24 used data 'const char *() const' inline
|-CXXMethodDecl 0x56469aa28708 <line:79:5, col:25> col:16 used length 'int () const' inline
|-CXXMethodDecl 0x56469aa287d0 <line:81:5, col:60> col:52 c_str 'const char *() const'
| |-NoInlineAttr 0x56469aa28870 <col:20>
| `-OptimizeNoneAttr 0x56469aa288c8 <col:30>
|-CXXConversionDecl 0x56469aa289b8 <line:83:5, col:45> col:12 used operator int (String::*)() const 'String::unspecified_bool_type () const' inline
|-CXXMethodDecl 0x56469aa28a88 <line:84:5, col:25> col:17 used empty 'bool () const' inline
|-CXXMethodDecl 0x56469aa28b48 <line:85:5, col:29> col:17 operator! 'bool () const' inline
|-CXXMethodDecl 0x56469aa28c38 <line:87:5, col:35> col:27 used begin 'String::const_iterator () const' inline
|-CXXMethodDecl 0x56469aa28cf8 <line:88:5, col:33> col:27 used end 'String::const_iterator () const' inline
|-CXXMethodDecl 0x56469aa28e78 <line:90:5, col:35> col:17 used operator[] 'char (int) const' inline
| `-ParmVarDecl 0x56469aa28db0 <col:28, col:32> col:32 i 'int'
|-CXXMethodDecl 0x56469aa28fc8 <line:91:5, col:27> col:17 at 'char (int) const' inline
| `-ParmVarDecl 0x56469aa28f38 <col:20, col:24> col:24 i 'int'
|-CXXMethodDecl 0x56469aa290b8 <line:92:5, col:25> col:17 front 'char () const' inline
|-CXXMethodDecl 0x56469aa29178 <line:93:5, col:24> col:17 back 'char () const' inline
|-CXXMethodDecl 0x56469aa293c8 <line:95:5, col:64> col:21 used hashcode 'uint32_t (const char *, const char *)' static
| |-ParmVarDecl 0x56469aa29230 <col:30, col:42> col:42 begin 'const char *'
| `-ParmVarDecl 0x56469aa292b0 <col:49, col:61> col:61 end 'const char *'
|-CXXMethodDecl 0x56469aa29628 <line:96:5, line:97:33> line:96:28 hashcode 'uint32_t (const unsigned char *, const unsigned char *)' static inline
| |-ParmVarDecl 0x56469aa29490 <col:37, col:58> col:58 begin 'const unsigned char *'
| `-ParmVarDecl 0x56469aa29510 <line:97:9, col:30> col:30 end 'const unsigned char *'
|-CXXMethodDecl 0x56469aa296f8 <line:98:5, col:32> col:21 hashcode 'uint32_t () const' inline
|-CXXMethodDecl 0x56469aa29908 <line:100:5, col:65> col:19 substring 'String (const char *, const char *) const' inline
| |-ParmVarDecl 0x56469aa297b0 <col:29, col:41> col:41 begin 'const char *'
| `-ParmVarDecl 0x56469aa29830 <col:48, col:60> col:60 end 'const char *'
|-CXXMethodDecl 0x56469aa29b28 <line:101:5, col:40> col:12 used substring 'String (int, int) const'
| |-ParmVarDecl 0x56469aa299d0 <col:22, col:26> col:26 pos 'int'
| `-ParmVarDecl 0x56469aa29a50 <col:31, col:35> col:35 len 'int'
|-CXXMethodDecl 0x56469aa29cb8 <line:102:5, col:38> col:19 substring 'String (int) const' inline
| `-ParmVarDecl 0x56469aa29bf0 <col:29, col:33> col:33 pos 'int'
|-CXXMethodDecl 0x56469aa29da8 <line:103:5, col:25> col:12 trim_space 'String () const'
|-CXXMethodDecl 0x56469aa29f18 <line:105:5, col:41> col:17 equals 'bool (const String &) const' inline
| `-ParmVarDecl 0x56469aa29e58 <col:24, col:38> col:38 x 'const String &'
|-CXXMethodDecl 0x56469aa2a128 <line:106:5, col:48> col:17 used equals 'bool (const char *, int) const' inline
| |-ParmVarDecl 0x56469aa29fd8 <col:24, col:36> col:36 s 'const char *'
| `-ParmVarDecl 0x56469aa2a058 <col:39, col:43> col:43 len 'int'
|-CXXMethodDecl 0x56469aa2a340 <line:107:5, col:63> col:23 used compare 'int (const String &, const String &)' static inline
| |-ParmVarDecl 0x56469aa2a1e8 <col:31, col:45> col:45 a 'const String &'
| `-ParmVarDecl 0x56469aa2a260 <col:48, col:62> col:62 b 'const String &'
|-CXXMethodDecl 0x56469aa2a4d0 <line:108:5, col:41> col:16 used compare 'int (const String &) const' inline
| `-ParmVarDecl 0x56469aa2a400 <col:24, col:38> col:38 x 'const String &'
|-CXXMethodDecl 0x56469aa2a6f0 <line:109:5, col:41> col:9 used compare 'int (const char *, int) const'
| |-ParmVarDecl 0x56469aa2a590 <col:17, col:29> col:29 s 'const char *'
| `-ParmVarDecl 0x56469aa2a610 <col:32, col:36> col:36 len 'int'
|-CXXMethodDecl 0x56469aa2a840 <line:110:5, col:46> col:17 starts_with 'bool (const String &) const' inline
| `-ParmVarDecl 0x56469aa2a7b0 <col:29, col:43> col:43 x 'const String &'
|-CXXMethodDecl 0x56469aa2aa18 <line:111:5, col:46> col:10 used starts_with 'bool (const char *, int) const'
| |-ParmVarDecl 0x56469aa2a900 <col:22, col:34> col:34 s 'const char *'
| `-ParmVarDecl 0x56469aa2a980 <col:37, col:41> col:41 len 'int'
|-CXXMethodDecl 0x56469aa2ab68 <line:112:5, col:44> col:10 used glob_match 'bool (const String &) const'
| `-ParmVarDecl 0x56469aa2aad8 <col:21, col:35> col:35 pattern 'const String &'
|-CXXMethodDecl 0x56469aa2ad80 <line:125:5, col:42> col:9 find_left 'int (char, int) const'
| |-ParmVarDecl 0x56469aa2ac20 <col:19, col:24> col:24 c 'char'
| `-ParmVarDecl 0x56469aa2aca0 <col:27, col:39> col:31 start 'int' cinit
|   `-IntegerLiteral 0x56469aa34100 <col:39> 'int' 0
|-CXXMethodDecl 0x56469aa2afa0 <line:126:5, col:51> col:9 find_left 'int (const String &, int) const'
| |-ParmVarDecl 0x56469aa2ae40 <col:19, col:33> col:33 x 'const String &'
| `-ParmVarDecl 0x56469aa2aec0 <col:36, col:48> col:40 start 'int' cinit
|   `-IntegerLiteral 0x56469aa34120 <col:48> 'int' 0
|-CXXMethodDecl 0x56469aa2b180 <line:127:5, col:52> col:9 find_right 'int (char, int) const'
| |-ParmVarDecl 0x56469aa2b060 <col:20, col:25> col:25 c 'char'
| `-ParmVarDecl 0x56469aa2b0e0 <col:28, col:40> col:32 start 'int' cinit
|   `-IntegerLiteral 0x56469aa34140 <col:40> 'int' 2147483647
|-CXXMethodDecl 0x56469aa2b250 <line:129:5, col:20> col:12 lower 'String () const'
|-CXXMethodDecl 0x56469aa2b310 <line:130:5, col:20> col:12 upper 'String () const'
|-CXXMethodDecl 0x56469aa2b3d0 <line:131:5, col:24> col:12 printable 'String () const'
|-CXXMethodDecl 0x56469aa2b490 <line:132:5, col:25> col:12 quoted_hex 'String () const'
|-CXXMethodDecl 0x56469aa2b550 <line:133:5, col:26> col:12 encode_json 'String () const'
|-CXXMethodDecl 0x56469aa2b6f8 <line:135:5, col:45> col:20 used operator= 'String &(const String &)' inline
| `-ParmVarDecl 0x56469aa2b600 <col:30, col:44> col:44 x 'const String &'
|-CXXMethodDecl 0x56469aa2b878 <line:137:5, col:40> col:20 used operator= 'String &(String &&)' inline
| `-ParmVarDecl 0x56469aa2b7b0 <col:30, col:39> col:39 x 'String &&'
|-CXXMethodDecl 0x56469aa2ba50 <line:139:5, col:46> col:20 operator= 'String &(const char *)' inline
| `-ParmVarDecl 0x56469aa2b938 <col:30, col:42> col:42 cstr 'const char *'
|-CXXMethodDecl 0x56469aa2bbc8 <line:141:5, col:31> col:17 swap 'void (String &)' inline
| `-ParmVarDecl 0x56469aa2bb08 <col:22, col:30> col:30 x 'String &'
|-CXXMethodDecl 0x56469aa2bd10 <line:143:5, col:39> col:17 append 'void (const String &)' inline
| `-ParmVarDecl 0x56469aa2bc80 <col:24, col:38> col:38 x 'const String &'
|-CXXMethodDecl 0x56469aa2be60 <line:144:5, col:40> col:17 used append 'void (const char *)' inline
| `-ParmVarDecl 0x56469aa2bdd0 <col:24, col:36> col:36 cstr 'const char *'
|-CXXMethodDecl 0x56469aa2c038 <line:145:5, col:46> col:17 used append 'void (const char *, int)' inline
| |-ParmVarDecl 0x56469aa2bf20 <col:24, col:36> col:36 s 'const char *'
| `-ParmVarDecl 0x56469aa2bfa0 <col:39, col:43> col:43 len 'int'
|-CXXMethodDecl 0x56469aa2c218 <line:146:5, col:59> col:17 append 'void (const char *, const char *)' inline
| |-ParmVarDecl 0x56469aa2c100 <col:24, col:36> col:36 first 'const char *'
| `-ParmVarDecl 0x56469aa2c180 <col:43, col:55> col:55 last 'const char *'
|-CXXMethodDecl 0x56469aa2c368 <line:147:5, col:30> col:17 append 'void (char)' inline
| `-ParmVarDecl 0x56469aa2c2d8 <col:24, col:29> col:29 c 'char'
|-CXXMethodDecl 0x56469aa2c578 <line:148:5, col:36> col:10 append_fill 'void (int, int)'
| |-ParmVarDecl 0x56469aa2c428 <col:22, col:26> col:26 c 'int'
| `-ParmVarDecl 0x56469aa2c4a8 <col:29, col:33> col:33 len 'int'
|-CXXMethodDecl 0x56469aa2c6d8 <line:149:5, col:39> col:11 used append_uninitialized 'char *(int)'
| `-ParmVarDecl 0x56469aa2c640 <col:32, col:36> col:36 len 'int'
|-CXXMethodDecl 0x56469aa2c830 <line:150:5, col:68> col:18 append_garbage 'char *(int)' inline
| |-ParmVarDecl 0x56469aa2c798 <col:33, col:37> col:37 len 'int'
| `-DeprecatedAttr 0x56469aa2c8d8 <col:57> "" ""
|-CXXMethodDecl 0x56469aa2c9e8 <line:152:5, col:46> col:20 used operator+= 'String &(const String &)' inline
| `-ParmVarDecl 0x56469aa2c958 <col:31, col:45> col:45 x 'const String &'
|-CXXMethodDecl 0x56469aa2cb38 <line:153:5, col:47> col:20 operator+= 'String &(const char *)' inline
| `-ParmVarDecl 0x56469aa2caa8 <col:31, col:43> col:43 cstr 'const char *'
|-CXXMethodDecl 0x56469aa2ccb8 <line:154:5, col:37> col:20 operator+= 'String &(char)' inline
| `-ParmVarDecl 0x56469aa2cbf0 <col:31, col:36> col:36 c 'char'
|-CXXMethodDecl 0x56469aa2cd80 <line:160:5, col:29> col:17 is_shared 'bool () const' inline
|-CXXMethodDecl 0x56469aa2ce40 <line:161:5, col:29> col:17 is_stable 'bool () const' inline
|-CXXMethodDecl 0x56469aa2cf00 <line:163:5, col:60> col:19 unique 'String () const' inline
| `-DeprecatedAttr 0x56469aa2cfa0 <col:49> "" ""
|-CXXMethodDecl 0x56469aa2d030 <line:164:5, col:30> col:19 used unshared 'String () const' inline
|-CXXMethodDecl 0x56469aa2d0f0 <line:165:5, col:29> col:19 compact 'String () const' inline
|-CXXMethodDecl 0x56469aa2d1e0 <line:167:5, col:24> col:11 mutable_data 'char *()'
|-CXXMethodDecl 0x56469aa2d2a8 <line:168:5, col:25> col:11 mutable_c_str 'char *()'
|-CXXMethodDecl 0x56469aa2d368 <line:170:5, col:52> col:33 make_out_of_memory 'const String &()' static inline
|-CXXMethodDecl 0x56469aa2d428 <line:171:5, col:33> col:17 out_of_memory 'bool () const' inline
|-CXXMethodDecl 0x56469aa2d520 <line:172:5, col:50> col:31 out_of_memory_data 'const char *()' static inline
|-CXXMethodDecl 0x56469aa2d5e8 <line:173:5, col:44> col:23 out_of_memory_length 'int ()' static inline
|-CXXMethodDecl 0x56469aa2d6b0 <line:174:5, col:42> col:31 used empty_data 'const char *()' static inline
|-CXXMethodDecl 0x56469aa2d888 <line:180:5, col:81> col:31 skip_utf8_char 'const char *(const char *, const char *)' static inline
| |-ParmVarDecl 0x56469aa2d768 <col:46, col:58> col:58 first 'const char *'
| `-ParmVarDecl 0x56469aa2d7e8 <col:65, col:77> col:77 last 'const char *'
|-CXXMethodDecl 0x56469aa2dab0 <line:181:5, line:182:38> line:181:33 used skip_utf8_char 'const unsigned char *(const unsigned char *, const unsigned char *)' static
| |-ParmVarDecl 0x56469aa2d950 <col:48, col:69> col:69 first 'const unsigned char *'
| `-ParmVarDecl 0x56469aa2d9d0 <line:182:13, col:34> col:34 last 'const unsigned char *'
|-VarDecl 0x56469aa2dbc0 <line:184:5, col:35> col:23 used bool_data 'const char [11]' static
|-AccessSpecDecl 0x56469aa2dc28 <line:186:3, col:10> col:3 private
|-CXXRecordDecl 0x56469aa2dc50 <line:189:5, line:198:5> line:189:12 referenced struct memo_t definition
| |-DefinitionData pass_in_registers aggregate standard_layout trivially_copyable pod trivial
| | |-DefaultConstructor exists trivial needs_implicit
| | |-CopyConstructor simple trivial has_const_param needs_implicit implicit_has_const_param
| | |-MoveConstructor exists simple trivial needs_implicit
| | |-CopyAssignment trivial has_const_param needs_implicit implicit_has_const_param
| | |-MoveAssignment exists simple trivial needs_implicit
| | `-Destructor simple irrelevant trivial needs_implicit
| |-CXXRecordDecl 0x56469aa2dd68 <col:5, col:12> col:12 implicit struct memo_t
| |-FieldDecl 0x56469aa2de08 <line:190:2, col:20> col:20 referenced refcount 'volatile uint32_t':'volatile unsigned int'
| |-FieldDecl 0x56469aa2de68 <line:191:2, col:11> col:11 referenced capacity 'uint32_t':'unsigned int'
| |-FieldDecl 0x56469aa2dec8 <line:192:2, col:20> col:20 dirty 'volatile uint32_t':'volatile unsigned int'
| `-FieldDecl 0x56469aa2df78 <line:197:2, col:18> col:7 real_data 'char [8]'
|-EnumDecl 0x56469aa2dfe0 <line:200:5, line:202:5> line:200:5
| `-EnumConstantDecl 0x56469aa2e218 <line:201:2, col:32> col:2 referenced MEMO_SPACE 'String::(anonymous enum at ../dummy_inc/click/string.hh:200:5)'
|   `-ImplicitCastExpr 0x56469aa2e268 <col:15, col:32> 'unsigned int' <IntegralCast>
|     `-ConstantExpr 0x56469aa2e1f8 <col:15, col:32> 'unsigned long' Int: 12
|       `-BinaryOperator 0x56469aa2e108 <col:15, col:32> 'unsigned long' '-'
|         |-UnaryExprOrTypeTraitExpr 0x56469aa2e0b0 <col:15, col:28> 'unsigned long' sizeof 'String::memo_t'
|         `-ImplicitCastExpr 0x56469aa2e0f0 <col:32> 'unsigned long' <IntegralCast>
|           `-IntegerLiteral 0x56469aa2e0d0 <col:32> 'int' 8
|-CXXRecordDecl 0x56469aa2e280 <line:204:5, line:208:5> line:204:12 referenced struct rep_t definition
| |-DefinitionData pass_in_registers aggregate standard_layout trivially_copyable pod trivial literal
| | |-DefaultConstructor exists trivial
| | |-CopyConstructor simple trivial has_const_param implicit_has_const_param
| | |-MoveConstructor exists simple trivial
| | |-CopyAssignment trivial has_const_param implicit_has_const_param
| | |-MoveAssignment exists simple trivial
| | `-Destructor simple irrelevant trivial
| |-CXXRecordDecl 0x56469aa2e398 <col:5, col:12> col:12 implicit struct rep_t
| |-FieldDecl 0x56469aa2e440 <line:205:2, col:14> col:14 referenced data 'const char *'
| |-FieldDecl 0x56469aa2e4a8 <line:206:2, col:6> col:6 referenced length 'int'
| |-FieldDecl 0x56469aa2e538 <line:207:2, col:10> col:10 referenced memo 'String::memo_t *'
| |-CXXConstructorDecl 0x56469aa345d0 <line:204:12> col:12 implicit used rep_t 'void () noexcept' inline default trivial
| | `-CompoundStmt 0x56469aa34a08 <col:12>
| |-CXXConstructorDecl 0x56469aa346d8 <col:12> col:12 implicit used constexpr rep_t 'void (const String::rep_t &) noexcept' inline default trivial
| | |-ParmVarDecl 0x56469aa347e8 <col:12> col:12 used 'const String::rep_t &'
| | |-CXXCtorInitializer Field 0x56469aa2e440 'data' 'const char *'
| | | `-ImplicitCastExpr 0x56469aa36f90 <col:12> 'const char *' <LValueToRValue>
| | |   `-MemberExpr 0x56469aa36f60 <col:12> 'const char *const' lvalue .data 0x56469aa2e440
| | |     `-DeclRefExpr 0x56469aa36f40 <col:12> 'const String::rep_t' lvalue ParmVar 0x56469aa347e8 '' 'const String::rep_t &'
| | |-CXXCtorInitializer Field 0x56469aa2e4a8 'length' 'int'
| | | `-ImplicitCastExpr 0x56469aa37020 <col:12> 'int' <LValueToRValue>
| | |   `-MemberExpr 0x56469aa36ff0 <col:12> 'const int' lvalue .length 0x56469aa2e4a8
| | |     `-DeclRefExpr 0x56469aa36fd0 <col:12> 'const String::rep_t' lvalue ParmVar 0x56469aa347e8 '' 'const String::rep_t &'
| | |-CXXCtorInitializer Field 0x56469aa2e538 'memo' 'String::memo_t *'
| | | `-ImplicitCastExpr 0x56469aa370b0 <col:12> 'String::memo_t *' <LValueToRValue>
| | |   `-MemberExpr 0x56469aa37080 <col:12> 'String::memo_t *const' lvalue .memo 0x56469aa2e538
| | |     `-DeclRefExpr 0x56469aa37060 <col:12> 'const String::rep_t' lvalue ParmVar 0x56469aa347e8 '' 'const String::rep_t &'
| | `-CompoundStmt 0x56469aa37108 <col:12>
| |-CXXConstructorDecl 0x56469aa34888 <col:12> col:12 implicit constexpr rep_t 'void (String::rep_t &&)' inline default trivial noexcept-unevaluated 0x56469aa34888
| | `-ParmVarDecl 0x56469aa34998 <col:12> col:12 'String::rep_t &&'
| |-CXXDestructorDecl 0x56469aa39ef0 <col:12> col:12 implicit ~rep_t 'void () noexcept' inline default trivial
| |-CXXMethodDecl 0x56469aa45908 <col:12> col:12 implicit used constexpr operator= 'String::rep_t &(const String::rep_t &) noexcept' inline default trivial
| | |-ParmVarDecl 0x56469aa45a18 <col:12> col:12 used 'const String::rep_t &'
| | `-CompoundStmt 0x56469aa45f30 <col:12>
| |   |-BinaryOperator 0x56469aa45d48 <col:12> 'const char *' lvalue '='
| |   | |-MemberExpr 0x56469aa45d00 <col:12> 'const char *' lvalue ->data 0x56469aa2e440
| |   | | `-CXXThisExpr 0x56469aa45cf0 <col:12> 'String::rep_t *' this
| |   | `-ImplicitCastExpr 0x56469aa45d30 <col:12> 'const char *' <LValueToRValue>
| |   |   `-MemberExpr 0x56469aa45cc0 <col:12> 'const char *const' lvalue .data 0x56469aa2e440
| |   |     `-DeclRefExpr 0x56469aa45ca0 <col:12> 'const String::rep_t' lvalue ParmVar 0x56469aa45a18 '' 'const String::rep_t &'
| |   |-BinaryOperator 0x56469aa45e10 <col:12> 'int' lvalue '='
| |   | |-MemberExpr 0x56469aa45dc8 <col:12> 'int' lvalue ->length 0x56469aa2e4a8
| |   | | `-CXXThisExpr 0x56469aa45db8 <col:12> 'String::rep_t *' this
| |   | `-ImplicitCastExpr 0x56469aa45df8 <col:12> 'int' <LValueToRValue>
| |   |   `-MemberExpr 0x56469aa45d88 <col:12> 'const int' lvalue .length 0x56469aa2e4a8
| |   |     `-DeclRefExpr 0x56469aa45d68 <col:12> 'const String::rep_t' lvalue ParmVar 0x56469aa45a18 '' 'const String::rep_t &'
| |   |-BinaryOperator 0x56469aa45ed8 <col:12> 'String::memo_t *' lvalue '='
| |   | |-MemberExpr 0x56469aa45e90 <col:12> 'String::memo_t *' lvalue ->memo 0x56469aa2e538
| |   | | `-CXXThisExpr 0x56469aa45e80 <col:12> 'String::rep_t *' this
| |   | `-ImplicitCastExpr 0x56469aa45ec0 <col:12> 'String::memo_t *' <LValueToRValue>
| |   |   `-MemberExpr 0x56469aa45e50 <col:12> 'String::memo_t *const' lvalue .memo 0x56469aa2e538
| |   |     `-DeclRefExpr 0x56469aa45e30 <col:12> 'const String::rep_t' lvalue ParmVar 0x56469aa45a18 '' 'const String::rep_t &'
| |   `-ReturnStmt 0x56469aa45f20 <col:12>
| |     `-UnaryOperator 0x56469aa45f08 <col:12> 'String::rep_t' lvalue prefix '*' cannot overflow
| |       `-CXXThisExpr 0x56469aa45ef8 <col:12> 'String::rep_t *' this
| `-CXXMethodDecl 0x56469aa45a88 <col:12> col:12 implicit constexpr operator= 'String::rep_t &(String::rep_t &&)' inline default trivial noexcept-unevaluated 0x56469aa45a88
|   `-ParmVarDecl 0x56469aa45b98 <col:12> col:12 'String::rep_t &&'
|-FieldDecl 0x56469aa2e5b0 <line:211:5, col:19> col:19 referenced _r 'String::rep_t' mutable
|-CXXMethodDecl 0x56469aa2e7f8 <line:256:5, line:261:5> line:256:17 used assign_memo 'void (const char *, int, String::memo_t *) const' inline
| |-ParmVarDecl 0x56469aa2e618 <col:29, col:41> col:41 used data 'const char *'
| |-ParmVarDecl 0x56469aa2e698 <col:47, col:51> col:51 used length 'int'
| |-ParmVarDecl 0x56469aa2e710 <col:59, col:67> col:67 used memo 'String::memo_t *'
| `-CompoundStmt 0x56469aa34590 <col:79, line:261:5>
|   |-BinaryOperator 0x56469aa34208 <line:257:2, col:12> 'const char *' lvalue '='
|   | |-MemberExpr 0x56469aa341a0 <col:2, col:5> 'const char *' lvalue .data 0x56469aa2e440
|   | | `-MemberExpr 0x56469aa34170 <col:2> 'String::rep_t' lvalue ->_r 0x56469aa2e5b0
|   | |   `-CXXThisExpr 0x56469aa34160 <col:2> 'const String *' implicit this
|   | `-ImplicitCastExpr 0x56469aa341f0 <col:12> 'const char *' <LValueToRValue>
|   |   `-DeclRefExpr 0x56469aa341d0 <col:12> 'const char *' lvalue ParmVar 0x56469aa2e618 'data' 'const char *'
|   |-BinaryOperator 0x56469aa342d0 <line:258:2, col:14> 'int' lvalue '='
|   | |-MemberExpr 0x56469aa34268 <col:2, col:5> 'int' lvalue .length 0x56469aa2e4a8
|   | | `-MemberExpr 0x56469aa34238 <col:2> 'String::rep_t' lvalue ->_r 0x56469aa2e5b0
|   | |   `-CXXThisExpr 0x56469aa34228 <col:2> 'const String *' implicit this
|   | `-ImplicitCastExpr 0x56469aa342b8 <col:14> 'int' <LValueToRValue>
|   |   `-DeclRefExpr 0x56469aa34298 <col:14> 'int' lvalue ParmVar 0x56469aa2e698 'length' 'int'
|   `-IfStmt 0x56469aa34578 <line:259:2, line:260:41>
|     |-ImplicitCastExpr 0x56469aa343f0 <line:259:6, col:21> 'bool' <PointerToBoolean>
|     | `-ImplicitCastExpr 0x56469aa343d8 <col:6, col:21> 'String::memo_t *' <LValueToRValue>
|     |   `-ParenExpr 0x56469aa343b8 <col:6, col:21> 'String::memo_t *' lvalue
|     |     `-BinaryOperator 0x56469aa34398 <col:7, col:17> 'String::memo_t *' lvalue '='
|     |       |-MemberExpr 0x56469aa34330 <col:7, col:10> 'String::memo_t *' lvalue .memo 0x56469aa2e538
|     |       | `-MemberExpr 0x56469aa34300 <col:7> 'String::rep_t' lvalue ->_r 0x56469aa2e5b0
|     |       |   `-CXXThisExpr 0x56469aa342f0 <col:7> 'const String *' implicit this
|     |       `-ImplicitCastExpr 0x56469aa34380 <col:17> 'String::memo_t *' <LValueToRValue>
|     |         `-DeclRefExpr 0x56469aa34360 <col:17> 'String::memo_t *' lvalue ParmVar 0x56469aa2e710 'memo' 'String::memo_t *'
|     `-CallExpr 0x56469aa34550 <line:260:6, col:41> 'void'
|       |-ImplicitCastExpr 0x56469aa34538 <col:6, col:23> 'void (*)(volatile uint32_t &)' <FunctionToPointerDecay>
|       | `-DeclRefExpr 0x56469aa34440 <col:6, col:23> 'void (volatile uint32_t &)' lvalue CXXMethod 0x56469aa1d228 'inc' 'void (volatile uint32_t &)'
|       `-MemberExpr 0x56469aa344a8 <col:27, col:33> 'volatile uint32_t':'volatile unsigned int' lvalue ->refcount 0x56469aa2de08
|         `-ImplicitCastExpr 0x56469aa34490 <col:27> 'String::memo_t *' <LValueToRValue>
|           `-DeclRefExpr 0x56469aa34470 <col:27> 'String::memo_t *' lvalue ParmVar 0x56469aa2e710 'memo' 'String::memo_t *'
|-CXXConstructorDecl 0x56469aa2eaa8 <line:263:5, line:265:5> line:263:12 used String 'void (const char *, int, String::memo_t *)' inline
| |-ParmVarDecl 0x56469aa2e8c8 <col:19, col:31> col:31 used data 'const char *'
| |-ParmVarDecl 0x56469aa2e948 <col:37, col:41> col:41 used length 'int'
| |-ParmVarDecl 0x56469aa2e9c0 <col:49, col:57> col:57 used memo 'String::memo_t *'
| |-CXXCtorInitializer Field 0x56469aa2e5b0 '_r' 'String::rep_t'
| | `-CXXConstructExpr 0x56469aa34a18 <col:12> 'String::rep_t' 'void () noexcept'
| `-CompoundStmt 0x56469aa34ba8 <col:63, line:265:5>
|   `-CXXMemberCallExpr 0x56469aa34b10 <line:264:2, col:32> 'void'
|     |-MemberExpr 0x56469aa34a80 <col:2> '<bound member function type>' ->assign_memo 0x56469aa2e7f8
|     | `-ImplicitCastExpr 0x56469aa34b48 <col:2> 'const String *' <NoOp>
|     |   `-CXXThisExpr 0x56469aa34a70 <col:2> 'String *' implicit this
|     |-ImplicitCastExpr 0x56469aa34b60 <col:14> 'const char *' <LValueToRValue>
|     | `-DeclRefExpr 0x56469aa34ab0 <col:14> 'const char *' lvalue ParmVar 0x56469aa2e8c8 'data' 'const char *'
|     |-ImplicitCastExpr 0x56469aa34b78 <col:20> 'int' <LValueToRValue>
|     | `-DeclRefExpr 0x56469aa34ad0 <col:20> 'int' lvalue ParmVar 0x56469aa2e948 'length' 'int'
|     `-ImplicitCastExpr 0x56469aa34b90 <col:28> 'String::memo_t *' <LValueToRValue>
|       `-DeclRefExpr 0x56469aa34af0 <col:28> 'String::memo_t *' lvalue ParmVar 0x56469aa2e9c0 'memo' 'String::memo_t *'
|-CXXMethodDecl 0x56469aa2ec38 <line:267:5, line:269:5> line:267:17 used assign 'void (const String &) const' inline
| |-ParmVarDecl 0x56469aa2eb78 <col:24, col:38> col:38 used x 'const String &'
| `-CompoundStmt 0x56469aa34e00 <col:47, line:269:5>
|   `-CXXMemberCallExpr 0x56469aa34d80 <line:268:2, col:47> 'void'
|     |-MemberExpr 0x56469aa34bd0 <col:2> '<bound member function type>' ->assign_memo 0x56469aa2e7f8
|     | `-CXXThisExpr 0x56469aa34bc0 <col:2> 'const String *' implicit this
|     |-ImplicitCastExpr 0x56469aa34db8 <col:14, col:19> 'const char *' <LValueToRValue>
|     | `-MemberExpr 0x56469aa34c50 <col:14, col:19> 'const char *' lvalue .data 0x56469aa2e440
|     |   `-MemberExpr 0x56469aa34c20 <col:14, col:16> 'String::rep_t' lvalue ._r 0x56469aa2e5b0
|     |     `-DeclRefExpr 0x56469aa34c00 <col:14> 'const String' lvalue ParmVar 0x56469aa2eb78 'x' 'const String &'
|     |-ImplicitCastExpr 0x56469aa34dd0 <col:25, col:30> 'int' <LValueToRValue>
|     | `-MemberExpr 0x56469aa34cd0 <col:25, col:30> 'int' lvalue .length 0x56469aa2e4a8
|     |   `-MemberExpr 0x56469aa34ca0 <col:25, col:27> 'String::rep_t' lvalue ._r 0x56469aa2e5b0
|     |     `-DeclRefExpr 0x56469aa34c80 <col:25> 'const String' lvalue ParmVar 0x56469aa2eb78 'x' 'const String &'
|     `-ImplicitCastExpr 0x56469aa34de8 <col:38, col:43> 'String::memo_t *' <LValueToRValue>
|       `-MemberExpr 0x56469aa34d50 <col:38, col:43> 'String::memo_t *' lvalue .memo 0x56469aa2e538
|         `-MemberExpr 0x56469aa34d20 <col:38, col:40> 'String::rep_t' lvalue ._r 0x56469aa2e5b0
|           `-DeclRefExpr 0x56469aa34d00 <col:38> 'const String' lvalue ParmVar 0x56469aa2eb78 'x' 'const String &'
|-CXXMethodDecl 0x56469aa2ed00 <line:271:5, line:278:5> line:271:17 used deref 'void () const' inline
| `-CompoundStmt 0x56469aa357c0 <col:31, line:278:5>
|   `-IfStmt 0x56469aa357a8 <line:272:2, line:277:2>
|     |-ImplicitCastExpr 0x56469aa34ea0 <line:272:6, col:9> 'bool' <PointerToBoolean>
|     | `-ImplicitCastExpr 0x56469aa34e88 <col:6, col:9> 'String::memo_t *' <LValueToRValue>
|     |   `-MemberExpr 0x56469aa34e58 <col:6, col:9> 'String::memo_t *' lvalue .memo 0x56469aa2e538
|     |     `-MemberExpr 0x56469aa34e28 <col:6> 'String::rep_t' lvalue ->_r 0x56469aa2e5b0
|     |       `-CXXThisExpr 0x56469aa34e18 <col:6> 'const String *' implicit this
|     `-CompoundStmt 0x56469aa35780 <col:15, line:277:2>
|       |-ParenExpr 0x56469aa35350 <line:273:6, col:166> 'void'
|       | `-ConditionalOperator 0x56469aa35320 <col:7, col:165> 'void'
|       |   |-CXXStaticCastExpr 0x56469aa34fb0 <col:7, col:44> 'bool' static_cast<_Bool> <NoOp>
|       |   | `-ImplicitCastExpr 0x56469aa34f98 <col:27, col:36> 'bool' <IntegralToBoolean> part_of_explicit_cast
|       |   |   `-ImplicitCastExpr 0x56469aa34f80 <col:27, col:36> 'uint32_t':'unsigned int' <LValueToRValue> part_of_explicit_cast
|       |   |     `-MemberExpr 0x56469aa34f40 <col:27, col:36> 'volatile uint32_t':'volatile unsigned int' lvalue ->refcount 0x56469aa2de08
|       |   |       `-ImplicitCastExpr 0x56469aa34f28 <col:27, col:30> 'String::memo_t *' <LValueToRValue>
|       |   |         `-MemberExpr 0x56469aa34ef8 <col:27, col:30> 'String::memo_t *' lvalue .memo 0x56469aa2e538
|       |   |           `-MemberExpr 0x56469aa34ec8 <col:27> 'String::rep_t' lvalue ->_r 0x56469aa2e5b0
|       |   |             `-CXXThisExpr 0x56469aa34eb8 <col:27> 'const String *' implicit this
|       |   |-CXXFunctionalCastExpr 0x56469aa35010 <col:48, col:55> 'void' functional cast to void <ToVoid>
|       |   | `-IntegerLiteral 0x56469aa34ff0 <col:54> 'int' 0
|       |   `-CallExpr 0x56469aa35280 <col:59, col:165> 'void'
|       |     |-ImplicitCastExpr 0x56469aa35268 <col:59> 'void (*)(const char *, const char *, unsigned int, const char *) __attribute__((noreturn)) throw()' <FunctionToPointerDecay>
|       |     | `-DeclRefExpr 0x56469aa351e8 <col:59> 'void (const char *, const char *, unsigned int, const char *) __attribute__((noreturn)) throw()' lvalue Function 0x56469a795220 '__assert_fail' 'void (const char *, const char *, unsigned int, const char *) __attribute__((noreturn)) throw()'
|       |     |-ImplicitCastExpr 0x56469aa352c0 <col:74> 'const char *' <ArrayToPointerDecay>
|       |     | `-StringLiteral 0x56469aa350f8 <col:74> 'const char [18]' lvalue "_r.memo->refcount"
|       |     |-ImplicitCastExpr 0x56469aa352d8 <col:95> 'const char *' <ArrayToPointerDecay>
|       |     | `-StringLiteral 0x56469aa35128 <col:95> 'const char [29]' lvalue "../dummy_inc/click/string.hh"
|       |     |-ImplicitCastExpr 0x56469aa352f0 <col:127> 'unsigned int' <IntegralCast>
|       |     | `-IntegerLiteral 0x56469aa35160 <col:127> 'int' 273
|       |     `-ImplicitCastExpr 0x56469aa35308 <col:132, col:146> 'const char *' <ArrayToPointerDecay>
|       |       `-UnaryOperator 0x56469aa351d0 <col:132, col:146> 'const char [27]' lvalue prefix '__extension__' cannot overflow
|       |         `-PredefinedExpr 0x56469aa351b8 <col:146> 'const char [27]' lvalue __PRETTY_FUNCTION__
|       |           `-StringLiteral 0x56469aa35180 <col:146> 'const char [27]' lvalue "void String::deref() const"
|       |-IfStmt 0x56469aa356a0 <line:274:6, line:275:22>
|       | |-CallExpr 0x56469aa35560 <line:274:10, col:57> 'bool'
|       | | |-ImplicitCastExpr 0x56469aa35548 <col:10, col:27> 'bool (*)(volatile uint32_t &)' <FunctionToPointerDecay>
|       | | | `-DeclRefExpr 0x56469aa354c0 <col:10, col:27> 'bool (volatile uint32_t &)' lvalue CXXMethod 0x56469aa1e670 'dec_and_test' 'bool (volatile uint32_t &)'
|       | | `-MemberExpr 0x56469aa35490 <col:40, col:49> 'volatile uint32_t':'volatile unsigned int' lvalue ->refcount 0x56469aa2de08
|       | |   `-ImplicitCastExpr 0x56469aa35478 <col:40, col:43> 'String::memo_t *' <LValueToRValue>
|       | |     `-MemberExpr 0x56469aa35448 <col:40, col:43> 'String::memo_t *' lvalue .memo 0x56469aa2e538
|       | |       `-MemberExpr 0x56469aa35418 <col:40> 'String::rep_t' lvalue ->_r 0x56469aa2e5b0
|       | |         `-CXXThisExpr 0x56469aa35408 <col:40> 'const String *' implicit this
|       | `-CallExpr 0x56469aa35660 <line:275:3, col:22> 'void'
|       |   |-ImplicitCastExpr 0x56469aa35648 <col:3> 'void (*)(String::memo_t *)' <FunctionToPointerDecay>
|       |   | `-DeclRefExpr 0x56469aa35588 <col:3> 'void (String::memo_t *)' lvalue CXXMethod 0x56469aa334e0 'delete_memo' 'void (String::memo_t *)'
|       |   `-ImplicitCastExpr 0x56469aa35688 <col:15, col:18> 'String::memo_t *' <LValueToRValue>
|       |     `-MemberExpr 0x56469aa355e8 <col:15, col:18> 'String::memo_t *' lvalue .memo 0x56469aa2e538
|       |       `-MemberExpr 0x56469aa355b8 <col:15> 'String::rep_t' lvalue ->_r 0x56469aa2e5b0
|       |         `-CXXThisExpr 0x56469aa355a8 <col:15> 'const String *' implicit this
|       `-BinaryOperator 0x56469aa35760 <line:276:6, col:16> 'String::memo_t *' lvalue '='
|         |-MemberExpr 0x56469aa356f8 <col:6, col:9> 'String::memo_t *' lvalue .memo 0x56469aa2e538
|         | `-MemberExpr 0x56469aa356c8 <col:6> 'String::rep_t' lvalue ->_r 0x56469aa2e5b0
|         |   `-CXXThisExpr 0x56469aa356b8 <col:6> 'const String *' implicit this
|         `-ImplicitCastExpr 0x56469aa35748 <col:16> 'String::memo_t *' <NullToPointer>
|           `-IntegerLiteral 0x56469aa35728 <col:16> 'int' 0
|-CXXMethodDecl 0x56469aa2ef98 <line:280:5, col:56> col:10 used assign 'void (const char *, int, bool)'
| |-ParmVarDecl 0x56469aa2edb8 <col:17, col:29> col:29 s 'const char *'
| |-ParmVarDecl 0x56469aa2ee38 <col:32, col:36> col:36 len 'int'
| `-ParmVarDecl 0x56469aa2eeb0 <col:41, col:46> col:46 need_deref 'bool'
|-CXXMethodDecl 0x56469aa2f070 <line:281:5, col:31> col:10 assign_out_of_memory 'void ()'
|-CXXMethodDecl 0x56469aa2f2c0 <line:282:5, col:53> col:10 used append 'void (const char *, int, String::memo_t *)'
| |-ParmVarDecl 0x56469aa2f128 <col:17, col:29> col:29 s 'const char *'
| |-ParmVarDecl 0x56469aa2f1a8 <col:32, col:36> col:36 len 'int'
| `-ParmVarDecl 0x56469aa2f220 <col:41, col:49> col:49 memo 'String::memo_t *'
|-CXXMethodDecl 0x56469aa2f4a8 <line:283:5, col:58> col:19 used hard_make_stable 'String (const char *, int)' static
| |-ParmVarDecl 0x56469aa2f390 <col:36, col:48> col:48 s 'const char *'
| `-ParmVarDecl 0x56469aa2f410 <col:51, col:55> col:55 len 'int'
|-CXXMethodDecl 0x56469aa2f5a8 <line:284:5, line:286:5> line:284:27 used absent_memo 'String::memo_t *()' static inline
| `-CompoundStmt 0x56469aa35898 <col:41, line:286:5>
|   `-ReturnStmt 0x56469aa35888 <line:285:2, col:48>
|     `-CXXReinterpretCastExpr 0x56469aa35858 <col:9, col:48> 'String::memo_t *' reinterpret_cast<struct String::memo_t *> <IntegralToPointer>
|       `-CXXFunctionalCastExpr 0x56469aa35820 <col:36, col:47> 'uintptr_t':'unsigned long' functional cast to uintptr_t <NoOp>
|         `-ImplicitCastExpr 0x56469aa35808 <col:46> 'uintptr_t':'unsigned long' <IntegralCast> part_of_explicit_cast
|           `-IntegerLiteral 0x56469aa357e8 <col:46> 'int' 1
|-CXXMethodDecl 0x56469aa2f848 <line:287:5, col:68> col:20 create_memo 'String::memo_t *(char *, int, int)' static
| |-ParmVarDecl 0x56469aa2f660 <col:32, col:38> col:38 space 'char *'
| |-ParmVarDecl 0x56469aa2f6e0 <col:45, col:49> col:49 dirty 'int'
| `-ParmVarDecl 0x56469aa2f760 <col:56, col:60> col:60 capacity 'int'
|-CXXMethodDecl 0x56469aa334e0 <line:288:5, col:41> col:17 used delete_memo 'void (String::memo_t *)' static
| `-ParmVarDecl 0x56469aa2f910 <col:29, col:37> col:37 memo 'String::memo_t *'
|-CXXMethodDecl 0x56469aa335b0 <line:289:5, col:30> col:17 hard_c_str 'const char *() const'
|-CXXMethodDecl 0x56469aa33780 <line:290:5, col:46> col:10 used hard_equals 'bool (const char *, int) const'
| |-ParmVarDecl 0x56469aa33668 <col:22, col:34> col:34 s 'const char *'
| `-ParmVarDecl 0x56469aa336e8 <col:37, col:41> col:41 len 'int'
|-VarDecl 0x56469aa33840 <line:292:5, col:23> col:23 used null_data 'const char' static
|-VarDecl 0x56469aa33908 <line:293:5, col:34> col:23 used oom_data 'const char [15]' static
|-VarDecl 0x56469aa33a08 <line:294:5, col:34> col:23 int_data 'const char [20]' static
|-VarDecl 0x56469aa33a80 <line:295:5, col:24> col:24 used null_string_rep 'const String::rep_t' static
|-VarDecl 0x56469aa33af8 <line:296:5, col:24> col:24 used oom_string_rep 'const String::rep_t' static
|-EnumDecl 0x56469aa33b60 <line:297:5, col:25> col:5
| `-EnumConstantDecl 0x56469aa33c60 <col:12, col:22> col:12 referenced oom_len 'String::(anonymous enum at ../dummy_inc/click/string.hh:297:5)'
|   `-ImplicitCastExpr 0x56469aa33cb0 <col:22> 'unsigned int' <IntegralCast>
|     `-ConstantExpr 0x56469aa33c40 <col:22> 'int' Int: 14
|       `-IntegerLiteral 0x56469aa33c20 <col:22> 'int' 14
|-CXXMethodDecl 0x56469aa33ec8 <line:299:5, col:46> col:19 make_claim 'String (char *, int, int)' static
| |-ParmVarDecl 0x56469aa33ce0 <col:30, col:35> col:36 'char *'
| |-ParmVarDecl 0x56469aa33d60 <col:38> col:41 'int'
| `-ParmVarDecl 0x56469aa33de0 <col:43> col:46 'int'
|-FriendDecl 0x56469aa33fd0 <line:301:5, col:19> col:12 'struct rep_t':'String::rep_t'
`-FriendDecl 0x56469aa34060 <line:302:5, col:18> col:12 'class StringAccum':'StringAccum'

Layout: <CGRecordLayout
  LLVMType:%class.String = type { %"struct.String::rep_t" }
  NonVirtualBaseLLVMType:%class.String = type { %"struct.String::rep_t" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class vector_memory<class sized_array_memory<8> >
         0 |   vector_memory<class sized_array_memory<8> >::type * l_
         8 |   vector_memory::size_type n_
        12 |   vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class Vector<class NameDB *>
         0 |   class vector_memory<class sized_array_memory<8> > vm_
         0 |     vector_memory<class sized_array_memory<8> >::type * l_
         8 |     vector_memory::size_type n_
        12 |     vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class NameInfo
         0 |   class Vector<class NameDB *> _namedb_roots
         0 |     class vector_memory<class sized_array_memory<8> > vm_
         0 |       vector_memory<class sized_array_memory<8> >::type * l_
         8 |       vector_memory::size_type n_
        12 |       vector_memory::size_type capacity_
        16 |   class Vector<class NameDB *> _namedbs
        16 |     class vector_memory<class sized_array_memory<8> > vm_
        16 |       vector_memory<class sized_array_memory<8> >::type * l_
        24 |       vector_memory::size_type n_
        28 |       vector_memory::size_type capacity_
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x56469ad249f0 <../dummy_inc/click/vector.hh:11:1, line:71:1> line:11:30 class vector_memory definition
|-DefinitionData standard_layout has_user_declared_ctor can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor simple trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveConstructor
| |-CopyAssignment trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveAssignment
| `-Destructor non_trivial user_declared
|-TemplateArgument type 'sized_array_memory<8>'
|-CXXRecordDecl 0x56469ad24bc8 prev 0x56469ad249f0 <col:24, col:30> col:30 implicit class vector_memory
|-AccessSpecDecl 0x56469ad24c58 <col:46, col:52> col:46 public
|-TypedefDecl 0x56469ad24c80 <line:12:5, col:17> col:17 size_type 'int'
| `-BuiltinType 0x56469a6f2580 'int'
|-TypedefDecl 0x56469ad26870 <line:13:5, col:31> col:31 type 'typename sized_array_memory<8>::type':'char_array<8>'
| `-ElaboratedType 0x56469ad26820 'typename sized_array_memory<8>::type' sugar
|   `-TypedefType 0x56469ad25130 'sized_array_memory<8>::type' sugar
|     |-Typedef 0x56469ad25030 'type'
|     `-TemplateSpecializationType 0x56469ad24fc0 'char_array<8UL>' sugar char_array
|       |-TemplateArgument expr
|       | `-ConstantExpr 0x56469ad24ea0 <../dummy_inc/click/array_memory.hh:11:24> 'unsigned long' Int: 8
|       |   `-SubstNonTypeTemplateParmExpr 0x56469ad24e80 <col:24> 'unsigned long'
|       |     `-IntegerLiteral 0x56469ad24e60 <col:24> 'unsigned long' 8
|       `-RecordType 0x56469ad24fa0 'char_array<8>'
|         `-ClassTemplateSpecialization 0x56469ad24ec0 'char_array'
|-TypedefDecl 0x56469ad26928 <../dummy_inc/click/vector.hh:14:5, col:19> col:19 iterator 'vector_memory<sized_array_memory<8> >::type *'
| `-PointerType 0x56469ad268f0 'vector_memory<sized_array_memory<8> >::type *'
|   `-TypedefType 0x56469ad268d0 'vector_memory<sized_array_memory<8> >::type' sugar
|     |-Typedef 0x56469ad26870 'type'
|     `-ElaboratedType 0x56469ad26820 'typename sized_array_memory<8>::type' sugar
|       `-TypedefType 0x56469ad25130 'sized_array_memory<8>::type' sugar
|         |-Typedef 0x56469ad25030 'type'
|         `-TemplateSpecializationType 0x56469ad24fc0 'char_array<8UL>' sugar char_array
|           |-TemplateArgument expr
|           | `-ConstantExpr 0x56469ad24ea0 <../dummy_inc/click/array_memory.hh:11:24> 'unsigned long' Int: 8
|           |   `-SubstNonTypeTemplateParmExpr 0x56469ad24e80 <col:24> 'unsigned long'
|           |     `-IntegerLiteral 0x56469ad24e60 <col:24> 'unsigned long' 8
|           `-RecordType 0x56469ad24fa0 'char_array<8>'
|             `-ClassTemplateSpecialization 0x56469ad24ec0 'char_array'
|-CXXMethodDecl 0x56469ad26aa8 <../dummy_inc/click/vector.hh:15:5, line:18:5> line:15:17 need_argument_copy 'bool (const vector_memory<sized_array_memory<8> >::type *) const' inline
| `-ParmVarDecl 0x56469ad269b8 <col:36, col:48> col:48 argp 'const vector_memory<sized_array_memory<8> >::type *'
|-CXXConstructorDecl 0x56469ad26b98 <line:20:5, line:22:5> line:20:5 vector_memory 'void ()'
|-CXXDestructorDecl 0x56469ad26c78 <line:23:5, col:20> col:5 ~vector_memory 'void ()' noexcept-unevaluated 0x56469ad26c78
|-CXXMethodDecl 0x56469ad26f48 <line:25:5, col:43> col:10 assign 'void (const vector_memory<sized_array_memory<8> > &)'
| `-ParmVarDecl 0x56469ad26e50 <col:17, col:42> col:42 x 'const vector_memory<sized_array_memory<8> > &'
|-CXXMethodDecl 0x56469ad27188 <line:26:5, col:44> col:10 assign 'void (vector_memory::size_type, const vector_memory<sized_array_memory<8> >::type *)'
| |-ParmVarDecl 0x56469ad27000 <col:17, col:27> col:27 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x56469ad27078 <col:30, col:42> col:42 vp 'const vector_memory<sized_array_memory<8> >::type *'
|-CXXMethodDecl 0x56469ad27358 <line:27:5, col:44> col:10 resize 'void (vector_memory::size_type, const vector_memory<sized_array_memory<8> >::type *)'
| |-ParmVarDecl 0x56469ad27248 <col:17, col:27> col:27 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x56469ad272c0 <col:30, col:42> col:42 vp 'const vector_memory<sized_array_memory<8> >::type *'
|-CXXMethodDecl 0x56469ad274b8 <line:28:5, line:30:5> line:28:14 begin 'vector_memory<sized_array_memory<8> >::iterator ()'
|-CXXMethodDecl 0x56469ad27588 <line:31:5, line:33:5> line:31:14 end 'vector_memory<sized_array_memory<8> >::iterator ()'
|-CXXMethodDecl 0x56469ad277d8 <line:34:5, col:48> col:14 insert 'vector_memory<sized_array_memory<8> >::iterator (vector_memory<sized_array_memory<8> >::iterator, const vector_memory<sized_array_memory<8> >::type *)'
| |-ParmVarDecl 0x56469ad27648 <col:21, col:30> col:30 it 'vector_memory<sized_array_memory<8> >::iterator':'vector_memory<sized_array_memory<8> >::type *'
| `-ParmVarDecl 0x56469ad276c0 <col:34, col:46> col:46 vp 'const vector_memory<sized_array_memory<8> >::type *'
|-CXXMethodDecl 0x56469ad27a38 <line:35:5, col:42> col:14 erase 'vector_memory<sized_array_memory<8> >::iterator (vector_memory<sized_array_memory<8> >::iterator, vector_memory<sized_array_memory<8> >::iterator)'
| |-ParmVarDecl 0x56469ad278a8 <col:20, col:29> col:29 a 'vector_memory<sized_array_memory<8> >::iterator':'vector_memory<sized_array_memory<8> >::type *'
| `-ParmVarDecl 0x56469ad27920 <col:32, col:41> col:41 b 'vector_memory<sized_array_memory<8> >::iterator':'vector_memory<sized_array_memory<8> >::type *'
|-CXXMethodDecl 0x56469ad27bf8 <line:36:5, line:43:5> line:36:17 push_back 'void (const vector_memory<sized_array_memory<8> >::type *)' inline
| `-ParmVarDecl 0x56469ad27b08 <col:27, col:39> col:39 vp 'const vector_memory<sized_array_memory<8> >::type *'
|-CXXMethodDecl 0x56469ad27db8 <line:45:5, line:52:5> line:45:17 move_construct_back 'void (vector_memory<sized_array_memory<8> >::type *)' inline
| `-ParmVarDecl 0x56469ad27cc0 <col:37, col:43> col:43 vp 'vector_memory<sized_array_memory<8> >::type *'
|-CXXMethodDecl 0x56469ad27e70 <line:54:5, line:59:5> line:54:17 pop_back 'void ()' inline
|-CXXMethodDecl 0x56469ad27f20 <line:60:5, line:64:5> line:60:17 clear 'void ()' inline
|-CXXMethodDecl 0x56469ad28158 <line:65:5, col:59> col:10 reserve_and_push_back 'bool (vector_memory::size_type, const vector_memory<sized_array_memory<8> >::type *)'
| |-ParmVarDecl 0x56469ad27fd0 <col:32, col:42> col:42 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x56469ad28048 <col:45, col:57> col:57 vp 'const vector_memory<sized_array_memory<8> >::type *'
|-CXXMethodDecl 0x56469ad283f8 <line:66:5, col:35> col:10 swap 'void (vector_memory<sized_array_memory<8> > &)'
| `-ParmVarDecl 0x56469ad28300 <col:15, col:34> col:34 x 'vector_memory<sized_array_memory<8> > &'
|-FieldDecl 0x56469ad284c0 <line:68:5, col:11> col:11 l_ 'vector_memory<sized_array_memory<8> >::type *'
|-FieldDecl 0x56469ad28510 <line:69:5, col:15> col:15 n_ 'vector_memory::size_type':'int'
`-FieldDecl 0x56469ad28560 <line:70:5, col:15> col:15 capacity_ 'vector_memory::size_type':'int'

Layout: <CGRecordLayout
  LLVMType:%class.vector_memory = type { %struct.char_array*, i32, i32 }
  NonVirtualBaseLLVMType:%class.vector_memory = type { %struct.char_array*, i32, i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x56469ab0b290 <../dummy_inc/click/ipaddress.hh:13:1, col:29> ../dummy_inc/click/vector.hh:111:7 class Vector definition
|-DefinitionData standard_layout has_user_declared_ctor has_mutable_fields can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor non_trivial user_declared has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveConstructor exists non_trivial user_declared needs_overload_resolution
| |-CopyAssignment non_trivial has_const_param user_declared needs_overload_resolution implicit_has_const_param
| |-MoveAssignment exists non_trivial user_declared needs_overload_resolution
| `-Destructor simple non_trivial needs_overload_resolution
|-TemplateArgument type 'NameDB *'
|-CXXRecordDecl 0x56469ab0b498 prev 0x56469ab0b290 <col:1, col:7> col:7 implicit class Vector
|-TypedefDecl 0x56469ab0c4b0 <line:113:5, col:44> col:44 array_memory_type 'typename array_memory<NameDB *>::type':'sized_array_memory<8>'
| `-ElaboratedType 0x56469ab0c460 'typename array_memory<NameDB *>::type' sugar
|   `-TypedefType 0x56469ab0c440 'conditional<true, sized_array_memory<8>, typed_array_memory<NameDB *> >::type' sugar
|     |-Typedef 0x56469ab0c2f0 'type'
|     `-SubstTemplateTypeParmType 0x56469ad245c0 'sized_array_memory<8>' sugar
|       |-TemplateTypeParmType 0x56469a9bee80 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x56469a9bee28 'T'
|       `-RecordType 0x56469ad24110 'sized_array_memory<8>'
|         `-ClassTemplateSpecialization 0x56469ad24028 'sized_array_memory'
|-FieldDecl 0x56469ab0c5b0 <line:114:5, col:46> col:46 vm_ 'vector_memory<Vector<NameDB *>::array_memory_type>':'vector_memory<sized_array_memory<8> >' mutable
|-AccessSpecDecl 0x56469ab0c600 <line:116:3, col:9> col:3 public
|-TypedefDecl 0x56469ab0c638 <line:118:5, col:15> col:15 value_type 'NameDB *':'NameDB *'
| `-SubstTemplateTypeParmType 0x56469ab0b530 'NameDB *' sugar
|   |-TemplateTypeParmType 0x56469a9f6d90 'T' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x56469a9f6d38 'T'
|   `-PointerType 0x56469ae65520 'NameDB *'
|     `-RecordType 0x56469ae63cd0 'NameDB'
|       `-CXXRecord 0x56469ae66d28 'NameDB'
|-TypedefDecl 0x56469ab0c6f8 <line:119:5, col:16> col:16 reference 'NameDB *&'
| `-LValueReferenceType 0x56469ab0c6c0 'NameDB *&'
|   `-SubstTemplateTypeParmType 0x56469ab0b530 'NameDB *' sugar
|     |-TemplateTypeParmType 0x56469a9f6d90 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x56469a9f6d38 'T'
|     `-PointerType 0x56469ae65520 'NameDB *'
|       `-RecordType 0x56469ae63cd0 'NameDB'
|         `-CXXRecord 0x56469ae66d28 'NameDB'
|-TypedefDecl 0x56469ab0c7b8 <line:120:5, col:22> col:22 const_reference 'NameDB *const &'
| `-LValueReferenceType 0x56469ab0c780 'NameDB *const &'
|   `-QualType 0x56469ab0b531 'NameDB *const' const
|     `-SubstTemplateTypeParmType 0x56469ab0b530 'NameDB *' sugar
|       |-TemplateTypeParmType 0x56469a9f6d90 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x56469a9f6d38 'T'
|       `-PointerType 0x56469ae65520 'NameDB *'
|         `-RecordType 0x56469ae63cd0 'NameDB'
|           `-CXXRecord 0x56469ae66d28 'NameDB'
|-TypedefDecl 0x56469ab0c878 <line:121:5, col:16> col:16 pointer 'NameDB **'
| `-PointerType 0x56469ab0c840 'NameDB **'
|   `-SubstTemplateTypeParmType 0x56469ab0b530 'NameDB *' sugar
|     |-TemplateTypeParmType 0x56469a9f6d90 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x56469a9f6d38 'T'
|     `-PointerType 0x56469ae65520 'NameDB *'
|       `-RecordType 0x56469ae63cd0 'NameDB'
|         `-CXXRecord 0x56469ae66d28 'NameDB'
|-TypedefDecl 0x56469ab0c938 <line:122:5, col:22> col:22 const_pointer 'NameDB *const *'
| `-PointerType 0x56469ab0c900 'NameDB *const *'
|   `-QualType 0x56469ab0b531 'NameDB *const' const
|     `-SubstTemplateTypeParmType 0x56469ab0b530 'NameDB *' sugar
|       |-TemplateTypeParmType 0x56469a9f6d90 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x56469a9f6d38 'T'
|       `-PointerType 0x56469ae65520 'NameDB *'
|         `-RecordType 0x56469ae63cd0 'NameDB'
|           `-CXXRecord 0x56469ae66d28 'NameDB'
|-TypedefDecl 0x56469ab0d510 <line:125:5, col:45> col:45 value_argument_type 'typename fast_argument<NameDB *>::type':'NameDB *'
| `-ElaboratedType 0x56469ab0d4c0 'typename fast_argument<NameDB *>::type' sugar
|   `-TypedefType 0x56469ab0d4a0 'fast_argument<NameDB *, false>::type' sugar
|     |-Typedef 0x56469ab0d430 'type'
|     `-SubstTemplateTypeParmType 0x56469ab0d1f0 'NameDB *' sugar
|       |-TemplateTypeParmType 0x56469a9c9ea0 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x56469a9c9e50 'T'
|       `-PointerType 0x56469ae65520 'NameDB *'
|         `-RecordType 0x56469ae63cd0 'NameDB'
|           `-CXXRecord 0x56469ae66d28 'NameDB'
|-TypedefDecl 0x56469ab0d578 <line:126:5, col:22> col:22 const_access_type 'NameDB *const &'
| `-LValueReferenceType 0x56469ab0c780 'NameDB *const &'
|   `-QualType 0x56469ab0b531 'NameDB *const' const
|     `-SubstTemplateTypeParmType 0x56469ab0b530 'NameDB *' sugar
|       |-TemplateTypeParmType 0x56469a9f6d90 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x56469a9f6d38 'T'
|       `-PointerType 0x56469ae65520 'NameDB *'
|         `-RecordType 0x56469ae63cd0 'NameDB'
|           `-CXXRecord 0x56469ae66d28 'NameDB'
|-TypedefDecl 0x56469ab0d5d0 <line:128:5, col:17> col:17 size_type 'int'
| `-BuiltinType 0x56469a6f2580 'int'
|-TypedefDecl 0x56469ab0d638 <line:130:5, col:16> col:16 iterator 'NameDB **'
| `-PointerType 0x56469ab0c840 'NameDB **'
|   `-SubstTemplateTypeParmType 0x56469ab0b530 'NameDB *' sugar
|     |-TemplateTypeParmType 0x56469a9f6d90 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x56469a9f6d38 'T'
|     `-PointerType 0x56469ae65520 'NameDB *'
|       `-RecordType 0x56469ae63cd0 'NameDB'
|         `-CXXRecord 0x56469ae66d28 'NameDB'
|-TypedefDecl 0x56469ab0d6a0 <line:131:5, col:22> col:22 const_iterator 'NameDB *const *'
| `-PointerType 0x56469ab0c900 'NameDB *const *'
|   `-QualType 0x56469ab0b531 'NameDB *const' const
|     `-SubstTemplateTypeParmType 0x56469ab0b530 'NameDB *' sugar
|       |-TemplateTypeParmType 0x56469a9f6d90 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x56469a9f6d38 'T'
|       `-PointerType 0x56469ae65520 'NameDB *'
|         `-RecordType 0x56469ae63cd0 'NameDB'
|           `-CXXRecord 0x56469ae66d28 'NameDB'
|-EnumDecl 0x56469ab0d6f8 <line:134:5> col:5
| `-EnumConstantDecl 0x56469ab0d7f0 <col:12, col:40> col:12 RESERVE_GROW 'Vector<NameDB *>::(anonymous enum at ../dummy_inc/click/vector.hh:134:5)'
|   `-ConstantExpr 0x56469ab0d7d0 <col:27, col:40> 'Vector::size_type':'int' Int: -1
|     `-CStyleCastExpr 0x56469a9f8418 <col:27, col:40> 'Vector::size_type':'int' <NoOp>
|       `-UnaryOperator 0x56469a9f83f0 <col:39, col:40> 'int' prefix '-'
|         `-IntegerLiteral 0x56469a9f83d0 <col:40> 'int' 1
|-CXXConstructorDecl 0x56469ab0d878 <line:137:5, col:28> col:21 Vector 'void ()' inline
|-CXXConstructorDecl 0x56469ab0db08 <line:138:5, col:62> col:21 Vector 'void (Vector::size_type, Vector<NameDB *>::value_argument_type)' inline
| |-ParmVarDecl 0x56469ab0d930 <col:28, col:38> col:38 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x56469ab0d9d0 <col:41, col:61> col:61 v 'Vector<NameDB *>::value_argument_type':'NameDB *'
|-CXXConstructorDecl 0x56469ab0ddc8 <line:139:5, col:37> col:12 Vector 'void (const Vector<NameDB *> &)' inline
| `-ParmVarDecl 0x56469ab0dcb0 <col:19, col:36> col:36 x 'const Vector<NameDB *> &'
|-CXXConstructorDecl 0x56469ab0e088 <line:141:5, col:32> col:12 Vector 'void (Vector<NameDB *> &&)' inline
| `-ParmVarDecl 0x56469ab0df70 <col:19, col:31> col:31 x 'Vector<NameDB *> &&'
|-CXXMethodDecl 0x56469ab0e3d0 <line:144:5, col:51> col:23 operator= 'Vector<NameDB *> &(const Vector<NameDB *> &)' inline
| `-ParmVarDecl 0x56469ab0e2b0 <col:33, col:50> col:50 x 'const Vector<NameDB *> &'
|-CXXMethodDecl 0x56469ab0e6e0 <line:146:5, col:46> col:23 operator= 'Vector<NameDB *> &(Vector<NameDB *> &&)' inline
| `-ParmVarDecl 0x56469ab0e5c0 <col:33, col:45> col:45 x 'Vector<NameDB *> &&'
|-CXXMethodDecl 0x56469ab0e9d0 <line:148:5, col:70> col:23 assign 'Vector<NameDB *> &(Vector::size_type, Vector<NameDB *>::value_argument_type)' inline
| |-ParmVarDecl 0x56469ab0e818 <col:30, col:40> col:40 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x56469ab0e890 <col:43, col:69> col:63 v 'Vector<NameDB *>::value_argument_type':'NameDB *'
|-CXXMethodDecl 0x56469ab0eb28 <line:150:5, col:55> col:49 begin 'Vector<NameDB *>::iterator ()'
| |-NoInlineAttr 0x56469ab0ec08 <col:20> Inherited
| `-OptimizeNoneAttr 0x56469ab0ec60 <col:30> Inherited
|-CXXMethodDecl 0x56469ab0eca8 <line:151:5, col:53> col:49 end 'Vector<NameDB *>::iterator ()'
| |-NoInlineAttr 0x56469ab0ed58 <col:20> Inherited
| `-OptimizeNoneAttr 0x56469ab0edb0 <col:30> Inherited
|-CXXMethodDecl 0x56469ab0ee78 <line:152:5, col:63> col:55 begin 'Vector<NameDB *>::const_iterator () const'
| |-NoInlineAttr 0x56469ab0ef28 <col:20> Inherited
| `-OptimizeNoneAttr 0x56469ab0ef80 <col:30> Inherited
|-CXXMethodDecl 0x56469ab0efc8 <line:153:5, col:61> col:55 end 'Vector<NameDB *>::const_iterator () const'
| |-NoInlineAttr 0x56469ab0f078 <col:20> Inherited
| `-OptimizeNoneAttr 0x56469ab0f0d0 <col:30> Inherited
|-CXXMethodDecl 0x56469ab0f118 <line:154:5, col:64> col:55 cbegin 'Vector<NameDB *>::const_iterator () const'
| |-NoInlineAttr 0x56469ab0f1c8 <col:20> Inherited
| `-OptimizeNoneAttr 0x56469ab0f220 <col:30> Inherited
|-CXXMethodDecl 0x56469ab0f268 <line:155:5, col:62> col:55 cend 'Vector<NameDB *>::const_iterator () const'
| |-NoInlineAttr 0x56469ab0f318 <col:20> Inherited
| `-OptimizeNoneAttr 0x56469ab0f370 <col:30> Inherited
|-CXXMethodDecl 0x56469ab0f398 <line:157:5, col:29> col:22 size 'Vector::size_type () const' inline
|-CXXMethodDecl 0x56469ab0f448 <line:158:5, col:33> col:22 capacity 'Vector::size_type () const' inline
|-CXXMethodDecl 0x56469ab0f4f8 <line:159:5, col:25> col:17 empty 'bool () const' inline
|-CXXMethodDecl 0x56469ab0f6b8 <line:160:5, col:64> col:17 resize 'void (Vector::size_type, Vector<NameDB *>::value_argument_type)' inline
| |-ParmVarDecl 0x56469ab0f5a8 <col:24, col:34> col:34 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x56469ab0f620 <col:37, col:63> col:57 v 'Vector<NameDB *>::value_argument_type':'NameDB *'
|-CXXMethodDecl 0x56469ab0f808 <line:161:5, col:36> col:17 reserve 'bool (Vector::size_type)' inline
| `-ParmVarDecl 0x56469ab0f778 <col:25, col:35> col:35 n 'Vector::size_type':'int'
|-CXXMethodDecl 0x56469ab0f9b8 <line:163:5, col:65> col:43 operator[] 'NameDB *&(Vector::size_type)'
| |-ParmVarDecl 0x56469ab0f8c0 <col:54, col:64> col:64 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x56469ab0fa70 <col:20>
| `-OptimizeNoneAttr 0x56469ab0fac8 <col:30>
|-CXXMethodDecl 0x56469ab0fbe8 <line:164:5, col:73> col:49 operator[] 'NameDB *const &(Vector::size_type) const'
| |-ParmVarDecl 0x56469ab0faf0 <col:60, col:70> col:70 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x56469ab0fca0 <col:20>
| `-OptimizeNoneAttr 0x56469ab0fcf8 <col:30>
|-CXXMethodDecl 0x56469ab0fdb0 <line:165:5, col:29> col:15 at 'NameDB *&(Vector::size_type)' inline
| `-ParmVarDecl 0x56469ab0fd20 <col:18, col:28> col:28 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x56469ab0fef8 <line:166:5, col:37> col:21 at 'NameDB *const &(Vector::size_type) const' inline
| `-ParmVarDecl 0x56469ab0fe68 <col:24, col:34> col:34 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x56469ab10028 <line:167:5, col:21> col:15 front 'NameDB *&()' inline
|-CXXMethodDecl 0x56469ab10158 <line:168:5, col:29> col:21 front 'NameDB *const &() const' inline
|-CXXMethodDecl 0x56469ab10228 <line:169:5, col:20> col:15 back 'NameDB *&()' inline
|-CXXMethodDecl 0x56469ab102f8 <line:170:5, col:28> col:21 back 'NameDB *const &() const' inline
|-CXXMethodDecl 0x56469ab10438 <line:172:5, col:39> col:15 unchecked_at 'NameDB *&(Vector::size_type)' inline
| `-ParmVarDecl 0x56469ab103a8 <col:28, col:38> col:38 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x56469ab10580 <line:173:5, col:47> col:21 unchecked_at 'NameDB *const &(Vector::size_type) const' inline
| `-ParmVarDecl 0x56469ab104f0 <col:34, col:44> col:44 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x56469ab106c8 <line:174:5, col:59> col:15 at_u 'NameDB *&(Vector::size_type)' inline
| |-ParmVarDecl 0x56469ab10638 <col:20, col:30> col:30 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x56469ab10780 <col:48> Inherited "" ""
|-CXXMethodDecl 0x56469ab10880 <line:175:5, col:71> col:21 at_u 'NameDB *const &(Vector::size_type) const' inline
| |-ParmVarDecl 0x56469ab107f0 <col:26, col:36> col:36 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x56469ab10938 <col:60> Inherited "" ""
|-CXXMethodDecl 0x56469ab109f8 <line:177:5, col:20> col:15 data 'NameDB **()' inline
|-CXXMethodDecl 0x56469ab10af8 <line:178:5, col:28> col:21 data 'NameDB *const *() const' inline
|-CXXMethodDecl 0x56469ab10c78 <line:180:5, col:48> col:17 push_back 'void (Vector<NameDB *>::value_argument_type)' inline
| `-ParmVarDecl 0x56469ab10bb8 <col:27, col:47> col:47 v 'Vector<NameDB *>::value_argument_type':'NameDB *'
|-FunctionTemplateDecl 0x56469ab11438 <line:182:5, line:183:63> col:48 push_back
| |-TemplateTypeParmDecl 0x56469ab10d30 <line:182:15, col:43> col:24 typename depth 0 index 0 A
| | `-TemplateArgument type 'fast_argument<NameDB *>':'fast_argument<NameDB *, false>'
| `-CXXMethodDecl 0x56469ab11398 <line:183:5, col:63> col:48 push_back 'typename A::enable_rvalue_reference (NameDB *&&)' inline
|   `-ParmVarDecl 0x56469ab11298 <col:58, col:62> col:62 v 'NameDB *&&'
|-CXXMethodDecl 0x56469ab11518 <line:185:5, col:26> col:17 pop_back 'void ()' inline
|-CXXMethodDecl 0x56469ab11668 <line:186:5, col:49> col:17 push_front 'void (Vector<NameDB *>::value_argument_type)' inline
| `-ParmVarDecl 0x56469ab115d8 <col:28, col:48> col:48 v 'Vector<NameDB *>::value_argument_type':'NameDB *'
|-CXXMethodDecl 0x56469ab11720 <line:187:5, col:27> col:17 pop_front 'void ()' inline
|-CXXMethodDecl 0x56469ab11968 <line:189:5, col:62> col:21 insert 'Vector<NameDB *>::iterator (Vector<NameDB *>::iterator, Vector<NameDB *>::value_argument_type)' inline
| |-ParmVarDecl 0x56469ab117e0 <col:28, col:37> col:37 it 'Vector<NameDB *>::iterator':'NameDB **'
| `-ParmVarDecl 0x56469ab11858 <col:41, col:61> col:61 v 'Vector<NameDB *>::value_argument_type':'NameDB *'
|-CXXMethodDecl 0x56469ab11b28 <line:190:5, col:38> col:21 erase 'Vector<NameDB *>::iterator (Vector<NameDB *>::iterator)' inline
| `-ParmVarDecl 0x56469ab11a38 <col:27, col:36> col:36 it 'Vector<NameDB *>::iterator':'NameDB **'
|-CXXMethodDecl 0x56469ab11d78 <line:191:5, col:49> col:21 erase 'Vector<NameDB *>::iterator (Vector<NameDB *>::iterator, Vector<NameDB *>::iterator)' inline
| |-ParmVarDecl 0x56469ab11bf0 <col:27, col:36> col:36 a 'Vector<NameDB *>::iterator':'NameDB **'
| `-ParmVarDecl 0x56469ab11c68 <col:39, col:48> col:48 b 'Vector<NameDB *>::iterator':'NameDB **'
|-CXXMethodDecl 0x56469ab11e38 <line:193:5, col:23> col:17 clear 'void ()' inline
|-CXXMethodDecl 0x56469ab12098 <line:195:5, col:34> col:17 swap 'void (Vector<NameDB *> &)' inline
| `-ParmVarDecl 0x56469ab11fa0 <col:22, col:33> col:33 x 'Vector<NameDB *> &'
`-CXXDestructorDecl 0x56469ab12168 <../dummy_inc/click/ipaddress.hh:13:29> col:29 implicit ~Vector 'void ()' inline default noexcept-unevaluated 0x56469ab12168

Layout: <CGRecordLayout
  LLVMType:%class.Vector = type { %class.vector_memory }
  NonVirtualBaseLLVMType:%class.Vector = type { %class.vector_memory }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x56469ae63d80 prev 0x56469ad80920 <../dummy_inc/click/nameinfo.hh:11:1, line:243:1> line:11:7 referenced class NameInfo definition
|-DefinitionData standard_layout has_user_declared_ctor has_mutable_fields can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor simple non_trivial has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveConstructor needs_overload_resolution
| |-CopyAssignment non_trivial has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveAssignment needs_overload_resolution
| `-Destructor non_trivial user_declared
|-CXXRecordDecl 0x56469ae63e78 <col:1, col:7> col:7 implicit referenced class NameInfo
|-AccessSpecDecl 0x56469ae63f08 <col:18, col:24> col:18 public
|-CXXConstructorDecl 0x56469ae63f68 <line:16:5, col:14> col:5 NameInfo 'void ()'
|-CXXDestructorDecl 0x56469ae64058 <line:23:5, col:15> col:5 ~NameInfo 'void ()' noexcept-unevaluated 0x56469ae64058
|-CXXMethodDecl 0x56469ae64160 <line:29:5, col:35> col:17 static_initialize 'void ()' static
|-CXXMethodDecl 0x56469ae64220 <line:35:5, col:32> col:17 static_cleanup 'void ()' static
|-EnumDecl 0x56469ae642c0 <line:38:5, line:63:5> line:38:10 DBType
| |-EnumConstantDecl 0x56469ae643c0 <line:39:2, col:11> col:2 T_NONE 'NameInfo::DBType'
| | `-ImplicitCastExpr 0x56469ae65100 <col:11> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x56469ae643a0 <col:11> 'int' Int: 0
| |     `-IntegerLiteral 0x56469ae64380 <col:11> 'int' 0
| |-EnumConstantDecl 0x56469ae64450 <line:40:2, col:19> col:2 T_SCHEDULEINFO 'NameInfo::DBType'
| | `-ImplicitCastExpr 0x56469ae65118 <col:19> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x56469ae64430 <col:19> 'int' Int: 1
| |     `-IntegerLiteral 0x56469ae64410 <col:19> 'int' 1
| |-EnumConstantDecl 0x56469ae644e0 <line:41:2, col:17> col:2 T_ANNOTATION 'NameInfo::DBType'
| | `-ImplicitCastExpr 0x56469ae65130 <col:17> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x56469ae644c0 <col:17> 'int' Int: 2
| |     `-IntegerLiteral 0x56469ae644a0 <col:17> 'int' 2
| |-EnumConstantDecl 0x56469ae64570 <line:42:2, col:18> col:2 referenced T_SCRIPT_INSN 'NameInfo::DBType'
| | `-ImplicitCastExpr 0x56469ae65148 <col:18> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x56469ae64550 <col:18> 'int' Int: 3
| |     `-IntegerLiteral 0x56469ae64530 <col:18> 'int' 3
| |-EnumConstantDecl 0x56469ae64600 <line:43:2, col:12> col:2 referenced T_SIGNO 'NameInfo::DBType'
| | `-ImplicitCastExpr 0x56469ae65160 <col:12> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x56469ae645e0 <col:12> 'int' Int: 4
| |     `-IntegerLiteral 0x56469ae645c0 <col:12> 'int' 4
| |-EnumConstantDecl 0x56469ae64690 <line:44:2, col:15> col:2 T_SPINLOCK 'NameInfo::DBType'
| | `-ImplicitCastExpr 0x56469ae65178 <col:15> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x56469ae64670 <col:15> 'int' Int: 5
| |     `-IntegerLiteral 0x56469ae64650 <col:15> 'int' 5
| |-EnumConstantDecl 0x56469ae64720 <line:45:2, col:20> col:2 T_ETHERNET_ADDR 'NameInfo::DBType'
| | `-ImplicitCastExpr 0x56469ae65190 <col:20> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x56469ae64700 <col:20> 'int' Int: 16777217
| |     `-IntegerLiteral 0x56469ae646e0 <col:20> 'int' 16777217
| |-EnumConstantDecl 0x56469ae647b0 <line:46:2, col:14> col:2 T_IP_ADDR 'NameInfo::DBType'
| | `-ImplicitCastExpr 0x56469ae651a8 <col:14> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x56469ae64790 <col:14> 'int' Int: 67108865
| |     `-IntegerLiteral 0x56469ae64770 <col:14> 'int' 67108865
| |-EnumConstantDecl 0x56469ae64840 <line:47:2, col:16> col:2 T_IP_PREFIX 'NameInfo::DBType'
| | `-ImplicitCastExpr 0x56469ae651c0 <col:16> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x56469ae64820 <col:16> 'int' Int: 67108866
| |     `-IntegerLiteral 0x56469ae64800 <col:16> 'int' 67108866
| |-EnumConstantDecl 0x56469ae648d0 <line:48:2, col:15> col:2 T_IP_PROTO 'NameInfo::DBType'
| | `-ImplicitCastExpr 0x56469ae651d8 <col:15> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x56469ae648b0 <col:15> 'int' Int: 67108867
| |     `-IntegerLiteral 0x56469ae64890 <col:15> 'int' 67108867
| |-EnumConstantDecl 0x56469ae64960 <line:49:2, col:20> col:2 T_IPFILTER_TYPE 'NameInfo::DBType'
| | `-ImplicitCastExpr 0x56469ae651f0 <col:20> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x56469ae64940 <col:20> 'int' Int: 67108868
| |     `-IntegerLiteral 0x56469ae64920 <col:20> 'int' 67108868
| |-EnumConstantDecl 0x56469ae649f0 <line:50:2, col:14> col:2 T_TCP_OPT 'NameInfo::DBType'
| | `-ImplicitCastExpr 0x56469ae65208 <col:14> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x56469ae649d0 <col:14> 'int' Int: 67108869
| |     `-IntegerLiteral 0x56469ae649b0 <col:14> 'int' 67108869
| |-EnumConstantDecl 0x56469ae64a80 <line:51:2, col:25> col:2 T_IPREWRITER_PATTERN 'NameInfo::DBType'
| | `-ImplicitCastExpr 0x56469ae65220 <col:25> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x56469ae64a60 <col:25> 'int' Int: 67108870
| |     `-IntegerLiteral 0x56469ae64a40 <col:25> 'int' 67108870
| |-EnumConstantDecl 0x56469ae64b10 <line:52:2, col:16> col:2 T_ICMP_TYPE 'NameInfo::DBType'
| | `-ImplicitCastExpr 0x56469ae65238 <col:16> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x56469ae64af0 <col:16> 'int' Int: 67174400
| |     `-IntegerLiteral 0x56469ae64ad0 <col:16> 'int' 67174400
| |-EnumConstantDecl 0x56469ae64ba0 <line:53:2, col:16> col:2 T_ICMP_CODE 'NameInfo::DBType'
| | `-ImplicitCastExpr 0x56469ae65250 <col:16> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x56469ae64b80 <col:16> 'int' Int: 67174656
| |     `-IntegerLiteral 0x56469ae64b60 <col:16> 'int' 67174656
| |-EnumConstantDecl 0x56469ae64c30 <line:54:2, col:14> col:2 T_IP_PORT 'NameInfo::DBType'
| | `-ImplicitCastExpr 0x56469ae65268 <col:14> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x56469ae64c10 <col:14> 'int' Int: 67239936
| |     `-IntegerLiteral 0x56469ae64bf0 <col:14> 'int' 67239936
| |-EnumConstantDecl 0x56469ae64cc0 <line:55:2, col:15> col:2 T_TCP_PORT 'NameInfo::DBType'
| | `-ImplicitCastExpr 0x56469ae65280 <col:15> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x56469ae64ca0 <col:15> 'int' Int: 67239942
| |     `-IntegerLiteral 0x56469ae64c80 <col:15> 'int' 67239942
| |-EnumConstantDecl 0x56469ae64d50 <line:56:2, col:15> col:2 T_UDP_PORT 'NameInfo::DBType'
| | `-ImplicitCastExpr 0x56469ae65298 <col:15> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x56469ae64d30 <col:15> 'int' Int: 67239953
| |     `-IntegerLiteral 0x56469ae64d10 <col:15> 'int' 67239953
| |-EnumConstantDecl 0x56469ae64de0 <line:57:2, col:19> col:2 T_IP_FIELDNAME 'NameInfo::DBType'
| | `-ImplicitCastExpr 0x56469ae652b0 <col:19> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x56469ae64dc0 <col:19> 'int' Int: 67305472
| |     `-IntegerLiteral 0x56469ae64da0 <col:19> 'int' 67305472
| |-EnumConstantDecl 0x56469ae64e70 <line:58:2, col:21> col:2 T_ICMP_FIELDNAME 'NameInfo::DBType'
| | `-ImplicitCastExpr 0x56469ae652c8 <col:21> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x56469ae64e50 <col:21> 'int' Int: 67305473
| |     `-IntegerLiteral 0x56469ae64e30 <col:21> 'int' 67305473
| |-EnumConstantDecl 0x56469ae64f00 <line:59:2, col:20> col:2 T_TCP_FIELDNAME 'NameInfo::DBType'
| | `-ImplicitCastExpr 0x56469ae652e0 <col:20> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x56469ae64ee0 <col:20> 'int' Int: 67305478
| |     `-IntegerLiteral 0x56469ae64ec0 <col:20> 'int' 67305478
| |-EnumConstantDecl 0x56469ae64f90 <line:60:2, col:20> col:2 T_UDP_FIELDNAME 'NameInfo::DBType'
| | `-ImplicitCastExpr 0x56469ae652f8 <col:20> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x56469ae64f70 <col:20> 'int' Int: 67305489
| |     `-IntegerLiteral 0x56469ae64f50 <col:20> 'int' 67305489
| |-EnumConstantDecl 0x56469ae65020 <line:61:2, col:15> col:2 T_IP6_ADDR 'NameInfo::DBType'
| | `-ImplicitCastExpr 0x56469ae65310 <col:15> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x56469ae65000 <col:15> 'int' Int: 100663297
| |     `-IntegerLiteral 0x56469ae64fe0 <col:15> 'int' 100663297
| `-EnumConstantDecl 0x56469ae650b0 <line:62:2, col:17> col:2 T_IP6_PREFIX 'NameInfo::DBType'
|   `-ImplicitCastExpr 0x56469ae65328 <col:17> 'unsigned int' <IntegralCast>
|     `-ConstantExpr 0x56469ae65090 <col:17> 'int' Int: 100663298
|       `-IntegerLiteral 0x56469ae65070 <col:17> 'int' 100663298
|-CXXMethodDecl 0x56469ae65628 <line:85:5, line:86:35> line:85:20 used getdb 'NameDB *(uint32_t, const Element *, size_t, bool)' static
| |-ParmVarDecl 0x56469ae65350 <col:26, col:35> col:35 type 'uint32_t':'unsigned int'
| |-ParmVarDecl 0x56469ae653c8 <col:41, col:56> col:56 context 'const Element *'
| |-ParmVarDecl 0x56469ae65440 <line:86:5, col:12> col:12 value_size 'size_t':'unsigned long'
| `-ParmVarDecl 0x56469ae654b8 <col:24, col:29> col:29 create 'bool'
|-CXXMethodDecl 0x56469ae65848 <line:104:5, col:61> col:17 used installdb 'void (NameDB *, const Element *)' static
| |-ParmVarDecl 0x56469ae656f8 <col:27, col:35> col:35 db 'NameDB *'
| `-ParmVarDecl 0x56469ae65770 <col:39, col:54> col:54 context 'const Element *'
|-CXXMethodDecl 0x56469ae659c8 <line:112:5, col:39> col:17 used uninstalldb 'void (NameDB *)' static
| `-ParmVarDecl 0x56469ae65908 <col:29, col:37> col:37 db 'NameDB *'
|-CXXMethodDecl 0x56469ae65db8 <line:127:5, line:128:65> line:127:17 used query 'bool (uint32_t, const Element *, const String &, void *, size_t)' static
| |-ParmVarDecl 0x56469ae65a80 <col:23, col:32> col:32 type 'uint32_t':'unsigned int'
| |-ParmVarDecl 0x56469ae65af8 <col:38, col:53> col:53 context 'const Element *'
| |-ParmVarDecl 0x56469ae65b70 <line:128:9, col:23> col:23 name 'const String &'
| |-ParmVarDecl 0x56469ae65bf0 <col:29, col:35> col:35 value_store 'void *'
| `-ParmVarDecl 0x56469ae65c68 <col:48, col:55> col:55 value_size 'size_t':'unsigned long'
|-CXXMethodDecl 0x56469ae66138 <line:147:5, line:148:46> line:147:17 query_int 'bool (uint32_t, const Element *, const String &, int32_t *)' static
| |-ParmVarDecl 0x56469ae65e90 <col:27, col:36> col:36 type 'uint32_t':'unsigned int'
| |-ParmVarDecl 0x56469ae65f08 <col:42, col:57> col:57 context 'const Element *'
| |-ParmVarDecl 0x56469ae65f80 <line:148:6, col:20> col:20 name 'const String &'
| `-ParmVarDecl 0x56469ae65ff8 <col:26, col:35> col:35 value_store 'int32_t *'
|-CXXMethodDecl 0x56469ae664b8 <line:151:5, line:152:47> line:151:17 query_int 'bool (uint32_t, const Element *, const String &, uint32_t *)' static
| |-ParmVarDecl 0x56469ae66208 <col:27, col:36> col:36 type 'uint32_t':'unsigned int'
| |-ParmVarDecl 0x56469ae66280 <col:42, col:57> col:57 context 'const Element *'
| |-ParmVarDecl 0x56469ae662f8 <line:152:6, col:20> col:20 name 'const String &'
| `-ParmVarDecl 0x56469ae66370 <col:26, col:36> col:36 value_store 'uint32_t *'
|-CXXMethodDecl 0x56469ab0a730 <line:167:5, line:168:43> line:167:19 used revquery 'String (uint32_t, const Element *, const void *, size_t)' static
| |-ParmVarDecl 0x56469ae66588 <col:28, col:37> col:37 type 'uint32_t':'unsigned int'
| |-ParmVarDecl 0x56469ae66600 <col:43, col:58> col:58 context 'const Element *'
| |-ParmVarDecl 0x56469ae66680 <line:168:7, col:19> col:19 value 'const void *'
| `-ParmVarDecl 0x56469ae666f8 <col:26, col:33> col:33 value_size 'size_t':'unsigned long'
|-CXXMethodDecl 0x56469ab0aa18 <line:182:5, line:183:24> line:182:26 revquery_int 'String (uint32_t, const Element *, int32_t)' static inline
| |-ParmVarDecl 0x56469ab0a800 <col:39, col:48> col:48 type 'uint32_t':'unsigned int'
| |-ParmVarDecl 0x56469ab0a878 <col:54, col:69> col:69 context 'const Element *'
| `-ParmVarDecl 0x56469ab0a8f0 <line:183:11, col:19> col:19 value 'int32_t':'int'
|-CXXMethodDecl 0x56469ab0ae18 <line:202:5, line:203:66> line:202:24 define 'bool (uint32_t, const Element *, const String &, const void *, size_t)' static inline
| |-ParmVarDecl 0x56469ab0aae0 <col:31, col:40> col:40 type 'uint32_t':'unsigned int'
| |-ParmVarDecl 0x56469ab0ab58 <col:46, col:61> col:61 context 'const Element *'
| |-ParmVarDecl 0x56469ab0abd0 <line:203:10, col:24> col:24 name 'const String &'
| |-ParmVarDecl 0x56469ab0ac50 <col:30, col:42> col:42 value 'const void *'
| `-ParmVarDecl 0x56469ab0acc8 <col:49, col:56> col:56 value_size 'size_t':'unsigned long'
|-CXXMethodDecl 0x56469ab0b198 <line:220:5, line:221:40> line:220:24 define_int 'bool (uint32_t, const Element *, const String &, int32_t)' static inline
| |-ParmVarDecl 0x56469ab0aef0 <col:35, col:44> col:44 type 'uint32_t':'unsigned int'
| |-ParmVarDecl 0x56469ab0af68 <col:50, col:65> col:65 context 'const Element *'
| |-ParmVarDecl 0x56469ab0afe0 <line:221:7, col:21> col:21 name 'const String &'
| `-ParmVarDecl 0x56469ab0b058 <col:27, col:35> col:35 value 'int32_t':'int'
|-AccessSpecDecl 0x56469ab0b258 <line:230:3, col:10> col:3 private
|-FieldDecl 0x56469ab12250 <line:232:5, col:22> col:22 _namedb_roots 'Vector<NameDB *>':'Vector<NameDB *>'
|-FieldDecl 0x56469ab12350 <line:233:5, col:22> col:22 _namedbs 'Vector<NameDB *>':'Vector<NameDB *>'
|-CXXMethodDecl 0x56469ab123e8 <line:235:5, col:73> col:20 install_dynamic_sentinel 'NameDB *()' inline
| `-CompoundStmt 0x56469ae66d10 <col:47, col:73>
|   `-ReturnStmt 0x56469ae66d00 <col:49, col:67>
|     `-CStyleCastExpr 0x56469ae66cd8 <col:56, col:67> 'NameDB *' <BitCast>
|       `-CXXThisExpr 0x56469ae66cb8 <col:67> 'NameInfo *' this
|-CXXMethodDecl 0x56469ae66898 <line:236:5, col:87> col:13 namedb 'NameDB *(uint32_t, size_t, const String &, NameDB *)'
| |-ParmVarDecl 0x56469ab12498 <col:20, col:29> col:29 type 'uint32_t':'unsigned int'
| |-ParmVarDecl 0x56469ab12510 <col:35, col:42> col:42 size 'size_t':'unsigned long'
| |-ParmVarDecl 0x56469ab12588 <col:48, col:62> col:62 prefix 'const String &'
| `-ParmVarDecl 0x56469ab12600 <col:70, col:78> col:78 installer 'NameDB *'
|-CXXConstructorDecl 0x56469ae66988 <line:11:7> col:7 implicit NameInfo 'void (const NameInfo &)' inline default noexcept-unevaluated 0x56469ae66988
| `-ParmVarDecl 0x56469ae66a98 <col:7> col:7 'const NameInfo &'
`-CXXMethodDecl 0x56469ae66b38 <col:7> col:7 implicit operator= 'NameInfo &(const NameInfo &)' inline default noexcept-unevaluated 0x56469ae66b38
  `-ParmVarDecl 0x56469ae66c48 <col:7> col:7 'const NameInfo &'

Layout: <CGRecordLayout
  LLVMType:%class.NameInfo = type { %class.Vector, %class.Vector }
  NonVirtualBaseLLVMType:%class.NameInfo = type { %class.Vector, %class.Vector }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x56469ae66d28 prev 0x56469ae63c38 <../dummy_inc/click/nameinfo.hh:245:1, line:348:1> line:245:7 referenced class NameDB definition
|-DefinitionData polymorphic abstract has_user_declared_ctor has_mutable_fields can_const_default_init
| |-DefaultConstructor
| |-CopyConstructor simple non_trivial has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveConstructor needs_overload_resolution
| |-CopyAssignment non_trivial has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveAssignment needs_overload_resolution
| `-Destructor non_trivial user_declared needs_overload_resolution
|-CXXRecordDecl 0x56469ae66e20 <col:1, col:7> col:7 implicit referenced class NameDB
|-AccessSpecDecl 0x56469ae66eb0 <col:16, col:22> col:16 public
|-CXXConstructorDecl 0x56469ae67118 <line:253:5, col:74> col:12 used NameDB 'void (uint32_t, const String &, size_t)' inline
| |-ParmVarDecl 0x56469ae66ee8 <col:19, col:28> col:28 type 'uint32_t':'unsigned int'
| |-ParmVarDecl 0x56469ae66f60 <col:34, col:48> col:48 context 'const String &'
| `-ParmVarDecl 0x56469ae66fd8 <col:57, col:64> col:64 value_size 'size_t':'unsigned long'
|-CXXDestructorDecl 0x56469ae67220 <line:259:5, line:261:5> line:259:13 used ~NameDB 'void () noexcept' virtual
| `-CompoundStmt 0x56469ae688a8 <col:23, line:261:5>
|   `-CallExpr 0x56469ae68880 <line:260:2, col:28> 'void'
|     |-ImplicitCastExpr 0x56469ae68868 <col:2, col:12> 'void (*)(NameDB *)' <FunctionToPointerDecay>
|     | `-DeclRefExpr 0x56469ae687f8 <col:2, col:12> 'void (NameDB *)' lvalue CXXMethod 0x56469ae659c8 'uninstalldb' 'void (NameDB *)'
|     `-CXXThisExpr 0x56469ae68828 <col:24> 'NameDB *' this
|-CXXMethodDecl 0x56469ae67348 <line:264:5, line:266:5> line:264:14 type 'uint32_t () const'
| `-CompoundStmt 0x56469ae68928 <col:27, line:266:5>
|   `-ReturnStmt 0x56469ae68918 <line:265:2, col:9>
|     `-ImplicitCastExpr 0x56469ae68900 <col:9> 'uint32_t':'unsigned int' <LValueToRValue>
|       `-MemberExpr 0x56469ae688d0 <col:9> 'const uint32_t':'const unsigned int' lvalue ->_type 0x56469ae68130
|         `-CXXThisExpr 0x56469ae688c0 <col:9> 'const NameDB *' implicit this
|-CXXMethodDecl 0x56469ae67408 <line:269:5, line:271:5> line:269:19 context 'const String &() const'
| `-CompoundStmt 0x56469ae68990 <col:35, line:271:5>
|   `-ReturnStmt 0x56469ae68980 <line:270:2, col:9>
|     `-MemberExpr 0x56469ae68950 <col:9> 'const String' lvalue ->_context 0x56469ae68190
|       `-CXXThisExpr 0x56469ae68940 <col:9> 'const NameDB *' implicit this
|-CXXMethodDecl 0x56469ae674f8 <line:279:5, line:281:5> line:279:13 context_parent 'NameDB *() const'
| `-CompoundStmt 0x56469ae68a10 <col:36, line:281:5>
|   `-ReturnStmt 0x56469ae68a00 <line:280:2, col:9>
|     `-ImplicitCastExpr 0x56469ae689e8 <col:9> 'NameDB *' <LValueToRValue>
|       `-MemberExpr 0x56469ae689b8 <col:9> 'NameDB *const' lvalue ->_context_parent 0x56469ae68250
|         `-CXXThisExpr 0x56469ae689a8 <col:9> 'const NameDB *' implicit this
|-CXXMethodDecl 0x56469ae675e8 <line:284:5, line:286:5> line:284:12 value_size 'size_t () const'
| `-CompoundStmt 0x56469ae68a90 <col:31, line:286:5>
|   `-ReturnStmt 0x56469ae68a80 <line:285:2, col:9>
|     `-ImplicitCastExpr 0x56469ae68a68 <col:9> 'size_t':'unsigned long' <LValueToRValue>
|       `-MemberExpr 0x56469ae68a38 <col:9> 'const size_t':'const unsigned long' lvalue ->_value_size 0x56469ae681f0
|         `-CXXThisExpr 0x56469ae68a28 <col:9> 'const NameDB *' implicit this
|-CXXMethodDecl 0x56469ae678b8 <line:295:5, col:78> col:18 query 'bool (const String &, void *, size_t)' virtual pure
| |-ParmVarDecl 0x56469ae67698 <col:24, col:38> col:38 name 'const String &'
| |-ParmVarDecl 0x56469ae67718 <col:44, col:50> col:50 value 'void *'
| `-ParmVarDecl 0x56469ae67790 <col:57, col:64> col:64 value_size 'size_t':'unsigned long'
|-CXXMethodDecl 0x56469ae67b18 <line:305:5, col:65> col:20 revquery 'String (const void *, size_t)' virtual
| |-ParmVarDecl 0x56469ae67988 <col:29, col:41> col:41 value 'const void *'
| `-ParmVarDecl 0x56469ae67a00 <col:48, col:55> col:55 value_size 'size_t':'unsigned long'
|-CXXMethodDecl 0x56469ae67df8 <line:315:5, col:81> col:18 used define 'bool (const String &, const void *, size_t)' virtual
| |-ParmVarDecl 0x56469ae67bd8 <col:25, col:39> col:39 name 'const String &'
| |-ParmVarDecl 0x56469ae67c58 <col:45, col:57> col:57 value 'const void *'
| `-ParmVarDecl 0x56469ae67cd0 <col:64, col:71> col:71 value_size 'size_t':'unsigned long'
|-CXXMethodDecl 0x56469ae68048 <line:324:5, col:61> col:17 define_int 'bool (const String &, int32_t)' inline
| |-ParmVarDecl 0x56469ae67ec0 <col:28, col:42> col:42 name 'const String &'
| `-ParmVarDecl 0x56469ae67f38 <col:48, col:56> col:56 value 'int32_t':'int'
|-AccessSpecDecl 0x56469ae680f8 <line:332:3, col:10> col:3 private
|-FieldDecl 0x56469ae68130 <line:334:5, col:14> col:14 referenced _type 'uint32_t':'unsigned int'
|-FieldDecl 0x56469ae68190 <line:335:5, col:12> col:12 referenced _context 'String'
|-FieldDecl 0x56469ae681f0 <line:336:5, col:12> col:12 referenced _value_size 'size_t':'unsigned long'
|-FieldDecl 0x56469ae68250 <line:337:5, col:13> col:13 referenced _context_parent 'NameDB *'
|-FieldDecl 0x56469ae682b0 <line:338:5, col:13> col:13 _context_sibling 'NameDB *'
|-FieldDecl 0x56469ae68310 <line:339:5, col:13> col:13 _context_child 'NameDB *'
|-FieldDecl 0x56469ae68370 <line:340:5, col:15> col:15 _installed 'NameInfo *'
|-FriendDecl 0x56469ae68410 <line:346:5, col:18> col:12 'class NameInfo':'NameInfo'
|-CXXConstructorDecl 0x56469ae68478 <line:245:7> col:7 implicit NameDB 'void (const NameDB &)' inline default noexcept-unevaluated 0x56469ae68478
| `-ParmVarDecl 0x56469ae68588 <col:7> col:7 'const NameDB &'
`-CXXMethodDecl 0x56469ae68628 <col:7> col:7 implicit operator= 'NameDB &(const NameDB &)' inline default noexcept-unevaluated 0x56469ae68628
  `-ParmVarDecl 0x56469ae68738 <col:7> col:7 'const NameDB &'

Layout: <CGRecordLayout
  LLVMType:%class.NameDB = type { i32 (...)**, i32, %class.String, i64, %class.NameDB*, %class.NameDB*, %class.NameDB*, %class.NameInfo* }
  NonVirtualBaseLLVMType:%class.NameDB = type { i32 (...)**, i32, %class.String, i64, %class.NameDB*, %class.NameDB*, %class.NameDB*, %class.NameInfo* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x56469ae68cc0 <../dummy_inc/click/nameinfo.hh:352:5, line:355:5> line:352:12 referenced struct Entry definition
|-DefinitionData pass_in_registers aggregate standard_layout trivially_copyable pod trivial literal
| |-DefaultConstructor exists trivial needs_implicit
| |-CopyConstructor simple trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveConstructor exists simple trivial needs_implicit
| |-CopyAssignment trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveAssignment exists simple trivial needs_implicit
| `-Destructor simple irrelevant trivial
|-CXXRecordDecl 0x56469ae68dd8 <col:5, col:12> col:12 implicit struct Entry
|-FieldDecl 0x56469ae68e80 <line:353:2, col:14> col:14 name 'const char *'
|-FieldDecl 0x56469ae68ee0 <line:354:2, col:11> col:11 referenced value 'uint32_t':'unsigned int'
`-CXXDestructorDecl 0x56469aea2440 <line:352:12> col:12 implicit referenced ~Entry 'void () noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.StaticNameDB::Entry" = type { i8*, i32 }
  NonVirtualBaseLLVMType:%"struct.StaticNameDB::Entry" = type { i8*, i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x56469ae68aa8 <../dummy_inc/click/nameinfo.hh:350:1, line:401:1> line:350:7 referenced class StaticNameDB definition
|-DefinitionData polymorphic has_user_declared_ctor has_mutable_fields can_const_default_init
| |-DefaultConstructor
| |-CopyConstructor simple non_trivial has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveConstructor exists simple non_trivial needs_overload_resolution
| |-CopyAssignment non_trivial has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveAssignment exists simple non_trivial needs_overload_resolution
| `-Destructor simple non_trivial needs_overload_resolution
|-public 'NameDB'
|-CXXRecordDecl 0x56469ae68c08 <col:1, col:7> col:7 implicit referenced class StaticNameDB
|-AccessSpecDecl 0x56469ae68c98 <col:38, col:44> col:38 public
|-CXXRecordDecl 0x56469ae68cc0 <line:352:5, line:355:5> line:352:12 referenced struct Entry definition
| |-DefinitionData pass_in_registers aggregate standard_layout trivially_copyable pod trivial literal
| | |-DefaultConstructor exists trivial needs_implicit
| | |-CopyConstructor simple trivial has_const_param needs_implicit implicit_has_const_param
| | |-MoveConstructor exists simple trivial needs_implicit
| | |-CopyAssignment trivial has_const_param needs_implicit implicit_has_const_param
| | |-MoveAssignment exists simple trivial needs_implicit
| | `-Destructor simple irrelevant trivial
| |-CXXRecordDecl 0x56469ae68dd8 <col:5, col:12> col:12 implicit struct Entry
| |-FieldDecl 0x56469ae68e80 <line:353:2, col:14> col:14 name 'const char *'
| |-FieldDecl 0x56469ae68ee0 <line:354:2, col:11> col:11 referenced value 'uint32_t':'unsigned int'
| `-CXXDestructorDecl 0x56469aea2440 <line:352:12> col:12 implicit referenced ~Entry 'void () noexcept' inline default trivial
|-CXXConstructorDecl 0x56469ae69278 <line:369:5, line:370:37> line:369:12 used StaticNameDB 'void (uint32_t, const String &, const StaticNameDB::Entry *, size_t)' inline
| |-ParmVarDecl 0x56469ae68f58 <col:25, col:34> col:34 type 'uint32_t':'unsigned int'
| |-ParmVarDecl 0x56469ae68fd0 <col:40, col:54> col:54 context 'const String &'
| |-ParmVarDecl 0x56469ae69078 <line:370:4, col:17> col:17 entry 'const StaticNameDB::Entry *'
| `-ParmVarDecl 0x56469ae690f0 <col:24, col:31> col:31 nentry 'size_t':'unsigned long'
|-CXXMethodDecl 0x56469ae694e8 <line:379:5, col:66> col:10 query 'bool (const String &, void *, size_t)'
| |-Overrides: [ 0x56469ae678b8 NameDB::query 'bool (const String &, void *, size_t)' ]
| |-ParmVarDecl 0x56469ae69350 <col:16, col:30> col:30 name 'const String &'
| |-ParmVarDecl 0x56469ae693d0 <col:36, col:42> col:42 value 'void *'
| `-ParmVarDecl 0x56469ae69448 <col:49, col:56> col:56 value_size 'size_t':'unsigned long'
|-CXXMethodDecl 0x56469ae696c8 <line:388:5, col:57> col:12 revquery 'String (const void *, size_t)'
| |-Overrides: [ 0x56469ae67b18 NameDB::revquery 'String (const void *, size_t)' ]
| |-ParmVarDecl 0x56469ae695b8 <col:21, col:33> col:33 value 'const void *'
| `-ParmVarDecl 0x56469ae69630 <col:40, col:47> col:47 value_size 'size_t':'unsigned long'
|-AccessSpecDecl 0x56469ae69778 <line:396:3, col:10> col:3 private
|-FieldDecl 0x56469ae697b0 <line:398:5, col:18> col:18 _entries 'const StaticNameDB::Entry *'
|-FieldDecl 0x56469ae69810 <line:399:5, col:12> col:12 _nentries 'size_t':'unsigned long'
|-CXXConstructorDecl 0x56469ae69888 <line:350:7> col:7 implicit StaticNameDB 'void (const StaticNameDB &)' inline default noexcept-unevaluated 0x56469ae69888
| `-ParmVarDecl 0x56469ae69998 <col:7> col:7 'const StaticNameDB &'
|-CXXConstructorDecl 0x56469ae69a38 <col:7> col:7 implicit StaticNameDB 'void (StaticNameDB &&)' inline default noexcept-unevaluated 0x56469ae69a38
| `-ParmVarDecl 0x56469ae69b48 <col:7> col:7 'StaticNameDB &&'
|-CXXMethodDecl 0x56469ae69be8 <col:7> col:7 implicit operator= 'StaticNameDB &(const StaticNameDB &)' inline default noexcept-unevaluated 0x56469ae69be8
| `-ParmVarDecl 0x56469ae69cf8 <col:7> col:7 'const StaticNameDB &'
|-CXXMethodDecl 0x56469ae69d68 <col:7> col:7 implicit operator= 'StaticNameDB &(StaticNameDB &&)' inline default noexcept-unevaluated 0x56469ae69d68
| `-ParmVarDecl 0x56469ae69e78 <col:7> col:7 'StaticNameDB &&'
`-CXXDestructorDecl 0x56469ae69f00 <col:7> col:7 implicit ~StaticNameDB 'void ()' inline default noexcept-unevaluated 0x56469ae69f00
  `-Overrides: [ 0x56469ae67220 NameDB::~NameDB 'void () noexcept' ]

Layout: <CGRecordLayout
  LLVMType:%class.StaticNameDB = type { %class.NameDB, %"struct.StaticNameDB::Entry"*, i64 }
  NonVirtualBaseLLVMType:%class.StaticNameDB = type { %class.NameDB, %"struct.StaticNameDB::Entry"*, i64 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class Element
         0 |   (Element vtable pointer)
         8 |   class Element::Port *[2] _ports
        24 |   class Element::Port [4] _inline_ports
        88 |   int [2] _nports
        96 |   class Router * _router
       104 |   int _eindex
           | [sizeof=112, dsize=108, align=8,
           |  nvsize=108, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x56469ac67da8 prev 0x56469ac5f548 <../dummy_inc/click/element.hh:214:5, line:252:5> line:214:11 referenced class Port definition
|-DefinitionData pass_in_registers standard_layout trivially_copyable has_user_declared_ctor can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor simple trivial has_const_param implicit_has_const_param
| |-MoveConstructor exists simple trivial
| |-CopyAssignment trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveAssignment exists simple trivial needs_implicit
| `-Destructor simple irrelevant trivial needs_implicit
|-CXXRecordDecl 0x56469ac67ea0 <col:5, col:11> col:11 implicit referenced class Port
|-AccessSpecDecl 0x56469ac67f30 <col:18, col:24> col:18 public
|-CXXMethodDecl 0x56469ac67fa8 <line:216:9, col:30> col:21 used active 'bool () const' inline
|-CXXMethodDecl 0x56469ac68068 <line:217:9, col:35> col:25 element 'Element *() const' inline
|-CXXMethodDecl 0x56469ac68130 <line:218:9, col:27> col:20 port 'int () const' inline
|-CXXMethodDecl 0x56469ac682a8 <line:220:9, col:65> col:49 used push 'void (Packet *) const'
| |-ParmVarDecl 0x56469ac681e0 <col:54, col:62> col:62 p 'Packet *'
| |-NoInlineAttr 0x56469ac68350 <col:24>
| `-OptimizeNoneAttr 0x56469ac683a8 <col:34>
|-CXXMethodDecl 0x56469ac683f0 <line:221:9, col:31> col:24 used pull 'Packet *() const' inline
|-CXXMethodDecl 0x56469ac686a8 <line:227:9, col:63> col:21 used assign 'void (bool, Element *, int)' inline
| |-ParmVarDecl 0x56469ac684a0 <col:28, col:33> col:33 isoutput 'bool'
| |-ParmVarDecl 0x56469ac68518 <col:43, col:52> col:52 e 'Element *'
| `-ParmVarDecl 0x56469ac68598 <col:55, col:59> col:59 port 'int'
|-AccessSpecDecl 0x56469ac68760 <line:229:7, col:14> col:7 private
|-FieldDecl 0x56469ac68798 <line:231:9, col:18> col:18 referenced _e 'Element *'
|-FieldDecl 0x56469ac68800 <line:232:9, col:13> col:13 referenced _port 'int'
|-CXXConstructorDecl 0x56469ac68888 <line:247:9, col:21> col:16 Port 'void ()' inline
|-CXXMethodDecl 0x56469ac68ba8 <line:248:9, col:79> col:21 assign 'void (bool, Element *, Element *, int)' inline
| |-ParmVarDecl 0x56469ac68940 <col:28, col:33> col:33 isoutput 'bool'
| |-ParmVarDecl 0x56469ac689b8 <col:43, col:52> col:52 owner 'Element *'
| |-ParmVarDecl 0x56469ac68a30 <col:59, col:68> col:68 e 'Element *'
| `-ParmVarDecl 0x56469ac68ab0 <col:71, col:75> col:75 port 'int'
|-FriendDecl 0x56469ac68cc0 <line:250:9, col:22> col:16 'class Element':'Element'
|-CXXConstructorDecl 0x56469ac70638 <line:214:11> col:11 implicit constexpr Port 'void (const Element::Port &)' inline default trivial noexcept-unevaluated 0x56469ac70638
| `-ParmVarDecl 0x56469ac70748 <col:11> col:11 'const Element::Port &'
`-CXXConstructorDecl 0x56469ac707e8 <col:11> col:11 implicit constexpr Port 'void (Element::Port &&)' inline default trivial noexcept-unevaluated 0x56469ac707e8
  `-ParmVarDecl 0x56469ac708f8 <col:11> col:11 'Element::Port &&'

Layout: <CGRecordLayout
  LLVMType:%"class.Element::Port" = type <{ %class.Element*, i32, [4 x i8] }>
  NonVirtualBaseLLVMType:%"class.Element::Port.base" = type <{ %class.Element*, i32 }>
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class Vector<class Element *>
         0 |   class vector_memory<class sized_array_memory<8> > vm_
         0 |     vector_memory<class sized_array_memory<8> >::type * l_
         8 |     vector_memory::size_type n_
        12 |     vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class vector_memory<class typed_array_memory<class String> >
         0 |   vector_memory<class typed_array_memory<class String> >::type * l_
         8 |   vector_memory::size_type n_
        12 |   vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class Vector<class String>
         0 |   class vector_memory<class typed_array_memory<class String> > vm_
         0 |     vector_memory<class typed_array_memory<class String> >::type * l_
         8 |     vector_memory::size_type n_
        12 |     vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class Vector<unsigned int>
         0 |   class vector_memory<class sized_array_memory<4> > vm_
         0 |     vector_memory<class sized_array_memory<4> >::type * l_
         8 |     vector_memory::size_type n_
        12 |     vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class vector_memory<class typed_array_memory<struct Router::element_landmark_t> >
         0 |   vector_memory<class typed_array_memory<struct Router::element_landmark_t> >::type * l_
         8 |   vector_memory::size_type n_
        12 |   vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class Vector<struct Router::element_landmark_t>
         0 |   class vector_memory<class typed_array_memory<struct Router::element_landmark_t> > vm_
         0 |     vector_memory<class typed_array_memory<struct Router::element_landmark_t> >::type * l_
         8 |     vector_memory::size_type n_
        12 |     vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class vector_memory<class sized_array_memory<16> >
         0 |   vector_memory<class sized_array_memory<16> >::type * l_
         8 |   vector_memory::size_type n_
        12 |   vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class Vector<struct Router::Connection>
         0 |   class vector_memory<class sized_array_memory<16> > vm_
         0 |     vector_memory<class sized_array_memory<16> >::type * l_
         8 |     vector_memory::size_type n_
        12 |     vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class Vector<void *>
         0 |   class vector_memory<class sized_array_memory<8> > vm_
         0 |     vector_memory<class sized_array_memory<8> >::type * l_
         8 |     vector_memory::size_type n_
        12 |     vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class Router
         0 |   class Master * _master
         8 |   class atomic_uint32_t _runcount
         8 |     uint32_t _val
        12 |   volatile int _state
    16:0-0 |   _Bool _have_connections
    16:1-1 |   _Bool _conn_sorted
    16:2-2 |   _Bool _have_configuration
        20 |   volatile int _running
        24 |   class atomic_uint32_t _refcount
        24 |     uint32_t _val
        32 |   class Vector<class Element *> _elements
        32 |     class vector_memory<class sized_array_memory<8> > vm_
        32 |       vector_memory<class sized_array_memory<8> >::type * l_
        40 |       vector_memory::size_type n_
        44 |       vector_memory::size_type capacity_
        48 |   class Vector<class String> _element_names
        48 |     class vector_memory<class typed_array_memory<class String> > vm_
        48 |       vector_memory<class typed_array_memory<class String> >::type * l_
        56 |       vector_memory::size_type n_
        60 |       vector_memory::size_type capacity_
        64 |   class Vector<class String> _element_configurations
        64 |     class vector_memory<class typed_array_memory<class String> > vm_
        64 |       vector_memory<class typed_array_memory<class String> >::type * l_
        72 |       vector_memory::size_type n_
        76 |       vector_memory::size_type capacity_
        80 |   class Vector<unsigned int> _element_landmarkids
        80 |     class vector_memory<class sized_array_memory<4> > vm_
        80 |       vector_memory<class sized_array_memory<4> >::type * l_
        88 |       vector_memory::size_type n_
        92 |       vector_memory::size_type capacity_
        96 |   class Vector<int> _element_home_thread_ids
        96 |     class vector_memory<class sized_array_memory<4> > vm_
        96 |       vector_memory<class sized_array_memory<4> >::type * l_
       104 |       vector_memory::size_type n_
       108 |       vector_memory::size_type capacity_
       112 |   class Vector<struct Router::element_landmark_t> _element_landmarks
       112 |     class vector_memory<class typed_array_memory<struct Router::element_landmark_t> > vm_
       112 |       vector_memory<class typed_array_memory<struct Router::element_landmark_t> >::type * l_
       120 |       vector_memory::size_type n_
       124 |       vector_memory::size_type capacity_
       128 |   uint32_t _last_landmarkid
       136 |   class Vector<int> _element_name_sorter
       136 |     class vector_memory<class sized_array_memory<4> > vm_
       136 |       vector_memory<class sized_array_memory<4> >::type * l_
       144 |       vector_memory::size_type n_
       148 |       vector_memory::size_type capacity_
       152 |   Vector<int> [2] _element_gport_offset
       184 |   class Vector<int> _element_configure_order
       184 |     class vector_memory<class sized_array_memory<4> > vm_
       184 |       vector_memory<class sized_array_memory<4> >::type * l_
       192 |       vector_memory::size_type n_
       196 |       vector_memory::size_type capacity_
       200 |   class Vector<struct Router::Connection> _conn
       200 |     class vector_memory<class sized_array_memory<16> > vm_
       200 |       vector_memory<class sized_array_memory<16> >::type * l_
       208 |       vector_memory::size_type n_
       212 |       vector_memory::size_type capacity_
       216 |   class Vector<int> _conn_output_sorter
       216 |     class vector_memory<class sized_array_memory<4> > vm_
       216 |       vector_memory<class sized_array_memory<4> >::type * l_
       224 |       vector_memory::size_type n_
       228 |       vector_memory::size_type capacity_
       232 |   class Vector<class String> _requirements
       232 |     class vector_memory<class typed_array_memory<class String> > vm_
       232 |       vector_memory<class typed_array_memory<class String> >::type * l_
       240 |       vector_memory::size_type n_
       244 |       vector_memory::size_type capacity_
       248 |   class Vector<int> _ehandler_first_by_element
       248 |     class vector_memory<class sized_array_memory<4> > vm_
       248 |       vector_memory<class sized_array_memory<4> >::type * l_
       256 |       vector_memory::size_type n_
       260 |       vector_memory::size_type capacity_
       264 |   class Vector<int> _ehandler_to_handler
       264 |     class vector_memory<class sized_array_memory<4> > vm_
       264 |       vector_memory<class sized_array_memory<4> >::type * l_
       272 |       vector_memory::size_type n_
       276 |       vector_memory::size_type capacity_
       280 |   class Vector<int> _ehandler_next
       280 |     class vector_memory<class sized_array_memory<4> > vm_
       280 |       vector_memory<class sized_array_memory<4> >::type * l_
       288 |       vector_memory::size_type n_
       292 |       vector_memory::size_type capacity_
       296 |   class Vector<int> _handler_first_by_name
       296 |     class vector_memory<class sized_array_memory<4> > vm_
       296 |       vector_memory<class sized_array_memory<4> >::type * l_
       304 |       vector_memory::size_type n_
       308 |       vector_memory::size_type capacity_
       312 |   class Handler ** _handler_bufs
       320 |   int _nhandlers_bufs
       324 |   int _free_handler
       328 |   class Vector<class String> _attachment_names
       328 |     class vector_memory<class typed_array_memory<class String> > vm_
       328 |       vector_memory<class typed_array_memory<class String> >::type * l_
       336 |       vector_memory::size_type n_
       340 |       vector_memory::size_type capacity_
       344 |   class Vector<void *> _attachments
       344 |     class vector_memory<class sized_array_memory<8> > vm_
       344 |       vector_memory<class sized_array_memory<8> >::type * l_
       352 |       vector_memory::size_type n_
       356 |       vector_memory::size_type capacity_
       360 |   class Element * _root_element
       368 |   class String _configuration
       368 |     struct String::rep_t _r
       368 |       const char * data
       376 |       int length
       384 |       struct String::memo_t * memo
       392 |   struct Router::notifier_signals_t * _notifier_signals
       400 |   class HashMap_ArenaFactory * _arena_factory
       408 |   class Router * _hotswap_router
       416 |   class ThreadSched * _thread_sched
       424 |   class NameInfo * _name_info
       432 |   class Vector<int> _flow_code_override_eindex
       432 |     class vector_memory<class sized_array_memory<4> > vm_
       432 |       vector_memory<class sized_array_memory<4> >::type * l_
       440 |       vector_memory::size_type n_
       444 |       vector_memory::size_type capacity_
       448 |   class Vector<class String> _flow_code_override
       448 |     class vector_memory<class typed_array_memory<class String> > vm_
       448 |       vector_memory<class typed_array_memory<class String> >::type * l_
       456 |       vector_memory::size_type n_
       460 |       vector_memory::size_type capacity_
       464 |   class Router * _next_router
           | [sizeof=472, dsize=472, align=8,
           |  nvsize=472, nvalign=8]

*** Dumping AST Record Layout
         0 | __sigset_t
         0 |   unsigned long [16] __val
           | [sizeof=128, dsize=128, align=8,
           |  nvsize=128, nvalign=8]

*** Dumping AST Record Layout
         0 | class Spinlock (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | class Master
         0 |   class RouterThread ** _threads
         8 |   int _nthreads
        16 |   class Router * _routers
        24 |   int _refcount
        28 |   class atomic_uint32_t _master_paused
        28 |     uint32_t _val
        32 |   struct Master::SignalInfo * _siginfo
        40 |   __sigset_t _sig_dispatching
        40 |     unsigned long [16] __val
       168 |   class Spinlock _signal_lock (empty)
           | [sizeof=176, dsize=169, align=8,
           |  nvsize=169, nvalign=8]

*** Dumping AST Record Layout
         0 | struct TaskLink
         0 |   struct TaskLink * _prev
         8 |   struct TaskLink * _next
        16 |   unsigned int _pass
           | [sizeof=24, dsize=20, align=8,
           |  nvsize=20, nvalign=8]

*** Dumping AST Record Layout
         0 | class Vector<struct TimerSet::heap_element>
         0 |   class vector_memory<class sized_array_memory<16> > vm_
         0 |     vector_memory<class sized_array_memory<16> >::type * l_
         8 |     vector_memory::size_type n_
        12 |     vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class Vector<class Timer *>
         0 |   class vector_memory<class sized_array_memory<8> > vm_
         0 |     vector_memory<class sized_array_memory<8> >::type * l_
         8 |     vector_memory::size_type n_
        12 |     vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class SimpleSpinlock (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | class TimerSet
         0 |   class Timestamp _timer_expiry
         0 |     union Timestamp::rep_t _t
         0 |       int64_t x
         8 |   unsigned int _max_timer_stride
        12 |   unsigned int _timer_stride
        16 |   unsigned int _timer_count
        24 |   class Vector<struct TimerSet::heap_element> _timer_heap
        24 |     class vector_memory<class sized_array_memory<16> > vm_
        24 |       vector_memory<class sized_array_memory<16> >::type * l_
        32 |       vector_memory::size_type n_
        36 |       vector_memory::size_type capacity_
        40 |   class Vector<class Timer *> _timer_runchunk
        40 |     class vector_memory<class sized_array_memory<8> > vm_
        40 |       vector_memory<class sized_array_memory<8> >::type * l_
        48 |       vector_memory::size_type n_
        52 |       vector_memory::size_type capacity_
        56 |   class SimpleSpinlock _timer_lock (empty)
        64 |   class Timestamp _timer_check
        64 |     union Timestamp::rep_t _t
        64 |       int64_t x
        72 |   uint32_t _timer_check_reports
           | [sizeof=80, dsize=76, align=8,
           |  nvsize=76, nvalign=8]

*** Dumping AST Record Layout
         0 | class Vector<struct pollfd>
         0 |   class vector_memory<class sized_array_memory<8> > vm_
         0 |     vector_memory<class sized_array_memory<8> >::type * l_
         8 |     vector_memory::size_type n_
        12 |     vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class vector_memory<class sized_array_memory<24> >
         0 |   vector_memory<class sized_array_memory<24> >::type * l_
         8 |   vector_memory::size_type n_
        12 |   vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class Vector<struct SelectSet::SelectorInfo>
         0 |   class vector_memory<class sized_array_memory<24> > vm_
         0 |     vector_memory<class sized_array_memory<24> >::type * l_
         8 |     vector_memory::size_type n_
        12 |     vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class SelectSet
         0 |   int [2] _wake_pipe
         8 |   volatile _Bool _wake_pipe_pending
        16 |   class Vector<struct pollfd> _pollfds
        16 |     class vector_memory<class sized_array_memory<8> > vm_
        16 |       vector_memory<class sized_array_memory<8> >::type * l_
        24 |       vector_memory::size_type n_
        28 |       vector_memory::size_type capacity_
        32 |   class Vector<struct SelectSet::SelectorInfo> _selinfo
        32 |     class vector_memory<class sized_array_memory<24> > vm_
        32 |       vector_memory<class sized_array_memory<24> >::type * l_
        40 |       vector_memory::size_type n_
        44 |       vector_memory::size_type capacity_
           | [sizeof=48, dsize=48, align=8,
           |  nvsize=48, nvalign=8]

*** Dumping AST Record Layout
         0 | union Task::Pending
         0 |   class Task * t
         0 |   uintptr_t x
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class SpinlockIRQ (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | class RouterThread
         0 |   struct TaskLink _task_link
         0 |     struct TaskLink * _prev
         8 |     struct TaskLink * _next
        16 |     unsigned int _pass
        24 |   volatile _Bool _stop_flag
        32 |   class TimerSet _timers
        32 |     class Timestamp _timer_expiry
        32 |       union Timestamp::rep_t _t
        32 |         int64_t x
        40 |     unsigned int _max_timer_stride
        44 |     unsigned int _timer_stride
        48 |     unsigned int _timer_count
        56 |     class Vector<struct TimerSet::heap_element> _timer_heap
        56 |       class vector_memory<class sized_array_memory<16> > vm_
        56 |         vector_memory<class sized_array_memory<16> >::type * l_
        64 |         vector_memory::size_type n_
        68 |         vector_memory::size_type capacity_
        72 |     class Vector<class Timer *> _timer_runchunk
        72 |       class vector_memory<class sized_array_memory<8> > vm_
        72 |         vector_memory<class sized_array_memory<8> >::type * l_
        80 |         vector_memory::size_type n_
        84 |         vector_memory::size_type capacity_
        88 |     class SimpleSpinlock _timer_lock (empty)
        96 |     class Timestamp _timer_check
        96 |       union Timestamp::rep_t _t
        96 |         int64_t x
       104 |     uint32_t _timer_check_reports
       112 |   class SelectSet _selects
       112 |     int [2] _wake_pipe
       120 |     volatile _Bool _wake_pipe_pending
       128 |     class Vector<struct pollfd> _pollfds
       128 |       class vector_memory<class sized_array_memory<8> > vm_
       128 |         vector_memory<class sized_array_memory<8> >::type * l_
       136 |         vector_memory::size_type n_
       140 |         vector_memory::size_type capacity_
       144 |     class Vector<struct SelectSet::SelectorInfo> _selinfo
       144 |       class vector_memory<class sized_array_memory<24> > vm_
       144 |         vector_memory<class sized_array_memory<24> >::type * l_
       152 |         vector_memory::size_type n_
       156 |         vector_memory::size_type capacity_
       192 |   class Spinlock _task_lock (empty)
       196 |   class atomic_uint32_t _task_blocker
       196 |     uint32_t _val
       200 |   class atomic_uint32_t _task_blocker_waiting
       200 |     uint32_t _val
       208 |   union Task::Pending _pending_head
       208 |     class Task * t
       208 |     uintptr_t x
       216 |   class Task::Pending * _pending_tail
       224 |   class SpinlockIRQ _pending_lock (empty)
       256 |   class Master * _master
       264 |   int _id
       268 |   _Bool _driver_entered
       272 |   unsigned int _tasks_per_iter
       276 |   unsigned int _iters_per_os
           | [sizeof=320, dsize=280, align=64,
           |  nvsize=280, nvalign=64]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x56469ad035b0 <../dummy_inc/click/task.hh:31:1, line:47:1> line:31:8 referenced struct TaskLink definition
|-DefinitionData pass_in_registers standard_layout trivially_copyable has_user_declared_ctor can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor simple trivial has_const_param implicit_has_const_param
| |-MoveConstructor exists simple trivial
| |-CopyAssignment trivial has_const_param implicit_has_const_param
| |-MoveAssignment exists simple trivial
| `-Destructor simple irrelevant trivial
|-CXXRecordDecl 0x56469ad036c8 <col:1, col:8> col:8 implicit referenced struct TaskLink
|-FieldDecl 0x56469ad03798 <line:33:5, col:15> col:15 referenced _prev 'TaskLink *'
|-FieldDecl 0x56469ad037f8 <line:34:5, col:15> col:15 referenced _next 'TaskLink *'
|-FieldDecl 0x56469ad03860 <line:37:5, col:14> col:14 referenced _pass 'unsigned int'
|-CXXConstructorDecl 0x56469ad038e8 <line:39:5, line:46:5> line:39:5 used TaskLink 'void ()'
| `-CompoundStmt 0x56469ad03b50 <col:16, line:46:5>
|   |-BinaryOperator 0x56469ad03a98 <line:41:9, col:25> 'TaskLink *' lvalue '='
|   | |-MemberExpr 0x56469ad039b8 <col:9> 'TaskLink *' lvalue ->_prev 0x56469ad03798
|   | | `-CXXThisExpr 0x56469ad039a8 <col:9> 'TaskLink *' implicit this
|   | `-ImplicitCastExpr 0x56469ad03a80 <col:17, col:25> 'TaskLink *' <LValueToRValue>
|   |   `-BinaryOperator 0x56469ad03a60 <col:17, col:25> 'TaskLink *' lvalue '='
|   |     |-MemberExpr 0x56469ad039f8 <col:17> 'TaskLink *' lvalue ->_next 0x56469ad037f8
|   |     | `-CXXThisExpr 0x56469ad039e8 <col:17> 'TaskLink *' implicit this
|   |     `-ImplicitCastExpr 0x56469ad03a48 <col:25> 'TaskLink *' <NullToPointer>
|   |       `-IntegerLiteral 0x56469ad03a28 <col:25> 'int' 0
|   `-BinaryOperator 0x56469ad03b30 <line:44:9, col:17> 'unsigned int' lvalue '='
|     |-MemberExpr 0x56469ad03ac8 <col:9> 'unsigned int' lvalue ->_pass 0x56469ad03860
|     | `-CXXThisExpr 0x56469ad03ab8 <col:9> 'TaskLink *' implicit this
|     `-ImplicitCastExpr 0x56469ad03b18 <col:17> 'unsigned int' <IntegralCast>
|       `-IntegerLiteral 0x56469ad03af8 <col:17> 'int' 0
|-CXXConstructorDecl 0x56469ad6d2c8 <line:31:8> col:8 implicit constexpr TaskLink 'void (const TaskLink &)' inline default trivial noexcept-unevaluated 0x56469ad6d2c8
| `-ParmVarDecl 0x56469ad6d3d8 <col:8> col:8 'const TaskLink &'
|-CXXConstructorDecl 0x56469ad6d478 <col:8> col:8 implicit constexpr TaskLink 'void (TaskLink &&)' inline default trivial noexcept-unevaluated 0x56469ad6d478
| `-ParmVarDecl 0x56469ad6d588 <col:8> col:8 'TaskLink &&'
|-CXXDestructorDecl 0x56469ad6d778 <col:8> col:8 implicit ~TaskLink 'void ()' inline default trivial noexcept-unevaluated 0x56469ad6d778
|-CXXMethodDecl 0x56469ad6df78 <col:8> col:8 implicit operator= 'TaskLink &(const TaskLink &)' inline default trivial noexcept-unevaluated 0x56469ad6df78
| `-ParmVarDecl 0x56469ad6e088 <col:8> col:8 'const TaskLink &'
`-CXXMethodDecl 0x56469ad6e0f8 <col:8> col:8 implicit operator= 'TaskLink &(TaskLink &&)' inline default trivial noexcept-unevaluated 0x56469ad6e0f8
  `-ParmVarDecl 0x56469ad6e208 <col:8> col:8 'TaskLink &&'

Layout: <CGRecordLayout
  LLVMType:%struct.TaskLink = type <{ %struct.TaskLink*, %struct.TaskLink*, i32, [4 x i8] }>
  NonVirtualBaseLLVMType:%struct.TaskLink.base = type <{ %struct.TaskLink*, %struct.TaskLink*, i32 }>
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x56469abf36f0 prev 0x56469abea530 <../dummy_inc/click/timestamp.hh:539:5, line:566:5> line:539:11 referenced union rep_t definition
|-DefinitionData pass_in_registers aggregate standard_layout trivially_copyable pod trivial literal has_variant_members
| |-DefaultConstructor exists trivial
| |-CopyConstructor simple trivial has_const_param implicit_has_const_param
| |-MoveConstructor exists simple trivial
| |-CopyAssignment trivial has_const_param implicit_has_const_param
| |-MoveAssignment exists simple trivial
| `-Destructor simple irrelevant trivial
|-CXXRecordDecl 0x56469abf37e8 <col:5, col:11> col:11 implicit union rep_t
|-FieldDecl 0x56469abf3888 <line:541:9, col:17> col:17 referenced x 'int64_t':'long'
|-CXXConstructorDecl 0x56469abfa650 <line:539:11> col:11 implicit used rep_t 'void () noexcept' inline default trivial
| `-CompoundStmt 0x56469abfaa38 <col:11>
|-CXXConstructorDecl 0x56469abfa730 <col:11> col:11 implicit used constexpr rep_t 'void (const Timestamp::rep_t &) noexcept' inline default trivial
| |-ParmVarDecl 0x56469abfa818 <col:11> col:11 'const Timestamp::rep_t &'
| `-CompoundStmt 0x56469abfb180 <col:11>
|-CXXConstructorDecl 0x56469abfa8b8 <col:11> col:11 implicit used constexpr rep_t 'void (Timestamp::rep_t &&) noexcept' inline default trivial
| |-ParmVarDecl 0x56469abfa9c8 <col:11> col:11 'Timestamp::rep_t &&'
| `-CompoundStmt 0x56469abfc9d8 <col:11>
|-CXXDestructorDecl 0x56469abfbce8 <col:11> col:11 implicit ~rep_t 'void () noexcept' inline default trivial
|-CXXMethodDecl 0x56469a902678 <col:11> col:11 implicit used constexpr operator= 'Timestamp::rep_t &(const Timestamp::rep_t &) noexcept' inline default trivial
| |-ParmVarDecl 0x56469a902788 <col:11> col:11 'const Timestamp::rep_t &'
| `-CompoundStmt 0x56469a903050 <col:11>
|   `-ReturnStmt 0x56469a903040 <col:11>
|     `-UnaryOperator 0x56469a903028 <col:11> 'Timestamp::rep_t' lvalue prefix '*' cannot overflow
|       `-CXXThisExpr 0x56469a903018 <col:11> 'Timestamp::rep_t *' this
`-CXXMethodDecl 0x56469a9027f8 <col:11> col:11 implicit used constexpr operator= 'Timestamp::rep_t &(Timestamp::rep_t &&) noexcept' inline default trivial
  |-ParmVarDecl 0x56469a902908 <col:11> col:11 'Timestamp::rep_t &&'
  `-CompoundStmt 0x56469ac90d10 <col:11>
    `-ReturnStmt 0x56469ac90d00 <col:11>
      `-UnaryOperator 0x56469ac90ce8 <col:11> 'Timestamp::rep_t' lvalue prefix '*' cannot overflow
        `-CXXThisExpr 0x56469ac90cd8 <col:11> 'Timestamp::rep_t *' this

Layout: <CGRecordLayout
  LLVMType:%"union.Timestamp::rep_t" = type { i64 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x56469abe96e8 prev 0x56469abe93f8 <../dummy_inc/click/timestamp.hh:122:1, line:723:1> line:122:7 referenced class Timestamp definition
|-DefinitionData pass_in_registers standard_layout trivially_copyable has_user_declared_ctor can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor simple trivial has_const_param implicit_has_const_param
| |-MoveConstructor exists simple trivial
| |-CopyAssignment trivial has_const_param implicit_has_const_param
| |-MoveAssignment exists simple trivial
| `-Destructor simple irrelevant trivial
|-CXXRecordDecl 0x56469abe97e0 <col:1, col:7> col:7 implicit referenced class Timestamp
|-AccessSpecDecl 0x56469abe9870 <col:19, col:25> col:19 public
|-TypedefDecl 0x56469abe98a8 <line:125:5, col:21> col:21 referenced seconds_type 'int32_t':'int'
| `-TypedefType 0x56469a84e850 'int32_t' sugar
|   |-Typedef 0x56469a75b328 'int32_t'
|   `-TypedefType 0x56469a734510 '__int32_t' sugar
|     |-Typedef 0x56469a734128 '__int32_t'
|     `-BuiltinType 0x56469a6f2580 'int'
|-TypedefDecl 0x56469abe9910 <line:128:5, col:21> col:21 referenced value_type 'int64_t':'long'
| `-TypedefType 0x56469a84ea10 'int64_t' sugar
|   |-Typedef 0x56469a75b390 'int64_t'
|   `-TypedefType 0x56469a734630 '__int64_t' sugar
|     |-Typedef 0x56469a734208 '__int64_t'
|     `-BuiltinType 0x56469a6f25a0 'long'
|-EnumDecl 0x56469abe9968 <line:133:5, line:140:5> line:133:5
| |-EnumConstantDecl 0x56469abe9ae0 <line:134:9, col:38> col:9 max_seconds 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:133:5)'
| | `-ConstantExpr 0x56469abe9ac0 <col:23, col:38> 'Timestamp::seconds_type':'int' Int: 2147483647
| |   `-CStyleCastExpr 0x56469abe9a98 <col:23, col:38> 'Timestamp::seconds_type':'int' <NoOp>
| |     `-ImplicitCastExpr 0x56469abe9a80 <col:38> 'Timestamp::seconds_type':'int' <IntegralCast> part_of_explicit_cast
| |       `-IntegerLiteral 0x56469abe9a50 <col:38> 'unsigned int' 2147483647
| `-EnumConstantDecl 0x56469abe9bd8 <line:137:9, col:39> col:9 min_seconds 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:133:5)'
|   `-ConstantExpr 0x56469abe9bb8 <col:23, col:39> 'Timestamp::seconds_type':'int' Int: -2147483648
|     `-CStyleCastExpr 0x56469abe9b90 <col:23, col:39> 'Timestamp::seconds_type':'int' <NoOp>
|       `-ImplicitCastExpr 0x56469abe9b78 <col:38, col:39> 'Timestamp::seconds_type':'int' <IntegralCast> part_of_explicit_cast
|         `-UnaryOperator 0x56469abe9b50 <col:38, col:39> 'unsigned int' prefix '-'
|           `-IntegerLiteral 0x56469abe9b30 <col:39> 'unsigned int' 2147483648
|-EnumDecl 0x56469abe9c28 <line:142:5, line:162:5> line:142:5
| |-EnumConstantDecl 0x56469abe9d30 <line:143:9, col:24> col:9 referenced nsec_per_sec 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
| | `-ImplicitCastExpr 0x56469abea280 <col:24> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x56469abe9d10 <col:24> 'int' Int: 1000000000
| |     `-IntegerLiteral 0x56469abe9cf0 <col:24> 'int' 1000000000
| |-EnumConstantDecl 0x56469abe9dc0 <line:144:9, col:25> col:9 nsec_per_msec 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
| | `-ImplicitCastExpr 0x56469abea298 <col:25> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x56469abe9da0 <col:25> 'int' Int: 1000000
| |     `-IntegerLiteral 0x56469abe9d80 <col:25> 'int' 1000000
| |-EnumConstantDecl 0x56469abe9e50 <line:145:9, col:25> col:9 nsec_per_usec 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
| | `-ImplicitCastExpr 0x56469abea2b0 <col:25> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x56469abe9e30 <col:25> 'int' Int: 1000
| |     `-IntegerLiteral 0x56469abe9e10 <col:25> 'int' 1000
| |-EnumConstantDecl 0x56469abe9ee0 <line:146:9, col:24> col:9 referenced usec_per_sec 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
| | `-ImplicitCastExpr 0x56469abea2c8 <col:24> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x56469abe9ec0 <col:24> 'int' Int: 1000000
| |     `-IntegerLiteral 0x56469abe9ea0 <col:24> 'int' 1000000
| |-EnumConstantDecl 0x56469abe9f70 <line:147:9, col:25> col:9 usec_per_msec 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
| | `-ImplicitCastExpr 0x56469abea2e0 <col:25> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x56469abe9f50 <col:25> 'int' Int: 1000
| |     `-IntegerLiteral 0x56469abe9f30 <col:25> 'int' 1000
| |-EnumConstantDecl 0x56469abea000 <line:148:9, col:24> col:9 referenced msec_per_sec 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
| | `-ImplicitCastExpr 0x56469abea2f8 <col:24> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x56469abe9fe0 <col:24> 'int' Int: 1000
| |     `-IntegerLiteral 0x56469abe9fc0 <col:24> 'int' 1000
| |-EnumConstantDecl 0x56469abea090 <line:150:9, col:26> col:9 referenced subsec_per_sec 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
| | `-ImplicitCastExpr 0x56469abea310 <col:26> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x56469abea070 <col:26> 'int' Int: 1000000000
| |     `-DeclRefExpr 0x56469abea050 <col:26> 'int' EnumConstant 0x56469abe9d30 'nsec_per_sec' 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
| |-EnumConstantDecl 0x56469abea160 <line:157:9, col:44> col:9 referenced subsec_per_msec 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
| | `-ImplicitCastExpr 0x56469abea328 <col:27, col:44> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x56469abea140 <col:27, col:44> 'int' Int: 1000000
| |     `-BinaryOperator 0x56469abea120 <col:27, col:44> 'int' '/'
| |       |-DeclRefExpr 0x56469abea0e0 <col:27> 'int' EnumConstant 0x56469abea090 'subsec_per_sec' 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
| |       `-DeclRefExpr 0x56469abea100 <col:44> 'int' EnumConstant 0x56469abea000 'msec_per_sec' 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
| `-EnumConstantDecl 0x56469abea230 <line:158:9, col:44> col:9 referenced subsec_per_usec 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
|   `-ImplicitCastExpr 0x56469abea340 <col:27, col:44> 'unsigned int' <IntegralCast>
|     `-ConstantExpr 0x56469abea210 <col:27, col:44> 'int' Int: 1000
|       `-BinaryOperator 0x56469abea1f0 <col:27, col:44> 'int' '/'
|         |-DeclRefExpr 0x56469abea1b0 <col:27> 'int' EnumConstant 0x56469abea090 'subsec_per_sec' 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
|         `-DeclRefExpr 0x56469abea1d0 <col:44> 'int' EnumConstant 0x56469abe9ee0 'usec_per_sec' 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
|-EnumDecl 0x56469abea358 <line:164:5, line:166:5> line:164:5
| `-EnumConstantDecl 0x56469abea460 <line:165:9, col:19> col:9 NSUBSEC 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:164:5)'
|   `-ImplicitCastExpr 0x56469abea4b0 <col:19> 'unsigned int' <IntegralCast>
|     `-ConstantExpr 0x56469abea440 <col:19> 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)' Int: 1000000000
|       `-DeclRefExpr 0x56469abea420 <col:19> 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)' EnumConstant 0x56469abea090 'subsec_per_sec' 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
|-TypedefDecl 0x56469abea4d8 <line:168:5, col:32> col:32 referenced uninitialized_t 'uninitialized_type'
| `-RecordType 0x56469a84e480 'uninitialized_type'
|   `-CXXRecord 0x56469a84e3e8 'uninitialized_type'
|-CXXRecordDecl 0x56469abea530 <line:170:5, col:11> col:11 referenced union rep_t
|-CXXConstructorDecl 0x56469abea640 <line:174:5, line:176:5> line:174:12 used Timestamp 'void ()' inline
| |-CXXCtorInitializer Field 0x56469abf4838 '_t' 'Timestamp::rep_t'
| | `-CXXConstructExpr 0x56469abfaa48 <col:12> 'Timestamp::rep_t' 'void () noexcept'
| `-CompoundStmt 0x56469abfab68 <col:24, line:176:5>
|   `-CXXMemberCallExpr 0x56469abfab20 <line:175:9, col:20> 'void'
|     |-MemberExpr 0x56469abfaab0 <col:9> '<bound member function type>' ->assign 0x56469abef288
|     | `-CXXThisExpr 0x56469abfaaa0 <col:9> 'Timestamp *' implicit this
|     |-IntegerLiteral 0x56469abfaae0 <col:16> 'int' 0
|     `-ImplicitCastExpr 0x56469abfab50 <col:19> 'uint32_t':'unsigned int' <IntegralCast>
|       `-IntegerLiteral 0x56469abfab00 <col:19> 'int' 0
|-CXXConstructorDecl 0x56469abea888 <line:187:5, line:189:5> line:187:21 Timestamp 'void (long, uint32_t)' inline
| |-ParmVarDecl 0x56469abea700 <col:31, col:36> col:36 used sec 'long'
| |-ParmVarDecl 0x56469abea778 <col:41, col:59> col:50 used subsec 'uint32_t':'unsigned int' cinit
| | `-ImplicitCastExpr 0x56469abf6380 <col:59> 'uint32_t':'unsigned int' <IntegralCast>
| |   `-IntegerLiteral 0x56469abf6360 <col:59> 'int' 0
| |-CXXCtorInitializer Field 0x56469abf4838 '_t' 'Timestamp::rep_t'
| | `-CXXConstructExpr 0x56469abfab80 <col:21> 'Timestamp::rep_t' 'void () noexcept'
| `-CompoundStmt 0x56469abfacd0 <col:62, line:189:5>
|   `-CXXMemberCallExpr 0x56469abfac58 <line:188:9, col:27> 'void'
|     |-MemberExpr 0x56469abfabe8 <col:9> '<bound member function type>' ->assign 0x56469abef288
|     | `-CXXThisExpr 0x56469abfabd8 <col:9> 'Timestamp *' implicit this
|     |-ImplicitCastExpr 0x56469abfaca0 <col:16> 'Timestamp::seconds_type':'int' <IntegralCast>
|     | `-ImplicitCastExpr 0x56469abfac88 <col:16> 'long' <LValueToRValue>
|     |   `-DeclRefExpr 0x56469abfac18 <col:16> 'long' lvalue ParmVar 0x56469abea700 'sec' 'long'
|     `-ImplicitCastExpr 0x56469abfacb8 <col:21> 'uint32_t':'unsigned int' <LValueToRValue>
|       `-DeclRefExpr 0x56469abfac38 <col:21> 'uint32_t':'unsigned int' lvalue ParmVar 0x56469abea778 'subsec' 'uint32_t':'unsigned int'
|-CXXConstructorDecl 0x56469abeaae8 <line:191:5, line:193:5> line:191:21 used Timestamp 'void (int, uint32_t)' inline
| |-ParmVarDecl 0x56469abea958 <col:31, col:35> col:35 used sec 'int'
| |-ParmVarDecl 0x56469abea9d0 <col:40, col:58> col:49 used subsec 'uint32_t':'unsigned int' cinit
| | `-ImplicitCastExpr 0x56469abf63b8 <col:58> 'uint32_t':'unsigned int' <IntegralCast>
| |   `-IntegerLiteral 0x56469abf6398 <col:58> 'int' 0
| |-CXXCtorInitializer Field 0x56469abf4838 '_t' 'Timestamp::rep_t'
| | `-CXXConstructExpr 0x56469abface8 <col:21> 'Timestamp::rep_t' 'void () noexcept'
| `-CompoundStmt 0x56469abfae20 <col:61, line:193:5>
|   `-CXXMemberCallExpr 0x56469abfadc0 <line:192:9, col:27> 'void'
|     |-MemberExpr 0x56469abfad50 <col:9> '<bound member function type>' ->assign 0x56469abef288
|     | `-CXXThisExpr 0x56469abfad40 <col:9> 'Timestamp *' implicit this
|     |-ImplicitCastExpr 0x56469abfadf0 <col:16> 'int' <LValueToRValue>
|     | `-DeclRefExpr 0x56469abfad80 <col:16> 'int' lvalue ParmVar 0x56469abea958 'sec' 'int'
|     `-ImplicitCastExpr 0x56469abfae08 <col:21> 'uint32_t':'unsigned int' <LValueToRValue>
|       `-DeclRefExpr 0x56469abfada0 <col:21> 'uint32_t':'unsigned int' lvalue ParmVar 0x56469abea9d0 'subsec' 'uint32_t':'unsigned int'
|-CXXConstructorDecl 0x56469abead48 <line:195:5, line:197:5> line:195:21 Timestamp 'void (unsigned long, uint32_t)' inline
| |-ParmVarDecl 0x56469abeabb8 <col:31, col:45> col:45 used sec 'unsigned long'
| |-ParmVarDecl 0x56469abeac30 <col:50, col:68> col:59 used subsec 'uint32_t':'unsigned int' cinit
| | `-ImplicitCastExpr 0x56469abf63f0 <col:68> 'uint32_t':'unsigned int' <IntegralCast>
| |   `-IntegerLiteral 0x56469abf63d0 <col:68> 'int' 0
| |-CXXCtorInitializer Field 0x56469abf4838 '_t' 'Timestamp::rep_t'
| | `-CXXConstructExpr 0x56469abfae38 <col:21> 'Timestamp::rep_t' 'void () noexcept'
| `-CompoundStmt 0x56469abfaf88 <col:71, line:197:5>
|   `-CXXMemberCallExpr 0x56469abfaf10 <line:196:9, col:27> 'void'
|     |-MemberExpr 0x56469abfaea0 <col:9> '<bound member function type>' ->assign 0x56469abef288
|     | `-CXXThisExpr 0x56469abfae90 <col:9> 'Timestamp *' implicit this
|     |-ImplicitCastExpr 0x56469abfaf58 <col:16> 'Timestamp::seconds_type':'int' <IntegralCast>
|     | `-ImplicitCastExpr 0x56469abfaf40 <col:16> 'unsigned long' <LValueToRValue>
|     |   `-DeclRefExpr 0x56469abfaed0 <col:16> 'unsigned long' lvalue ParmVar 0x56469abeabb8 'sec' 'unsigned long'
|     `-ImplicitCastExpr 0x56469abfaf70 <col:21> 'uint32_t':'unsigned int' <LValueToRValue>
|       `-DeclRefExpr 0x56469abfaef0 <col:21> 'uint32_t':'unsigned int' lvalue ParmVar 0x56469abeac30 'subsec' 'uint32_t':'unsigned int'
|-CXXConstructorDecl 0x56469abebee0 <line:199:5, line:201:5> line:199:21 used Timestamp 'void (unsigned int, uint32_t)' inline
| |-ParmVarDecl 0x56469abeae18 <col:31, col:40> col:40 used sec 'unsigned int'
| |-ParmVarDecl 0x56469abeae90 <col:45, col:63> col:54 used subsec 'uint32_t':'unsigned int' cinit
| | `-ImplicitCastExpr 0x56469abf6428 <col:63> 'uint32_t':'unsigned int' <IntegralCast>
| |   `-IntegerLiteral 0x56469abf6408 <col:63> 'int' 0
| |-CXXCtorInitializer Field 0x56469abf4838 '_t' 'Timestamp::rep_t'
| | `-CXXConstructExpr 0x56469abfafa0 <col:21> 'Timestamp::rep_t' 'void () noexcept'
| `-CompoundStmt 0x56469abfb0f0 <col:66, line:201:5>
|   `-CXXMemberCallExpr 0x56469abfb078 <line:200:9, col:27> 'void'
|     |-MemberExpr 0x56469abfb008 <col:9> '<bound member function type>' ->assign 0x56469abef288
|     | `-CXXThisExpr 0x56469abfaff8 <col:9> 'Timestamp *' implicit this
|     |-ImplicitCastExpr 0x56469abfb0c0 <col:16> 'Timestamp::seconds_type':'int' <IntegralCast>
|     | `-ImplicitCastExpr 0x56469abfb0a8 <col:16> 'unsigned int' <LValueToRValue>
|     |   `-DeclRefExpr 0x56469abfb038 <col:16> 'unsigned int' lvalue ParmVar 0x56469abeae18 'sec' 'unsigned int'
|     `-ImplicitCastExpr 0x56469abfb0d8 <col:21> 'uint32_t':'unsigned int' <LValueToRValue>
|       `-DeclRefExpr 0x56469abfb058 <col:21> 'uint32_t':'unsigned int' lvalue ParmVar 0x56469abeae90 'subsec' 'uint32_t':'unsigned int'
|-CXXConstructorDecl 0x56469abec040 <line:203:5, col:37> col:21 used Timestamp 'void (double)' inline
| `-ParmVarDecl 0x56469abebfb0 <col:31> col:37 'double'
|-CXXConstructorDecl 0x56469abec1d8 <line:206:5, col:46> col:12 Timestamp 'void (const struct timeval &)' inline
| `-ParmVarDecl 0x56469abec118 <col:22, col:44> col:44 tv 'const struct timeval &'
|-CXXConstructorDecl 0x56469abec408 <line:208:5, col:47> col:12 Timestamp 'void (const struct timespec &)' inline
| `-ParmVarDecl 0x56469abec310 <col:22, col:45> col:45 ts 'const struct timespec &'
|-CXXConstructorDecl 0x56469abec5b8 <line:212:5, line:214:5> line:212:12 Timestamp 'void (const Timestamp::rep_t &)' inline
| |-ParmVarDecl 0x56469abec4f8 <col:22, col:35> col:35 used rep 'const Timestamp::rep_t &'
| |-CXXCtorInitializer Field 0x56469abf4838 '_t' 'Timestamp::rep_t'
| | `-CXXConstructExpr 0x56469abfb190 <line:213:11, col:17> 'Timestamp::rep_t' 'void (const Timestamp::rep_t &) noexcept'
| |   `-DeclRefExpr 0x56469abfb108 <col:14> 'const Timestamp::rep_t' lvalue ParmVar 0x56469abec4f8 'rep' 'const Timestamp::rep_t &'
| `-CompoundStmt 0x56469abfb1f0 <col:19, line:214:5>
|-CXXConstructorDecl 0x56469abec788 <line:217:5, line:219:5> line:217:12 used Timestamp 'void (const Timestamp::uninitialized_t &)' inline
| |-ParmVarDecl 0x56469abec6c8 <col:22, col:45> col:45 used unused 'const Timestamp::uninitialized_t &'
| |-CXXCtorInitializer Field 0x56469abf4838 '_t' 'Timestamp::rep_t'
| | `-CXXConstructExpr 0x56469abfb200 <col:12> 'Timestamp::rep_t' 'void () noexcept'
| `-CompoundStmt 0x56469abfb2b0 <col:53, line:219:5>
|   `-CStyleCastExpr 0x56469abfb288 <line:218:9, col:16> 'void' <ToVoid>
|     `-DeclRefExpr 0x56469abfb258 <col:16> 'const Timestamp::uninitialized_t':'const uninitialized_type' lvalue ParmVar 0x56469abec6c8 'unused' 'const Timestamp::uninitialized_t &'
|-TypedefDecl 0x56469abec978 <line:221:5, col:64> col:39 referenced unspecified_bool_type 'Timestamp::seconds_type (Timestamp::*)() const'
| `-MemberPointerType 0x56469abec8f0 'Timestamp::seconds_type (Timestamp::*)() const'
|   |-RecordType 0x56469abe9490 'Timestamp'
|   | `-CXXRecord 0x56469abe96e8 'Timestamp'
|   `-ParenType 0x56469abec890 'Timestamp::seconds_type () const' sugar
|     `-FunctionProtoType 0x56469abec860 'Timestamp::seconds_type () const' const cdecl
|       `-TypedefType 0x56469abe9a30 'Timestamp::seconds_type' sugar
|         |-Typedef 0x56469abe98a8 'seconds_type'
|         `-TypedefType 0x56469a84e850 'int32_t' sugar
|           |-Typedef 0x56469a75b328 'int32_t'
|           `-TypedefType 0x56469a734510 '__int32_t' sugar
|             |-Typedef 0x56469a734128 '__int32_t'
|             `-BuiltinType 0x56469a6f2580 'int'
|-CXXConversionDecl 0x56469abecab8 <line:222:5, col:45> col:12 used operator int (Timestamp::*)() const 'Timestamp::unspecified_bool_type () const' inline
|-CXXMethodDecl 0x56469abecb88 <line:225:5, line:231:5> line:225:17 used is_negative 'bool () const' inline
| `-CompoundStmt 0x56469abfb3b8 <col:37, line:231:5>
|   `-ReturnStmt 0x56469abfb3a8 <line:227:9, col:23>
|     `-BinaryOperator 0x56469abfb388 <col:16, col:23> 'bool' '<'
|       |-ImplicitCastExpr 0x56469abfb358 <col:16, col:19> 'int64_t':'long' <LValueToRValue>
|       | `-MemberExpr 0x56469abfb308 <col:16, col:19> 'const int64_t':'const long' lvalue .x 0x56469abf3888
|       |   `-MemberExpr 0x56469abfb2d8 <col:16> 'const Timestamp::rep_t' lvalue ->_t 0x56469abf4838
|       |     `-CXXThisExpr 0x56469abfb2c8 <col:16> 'const Timestamp *' implicit this
|       `-ImplicitCastExpr 0x56469abfb370 <col:23> 'long' <IntegralCast>
|         `-IntegerLiteral 0x56469abfb338 <col:23> 'int' 0
|-CXXMethodDecl 0x56469abecc48 <line:233:5, col:31> col:25 used sec 'Timestamp::seconds_type () const' inline
|-CXXMethodDecl 0x56469abecd08 <line:234:5, col:30> col:21 used subsec 'uint32_t () const' inline
|-CXXMethodDecl 0x56469abecdc8 <line:235:5, col:28> col:21 msec 'uint32_t () const' inline
|-CXXMethodDecl 0x56469abece88 <line:236:5, col:28> col:21 used usec 'uint32_t () const' inline
|-CXXMethodDecl 0x56469abecf48 <line:237:5, col:28> col:21 used nsec 'uint32_t () const' inline
|-CXXMethodDecl 0x56469abed0b8 <line:239:5, col:41> col:17 set_sec 'void (Timestamp::seconds_type)' inline
| `-ParmVarDecl 0x56469abecff8 <col:25, col:38> col:38 sec 'Timestamp::seconds_type':'int'
|-CXXMethodDecl 0x56469abed200 <line:240:5, col:43> col:17 set_subsec 'void (uint32_t)' inline
| `-ParmVarDecl 0x56469abed170 <col:28, col:37> col:37 subsec 'uint32_t':'unsigned int'
|-CXXMethodDecl 0x56469abed2c8 <line:242:5, col:65> col:25 msec1 'Timestamp::seconds_type () const' inline
| `-DeprecatedAttr 0x56469abed368 <col:54> "" ""
|-CXXMethodDecl 0x56469abed3f8 <line:243:5, col:65> col:25 usec1 'Timestamp::seconds_type () const' inline
| `-DeprecatedAttr 0x56469abed498 <col:54> "" ""
|-CXXMethodDecl 0x56469abed528 <line:244:5, col:65> col:25 nsec1 'Timestamp::seconds_type () const' inline
| `-DeprecatedAttr 0x56469abed5c8 <col:54> "" ""
|-CXXMethodDecl 0x56469abed6c8 <line:250:5, col:37> col:27 used timeval 'struct timeval () const' inline
|-CXXMethodDecl 0x56469abed798 <line:251:5, col:42> col:27 timeval_ceil 'struct timeval () const' inline
|-CXXMethodDecl 0x56469abed8c8 <line:257:5, col:39> col:28 timespec 'struct timespec () const' inline
|-CXXMethodDecl 0x56469abed9c0 <line:262:5, col:31> col:19 used doubleval 'double () const' inline
|-CXXMethodDecl 0x56469abedaf8 <line:265:5, line:271:5> line:265:23 msecval 'Timestamp::value_type () const' inline
| `-CompoundStmt 0x56469abfb5d0 <col:39, line:271:5>
|   `-ReturnStmt 0x56469abfb5c0 <line:267:9, col:61>
|     `-CallExpr 0x56469abfb560 <col:16, col:61> 'Timestamp::value_type':'long'
|       |-ImplicitCastExpr 0x56469abfb548 <col:16> 'Timestamp::value_type (*)(Timestamp::value_type, uint32_t)' <FunctionToPointerDecay>
|       | `-DeclRefExpr 0x56469abfb3d0 <col:16> 'Timestamp::value_type (Timestamp::value_type, uint32_t)' lvalue CXXMethod 0x56469abf4b68 'value_div' 'Timestamp::value_type (Timestamp::value_type, uint32_t)'
|       |-ImplicitCastExpr 0x56469abfb590 <col:26, col:29> 'int64_t':'long' <LValueToRValue>
|       | `-MemberExpr 0x56469abfb430 <col:26, col:29> 'const int64_t':'const long' lvalue .x 0x56469abf3888
|       |   `-MemberExpr 0x56469abfb400 <col:26> 'const Timestamp::rep_t' lvalue ->_t 0x56469abf4838
|       |     `-CXXThisExpr 0x56469abfb3f0 <col:26> 'const Timestamp *' implicit this
|       `-ImplicitCastExpr 0x56469abfb5a8 <col:32, col:49> 'uint32_t':'unsigned int' <IntegralCast>
|         `-BinaryOperator 0x56469abfb4d0 <col:32, col:49> 'int' '/'
|           |-ImplicitCastExpr 0x56469abfb4a0 <col:32> 'int' <IntegralCast>
|           | `-DeclRefExpr 0x56469abfb460 <col:32> 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)' EnumConstant 0x56469abea090 'subsec_per_sec' 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
|           `-ImplicitCastExpr 0x56469abfb4b8 <col:49> 'int' <IntegralCast>
|             `-DeclRefExpr 0x56469abfb480 <col:49> 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)' EnumConstant 0x56469abea000 'msec_per_sec' 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
|-CXXMethodDecl 0x56469abedbb8 <line:273:5, line:279:5> line:273:23 usecval 'Timestamp::value_type () const' inline
| `-CompoundStmt 0x56469abfb790 <col:39, line:279:5>
|   `-ReturnStmt 0x56469abfb780 <line:275:9, col:61>
|     `-CallExpr 0x56469abfb720 <col:16, col:61> 'Timestamp::value_type':'long'
|       |-ImplicitCastExpr 0x56469abfb708 <col:16> 'Timestamp::value_type (*)(Timestamp::value_type, uint32_t)' <FunctionToPointerDecay>
|       | `-DeclRefExpr 0x56469abfb5e8 <col:16> 'Timestamp::value_type (Timestamp::value_type, uint32_t)' lvalue CXXMethod 0x56469abf4b68 'value_div' 'Timestamp::value_type (Timestamp::value_type, uint32_t)'
|       |-ImplicitCastExpr 0x56469abfb750 <col:26, col:29> 'int64_t':'long' <LValueToRValue>
|       | `-MemberExpr 0x56469abfb648 <col:26, col:29> 'const int64_t':'const long' lvalue .x 0x56469abf3888
|       |   `-MemberExpr 0x56469abfb618 <col:26> 'const Timestamp::rep_t' lvalue ->_t 0x56469abf4838
|       |     `-CXXThisExpr 0x56469abfb608 <col:26> 'const Timestamp *' implicit this
|       `-ImplicitCastExpr 0x56469abfb768 <col:32, col:49> 'uint32_t':'unsigned int' <IntegralCast>
|         `-BinaryOperator 0x56469abfb6e8 <col:32, col:49> 'int' '/'
|           |-ImplicitCastExpr 0x56469abfb6b8 <col:32> 'int' <IntegralCast>
|           | `-DeclRefExpr 0x56469abfb678 <col:32> 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)' EnumConstant 0x56469abea090 'subsec_per_sec' 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
|           `-ImplicitCastExpr 0x56469abfb6d0 <col:49> 'int' <IntegralCast>
|             `-DeclRefExpr 0x56469abfb698 <col:49> 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)' EnumConstant 0x56469abe9ee0 'usec_per_sec' 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
|-CXXMethodDecl 0x56469abedc78 <line:281:5, line:287:5> line:281:23 nsecval 'Timestamp::value_type () const' inline
| `-CompoundStmt 0x56469abfb928 <col:39, line:287:5>
|   `-ReturnStmt 0x56469abfb918 <line:283:9, col:53>
|     `-BinaryOperator 0x56469abfb8f8 <col:16, col:53> 'long' '*'
|       |-ImplicitCastExpr 0x56469abfb8c8 <col:16, col:19> 'int64_t':'long' <LValueToRValue>
|       | `-MemberExpr 0x56469abfb7e8 <col:16, col:19> 'const int64_t':'const long' lvalue .x 0x56469abf3888
|       |   `-MemberExpr 0x56469abfb7b8 <col:16> 'const Timestamp::rep_t' lvalue ->_t 0x56469abf4838
|       |     `-CXXThisExpr 0x56469abfb7a8 <col:16> 'const Timestamp *' implicit this
|       `-ImplicitCastExpr 0x56469abfb8e0 <col:23, col:53> 'long' <IntegralCast>
|         `-ParenExpr 0x56469abfb8a8 <col:23, col:53> 'int'
|           `-BinaryOperator 0x56469abfb888 <col:24, col:39> 'int' '/'
|             |-ImplicitCastExpr 0x56469abfb858 <col:24> 'int' <IntegralCast>
|             | `-DeclRefExpr 0x56469abfb818 <col:24> 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)' EnumConstant 0x56469abe9d30 'nsec_per_sec' 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
|             `-ImplicitCastExpr 0x56469abfb870 <col:39> 'int' <IntegralCast>
|               `-DeclRefExpr 0x56469abfb838 <col:39> 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)' EnumConstant 0x56469abea090 'subsec_per_sec' 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
|-CXXMethodDecl 0x56469abedd68 <line:290:5, line:293:5> line:290:22 msec_ceil 'Timestamp () const' inline
| `-CompoundStmt 0x56469abfcbc0 <col:40, line:293:5>
|   |-DeclStmt 0x56469abfba70 <line:291:9, col:48>
|   | `-VarDecl 0x56469abfb950 <col:9, col:33> col:18 used x 'uint32_t':'unsigned int' cinit
|   |   `-BinaryOperator 0x56469abfba50 <col:22, col:33> 'unsigned int' '%'
|   |     |-CXXMemberCallExpr 0x56469abfb9f8 <col:22, col:29> 'uint32_t':'unsigned int'
|   |     | `-MemberExpr 0x56469abfb9c8 <col:22> '<bound member function type>' ->subsec 0x56469abecd08
|   |     |   `-CXXThisExpr 0x56469abfb9b8 <col:22> 'const Timestamp *' implicit this
|   |     `-ImplicitCastExpr 0x56469abfba38 <col:33> 'unsigned int' <IntegralCast>
|   |       `-DeclRefExpr 0x56469abfba18 <col:33> 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)' EnumConstant 0x56469abea160 'subsec_per_msec' 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
|   `-ReturnStmt 0x56469abfcbb0 <line:292:9, col:70>
|     `-ExprWithCleanups 0x56469abfcb98 <col:16, col:70> 'Timestamp'
|       `-CXXConstructExpr 0x56469abfcb68 <col:16, col:70> 'Timestamp' 'void (const Timestamp &) noexcept' elidable
|         `-MaterializeTemporaryExpr 0x56469abfcb50 <col:16, col:70> 'const Timestamp' lvalue
|           `-ParenExpr 0x56469abfcb30 <col:16, col:70> 'const Timestamp'
|             `-ConditionalOperator 0x56469abfcb00 <col:17, col:66> 'const Timestamp'
|               |-ImplicitCastExpr 0x56469abfc898 <col:17> 'bool' <IntegralToBoolean>
|               | `-ImplicitCastExpr 0x56469abfc880 <col:17> 'uint32_t':'unsigned int' <LValueToRValue>
|               |   `-DeclRefExpr 0x56469abfba88 <col:17> 'uint32_t':'unsigned int' lvalue Var 0x56469abfb950 'x' 'uint32_t':'unsigned int'
|               |-CXXConstructExpr 0x56469abfcaa0 <col:21, col:61> 'const Timestamp' 'void (const Timestamp &) noexcept' elidable
|               | `-MaterializeTemporaryExpr 0x56469abfca88 <col:21, col:61> 'const Timestamp' lvalue
|               |   `-CXXConstructExpr 0x56469abfca58 <col:21, col:61> 'const Timestamp' 'void (Timestamp &&) noexcept' elidable
|               |     `-MaterializeTemporaryExpr 0x56469abfc8b0 <col:21, col:61> 'Timestamp' xvalue
|               |       `-CXXOperatorCallExpr 0x56469abfc820 <col:21, col:61> 'Timestamp'
|               |         |-ImplicitCastExpr 0x56469abfc808 <col:27> 'Timestamp (*)(Timestamp, const Timestamp &)' <FunctionToPointerDecay>
|               |         | `-DeclRefExpr 0x56469abfc7b8 <col:27> 'Timestamp (Timestamp, const Timestamp &)' lvalue Function 0x56469abe9638 'operator+' 'Timestamp (Timestamp, const Timestamp &)'
|               |         |-CXXConstructExpr 0x56469abfc758 <col:21, col:22> 'Timestamp' 'void (const Timestamp &) noexcept'
|               |         | `-UnaryOperator 0x56469abfbab8 <col:21, col:22> 'const Timestamp' lvalue prefix '*' cannot overflow
|               |         |   `-CXXThisExpr 0x56469abfbaa8 <col:22> 'const Timestamp *' this
|               |         `-MaterializeTemporaryExpr 0x56469abfc7a0 <col:29, col:61> 'const Timestamp' lvalue
|               |           `-ImplicitCastExpr 0x56469abfc788 <col:29, col:61> 'const Timestamp' <NoOp>
|               |             `-CXXTemporaryObjectExpr 0x56469abfbf78 <col:29, col:61> 'Timestamp' 'void (int, uint32_t)'
|               |               |-IntegerLiteral 0x56469abfbae0 <col:39> 'int' 0
|               |               `-BinaryOperator 0x56469abfbb70 <col:42, col:60> 'unsigned int' '-'
|               |                 |-ImplicitCastExpr 0x56469abfbb40 <col:42> 'unsigned int' <IntegralCast>
|               |                 | `-DeclRefExpr 0x56469abfbb00 <col:42> 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)' EnumConstant 0x56469abea160 'subsec_per_msec' 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
|               |                 `-ImplicitCastExpr 0x56469abfbb58 <col:60> 'uint32_t':'unsigned int' <LValueToRValue>
|               |                   `-DeclRefExpr 0x56469abfbb20 <col:60> 'uint32_t':'unsigned int' lvalue Var 0x56469abfb950 'x' 'uint32_t':'unsigned int'
|               `-CXXConstructExpr 0x56469abfcad0 <col:65, col:66> 'const Timestamp' 'void (const Timestamp &) noexcept'
|                 `-UnaryOperator 0x56469abfc868 <col:65, col:66> 'const Timestamp' lvalue prefix '*' cannot overflow
|                   `-CXXThisExpr 0x56469abfc858 <col:66> 'const Timestamp *' this
|-CXXMethodDecl 0x56469abede28 <line:295:5, line:302:5> line:295:22 usec_ceil 'Timestamp () const' inline
| `-CompoundStmt 0x56469abfd118 <col:40, line:302:5>
|   |-DeclStmt 0x56469abfcd10 <line:297:9, col:48>
|   | `-VarDecl 0x56469abfcbf0 <col:9, col:33> col:18 used x 'uint32_t':'unsigned int' cinit
|   |   `-BinaryOperator 0x56469abfccf0 <col:22, col:33> 'unsigned int' '%'
|   |     |-CXXMemberCallExpr 0x56469abfcc98 <col:22, col:29> 'uint32_t':'unsigned int'
|   |     | `-MemberExpr 0x56469abfcc68 <col:22> '<bound member function type>' ->subsec 0x56469abecd08
|   |     |   `-CXXThisExpr 0x56469abfcc58 <col:22> 'const Timestamp *' implicit this
|   |     `-ImplicitCastExpr 0x56469abfccd8 <col:33> 'unsigned int' <IntegralCast>
|   |       `-DeclRefExpr 0x56469abfccb8 <col:33> 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)' EnumConstant 0x56469abea230 'subsec_per_usec' 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
|   `-ReturnStmt 0x56469abfd108 <line:298:9, col:70>
|     `-ExprWithCleanups 0x56469abfd0f0 <col:16, col:70> 'Timestamp'
|       `-CXXConstructExpr 0x56469abfd0c0 <col:16, col:70> 'Timestamp' 'void (const Timestamp &) noexcept' elidable
|         `-MaterializeTemporaryExpr 0x56469abfd0a8 <col:16, col:70> 'const Timestamp' lvalue
|           `-ParenExpr 0x56469abfd088 <col:16, col:70> 'const Timestamp'
|             `-ConditionalOperator 0x56469abfd058 <col:17, col:66> 'const Timestamp'
|               |-ImplicitCastExpr 0x56469abfcf80 <col:17> 'bool' <IntegralToBoolean>
|               | `-ImplicitCastExpr 0x56469abfcf68 <col:17> 'uint32_t':'unsigned int' <LValueToRValue>
|               |   `-DeclRefExpr 0x56469abfcd28 <col:17> 'uint32_t':'unsigned int' lvalue Var 0x56469abfcbf0 'x' 'uint32_t':'unsigned int'
|               |-CXXConstructExpr 0x56469abfcff8 <col:21, col:61> 'const Timestamp' 'void (const Timestamp &) noexcept' elidable
|               | `-MaterializeTemporaryExpr 0x56469abfcfe0 <col:21, col:61> 'const Timestamp' lvalue
|               |   `-CXXConstructExpr 0x56469abfcfb0 <col:21, col:61> 'const Timestamp' 'void (Timestamp &&) noexcept' elidable
|               |     `-MaterializeTemporaryExpr 0x56469abfcf98 <col:21, col:61> 'Timestamp' xvalue
|               |       `-CXXOperatorCallExpr 0x56469abfcf08 <col:21, col:61> 'Timestamp'
|               |         |-ImplicitCastExpr 0x56469abfcef0 <col:27> 'Timestamp (*)(Timestamp, const Timestamp &)' <FunctionToPointerDecay>
|               |         | `-DeclRefExpr 0x56469abfced0 <col:27> 'Timestamp (Timestamp, const Timestamp &)' lvalue Function 0x56469abe9638 'operator+' 'Timestamp (Timestamp, const Timestamp &)'
|               |         |-CXXConstructExpr 0x56469abfce70 <col:21, col:22> 'Timestamp' 'void (const Timestamp &) noexcept'
|               |         | `-UnaryOperator 0x56469abfcd58 <col:21, col:22> 'const Timestamp' lvalue prefix '*' cannot overflow
|               |         |   `-CXXThisExpr 0x56469abfcd48 <col:22> 'const Timestamp *' this
|               |         `-MaterializeTemporaryExpr 0x56469abfceb8 <col:29, col:61> 'const Timestamp' lvalue
|               |           `-ImplicitCastExpr 0x56469abfcea0 <col:29, col:61> 'const Timestamp' <NoOp>
|               |             `-CXXTemporaryObjectExpr 0x56469abfce30 <col:29, col:61> 'Timestamp' 'void (int, uint32_t)'
|               |               |-IntegerLiteral 0x56469abfcd80 <col:39> 'int' 0
|               |               `-BinaryOperator 0x56469abfce10 <col:42, col:60> 'unsigned int' '-'
|               |                 |-ImplicitCastExpr 0x56469abfcde0 <col:42> 'unsigned int' <IntegralCast>
|               |                 | `-DeclRefExpr 0x56469abfcda0 <col:42> 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)' EnumConstant 0x56469abea230 'subsec_per_usec' 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
|               |                 `-ImplicitCastExpr 0x56469abfcdf8 <col:60> 'uint32_t':'unsigned int' <LValueToRValue>
|               |                   `-DeclRefExpr 0x56469abfcdc0 <col:60> 'uint32_t':'unsigned int' lvalue Var 0x56469abfcbf0 'x' 'uint32_t':'unsigned int'
|               `-CXXConstructExpr 0x56469abfd028 <col:65, col:66> 'const Timestamp' 'void (const Timestamp &) noexcept'
|                 `-UnaryOperator 0x56469abfcf50 <col:65, col:66> 'const Timestamp' lvalue prefix '*' cannot overflow
|                   `-CXXThisExpr 0x56469abfcf40 <col:66> 'const Timestamp *' this
|-CXXMethodDecl 0x56469abedee8 <line:304:5, line:306:5> line:304:22 nsec_ceil 'Timestamp () const' inline
| `-CompoundStmt 0x56469abfd1a0 <col:40, line:306:5>
|   `-ReturnStmt 0x56469abfd190 <line:305:9, col:17>
|     `-CXXConstructExpr 0x56469abfd160 <col:16, col:17> 'Timestamp' 'void (const Timestamp &) noexcept'
|       `-UnaryOperator 0x56469abfd148 <col:16, col:17> 'const Timestamp' lvalue prefix '*' cannot overflow
|         `-CXXThisExpr 0x56469abfd138 <col:17> 'const Timestamp *' this
|-CXXMethodDecl 0x56469abee088 <line:310:5, col:65> col:29 make_jiffies 'Timestamp (click_jiffies_t)' static inline
| `-ParmVarDecl 0x56469abedf98 <col:42, col:58> col:58 jiffies 'click_jiffies_t':'unsigned int'
|-CXXMethodDecl 0x56469abee258 <line:312:5, col:76> col:29 make_jiffies 'Timestamp (click_jiffies_difference_t)' static inline
| `-ParmVarDecl 0x56469abee160 <col:42, col:69> col:69 jiffies 'click_jiffies_difference_t':'int'
|-CXXMethodDecl 0x56469abee348 <line:314:5, col:38> col:28 jiffies 'click_jiffies_t () const' inline
|-CXXMethodDecl 0x56469abee4b8 <line:318:5, line:320:5> line:318:29 make_sec 'Timestamp (Timestamp::seconds_type)' static inline
| |-ParmVarDecl 0x56469abee3f8 <col:38, col:51> col:51 used sec 'Timestamp::seconds_type':'int'
| `-CompoundStmt 0x56469abfd2e8 <col:56, line:320:5>
|   `-ReturnStmt 0x56469abfd2d8 <line:319:9, col:32>
|     `-ExprWithCleanups 0x56469abfd2c0 <col:16, col:32> 'Timestamp'
|       `-CXXConstructExpr 0x56469abfd290 <col:16, col:32> 'Timestamp' 'void (Timestamp &&) noexcept' elidable
|         `-MaterializeTemporaryExpr 0x56469abfd278 <col:16, col:32> 'Timestamp' xvalue
|           `-CXXTemporaryObjectExpr 0x56469abfd238 <col:16, col:32> 'Timestamp' 'void (int, uint32_t)'
|             |-ImplicitCastExpr 0x56469abfd208 <col:26> 'Timestamp::seconds_type':'int' <LValueToRValue>
|             | `-DeclRefExpr 0x56469abfd1c8 <col:26> 'Timestamp::seconds_type':'int' lvalue ParmVar 0x56469abee3f8 'sec' 'Timestamp::seconds_type':'int'
|             `-ImplicitCastExpr 0x56469abfd220 <col:31> 'uint32_t':'unsigned int' <IntegralCast>
|               `-IntegerLiteral 0x56469abfd1e8 <col:31> 'int' 0
|-CXXMethodDecl 0x56469abee6f8 <line:324:5, line:326:5> line:324:29 make_msec 'Timestamp (Timestamp::seconds_type, uint32_t)' static inline
| |-ParmVarDecl 0x56469abee570 <col:39, col:52> col:52 used sec 'Timestamp::seconds_type':'int'
| |-ParmVarDecl 0x56469abee5e8 <col:57, col:66> col:66 used msec 'uint32_t':'unsigned int'
| `-CompoundStmt 0x56469abfd4b8 <col:72, line:326:5>
|   `-ReturnStmt 0x56469abfd4a8 <line:325:9, col:51>
|     `-ExprWithCleanups 0x56469abfd490 <col:16, col:51> 'Timestamp'
|       `-CXXConstructExpr 0x56469abfd460 <col:16, col:51> 'Timestamp' 'void (Timestamp &&) noexcept' elidable
|         `-MaterializeTemporaryExpr 0x56469abfd448 <col:16, col:51> 'Timestamp' xvalue
|           `-CXXTemporaryObjectExpr 0x56469abfd408 <col:16, col:51> 'Timestamp' 'void (int, uint32_t)'
|             |-ImplicitCastExpr 0x56469abfd3f0 <col:26> 'Timestamp::seconds_type':'int' <LValueToRValue>
|             | `-DeclRefExpr 0x56469abfd310 <col:26> 'Timestamp::seconds_type':'int' lvalue ParmVar 0x56469abee570 'sec' 'Timestamp::seconds_type':'int'
|             `-CallExpr 0x56469abfd3b0 <col:31, col:50> 'uint32_t':'unsigned int'
|               |-ImplicitCastExpr 0x56469abfd398 <col:31> 'uint32_t (*)(uint32_t)' <FunctionToPointerDecay>
|               | `-DeclRefExpr 0x56469abfd330 <col:31> 'uint32_t (uint32_t)' lvalue CXXMethod 0x56469abf2fe0 'msec_to_subsec' 'uint32_t (uint32_t)'
|               `-ImplicitCastExpr 0x56469abfd3d8 <col:46> 'uint32_t':'unsigned int' <LValueToRValue>
|                 `-DeclRefExpr 0x56469abfd350 <col:46> 'uint32_t':'unsigned int' lvalue ParmVar 0x56469abee5e8 'msec' 'uint32_t':'unsigned int'
|-CXXMethodDecl 0x56469abee8a8 <line:328:5, line:337:5> line:328:29 used make_msec 'Timestamp (Timestamp::value_type)' static inline
| |-ParmVarDecl 0x56469abee7b8 <col:39, col:50> col:50 used msec 'Timestamp::value_type':'long'
| `-CompoundStmt 0x56469abfdb80 <col:56, line:337:5>
|   |-DeclStmt 0x56469abfd7b8 <line:329:9, col:51>
|   | `-VarDecl 0x56469abfd4e0 <col:9, col:50> col:19 used t 'Timestamp' nrvo cinit
|   |   `-ExprWithCleanups 0x56469abfd7a0 <col:19, col:50> 'Timestamp'
|   |     `-CXXConstructExpr 0x56469abfd770 <col:19, col:50> 'Timestamp' 'void (Timestamp &&) noexcept' elidable
|   |       `-MaterializeTemporaryExpr 0x56469abfd758 <col:23, col:50> 'Timestamp' xvalue
|   |         `-ImplicitCastExpr 0x56469abfd740 <col:23, col:50> 'Timestamp' <ConstructorConversion>
|   |           `-CXXConstructExpr 0x56469abfd710 <col:23, col:50> 'Timestamp' 'void (const Timestamp::uninitialized_t &)'
|   |             `-MaterializeTemporaryExpr 0x56469abfd6f8 <col:23, col:50> 'const Timestamp::uninitialized_t':'const uninitialized_type' lvalue
|   |               `-ImplicitCastExpr 0x56469abfd6e0 <col:23, col:50> 'const Timestamp::uninitialized_t':'const uninitialized_type' <NoOp>
|   |                 `-CXXTemporaryObjectExpr 0x56469abfd5d0 <col:23, col:50> 'Timestamp::uninitialized_t':'uninitialized_type' 'void () noexcept' zeroing
|   |-BinaryOperator 0x56469abfd970 <line:331:9, col:55> 'int64_t':'long' lvalue '='
|   | |-MemberExpr 0x56469abfd820 <col:9, col:14> 'int64_t':'long' lvalue .x 0x56469abf3888
|   | | `-MemberExpr 0x56469abfd7f0 <col:9, col:11> 'Timestamp::rep_t' lvalue ._t 0x56469abf4838
|   | |   `-DeclRefExpr 0x56469abfd7d0 <col:9> 'Timestamp' lvalue Var 0x56469abfd4e0 't' 'Timestamp'
|   | `-BinaryOperator 0x56469abfd950 <col:18, col:55> 'long' '*'
|   |   |-ImplicitCastExpr 0x56469abfd920 <col:18> 'Timestamp::value_type':'long' <LValueToRValue>
|   |   | `-DeclRefExpr 0x56469abfd850 <col:18> 'Timestamp::value_type':'long' lvalue ParmVar 0x56469abee7b8 'msec' 'Timestamp::value_type':'long'
|   |   `-ImplicitCastExpr 0x56469abfd938 <col:25, col:55> 'long' <IntegralCast>
|   |     `-ParenExpr 0x56469abfd900 <col:25, col:55> 'int'
|   |       `-BinaryOperator 0x56469abfd8e0 <col:26, col:43> 'int' '/'
|   |         |-ImplicitCastExpr 0x56469abfd8b0 <col:26> 'int' <IntegralCast>
|   |         | `-DeclRefExpr 0x56469abfd870 <col:26> 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)' EnumConstant 0x56469abea090 'subsec_per_sec' 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
|   |         `-ImplicitCastExpr 0x56469abfd8c8 <col:43> 'int' <IntegralCast>
|   |           `-DeclRefExpr 0x56469abfd890 <col:43> 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)' EnumConstant 0x56469abea000 'msec_per_sec' 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
|   `-ReturnStmt 0x56469abfdb68 <line:336:9, col:16>
|     `-CXXConstructExpr 0x56469abfdb38 <col:16> 'Timestamp' 'void (Timestamp &&) noexcept' elidable
|       `-ImplicitCastExpr 0x56469abfdb20 <col:16> 'Timestamp' xvalue <NoOp>
|         `-DeclRefExpr 0x56469abfdb00 <col:16> 'Timestamp' lvalue Var 0x56469abfd4e0 't' 'Timestamp'
|-CXXMethodDecl 0x56469abeea70 <line:341:5, line:343:5> line:341:29 make_usec 'Timestamp (Timestamp::seconds_type, uint32_t)' static inline
| |-ParmVarDecl 0x56469abee960 <col:39, col:52> col:52 used sec 'Timestamp::seconds_type':'int'
| |-ParmVarDecl 0x56469abee9d8 <col:57, col:66> col:66 used usec 'uint32_t':'unsigned int'
| `-CompoundStmt 0x56469abfdd38 <col:72, line:343:5>
|   `-ReturnStmt 0x56469abfdd28 <line:342:9, col:51>
|     `-ExprWithCleanups 0x56469abfdd10 <col:16, col:51> 'Timestamp'
|       `-CXXConstructExpr 0x56469abfdce0 <col:16, col:51> 'Timestamp' 'void (Timestamp &&) noexcept' elidable
|         `-MaterializeTemporaryExpr 0x56469abfdcc8 <col:16, col:51> 'Timestamp' xvalue
|           `-CXXTemporaryObjectExpr 0x56469abfdc88 <col:16, col:51> 'Timestamp' 'void (int, uint32_t)'
|             |-ImplicitCastExpr 0x56469abfdc70 <col:26> 'Timestamp::seconds_type':'int' <LValueToRValue>
|             | `-DeclRefExpr 0x56469abfdbb8 <col:26> 'Timestamp::seconds_type':'int' lvalue ParmVar 0x56469abee960 'sec' 'Timestamp::seconds_type':'int'
|             `-CallExpr 0x56469abfdc30 <col:31, col:50> 'uint32_t':'unsigned int'
|               |-ImplicitCastExpr 0x56469abfdc18 <col:31> 'uint32_t (*)(uint32_t)' <FunctionToPointerDecay>
|               | `-DeclRefExpr 0x56469abfdbd8 <col:31> 'uint32_t (uint32_t)' lvalue CXXMethod 0x56469abf3128 'usec_to_subsec' 'uint32_t (uint32_t)'
|               `-ImplicitCastExpr 0x56469abfdc58 <col:46> 'uint32_t':'unsigned int' <LValueToRValue>
|                 `-DeclRefExpr 0x56469abfdbf8 <col:46> 'uint32_t':'unsigned int' lvalue ParmVar 0x56469abee9d8 'usec' 'uint32_t':'unsigned int'
|-CXXMethodDecl 0x56469abeebc0 <line:345:5, line:354:5> line:345:29 used make_usec 'Timestamp (Timestamp::value_type)' static inline
| |-ParmVarDecl 0x56469abeeb30 <col:39, col:50> col:50 used usec 'Timestamp::value_type':'long'
| `-CompoundStmt 0x56469abfe180 <col:56, line:354:5>
|   |-DeclStmt 0x56469abfdf28 <line:346:9, col:51>
|   | `-VarDecl 0x56469abfdd60 <col:9, col:50> col:19 used t 'Timestamp' nrvo cinit
|   |   `-ExprWithCleanups 0x56469abfdf10 <col:19, col:50> 'Timestamp'
|   |     `-CXXConstructExpr 0x56469abfdee0 <col:19, col:50> 'Timestamp' 'void (Timestamp &&) noexcept' elidable
|   |       `-MaterializeTemporaryExpr 0x56469abfdec8 <col:23, col:50> 'Timestamp' xvalue
|   |         `-ImplicitCastExpr 0x56469abfdeb0 <col:23, col:50> 'Timestamp' <ConstructorConversion>
|   |           `-CXXConstructExpr 0x56469abfde80 <col:23, col:50> 'Timestamp' 'void (const Timestamp::uninitialized_t &)'
|   |             `-MaterializeTemporaryExpr 0x56469abfde68 <col:23, col:50> 'const Timestamp::uninitialized_t':'const uninitialized_type' lvalue
|   |               `-ImplicitCastExpr 0x56469abfde50 <col:23, col:50> 'const Timestamp::uninitialized_t':'const uninitialized_type' <NoOp>
|   |                 `-CXXTemporaryObjectExpr 0x56469abfde20 <col:23, col:50> 'Timestamp::uninitialized_t':'uninitialized_type' 'void () noexcept' zeroing
|   |-BinaryOperator 0x56469abfe0e0 <line:348:9, col:55> 'int64_t':'long' lvalue '='
|   | |-MemberExpr 0x56469abfdf90 <col:9, col:14> 'int64_t':'long' lvalue .x 0x56469abf3888
|   | | `-MemberExpr 0x56469abfdf60 <col:9, col:11> 'Timestamp::rep_t' lvalue ._t 0x56469abf4838
|   | |   `-DeclRefExpr 0x56469abfdf40 <col:9> 'Timestamp' lvalue Var 0x56469abfdd60 't' 'Timestamp'
|   | `-BinaryOperator 0x56469abfe0c0 <col:18, col:55> 'long' '*'
|   |   |-ImplicitCastExpr 0x56469abfe090 <col:18> 'Timestamp::value_type':'long' <LValueToRValue>
|   |   | `-DeclRefExpr 0x56469abfdfc0 <col:18> 'Timestamp::value_type':'long' lvalue ParmVar 0x56469abeeb30 'usec' 'Timestamp::value_type':'long'
|   |   `-ImplicitCastExpr 0x56469abfe0a8 <col:25, col:55> 'long' <IntegralCast>
|   |     `-ParenExpr 0x56469abfe070 <col:25, col:55> 'int'
|   |       `-BinaryOperator 0x56469abfe050 <col:26, col:43> 'int' '/'
|   |         |-ImplicitCastExpr 0x56469abfe020 <col:26> 'int' <IntegralCast>
|   |         | `-DeclRefExpr 0x56469abfdfe0 <col:26> 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)' EnumConstant 0x56469abea090 'subsec_per_sec' 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
|   |         `-ImplicitCastExpr 0x56469abfe038 <col:43> 'int' <IntegralCast>
|   |           `-DeclRefExpr 0x56469abfe000 <col:43> 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)' EnumConstant 0x56469abe9ee0 'usec_per_sec' 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
|   `-ReturnStmt 0x56469abfe168 <line:353:9, col:16>
|     `-CXXConstructExpr 0x56469abfe138 <col:16> 'Timestamp' 'void (Timestamp &&) noexcept' elidable
|       `-ImplicitCastExpr 0x56469abfe120 <col:16> 'Timestamp' xvalue <NoOp>
|         `-DeclRefExpr 0x56469abfe100 <col:16> 'Timestamp' lvalue Var 0x56469abfdd60 't' 'Timestamp'
|-CXXMethodDecl 0x56469abeed88 <line:358:5, line:360:5> line:358:29 make_nsec 'Timestamp (Timestamp::seconds_type, uint32_t)' static inline
| |-ParmVarDecl 0x56469abeec78 <col:39, col:52> col:52 used sec 'Timestamp::seconds_type':'int'
| |-ParmVarDecl 0x56469abeecf0 <col:57, col:66> col:66 used nsec 'uint32_t':'unsigned int'
| `-CompoundStmt 0x56469abfe338 <col:72, line:360:5>
|   `-ReturnStmt 0x56469abfe328 <line:359:9, col:51>
|     `-ExprWithCleanups 0x56469abfe310 <col:16, col:51> 'Timestamp'
|       `-CXXConstructExpr 0x56469abfe2e0 <col:16, col:51> 'Timestamp' 'void (Timestamp &&) noexcept' elidable
|         `-MaterializeTemporaryExpr 0x56469abfe2c8 <col:16, col:51> 'Timestamp' xvalue
|           `-CXXTemporaryObjectExpr 0x56469abfe288 <col:16, col:51> 'Timestamp' 'void (int, uint32_t)'
|             |-ImplicitCastExpr 0x56469abfe270 <col:26> 'Timestamp::seconds_type':'int' <LValueToRValue>
|             | `-DeclRefExpr 0x56469abfe1b8 <col:26> 'Timestamp::seconds_type':'int' lvalue ParmVar 0x56469abeec78 'sec' 'Timestamp::seconds_type':'int'
|             `-CallExpr 0x56469abfe230 <col:31, col:50> 'uint32_t':'unsigned int'
|               |-ImplicitCastExpr 0x56469abfe218 <col:31> 'uint32_t (*)(uint32_t)' <FunctionToPointerDecay>
|               | `-DeclRefExpr 0x56469abfe1d8 <col:31> 'uint32_t (uint32_t)' lvalue CXXMethod 0x56469abf3270 'nsec_to_subsec' 'uint32_t (uint32_t)'
|               `-ImplicitCastExpr 0x56469abfe258 <col:46> 'uint32_t':'unsigned int' <LValueToRValue>
|                 `-DeclRefExpr 0x56469abfe1f8 <col:46> 'uint32_t':'unsigned int' lvalue ParmVar 0x56469abeecf0 'nsec' 'uint32_t':'unsigned int'
|-CXXMethodDecl 0x56469abeeed8 <line:362:5, line:371:5> line:362:29 make_nsec 'Timestamp (Timestamp::value_type)' static inline
| |-ParmVarDecl 0x56469abeee48 <col:39, col:50> col:50 used nsec 'Timestamp::value_type':'long'
| `-CompoundStmt 0x56469ac0aca8 <col:56, line:371:5>
|   |-DeclStmt 0x56469abfe528 <line:363:9, col:51>
|   | `-VarDecl 0x56469abfe360 <col:9, col:50> col:19 used t 'Timestamp' nrvo cinit
|   |   `-ExprWithCleanups 0x56469abfe510 <col:19, col:50> 'Timestamp'
|   |     `-CXXConstructExpr 0x56469abfe4e0 <col:19, col:50> 'Timestamp' 'void (Timestamp &&) noexcept' elidable
|   |       `-MaterializeTemporaryExpr 0x56469abfe4c8 <col:23, col:50> 'Timestamp' xvalue
|   |         `-ImplicitCastExpr 0x56469abfe4b0 <col:23, col:50> 'Timestamp' <ConstructorConversion>
|   |           `-CXXConstructExpr 0x56469abfe480 <col:23, col:50> 'Timestamp' 'void (const Timestamp::uninitialized_t &)'
|   |             `-MaterializeTemporaryExpr 0x56469abfe468 <col:23, col:50> 'const Timestamp::uninitialized_t':'const uninitialized_type' lvalue
|   |               `-ImplicitCastExpr 0x56469abfe450 <col:23, col:50> 'const Timestamp::uninitialized_t':'const uninitialized_type' <NoOp>
|   |                 `-CXXTemporaryObjectExpr 0x56469abfe420 <col:23, col:50> 'Timestamp::uninitialized_t':'uninitialized_type' 'void () noexcept' zeroing
|   |-BinaryOperator 0x56469ac0ac08 <line:365:9, col:63> 'int64_t':'long' lvalue '='
|   | |-MemberExpr 0x56469abfe590 <col:9, col:14> 'int64_t':'long' lvalue .x 0x56469abf3888
|   | | `-MemberExpr 0x56469abfe560 <col:9, col:11> 'Timestamp::rep_t' lvalue ._t 0x56469abf4838
|   | |   `-DeclRefExpr 0x56469abfe540 <col:9> 'Timestamp' lvalue Var 0x56469abfe360 't' 'Timestamp'
|   | `-CallExpr 0x56469ac0aba8 <col:18, col:63> 'Timestamp::value_type':'long'
|   |   |-ImplicitCastExpr 0x56469ac0ab90 <col:18> 'Timestamp::value_type (*)(Timestamp::value_type, uint32_t)' <FunctionToPointerDecay>
|   |   | `-DeclRefExpr 0x56469abfe5c0 <col:18> 'Timestamp::value_type (Timestamp::value_type, uint32_t)' lvalue CXXMethod 0x56469abf4b68 'value_div' 'Timestamp::value_type (Timestamp::value_type, uint32_t)'
|   |   |-ImplicitCastExpr 0x56469ac0abd8 <col:28> 'Timestamp::value_type':'long' <LValueToRValue>
|   |   | `-DeclRefExpr 0x56469abfe5e0 <col:28> 'Timestamp::value_type':'long' lvalue ParmVar 0x56469abeee48 'nsec' 'Timestamp::value_type':'long'
|   |   `-ImplicitCastExpr 0x56469ac0abf0 <col:34, col:49> 'uint32_t':'unsigned int' <IntegralCast>
|   |     `-BinaryOperator 0x56469ac0ab70 <col:34, col:49> 'int' '/'
|   |       |-ImplicitCastExpr 0x56469ac0ab40 <col:34> 'int' <IntegralCast>
|   |       | `-DeclRefExpr 0x56469abfe600 <col:34> 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)' EnumConstant 0x56469abe9d30 'nsec_per_sec' 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
|   |       `-ImplicitCastExpr 0x56469ac0ab58 <col:49> 'int' <IntegralCast>
|   |         `-DeclRefExpr 0x56469abfe620 <col:49> 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)' EnumConstant 0x56469abea090 'subsec_per_sec' 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
|   `-ReturnStmt 0x56469ac0ac90 <line:370:9, col:16>
|     `-CXXConstructExpr 0x56469ac0ac60 <col:16> 'Timestamp' 'void (Timestamp &&) noexcept' elidable
|       `-ImplicitCastExpr 0x56469ac0ac48 <col:16> 'Timestamp' xvalue <NoOp>
|         `-DeclRefExpr 0x56469ac0ac28 <col:16> 'Timestamp' lvalue Var 0x56469abfe360 't' 'Timestamp'
|-CXXMethodDecl 0x56469abeefc8 <line:375:5, line:377:5> line:375:29 epsilon 'Timestamp ()' static inline
| `-CompoundStmt 0x56469ac0ade8 <col:39, line:377:5>
|   `-ReturnStmt 0x56469ac0add8 <line:376:9, col:30>
|     `-ExprWithCleanups 0x56469ac0adc0 <col:16, col:30> 'Timestamp'
|       `-CXXConstructExpr 0x56469ac0ad90 <col:16, col:30> 'Timestamp' 'void (Timestamp &&) noexcept' elidable
|         `-MaterializeTemporaryExpr 0x56469ac0ad78 <col:16, col:30> 'Timestamp' xvalue
|           `-CXXTemporaryObjectExpr 0x56469ac0ad38 <col:16, col:30> 'Timestamp' 'void (int, uint32_t)'
|             |-IntegerLiteral 0x56469ac0ace0 <col:26> 'int' 0
|             `-ImplicitCastExpr 0x56469ac0ad20 <col:29> 'uint32_t':'unsigned int' <IntegralCast>
|               `-IntegerLiteral 0x56469ac0ad00 <col:29> 'int' 1
|-CXXMethodDecl 0x56469abef088 <line:380:5, line:382:5> line:380:17 clear 'void ()' inline
| `-CompoundStmt 0x56469ac0aec8 <col:25, line:382:5>
|   `-CXXMemberCallExpr 0x56469ac0ae80 <line:381:9, col:20> 'void'
|     |-MemberExpr 0x56469ac0ae10 <col:9> '<bound member function type>' ->assign 0x56469abef288
|     | `-CXXThisExpr 0x56469ac0ae00 <col:9> 'Timestamp *' implicit this
|     |-IntegerLiteral 0x56469ac0ae40 <col:16> 'int' 0
|     `-ImplicitCastExpr 0x56469ac0aeb0 <col:19> 'uint32_t':'unsigned int' <IntegralCast>
|       `-IntegerLiteral 0x56469ac0ae60 <col:19> 'int' 0
|-CXXMethodDecl 0x56469abef288 <line:388:5, line:395:5> line:388:17 used assign 'void (Timestamp::seconds_type, uint32_t)' inline
| |-ParmVarDecl 0x56469abef138 <col:24, col:37> col:37 used sec 'Timestamp::seconds_type':'int'
| |-ParmVarDecl 0x56469abef1b0 <col:42, col:60> col:51 used subsec 'uint32_t':'unsigned int' cinit
| | `-ImplicitCastExpr 0x56469abf6460 <col:60> 'uint32_t':'unsigned int' <IntegralCast>
| |   `-IntegerLiteral 0x56469abf6440 <col:60> 'int' 0
| `-CompoundStmt 0x56469ac0b0c0 <col:63, line:395:5>
|   `-BinaryOperator 0x56469ac0b0a0 <line:390:9, col:49> 'int64_t':'long' lvalue '='
|     |-MemberExpr 0x56469ac0af20 <col:9, col:12> 'int64_t':'long' lvalue .x 0x56469abf3888
|     | `-MemberExpr 0x56469ac0aef0 <col:9> 'Timestamp::rep_t' lvalue ->_t 0x56469abf4838
|     |   `-CXXThisExpr 0x56469ac0aee0 <col:9> 'Timestamp *' implicit this
|     `-BinaryOperator 0x56469ac0b080 <col:16, col:49> 'long' '+'
|       |-BinaryOperator 0x56469ac0b010 <col:16, col:32> 'long' '*'
|       | |-CStyleCastExpr 0x56469ac0afb0 <col:16, col:26> 'int64_t':'long' <NoOp>
|       | | `-ImplicitCastExpr 0x56469ac0af98 <col:26> 'int64_t':'long' <IntegralCast> part_of_explicit_cast
|       | |   `-ImplicitCastExpr 0x56469ac0af80 <col:26> 'Timestamp::seconds_type':'int' <LValueToRValue> part_of_explicit_cast
|       | |     `-DeclRefExpr 0x56469ac0af50 <col:26> 'Timestamp::seconds_type':'int' lvalue ParmVar 0x56469abef138 'sec' 'Timestamp::seconds_type':'int'
|       | `-ImplicitCastExpr 0x56469ac0aff8 <col:32> 'long' <IntegralCast>
|       |   `-DeclRefExpr 0x56469ac0afd8 <col:32> 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)' EnumConstant 0x56469abea090 'subsec_per_sec' 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
|       `-ImplicitCastExpr 0x56469ac0b068 <col:49> 'long' <IntegralCast>
|         `-ImplicitCastExpr 0x56469ac0b050 <col:49> 'uint32_t':'unsigned int' <LValueToRValue>
|           `-DeclRefExpr 0x56469ac0b030 <col:49> 'uint32_t':'unsigned int' lvalue ParmVar 0x56469abef1b0 'subsec' 'uint32_t':'unsigned int'
|-CXXMethodDecl 0x56469abef458 <line:397:5, line:399:5> line:397:17 used assign_usec 'void (Timestamp::seconds_type, uint32_t)' inline
| |-ParmVarDecl 0x56469abef348 <col:29, col:42> col:42 used sec 'Timestamp::seconds_type':'int'
| |-ParmVarDecl 0x56469abef3c0 <col:47, col:56> col:56 used usec 'uint32_t':'unsigned int'
| `-CompoundStmt 0x56469ac0b218 <col:62, line:399:5>
|   `-CXXMemberCallExpr 0x56469ac0b1d0 <line:398:9, col:41> 'void'
|     |-MemberExpr 0x56469ac0b0e8 <col:9> '<bound member function type>' ->assign 0x56469abef288
|     | `-CXXThisExpr 0x56469ac0b0d8 <col:9> 'Timestamp *' implicit this
|     |-ImplicitCastExpr 0x56469ac0b200 <col:16> 'Timestamp::seconds_type':'int' <LValueToRValue>
|     | `-DeclRefExpr 0x56469ac0b118 <col:16> 'Timestamp::seconds_type':'int' lvalue ParmVar 0x56469abef348 'sec' 'Timestamp::seconds_type':'int'
|     `-CallExpr 0x56469ac0b190 <col:21, col:40> 'uint32_t':'unsigned int'
|       |-ImplicitCastExpr 0x56469ac0b178 <col:21> 'uint32_t (*)(uint32_t)' <FunctionToPointerDecay>
|       | `-DeclRefExpr 0x56469ac0b138 <col:21> 'uint32_t (uint32_t)' lvalue CXXMethod 0x56469abf3128 'usec_to_subsec' 'uint32_t (uint32_t)'
|       `-ImplicitCastExpr 0x56469ac0b1b8 <col:36> 'uint32_t':'unsigned int' <LValueToRValue>
|         `-DeclRefExpr 0x56469ac0b158 <col:36> 'uint32_t':'unsigned int' lvalue ParmVar 0x56469abef3c0 'usec' 'uint32_t':'unsigned int'
|-CXXMethodDecl 0x56469abef628 <line:401:5, line:403:5> line:401:17 used assign_nsec 'void (Timestamp::seconds_type, uint32_t)' inline
| |-ParmVarDecl 0x56469abef518 <col:29, col:42> col:42 used sec 'Timestamp::seconds_type':'int'
| |-ParmVarDecl 0x56469abef590 <col:47, col:56> col:56 used nsec 'uint32_t':'unsigned int'
| `-CompoundStmt 0x56469ac0b370 <col:62, line:403:5>
|   `-CXXMemberCallExpr 0x56469ac0b328 <line:402:9, col:41> 'void'
|     |-MemberExpr 0x56469ac0b240 <col:9> '<bound member function type>' ->assign 0x56469abef288
|     | `-CXXThisExpr 0x56469ac0b230 <col:9> 'Timestamp *' implicit this
|     |-ImplicitCastExpr 0x56469ac0b358 <col:16> 'Timestamp::seconds_type':'int' <LValueToRValue>
|     | `-DeclRefExpr 0x56469ac0b270 <col:16> 'Timestamp::seconds_type':'int' lvalue ParmVar 0x56469abef518 'sec' 'Timestamp::seconds_type':'int'
|     `-CallExpr 0x56469ac0b2e8 <col:21, col:40> 'uint32_t':'unsigned int'
|       |-ImplicitCastExpr 0x56469ac0b2d0 <col:21> 'uint32_t (*)(uint32_t)' <FunctionToPointerDecay>
|       | `-DeclRefExpr 0x56469ac0b290 <col:21> 'uint32_t (uint32_t)' lvalue CXXMethod 0x56469abf3270 'nsec_to_subsec' 'uint32_t (uint32_t)'
|       `-ImplicitCastExpr 0x56469ac0b310 <col:36> 'uint32_t':'unsigned int' <LValueToRValue>
|         `-DeclRefExpr 0x56469ac0b2b0 <col:36> 'uint32_t':'unsigned int' lvalue ParmVar 0x56469abef590 'nsec' 'uint32_t':'unsigned int'
|-CXXMethodDecl 0x56469abef7f8 <line:408:5, col:86> col:17 set 'void (Timestamp::seconds_type, uint32_t)' inline
| |-ParmVarDecl 0x56469abef6e8 <col:21, col:34> col:34 sec 'Timestamp::seconds_type':'int'
| |-ParmVarDecl 0x56469abef760 <col:39, col:57> col:48 subsec 'uint32_t':'unsigned int' cinit
| | `-ImplicitCastExpr 0x56469abf6498 <col:57> 'uint32_t':'unsigned int' <IntegralCast>
| |   `-IntegerLiteral 0x56469abf6478 <col:57> 'int' 0
| `-DeprecatedAttr 0x56469abef8a8 <col:75> "" ""
|-CXXMethodDecl 0x56469abefa38 <line:411:5, col:85> col:17 set_usec 'void (Timestamp::seconds_type, uint32_t)' inline
| |-ParmVarDecl 0x56469abef928 <col:26, col:39> col:39 sec 'Timestamp::seconds_type':'int'
| |-ParmVarDecl 0x56469abef9a0 <col:44, col:53> col:53 usec 'uint32_t':'unsigned int'
| `-DeprecatedAttr 0x56469abefae8 <col:74> "" ""
|-CXXMethodDecl 0x56469abefc78 <line:414:5, col:85> col:17 set_nsec 'void (Timestamp::seconds_type, uint32_t)' inline
| |-ParmVarDecl 0x56469abefb68 <col:26, col:39> col:39 sec 'Timestamp::seconds_type':'int'
| |-ParmVarDecl 0x56469abefbe0 <col:44, col:53> col:53 nsec 'uint32_t':'unsigned int'
| `-DeprecatedAttr 0x56469abefd28 <col:74> "" ""
|-CXXMethodDecl 0x56469abefdb8 <line:417:5, col:53> col:17 set_now 'void ()' inline
| `-DeprecatedAttr 0x56469abefe58 <col:42> "" ""
|-CXXMethodDecl 0x56469abf2690 <line:420:5, col:53> col:9 set_timeval_ioctl 'int (int, int)'
| |-ParmVarDecl 0x56469abf2570 <col:27, col:31> col:31 fd 'int'
| `-ParmVarDecl 0x56469abf25f0 <col:35, col:39> col:39 ioctl_selector 'int'
|-CXXMethodDecl 0x56469abf2760 <line:432:5, col:33> col:29 now 'Timestamp ()' static inline
|-CXXMethodDecl 0x56469abf2820 <line:438:5, col:56> col:45 used assign_now 'void ()'
| |-NoInlineAttr 0x56469abf28c0 <col:20>
| `-OptimizeNoneAttr 0x56469abf2918 <col:30>
|-CXXMethodDecl 0x56469abf2960 <line:446:5, col:36> col:29 used recent 'Timestamp ()' static inline
|-CXXMethodDecl 0x56469abf2a20 <line:452:5, col:31> col:17 used assign_recent 'void ()' inline
|-CXXMethodDecl 0x56469abf2ae0 <line:466:5, col:40> col:29 used now_steady 'Timestamp ()' static inline
|-CXXMethodDecl 0x56469abf2ba0 <line:472:5, col:35> col:17 used assign_now_steady 'void ()' inline
|-CXXMethodDecl 0x56469abf2c60 <line:481:5, col:43> col:29 used recent_steady 'Timestamp ()' static inline
|-CXXMethodDecl 0x56469abf2d20 <line:487:5, col:38> col:17 used assign_recent_steady 'void ()' inline
|-CXXMethodDecl 0x56469abf2de0 <line:496:5, col:22> col:12 unparse 'String () const'
|-CXXMethodDecl 0x56469abf2ea0 <line:501:5, col:31> col:12 unparse_interval 'String () const'
|-CXXMethodDecl 0x56469abf2fe0 <line:510:5, line:512:5> line:510:28 used msec_to_subsec 'uint32_t (uint32_t)' static inline
| |-ParmVarDecl 0x56469abf2f50 <col:43, col:52> col:52 used msec 'uint32_t':'unsigned int'
| `-CompoundStmt 0x56469ac0b4b8 <col:58, line:512:5>
|   `-ReturnStmt 0x56469ac0b4a8 <line:511:9, col:53>
|     `-BinaryOperator 0x56469ac0b488 <col:16, col:53> 'unsigned int' '*'
|       |-ImplicitCastExpr 0x56469ac0b458 <col:16> 'uint32_t':'unsigned int' <LValueToRValue>
|       | `-DeclRefExpr 0x56469ac0b388 <col:16> 'uint32_t':'unsigned int' lvalue ParmVar 0x56469abf2f50 'msec' 'uint32_t':'unsigned int'
|       `-ImplicitCastExpr 0x56469ac0b470 <col:23, col:53> 'unsigned int' <IntegralCast>
|         `-ParenExpr 0x56469ac0b438 <col:23, col:53> 'int'
|           `-BinaryOperator 0x56469ac0b418 <col:24, col:41> 'int' '/'
|             |-ImplicitCastExpr 0x56469ac0b3e8 <col:24> 'int' <IntegralCast>
|             | `-DeclRefExpr 0x56469ac0b3a8 <col:24> 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)' EnumConstant 0x56469abea090 'subsec_per_sec' 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
|             `-ImplicitCastExpr 0x56469ac0b400 <col:41> 'int' <IntegralCast>
|               `-DeclRefExpr 0x56469ac0b3c8 <col:41> 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)' EnumConstant 0x56469abea000 'msec_per_sec' 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
|-CXXMethodDecl 0x56469abf3128 <line:514:5, line:516:5> line:514:28 used usec_to_subsec 'uint32_t (uint32_t)' static inline
| |-ParmVarDecl 0x56469abf3098 <col:43, col:52> col:52 used usec 'uint32_t':'unsigned int'
| `-CompoundStmt 0x56469ac0b600 <col:58, line:516:5>
|   `-ReturnStmt 0x56469ac0b5f0 <line:515:9, col:53>
|     `-BinaryOperator 0x56469ac0b5d0 <col:16, col:53> 'unsigned int' '*'
|       |-ImplicitCastExpr 0x56469ac0b5a0 <col:16> 'uint32_t':'unsigned int' <LValueToRValue>
|       | `-DeclRefExpr 0x56469ac0b4d0 <col:16> 'uint32_t':'unsigned int' lvalue ParmVar 0x56469abf3098 'usec' 'uint32_t':'unsigned int'
|       `-ImplicitCastExpr 0x56469ac0b5b8 <col:23, col:53> 'unsigned int' <IntegralCast>
|         `-ParenExpr 0x56469ac0b580 <col:23, col:53> 'int'
|           `-BinaryOperator 0x56469ac0b560 <col:24, col:41> 'int' '/'
|             |-ImplicitCastExpr 0x56469ac0b530 <col:24> 'int' <IntegralCast>
|             | `-DeclRefExpr 0x56469ac0b4f0 <col:24> 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)' EnumConstant 0x56469abea090 'subsec_per_sec' 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
|             `-ImplicitCastExpr 0x56469ac0b548 <col:41> 'int' <IntegralCast>
|               `-DeclRefExpr 0x56469ac0b510 <col:41> 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)' EnumConstant 0x56469abe9ee0 'usec_per_sec' 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
|-CXXMethodDecl 0x56469abf3270 <line:518:5, line:520:5> line:518:28 used nsec_to_subsec 'uint32_t (uint32_t)' static inline
| |-ParmVarDecl 0x56469abf31e0 <col:43, col:52> col:52 used nsec 'uint32_t':'unsigned int'
| `-CompoundStmt 0x56469ac0b748 <col:58, line:520:5>
|   `-ReturnStmt 0x56469ac0b738 <line:519:9, col:53>
|     `-BinaryOperator 0x56469ac0b718 <col:16, col:53> 'unsigned int' '/'
|       |-ImplicitCastExpr 0x56469ac0b6e8 <col:16> 'uint32_t':'unsigned int' <LValueToRValue>
|       | `-DeclRefExpr 0x56469ac0b618 <col:16> 'uint32_t':'unsigned int' lvalue ParmVar 0x56469abf31e0 'nsec' 'uint32_t':'unsigned int'
|       `-ImplicitCastExpr 0x56469ac0b700 <col:23, col:53> 'unsigned int' <IntegralCast>
|         `-ParenExpr 0x56469ac0b6c8 <col:23, col:53> 'int'
|           `-BinaryOperator 0x56469ac0b6a8 <col:24, col:39> 'int' '/'
|             |-ImplicitCastExpr 0x56469ac0b678 <col:24> 'int' <IntegralCast>
|             | `-DeclRefExpr 0x56469ac0b638 <col:24> 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)' EnumConstant 0x56469abe9d30 'nsec_per_sec' 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
|             `-ImplicitCastExpr 0x56469ac0b690 <col:39> 'int' <IntegralCast>
|               `-DeclRefExpr 0x56469ac0b658 <col:39> 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)' EnumConstant 0x56469abea090 'subsec_per_sec' 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
|-CXXMethodDecl 0x56469abf33b8 <line:522:5, line:524:5> line:522:28 used subsec_to_msec 'uint32_t (uint32_t)' static inline
| |-ParmVarDecl 0x56469abf3328 <col:43, col:52> col:52 used subsec 'uint32_t':'unsigned int'
| `-CompoundStmt 0x56469ac0b890 <col:60, line:524:5>
|   `-ReturnStmt 0x56469ac0b880 <line:523:9, col:55>
|     `-BinaryOperator 0x56469ac0b860 <col:16, col:55> 'unsigned int' '/'
|       |-ImplicitCastExpr 0x56469ac0b830 <col:16> 'uint32_t':'unsigned int' <LValueToRValue>
|       | `-DeclRefExpr 0x56469ac0b760 <col:16> 'uint32_t':'unsigned int' lvalue ParmVar 0x56469abf3328 'subsec' 'uint32_t':'unsigned int'
|       `-ImplicitCastExpr 0x56469ac0b848 <col:25, col:55> 'unsigned int' <IntegralCast>
|         `-ParenExpr 0x56469ac0b810 <col:25, col:55> 'int'
|           `-BinaryOperator 0x56469ac0b7f0 <col:26, col:43> 'int' '/'
|             |-ImplicitCastExpr 0x56469ac0b7c0 <col:26> 'int' <IntegralCast>
|             | `-DeclRefExpr 0x56469ac0b780 <col:26> 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)' EnumConstant 0x56469abea090 'subsec_per_sec' 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
|             `-ImplicitCastExpr 0x56469ac0b7d8 <col:43> 'int' <IntegralCast>
|               `-DeclRefExpr 0x56469ac0b7a0 <col:43> 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)' EnumConstant 0x56469abea000 'msec_per_sec' 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
|-CXXMethodDecl 0x56469abf3500 <line:526:5, line:528:5> line:526:28 used subsec_to_usec 'uint32_t (uint32_t)' static inline
| |-ParmVarDecl 0x56469abf3470 <col:43, col:52> col:52 used subsec 'uint32_t':'unsigned int'
| `-CompoundStmt 0x56469ac0b9d8 <col:60, line:528:5>
|   `-ReturnStmt 0x56469ac0b9c8 <line:527:9, col:55>
|     `-BinaryOperator 0x56469ac0b9a8 <col:16, col:55> 'unsigned int' '/'
|       |-ImplicitCastExpr 0x56469ac0b978 <col:16> 'uint32_t':'unsigned int' <LValueToRValue>
|       | `-DeclRefExpr 0x56469ac0b8a8 <col:16> 'uint32_t':'unsigned int' lvalue ParmVar 0x56469abf3470 'subsec' 'uint32_t':'unsigned int'
|       `-ImplicitCastExpr 0x56469ac0b990 <col:25, col:55> 'unsigned int' <IntegralCast>
|         `-ParenExpr 0x56469ac0b958 <col:25, col:55> 'int'
|           `-BinaryOperator 0x56469ac0b938 <col:26, col:43> 'int' '/'
|             |-ImplicitCastExpr 0x56469ac0b908 <col:26> 'int' <IntegralCast>
|             | `-DeclRefExpr 0x56469ac0b8c8 <col:26> 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)' EnumConstant 0x56469abea090 'subsec_per_sec' 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
|             `-ImplicitCastExpr 0x56469ac0b920 <col:43> 'int' <IntegralCast>
|               `-DeclRefExpr 0x56469ac0b8e8 <col:43> 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)' EnumConstant 0x56469abe9ee0 'usec_per_sec' 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
|-CXXMethodDecl 0x56469abf3648 <line:530:5, line:532:5> line:530:28 used subsec_to_nsec 'uint32_t (uint32_t)' static inline
| |-ParmVarDecl 0x56469abf35b8 <col:43, col:52> col:52 used subsec 'uint32_t':'unsigned int'
| `-CompoundStmt 0x56469ac0bb20 <col:60, line:532:5>
|   `-ReturnStmt 0x56469ac0bb10 <line:531:9, col:55>
|     `-BinaryOperator 0x56469ac0baf0 <col:16, col:55> 'unsigned int' '*'
|       |-ImplicitCastExpr 0x56469ac0bac0 <col:16> 'uint32_t':'unsigned int' <LValueToRValue>
|       | `-DeclRefExpr 0x56469ac0b9f0 <col:16> 'uint32_t':'unsigned int' lvalue ParmVar 0x56469abf35b8 'subsec' 'uint32_t':'unsigned int'
|       `-ImplicitCastExpr 0x56469ac0bad8 <col:25, col:55> 'unsigned int' <IntegralCast>
|         `-ParenExpr 0x56469ac0baa0 <col:25, col:55> 'int'
|           `-BinaryOperator 0x56469ac0ba80 <col:26, col:41> 'int' '/'
|             |-ImplicitCastExpr 0x56469ac0ba50 <col:26> 'int' <IntegralCast>
|             | `-DeclRefExpr 0x56469ac0ba10 <col:26> 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)' EnumConstant 0x56469abe9d30 'nsec_per_sec' 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
|             `-ImplicitCastExpr 0x56469ac0ba68 <col:41> 'int' <IntegralCast>
|               `-DeclRefExpr 0x56469ac0ba30 <col:41> 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)' EnumConstant 0x56469abea090 'subsec_per_sec' 'Timestamp::(anonymous enum at ../dummy_inc/click/timestamp.hh:142:5)'
|-CXXRecordDecl 0x56469abf36f0 prev 0x56469abea530 <line:539:5, line:566:5> line:539:11 referenced union rep_t definition
| |-DefinitionData pass_in_registers aggregate standard_layout trivially_copyable pod trivial literal has_variant_members
| | |-DefaultConstructor exists trivial
| | |-CopyConstructor simple trivial has_const_param implicit_has_const_param
| | |-MoveConstructor exists simple trivial
| | |-CopyAssignment trivial has_const_param implicit_has_const_param
| | |-MoveAssignment exists simple trivial
| | `-Destructor simple irrelevant trivial
| |-CXXRecordDecl 0x56469abf37e8 <col:5, col:11> col:11 implicit union rep_t
| |-FieldDecl 0x56469abf3888 <line:541:9, col:17> col:17 referenced x 'int64_t':'long'
| |-CXXConstructorDecl 0x56469abfa650 <line:539:11> col:11 implicit used rep_t 'void () noexcept' inline default trivial
| | `-CompoundStmt 0x56469abfaa38 <col:11>
| |-CXXConstructorDecl 0x56469abfa730 <col:11> col:11 implicit used constexpr rep_t 'void (const Timestamp::rep_t &) noexcept' inline default trivial
| | |-ParmVarDecl 0x56469abfa818 <col:11> col:11 'const Timestamp::rep_t &'
| | `-CompoundStmt 0x56469abfb180 <col:11>
| |-CXXConstructorDecl 0x56469abfa8b8 <col:11> col:11 implicit used constexpr rep_t 'void (Timestamp::rep_t &&) noexcept' inline default trivial
| | |-ParmVarDecl 0x56469abfa9c8 <col:11> col:11 'Timestamp::rep_t &&'
| | `-CompoundStmt 0x56469abfc9d8 <col:11>
| |-CXXDestructorDecl 0x56469abfbce8 <col:11> col:11 implicit ~rep_t 'void () noexcept' inline default trivial
| |-CXXMethodDecl 0x56469a902678 <col:11> col:11 implicit used constexpr operator= 'Timestamp::rep_t &(const Timestamp::rep_t &) noexcept' inline default trivial
| | |-ParmVarDecl 0x56469a902788 <col:11> col:11 'const Timestamp::rep_t &'
| | `-CompoundStmt 0x56469a903050 <col:11>
| |   `-ReturnStmt 0x56469a903040 <col:11>
| |     `-UnaryOperator 0x56469a903028 <col:11> 'Timestamp::rep_t' lvalue prefix '*' cannot overflow
| |       `-CXXThisExpr 0x56469a903018 <col:11> 'Timestamp::rep_t *' this
| `-CXXMethodDecl 0x56469a9027f8 <col:11> col:11 implicit used constexpr operator= 'Timestamp::rep_t &(Timestamp::rep_t &&) noexcept' inline default trivial
|   |-ParmVarDecl 0x56469a902908 <col:11> col:11 'Timestamp::rep_t &&'
|   `-CompoundStmt 0x56469ac90d10 <col:11>
|     `-ReturnStmt 0x56469ac90d00 <col:11>
|       `-UnaryOperator 0x56469ac90ce8 <col:11> 'Timestamp::rep_t' lvalue prefix '*' cannot overflow
|         `-CXXThisExpr 0x56469ac90cd8 <col:11> 'Timestamp::rep_t *' this
|-EnumDecl 0x56469abf38f0 <line:571:5, line:577:5> line:571:10 referenced warp_class_type
| |-EnumConstantDecl 0x56469abf39f0 <line:572:9, col:21> col:9 warp_none 'Timestamp::warp_class_type'
| | `-ImplicitCastExpr 0x56469abf3bf0 <col:21> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x56469abf39d0 <col:21> 'int' Int: 0
| |     `-IntegerLiteral 0x56469abf39b0 <col:21> 'int' 0
| |-EnumConstantDecl 0x56469abf3a80 <line:573:9, col:23> col:9 warp_linear 'Timestamp::warp_class_type'
| | `-ImplicitCastExpr 0x56469abf3c08 <col:23> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x56469abf3a60 <col:23> 'int' Int: 1
| |     `-IntegerLiteral 0x56469abf3a40 <col:23> 'int' 1
| |-EnumConstantDecl 0x56469abf3b10 <line:574:9, col:23> col:9 referenced warp_nowait 'Timestamp::warp_class_type'
| | `-ImplicitCastExpr 0x56469abf3c20 <col:23> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x56469abf3af0 <col:23> 'int' Int: 2
| |     `-IntegerLiteral 0x56469abf3ad0 <col:23> 'int' 2
| `-EnumConstantDecl 0x56469abf3ba0 <line:576:9, col:27> col:9 warp_simulation 'Timestamp::warp_class_type'
|   `-ImplicitCastExpr 0x56469abf3c38 <col:27> 'unsigned int' <IntegralCast>
|     `-ConstantExpr 0x56469abf3b80 <col:27> 'int' Int: 3
|       `-IntegerLiteral 0x56469abf3b60 <col:27> 'int' 3
|-CXXMethodDecl 0x56469abf3c78 <line:581:5, col:34> col:23 warp_class 'int ()' static inline
|-CXXMethodDecl 0x56469abf3d40 <line:588:5, col:37> col:26 warp_speed 'double ()' static inline
|-CXXMethodDecl 0x56469abf3f48 <line:621:5, col:65> col:17 warp_set_class 'void (Timestamp::warp_class_type, double)' static
| |-ParmVarDecl 0x56469abf3df0 <col:32, col:48> col:48 w 'Timestamp::warp_class_type'
| `-ParmVarDecl 0x56469abf3e70 <col:51, col:62> col:58 s 'double' cinit
|   `-FloatingLiteral 0x56469abf64b0 <col:62> 'double' 1.000000e+00
|-CXXMethodDecl 0x56469abf4158 <line:628:5, col:82> col:17 warp_set_now 'void (const Timestamp &, const Timestamp &)' static
| |-ParmVarDecl 0x56469abf4008 <col:30, col:47> col:47 t_system 'const Timestamp &'
| `-ParmVarDecl 0x56469abf4080 <col:57, col:74> col:74 t_steady 'const Timestamp &'
|-CXXMethodDecl 0x56469abf4228 <line:632:5, col:40> col:22 used warp_real_delay 'Timestamp () const' inline
|-CXXMethodDecl 0x56469abf42e8 <line:635:5, col:37> col:24 used warp_jumping 'bool ()' static inline
|-CXXMethodDecl 0x56469abf4458 <line:640:5, col:57> col:17 used warp_jump_steady 'void (const Timestamp &)' static
| `-ParmVarDecl 0x56469abf4398 <col:34, col:51> col:51 expiry 'const Timestamp &'
|-CXXMethodDecl 0x56469abf4520 <line:647:5, col:42> col:29 now_unwarped 'Timestamp ()' static inline
|-CXXMethodDecl 0x56469abf45e0 <line:653:5, col:37> col:17 used assign_now_unwarped 'void ()' inline
|-CXXMethodDecl 0x56469abf46a0 <line:659:5, col:49> col:29 now_steady_unwarped 'Timestamp ()' static inline
|-CXXMethodDecl 0x56469abf4760 <line:666:5, col:44> col:17 used assign_now_steady_unwarped 'void ()' inline
|-AccessSpecDecl 0x56469abf4800 <line:670:3, col:10> col:3 private
|-FieldDecl 0x56469abf4838 <line:672:5, col:11> col:11 referenced _t 'Timestamp::rep_t'
|-CXXMethodDecl 0x56469abf48a8 <line:674:5, line:684:5> line:674:17 used add_fix 'void ()' inline
| `-CompoundStmt 0x56469ac0bb38 <col:27, line:684:5>
|-CXXMethodDecl 0x56469abf4968 <line:686:5, line:696:5> line:686:17 used sub_fix 'void ()' inline
| `-CompoundStmt 0x56469ac0bb48 <col:27, line:696:5>
|-CXXMethodDecl 0x56469abf4b68 <line:698:5, line:700:5> line:698:30 used value_div 'Timestamp::value_type (Timestamp::value_type, uint32_t)' static inline
| |-ParmVarDecl 0x56469abf4a18 <col:40, col:51> col:51 used a 'Timestamp::value_type':'long'
| |-ParmVarDecl 0x56469abf4a90 <col:54, col:63> col:63 used b 'uint32_t':'unsigned int'
| `-CompoundStmt 0x56469ac0bcd0 <col:66, line:700:5>
|   `-ReturnStmt 0x56469ac0bcc0 <line:699:9, col:31>
|     `-CallExpr 0x56469ac0bc60 <col:16, col:31> 'int64_t':'long'
|       |-ImplicitCastExpr 0x56469ac0bc48 <col:16> 'int64_t (*)(int64_t, uint32_t)' <FunctionToPointerDecay>
|       | `-DeclRefExpr 0x56469ac0bbf8 <col:16> 'int64_t (int64_t, uint32_t)' lvalue Function 0x56469aa76f18 'int_divide' 'int64_t (int64_t, uint32_t)'
|       |-ImplicitCastExpr 0x56469ac0bc90 <col:27> 'Timestamp::value_type':'long' <LValueToRValue>
|       | `-DeclRefExpr 0x56469ac0bbb8 <col:27> 'Timestamp::value_type':'long' lvalue ParmVar 0x56469abf4a18 'a' 'Timestamp::value_type':'long'
|       `-ImplicitCastExpr 0x56469ac0bca8 <col:30> 'uint32_t':'unsigned int' <LValueToRValue>
|         `-DeclRefExpr 0x56469ac0bbd8 <col:30> 'uint32_t':'unsigned int' lvalue ParmVar 0x56469abf4a90 'b' 'uint32_t':'unsigned int'
|-CXXMethodDecl 0x56469abf4ed8 <line:702:5, line:707:5> line:702:24 value_div_mod 'void (int32_t &, int32_t &, Timestamp::value_type, uint32_t)' static inline
| |-ParmVarDecl 0x56469abf4c28 <col:38, col:47> col:47 used div 'int32_t &'
| |-ParmVarDecl 0x56469abf4ca0 <col:52, col:61> col:61 used rem 'int32_t &'
| |-ParmVarDecl 0x56469abf4d18 <line:703:38, col:49> col:49 used a 'Timestamp::value_type':'long'
| |-ParmVarDecl 0x56469abf4d90 <col:52, col:61> col:61 used b 'uint32_t':'unsigned int'
| `-CompoundStmt 0x56469ac0c020 <col:64, line:707:5>
|   |-DeclStmt 0x56469ac0bd60 <line:704:9, col:24>
|   | `-VarDecl 0x56469ac0bcf8 <col:9, col:20> col:20 used quot 'Timestamp::value_type':'long'
|   |-BinaryOperator 0x56469ac0bf70 <line:705:9, col:39> 'int32_t':'int' lvalue '='
|   | |-DeclRefExpr 0x56469ac0bd78 <col:9> 'int32_t':'int' lvalue ParmVar 0x56469abf4ca0 'rem' 'int32_t &'
|   | `-ImplicitCastExpr 0x56469ac0bf58 <col:15, col:39> 'int32_t':'int' <IntegralCast>
|   |   `-CallExpr 0x56469ac0bef0 <col:15, col:39> 'uint32_t':'unsigned int'
|   |     |-ImplicitCastExpr 0x56469ac0bed8 <col:15> 'uint32_t (*)(int64_t, uint32_t, int64_t &)' <FunctionToPointerDecay>
|   |     | `-DeclRefExpr 0x56469ac0be58 <col:15> 'uint32_t (int64_t, uint32_t, int64_t &)' lvalue Function 0x56469aa7c1e8 'int_remainder' 'uint32_t (int64_t, uint32_t, int64_t &)'
|   |     |-ImplicitCastExpr 0x56469ac0bf28 <col:29> 'Timestamp::value_type':'long' <LValueToRValue>
|   |     | `-DeclRefExpr 0x56469ac0bdf8 <col:29> 'Timestamp::value_type':'long' lvalue ParmVar 0x56469abf4d18 'a' 'Timestamp::value_type':'long'
|   |     |-ImplicitCastExpr 0x56469ac0bf40 <col:32> 'uint32_t':'unsigned int' <LValueToRValue>
|   |     | `-DeclRefExpr 0x56469ac0be18 <col:32> 'uint32_t':'unsigned int' lvalue ParmVar 0x56469abf4d90 'b' 'uint32_t':'unsigned int'
|   |     `-DeclRefExpr 0x56469ac0be38 <col:35> 'Timestamp::value_type':'long' lvalue Var 0x56469ac0bcf8 'quot' 'Timestamp::value_type':'long'
|   `-BinaryOperator 0x56469ac0c000 <line:706:9, col:15> 'int32_t':'int' lvalue '='
|     |-DeclRefExpr 0x56469ac0bf90 <col:9> 'int32_t':'int' lvalue ParmVar 0x56469abf4c28 'div' 'int32_t &'
|     `-ImplicitCastExpr 0x56469ac0bfe8 <col:15> 'int32_t':'int' <IntegralCast>
|       `-ImplicitCastExpr 0x56469ac0bfd0 <col:15> 'Timestamp::value_type':'long' <LValueToRValue>
|         `-DeclRefExpr 0x56469ac0bfb0 <col:15> 'Timestamp::value_type':'long' lvalue Var 0x56469ac0bcf8 'quot' 'Timestamp::value_type':'long'
|-CXXMethodDecl 0x56469abf5178 <line:709:5, col:67> col:17 used assign_now 'void (bool, bool, bool)' inline
| |-ParmVarDecl 0x56469abf4fa8 <col:28, col:33> col:33 recent 'bool'
| |-ParmVarDecl 0x56469abf5020 <col:41, col:46> col:46 steady 'bool'
| `-ParmVarDecl 0x56469abf5098 <col:54, col:59> col:59 unwarped 'bool'
|-CXXMethodDecl 0x56469abf5418 <line:712:5, col:98> col:24 warp_adjust 'void (bool, const Timestamp &, const Timestamp &)' static inline
| |-ParmVarDecl 0x56469abf5240 <col:36, col:41> col:41 steady 'bool'
| |-ParmVarDecl 0x56469abf52b8 <col:49, col:66> col:66 t_raw 'const Timestamp &'
| `-ParmVarDecl 0x56469abf5330 <col:73, col:90> col:90 t_warped 'const Timestamp &'
|-CXXMethodDecl 0x56469abf55a8 <line:713:5, col:42> col:22 warped 'Timestamp (bool) const' inline
| `-ParmVarDecl 0x56469abf54e0 <col:29, col:34> col:34 steady 'bool'
|-CXXMethodDecl 0x56469abf57a8 <line:714:5, col:41> col:10 used warp 'void (bool, bool)'
| |-ParmVarDecl 0x56469abf5660 <col:15, col:20> col:20 steady 'bool'
| `-ParmVarDecl 0x56469abf56d8 <col:28, col:33> col:33 from_now 'bool'
|-FriendDecl 0x56469abf5a78 <line:717:5, col:73> col:24
| `-FunctionDecl 0x56469abf59b8 parent 0x56469a6f2488 <col:5, col:73> col:24 used operator== 'bool (const Timestamp &, const Timestamp &)' inline
|   |-ParmVarDecl 0x56469abf5868 <col:35, col:52> col:52 a 'const Timestamp &'
|   `-ParmVarDecl 0x56469abf58e0 <col:55, col:72> col:72 b 'const Timestamp &'
|-FriendDecl 0x56469abf5c98 <line:718:5, col:72> col:24
| `-FunctionDecl 0x56469abf5bd8 parent 0x56469a6f2488 <col:5, col:72> col:24 used operator< 'bool (const Timestamp &, const Timestamp &)' inline
|   |-ParmVarDecl 0x56469abf5ac8 <col:34, col:51> col:51 a 'const Timestamp &'
|   `-ParmVarDecl 0x56469abf5b40 <col:54, col:71> col:71 b 'const Timestamp &'
|-FriendDecl 0x56469abf5e60 <line:719:5, col:57> col:29
| `-FunctionDecl 0x56469abf5da8 parent 0x56469a6f2488 <col:5, col:57> col:29 operator- 'Timestamp (const Timestamp &)' inline
|   `-ParmVarDecl 0x56469abf5ce8 <col:39, col:56> col:56 b 'const Timestamp &'
|-FriendDecl 0x56469abf60e8 <line:720:5, col:73> col:30
| `-FunctionDecl 0x56469abf6028 parent 0x56469a6f2488 <col:5, col:73> col:30 used operator+= 'Timestamp &(Timestamp &, const Timestamp &)' inline
|   |-ParmVarDecl 0x56469abf5ed8 <col:41, col:52> col:52 a 'Timestamp &'
|   `-ParmVarDecl 0x56469abf5f50 <col:55, col:72> col:72 b 'const Timestamp &'
|-FriendDecl 0x56469abf6308 <line:721:5, col:73> col:30
| `-FunctionDecl 0x56469abf6248 parent 0x56469a6f2488 <col:5, col:73> col:30 used operator-= 'Timestamp &(Timestamp &, const Timestamp &)' inline
|   |-ParmVarDecl 0x56469abf6138 <col:41, col:52> col:52 a 'Timestamp &'
|   `-ParmVarDecl 0x56469abf61b0 <col:55, col:72> col:72 b 'const Timestamp &'
|-CXXConstructorDecl 0x56469abfbb90 <line:122:7> col:7 implicit used constexpr Timestamp 'void (const Timestamp &) noexcept' inline default trivial
| |-ParmVarDecl 0x56469abfbc78 <col:7> col:7 used 'const Timestamp &'
| |-CXXCtorInitializer Field 0x56469abf4838 '_t' 'Timestamp::rep_t'
| | `-CXXConstructExpr 0x56469abfc6e8 <col:7> 'Timestamp::rep_t' 'void (const Timestamp::rep_t &) noexcept'
| |   `-MemberExpr 0x56469abfc6a0 <col:7> 'const Timestamp::rep_t' lvalue ._t 0x56469abf4838
| |     `-DeclRefExpr 0x56469abfc680 <col:7> 'const Timestamp' lvalue ParmVar 0x56469abfbc78 '' 'const Timestamp &'
| `-CompoundStmt 0x56469abfc748 <col:7>
|-CXXConstructorDecl 0x56469abfbdf8 <col:7> col:7 implicit used constexpr Timestamp 'void (Timestamp &&) noexcept' inline default trivial
| |-ParmVarDecl 0x56469abfbf08 <col:7> col:7 used 'Timestamp &&'
| |-CXXCtorInitializer Field 0x56469abf4838 '_t' 'Timestamp::rep_t'
| | `-CXXConstructExpr 0x56469abfc9e8 <col:7> 'Timestamp::rep_t' 'void (Timestamp::rep_t &&) noexcept'
| |   `-MemberExpr 0x56469abfc990 <col:7> 'Timestamp::rep_t' xvalue ._t 0x56469abf4838
| |     `-CXXStaticCastExpr 0x56469abfc960 <col:7> 'Timestamp' xvalue static_cast<class Timestamp &&> <NoOp>
| |       `-DeclRefExpr 0x56469abfc930 <col:7> 'Timestamp' lvalue ParmVar 0x56469abfbf08 '' 'Timestamp &&'
| `-CompoundStmt 0x56469abfca48 <col:7>
|-CXXDestructorDecl 0x56469abfbfb8 <col:7> col:7 implicit referenced ~Timestamp 'void () noexcept' inline default trivial
|-CXXMethodDecl 0x56469a9024c8 <col:7> col:7 implicit used operator= 'Timestamp &(const Timestamp &) noexcept' inline default trivial
| |-ParmVarDecl 0x56469a9025d8 <col:7> col:7 used 'const Timestamp &'
| `-CompoundStmt 0x56469a9030c8 <col:7>
|   |-CXXMemberCallExpr 0x56469a903068 <col:7> 'Timestamp::rep_t' lvalue
|   | |-MemberExpr 0x56469a902fa8 <col:7> '<bound member function type>' .operator= 0x56469a902678
|   | | `-MemberExpr 0x56469a902eb8 <col:7> 'Timestamp::rep_t' lvalue ->_t 0x56469abf4838
|   | |   `-CXXThisExpr 0x56469a902ea8 <col:7> 'Timestamp *' this
|   | `-MemberExpr 0x56469a902f78 <col:7> 'const Timestamp::rep_t' lvalue ._t 0x56469abf4838
|   |   `-DeclRefExpr 0x56469a902f58 <col:7> 'const Timestamp' lvalue ParmVar 0x56469a9025d8 '' 'const Timestamp &'
|   `-ReturnStmt 0x56469a9030b8 <col:7>
|     `-UnaryOperator 0x56469a9030a0 <col:7> 'Timestamp' lvalue prefix '*' cannot overflow
|       `-CXXThisExpr 0x56469a903090 <col:7> 'Timestamp *' this
`-CXXMethodDecl 0x56469a902978 <col:7> col:7 implicit used operator= 'Timestamp &(Timestamp &&) noexcept' inline default trivial
  |-ParmVarDecl 0x56469a902a88 <col:7> col:7 used 'Timestamp &&'
  `-CompoundStmt 0x56469ac90d88 <col:7>
    |-CXXMemberCallExpr 0x56469ac90d28 <col:7> 'Timestamp::rep_t' lvalue
    | |-MemberExpr 0x56469ac90c90 <col:7> '<bound member function type>' .operator= 0x56469a9027f8
    | | `-MemberExpr 0x56469ac90b60 <col:7> 'Timestamp::rep_t' lvalue ->_t 0x56469abf4838
    | |   `-CXXThisExpr 0x56469ac90b50 <col:7> 'Timestamp *' this
    | `-MemberExpr 0x56469ac90c60 <col:7> 'Timestamp::rep_t' xvalue ._t 0x56469abf4838
    |   `-CXXStaticCastExpr 0x56469ac90c30 <col:7> 'Timestamp' xvalue static_cast<class Timestamp &&> <NoOp>
    |     `-DeclRefExpr 0x56469ac90c00 <col:7> 'Timestamp' lvalue ParmVar 0x56469a902a88 '' 'Timestamp &&'
    `-ReturnStmt 0x56469ac90d78 <col:7>
      `-UnaryOperator 0x56469ac90d60 <col:7> 'Timestamp' lvalue prefix '*' cannot overflow
        `-CXXThisExpr 0x56469ac90d50 <col:7> 'Timestamp *' this

Layout: <CGRecordLayout
  LLVMType:%class.Timestamp = type { %"union.Timestamp::rep_t" }
  NonVirtualBaseLLVMType:%class.Timestamp = type { %"union.Timestamp::rep_t" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x56469ad0da80 <../dummy_inc/click/vector.hh:11:1, line:71:1> line:11:30 class vector_memory definition
|-DefinitionData standard_layout has_user_declared_ctor can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor simple trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveConstructor
| |-CopyAssignment trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveAssignment
| `-Destructor non_trivial user_declared
|-TemplateArgument type 'sized_array_memory<16>'
|-CXXRecordDecl 0x56469ad0dc58 prev 0x56469ad0da80 <col:24, col:30> col:30 implicit class vector_memory
|-AccessSpecDecl 0x56469ad0dce8 <col:46, col:52> col:46 public
|-TypedefDecl 0x56469ad0dd10 <line:12:5, col:17> col:17 size_type 'int'
| `-BuiltinType 0x56469a6f2580 'int'
|-TypedefDecl 0x56469ad0f8e0 <line:13:5, col:31> col:31 type 'typename sized_array_memory<16>::type':'char_array<16>'
| `-ElaboratedType 0x56469ad0f890 'typename sized_array_memory<16>::type' sugar
|   `-TypedefType 0x56469ad0e1c0 'sized_array_memory<16>::type' sugar
|     |-Typedef 0x56469ad0e0c0 'type'
|     `-TemplateSpecializationType 0x56469ad0e050 'char_array<16UL>' sugar char_array
|       |-TemplateArgument expr
|       | `-ConstantExpr 0x56469ad0df30 <../dummy_inc/click/array_memory.hh:11:24> 'unsigned long' Int: 16
|       |   `-SubstNonTypeTemplateParmExpr 0x56469ad0df10 <col:24> 'unsigned long'
|       |     `-IntegerLiteral 0x56469ad0def0 <col:24> 'unsigned long' 16
|       `-RecordType 0x56469ad0e030 'char_array<16>'
|         `-ClassTemplateSpecialization 0x56469ad0df50 'char_array'
|-TypedefDecl 0x56469ad0f998 <../dummy_inc/click/vector.hh:14:5, col:19> col:19 iterator 'vector_memory<sized_array_memory<16> >::type *'
| `-PointerType 0x56469ad0f960 'vector_memory<sized_array_memory<16> >::type *'
|   `-TypedefType 0x56469ad0f940 'vector_memory<sized_array_memory<16> >::type' sugar
|     |-Typedef 0x56469ad0f8e0 'type'
|     `-ElaboratedType 0x56469ad0f890 'typename sized_array_memory<16>::type' sugar
|       `-TypedefType 0x56469ad0e1c0 'sized_array_memory<16>::type' sugar
|         |-Typedef 0x56469ad0e0c0 'type'
|         `-TemplateSpecializationType 0x56469ad0e050 'char_array<16UL>' sugar char_array
|           |-TemplateArgument expr
|           | `-ConstantExpr 0x56469ad0df30 <../dummy_inc/click/array_memory.hh:11:24> 'unsigned long' Int: 16
|           |   `-SubstNonTypeTemplateParmExpr 0x56469ad0df10 <col:24> 'unsigned long'
|           |     `-IntegerLiteral 0x56469ad0def0 <col:24> 'unsigned long' 16
|           `-RecordType 0x56469ad0e030 'char_array<16>'
|             `-ClassTemplateSpecialization 0x56469ad0df50 'char_array'
|-CXXMethodDecl 0x56469ad0fb18 <../dummy_inc/click/vector.hh:15:5, line:18:5> line:15:17 need_argument_copy 'bool (const vector_memory<sized_array_memory<16> >::type *) const' inline
| `-ParmVarDecl 0x56469ad0fa28 <col:36, col:48> col:48 argp 'const vector_memory<sized_array_memory<16> >::type *'
|-CXXConstructorDecl 0x56469ad0fc08 <line:20:5, line:22:5> line:20:5 vector_memory 'void ()'
|-CXXDestructorDecl 0x56469ad0fce8 <line:23:5, col:20> col:5 ~vector_memory 'void ()' noexcept-unevaluated 0x56469ad0fce8
|-CXXMethodDecl 0x56469ad0ffb8 <line:25:5, col:43> col:10 assign 'void (const vector_memory<sized_array_memory<16> > &)'
| `-ParmVarDecl 0x56469ad0fec0 <col:17, col:42> col:42 x 'const vector_memory<sized_array_memory<16> > &'
|-CXXMethodDecl 0x56469ad101f8 <line:26:5, col:44> col:10 assign 'void (vector_memory::size_type, const vector_memory<sized_array_memory<16> >::type *)'
| |-ParmVarDecl 0x56469ad10070 <col:17, col:27> col:27 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x56469ad100e8 <col:30, col:42> col:42 vp 'const vector_memory<sized_array_memory<16> >::type *'
|-CXXMethodDecl 0x56469ad103c8 <line:27:5, col:44> col:10 resize 'void (vector_memory::size_type, const vector_memory<sized_array_memory<16> >::type *)'
| |-ParmVarDecl 0x56469ad102b8 <col:17, col:27> col:27 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x56469ad10330 <col:30, col:42> col:42 vp 'const vector_memory<sized_array_memory<16> >::type *'
|-CXXMethodDecl 0x56469ad10528 <line:28:5, line:30:5> line:28:14 begin 'vector_memory<sized_array_memory<16> >::iterator ()'
|-CXXMethodDecl 0x56469ad105f8 <line:31:5, line:33:5> line:31:14 end 'vector_memory<sized_array_memory<16> >::iterator ()'
|-CXXMethodDecl 0x56469ad10848 <line:34:5, col:48> col:14 insert 'vector_memory<sized_array_memory<16> >::iterator (vector_memory<sized_array_memory<16> >::iterator, const vector_memory<sized_array_memory<16> >::type *)'
| |-ParmVarDecl 0x56469ad106b8 <col:21, col:30> col:30 it 'vector_memory<sized_array_memory<16> >::iterator':'vector_memory<sized_array_memory<16> >::type *'
| `-ParmVarDecl 0x56469ad10730 <col:34, col:46> col:46 vp 'const vector_memory<sized_array_memory<16> >::type *'
|-CXXMethodDecl 0x56469ad10aa8 <line:35:5, col:42> col:14 erase 'vector_memory<sized_array_memory<16> >::iterator (vector_memory<sized_array_memory<16> >::iterator, vector_memory<sized_array_memory<16> >::iterator)'
| |-ParmVarDecl 0x56469ad10918 <col:20, col:29> col:29 a 'vector_memory<sized_array_memory<16> >::iterator':'vector_memory<sized_array_memory<16> >::type *'
| `-ParmVarDecl 0x56469ad10990 <col:32, col:41> col:41 b 'vector_memory<sized_array_memory<16> >::iterator':'vector_memory<sized_array_memory<16> >::type *'
|-CXXMethodDecl 0x56469ad10c68 <line:36:5, line:43:5> line:36:17 push_back 'void (const vector_memory<sized_array_memory<16> >::type *)' inline
| `-ParmVarDecl 0x56469ad10b78 <col:27, col:39> col:39 vp 'const vector_memory<sized_array_memory<16> >::type *'
|-CXXMethodDecl 0x56469ad10e28 <line:45:5, line:52:5> line:45:17 move_construct_back 'void (vector_memory<sized_array_memory<16> >::type *)' inline
| `-ParmVarDecl 0x56469ad10d30 <col:37, col:43> col:43 vp 'vector_memory<sized_array_memory<16> >::type *'
|-CXXMethodDecl 0x56469ad1d178 <line:54:5, line:59:5> line:54:17 pop_back 'void ()' inline
|-CXXMethodDecl 0x56469ad1d228 <line:60:5, line:64:5> line:60:17 clear 'void ()' inline
|-CXXMethodDecl 0x56469ad1d468 <line:65:5, col:59> col:10 reserve_and_push_back 'bool (vector_memory::size_type, const vector_memory<sized_array_memory<16> >::type *)'
| |-ParmVarDecl 0x56469ad1d2d8 <col:32, col:42> col:42 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x56469ad1d350 <col:45, col:57> col:57 vp 'const vector_memory<sized_array_memory<16> >::type *'
|-CXXMethodDecl 0x56469ad1d708 <line:66:5, col:35> col:10 swap 'void (vector_memory<sized_array_memory<16> > &)'
| `-ParmVarDecl 0x56469ad1d610 <col:15, col:34> col:34 x 'vector_memory<sized_array_memory<16> > &'
|-FieldDecl 0x56469ad1d7d0 <line:68:5, col:11> col:11 l_ 'vector_memory<sized_array_memory<16> >::type *'
|-FieldDecl 0x56469ad1d820 <line:69:5, col:15> col:15 n_ 'vector_memory::size_type':'int'
`-FieldDecl 0x56469ad1d870 <line:70:5, col:15> col:15 capacity_ 'vector_memory::size_type':'int'

Layout: <CGRecordLayout
  LLVMType:%class.vector_memory.1 = type { %struct.char_array.2*, i32, i32 }
  NonVirtualBaseLLVMType:%class.vector_memory.1 = type { %struct.char_array.2*, i32, i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x56469ad0c5d8 <../dummy_inc/click/ipaddress.hh:13:1, col:29> ../dummy_inc/click/vector.hh:111:7 class Vector definition
|-DefinitionData standard_layout has_user_declared_ctor has_mutable_fields can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor non_trivial user_declared has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveConstructor exists non_trivial user_declared needs_overload_resolution
| |-CopyAssignment non_trivial has_const_param user_declared needs_overload_resolution implicit_has_const_param
| |-MoveAssignment exists non_trivial user_declared needs_overload_resolution
| `-Destructor simple non_trivial needs_overload_resolution
|-TemplateArgument type 'TimerSet::heap_element'
|-CXXRecordDecl 0x56469ad0c7e8 prev 0x56469ad0c5d8 <col:1, col:7> col:7 implicit class Vector
|-TypedefDecl 0x56469ad0d9f0 <line:113:5, col:44> col:44 array_memory_type 'typename array_memory<heap_element>::type':'sized_array_memory<16>'
| `-ElaboratedType 0x56469ad0d9a0 'typename array_memory<heap_element>::type' sugar
|   `-TypedefType 0x56469ad0d980 'conditional<true, sized_array_memory<16>, typed_array_memory<TimerSet::heap_element> >::type' sugar
|     |-Typedef 0x56469ad0d830 'type'
|     `-SubstTemplateTypeParmType 0x56469ad0d650 'sized_array_memory<16>' sugar
|       |-TemplateTypeParmType 0x56469a9bee80 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x56469a9bee28 'T'
|       `-RecordType 0x56469ad0d1a0 'sized_array_memory<16>'
|         `-ClassTemplateSpecialization 0x56469ad0d0b8 'sized_array_memory'
|-FieldDecl 0x56469ad1d8c0 <line:114:5, col:46> col:46 vm_ 'vector_memory<Vector<TimerSet::heap_element>::array_memory_type>':'vector_memory<sized_array_memory<16> >' mutable
|-AccessSpecDecl 0x56469ad1d910 <line:116:3, col:9> col:3 public
|-TypedefDecl 0x56469ad1d948 <line:118:5, col:15> col:15 value_type 'TimerSet::heap_element':'TimerSet::heap_element'
| `-SubstTemplateTypeParmType 0x56469ad0c880 'TimerSet::heap_element' sugar
|   |-TemplateTypeParmType 0x56469a9f6d90 'T' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x56469a9f6d38 'T'
|   `-RecordType 0x56469ad0b7e0 'TimerSet::heap_element'
|     `-CXXRecord 0x56469ad0b750 'heap_element'
|-TypedefDecl 0x56469ad1da08 <line:119:5, col:16> col:16 reference 'TimerSet::heap_element &'
| `-LValueReferenceType 0x56469ad1d9d0 'TimerSet::heap_element &'
|   `-SubstTemplateTypeParmType 0x56469ad0c880 'TimerSet::heap_element' sugar
|     |-TemplateTypeParmType 0x56469a9f6d90 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x56469a9f6d38 'T'
|     `-RecordType 0x56469ad0b7e0 'TimerSet::heap_element'
|       `-CXXRecord 0x56469ad0b750 'heap_element'
|-TypedefDecl 0x56469ad1da98 <line:120:5, col:22> col:22 const_reference 'const TimerSet::heap_element &'
| `-LValueReferenceType 0x56469ad1da60 'const TimerSet::heap_element &'
|   `-QualType 0x56469ad0c881 'const TimerSet::heap_element' const
|     `-SubstTemplateTypeParmType 0x56469ad0c880 'TimerSet::heap_element' sugar
|       |-TemplateTypeParmType 0x56469a9f6d90 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x56469a9f6d38 'T'
|       `-RecordType 0x56469ad0b7e0 'TimerSet::heap_element'
|         `-CXXRecord 0x56469ad0b750 'heap_element'
|-TypedefDecl 0x56469ad1db28 <line:121:5, col:16> col:16 pointer 'TimerSet::heap_element *'
| `-PointerType 0x56469ad1daf0 'TimerSet::heap_element *'
|   `-SubstTemplateTypeParmType 0x56469ad0c880 'TimerSet::heap_element' sugar
|     |-TemplateTypeParmType 0x56469a9f6d90 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x56469a9f6d38 'T'
|     `-RecordType 0x56469ad0b7e0 'TimerSet::heap_element'
|       `-CXXRecord 0x56469ad0b750 'heap_element'
|-TypedefDecl 0x56469ad1dbe8 <line:122:5, col:22> col:22 const_pointer 'const TimerSet::heap_element *'
| `-PointerType 0x56469ad1dbb0 'const TimerSet::heap_element *'
|   `-QualType 0x56469ad0c881 'const TimerSet::heap_element' const
|     `-SubstTemplateTypeParmType 0x56469ad0c880 'TimerSet::heap_element' sugar
|       |-TemplateTypeParmType 0x56469a9f6d90 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x56469a9f6d38 'T'
|       `-RecordType 0x56469ad0b7e0 'TimerSet::heap_element'
|         `-CXXRecord 0x56469ad0b750 'heap_element'
|-TypedefDecl 0x56469ad1e840 <line:125:5, col:45> col:45 value_argument_type 'typename fast_argument<heap_element>::type':'const TimerSet::heap_element &'
| `-ElaboratedType 0x56469ad1e7f0 'typename fast_argument<heap_element>::type' sugar
|   `-TypedefType 0x56469ad1e7d0 'fast_argument<TimerSet::heap_element, true>::type' sugar
|     |-Typedef 0x56469ad1e708 'type'
|     `-LValueReferenceType 0x56469ad1e6d0 'const TimerSet::heap_element &'
|       `-QualType 0x56469ad1e471 'const TimerSet::heap_element' const
|         `-SubstTemplateTypeParmType 0x56469ad1e470 'TimerSet::heap_element' sugar
|           |-TemplateTypeParmType 0x56469a9c9770 'T' dependent depth 0 index 0
|           | `-TemplateTypeParm 0x56469a9c9718 'T'
|           `-RecordType 0x56469ad0b7e0 'TimerSet::heap_element'
|             `-CXXRecord 0x56469ad0b750 'heap_element'
|-TypedefDecl 0x56469ad1e8a8 <line:126:5, col:22> col:22 const_access_type 'const TimerSet::heap_element &'
| `-LValueReferenceType 0x56469ad1da60 'const TimerSet::heap_element &'
|   `-QualType 0x56469ad0c881 'const TimerSet::heap_element' const
|     `-SubstTemplateTypeParmType 0x56469ad0c880 'TimerSet::heap_element' sugar
|       |-TemplateTypeParmType 0x56469a9f6d90 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x56469a9f6d38 'T'
|       `-RecordType 0x56469ad0b7e0 'TimerSet::heap_element'
|         `-CXXRecord 0x56469ad0b750 'heap_element'
|-TypedefDecl 0x56469ad1e900 <line:128:5, col:17> col:17 size_type 'int'
| `-BuiltinType 0x56469a6f2580 'int'
|-TypedefDecl 0x56469ad1e968 <line:130:5, col:16> col:16 iterator 'TimerSet::heap_element *'
| `-PointerType 0x56469ad1daf0 'TimerSet::heap_element *'
|   `-SubstTemplateTypeParmType 0x56469ad0c880 'TimerSet::heap_element' sugar
|     |-TemplateTypeParmType 0x56469a9f6d90 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x56469a9f6d38 'T'
|     `-RecordType 0x56469ad0b7e0 'TimerSet::heap_element'
|       `-CXXRecord 0x56469ad0b750 'heap_element'
|-TypedefDecl 0x56469ad1e9d0 <line:131:5, col:22> col:22 const_iterator 'const TimerSet::heap_element *'
| `-PointerType 0x56469ad1dbb0 'const TimerSet::heap_element *'
|   `-QualType 0x56469ad0c881 'const TimerSet::heap_element' const
|     `-SubstTemplateTypeParmType 0x56469ad0c880 'TimerSet::heap_element' sugar
|       |-TemplateTypeParmType 0x56469a9f6d90 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x56469a9f6d38 'T'
|       `-RecordType 0x56469ad0b7e0 'TimerSet::heap_element'
|         `-CXXRecord 0x56469ad0b750 'heap_element'
|-EnumDecl 0x56469ad1ea28 <line:134:5> col:5
| `-EnumConstantDecl 0x56469ad1eb20 <col:12, col:40> col:12 RESERVE_GROW 'Vector<TimerSet::heap_element>::(anonymous enum at ../dummy_inc/click/vector.hh:134:5)'
|   `-ConstantExpr 0x56469ad1eb00 <col:27, col:40> 'Vector::size_type':'int' Int: -1
|     `-CStyleCastExpr 0x56469a9f8418 <col:27, col:40> 'Vector::size_type':'int' <NoOp>
|       `-UnaryOperator 0x56469a9f83f0 <col:39, col:40> 'int' prefix '-'
|         `-IntegerLiteral 0x56469a9f83d0 <col:40> 'int' 1
|-CXXConstructorDecl 0x56469ad1eba8 <line:137:5, col:28> col:21 Vector 'void ()' inline
|-CXXConstructorDecl 0x56469ad1ee38 <line:138:5, col:62> col:21 Vector 'void (Vector::size_type, Vector<TimerSet::heap_element>::value_argument_type)' inline
| |-ParmVarDecl 0x56469ad1ec60 <col:28, col:38> col:38 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x56469ad1ed00 <col:41, col:61> col:61 v 'Vector<TimerSet::heap_element>::value_argument_type':'const TimerSet::heap_element &'
|-CXXConstructorDecl 0x56469ad1f0f8 <line:139:5, col:37> col:12 Vector 'void (const Vector<TimerSet::heap_element> &)' inline
| `-ParmVarDecl 0x56469ad1efe0 <col:19, col:36> col:36 x 'const Vector<TimerSet::heap_element> &'
|-CXXConstructorDecl 0x56469ad1f3b8 <line:141:5, col:32> col:12 Vector 'void (Vector<TimerSet::heap_element> &&)' inline
| `-ParmVarDecl 0x56469ad1f2a0 <col:19, col:31> col:31 x 'Vector<TimerSet::heap_element> &&'
|-CXXMethodDecl 0x56469ad1f700 <line:144:5, col:51> col:23 operator= 'Vector<TimerSet::heap_element> &(const Vector<TimerSet::heap_element> &)' inline
| `-ParmVarDecl 0x56469ad1f5e0 <col:33, col:50> col:50 x 'const Vector<TimerSet::heap_element> &'
|-CXXMethodDecl 0x56469ad1fa10 <line:146:5, col:46> col:23 operator= 'Vector<TimerSet::heap_element> &(Vector<TimerSet::heap_element> &&)' inline
| `-ParmVarDecl 0x56469ad1f8f0 <col:33, col:45> col:45 x 'Vector<TimerSet::heap_element> &&'
|-CXXMethodDecl 0x56469ad1fd00 <line:148:5, col:70> col:23 assign 'Vector<TimerSet::heap_element> &(Vector::size_type, Vector<TimerSet::heap_element>::value_argument_type)' inline
| |-ParmVarDecl 0x56469ad1fb48 <col:30, col:40> col:40 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x56469ad1fbc0 <col:43, col:69> col:63 v 'Vector<TimerSet::heap_element>::value_argument_type':'const TimerSet::heap_element &'
|-CXXMethodDecl 0x56469ad1fe58 <line:150:5, col:55> col:49 begin 'Vector<TimerSet::heap_element>::iterator ()'
| |-NoInlineAttr 0x56469ad1ff38 <col:20> Inherited
| `-OptimizeNoneAttr 0x56469ad1ff90 <col:30> Inherited
|-CXXMethodDecl 0x56469ad1ffd8 <line:151:5, col:53> col:49 end 'Vector<TimerSet::heap_element>::iterator ()'
| |-NoInlineAttr 0x56469ad20088 <col:20> Inherited
| `-OptimizeNoneAttr 0x56469ad200e0 <col:30> Inherited
|-CXXMethodDecl 0x56469ad201a8 <line:152:5, col:63> col:55 begin 'Vector<TimerSet::heap_element>::const_iterator () const'
| |-NoInlineAttr 0x56469ad20258 <col:20> Inherited
| `-OptimizeNoneAttr 0x56469ad202b0 <col:30> Inherited
|-CXXMethodDecl 0x56469ad202f8 <line:153:5, col:61> col:55 end 'Vector<TimerSet::heap_element>::const_iterator () const'
| |-NoInlineAttr 0x56469ad203a8 <col:20> Inherited
| `-OptimizeNoneAttr 0x56469ad20400 <col:30> Inherited
|-CXXMethodDecl 0x56469ad20448 <line:154:5, col:64> col:55 cbegin 'Vector<TimerSet::heap_element>::const_iterator () const'
| |-NoInlineAttr 0x56469ad204f8 <col:20> Inherited
| `-OptimizeNoneAttr 0x56469ad20550 <col:30> Inherited
|-CXXMethodDecl 0x56469ad20598 <line:155:5, col:62> col:55 cend 'Vector<TimerSet::heap_element>::const_iterator () const'
| |-NoInlineAttr 0x56469ad20648 <col:20> Inherited
| `-OptimizeNoneAttr 0x56469ad206a0 <col:30> Inherited
|-CXXMethodDecl 0x56469ad206c8 <line:157:5, col:29> col:22 used size 'Vector::size_type () const' inline
|-CXXMethodDecl 0x56469ad20778 <line:158:5, col:33> col:22 capacity 'Vector::size_type () const' inline
|-CXXMethodDecl 0x56469ad20828 <line:159:5, col:25> col:17 used empty 'bool () const' inline
|-CXXMethodDecl 0x56469ad209e8 <line:160:5, col:64> col:17 resize 'void (Vector::size_type, Vector<TimerSet::heap_element>::value_argument_type)' inline
| |-ParmVarDecl 0x56469ad208d8 <col:24, col:34> col:34 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x56469ad20950 <col:37, col:63> col:57 v 'Vector<TimerSet::heap_element>::value_argument_type':'const TimerSet::heap_element &'
|-CXXMethodDecl 0x56469ad20b38 <line:161:5, col:36> col:17 reserve 'bool (Vector::size_type)' inline
| `-ParmVarDecl 0x56469ad20aa8 <col:25, col:35> col:35 n 'Vector::size_type':'int'
|-CXXMethodDecl 0x56469ad20ce8 <line:163:5, col:65> col:43 operator[] 'TimerSet::heap_element &(Vector::size_type)'
| |-ParmVarDecl 0x56469ad20bf0 <col:54, col:64> col:64 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x56469ad20da0 <col:20>
| `-OptimizeNoneAttr 0x56469ad20df8 <col:30>
|-CXXMethodDecl 0x56469ad20f18 <line:164:5, col:73> col:49 operator[] 'const TimerSet::heap_element &(Vector::size_type) const'
| |-ParmVarDecl 0x56469ad20e20 <col:60, col:70> col:70 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x56469ad20fd0 <col:20>
| `-OptimizeNoneAttr 0x56469ad21028 <col:30>
|-CXXMethodDecl 0x56469ad210e0 <line:165:5, col:29> col:15 at 'TimerSet::heap_element &(Vector::size_type)' inline
| `-ParmVarDecl 0x56469ad21050 <col:18, col:28> col:28 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x56469ad21228 <line:166:5, col:37> col:21 at 'const TimerSet::heap_element &(Vector::size_type) const' inline
| `-ParmVarDecl 0x56469ad21198 <col:24, col:34> col:34 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x56469ad21358 <line:167:5, col:21> col:15 front 'TimerSet::heap_element &()' inline
|-CXXMethodDecl 0x56469ad21488 <line:168:5, col:29> col:21 front 'const TimerSet::heap_element &() const' inline
|-CXXMethodDecl 0x56469ad21558 <line:169:5, col:20> col:15 back 'TimerSet::heap_element &()' inline
|-CXXMethodDecl 0x56469ad21628 <line:170:5, col:28> col:21 back 'const TimerSet::heap_element &() const' inline
|-CXXMethodDecl 0x56469ad21768 <line:172:5, col:39> col:15 used unchecked_at 'TimerSet::heap_element &(Vector::size_type)' inline
| `-ParmVarDecl 0x56469ad216d8 <col:28, col:38> col:38 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x56469ad218b0 <line:173:5, col:47> col:21 unchecked_at 'const TimerSet::heap_element &(Vector::size_type) const' inline
| `-ParmVarDecl 0x56469ad21820 <col:34, col:44> col:44 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x56469ad219f8 <line:174:5, col:59> col:15 at_u 'TimerSet::heap_element &(Vector::size_type)' inline
| |-ParmVarDecl 0x56469ad21968 <col:20, col:30> col:30 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x56469ad21ab0 <col:48> Inherited "" ""
|-CXXMethodDecl 0x56469ad21bb0 <line:175:5, col:71> col:21 at_u 'const TimerSet::heap_element &(Vector::size_type) const' inline
| |-ParmVarDecl 0x56469ad21b20 <col:26, col:36> col:36 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x56469ad21c68 <col:60> Inherited "" ""
|-CXXMethodDecl 0x56469ad21d28 <line:177:5, col:20> col:15 data 'TimerSet::heap_element *()' inline
|-CXXMethodDecl 0x56469ad21e28 <line:178:5, col:28> col:21 data 'const TimerSet::heap_element *() const' inline
|-CXXMethodDecl 0x56469ad21fd8 <line:180:5, col:48> col:17 push_back 'void (Vector<TimerSet::heap_element>::value_argument_type)' inline
| `-ParmVarDecl 0x56469ad21ee8 <col:27, col:47> col:47 v 'Vector<TimerSet::heap_element>::value_argument_type':'const TimerSet::heap_element &'
|-FunctionTemplateDecl 0x56469ad22798 <line:182:5, line:183:63> col:48 push_back
| |-TemplateTypeParmDecl 0x56469ad22090 <line:182:15, col:43> col:24 typename depth 0 index 0 A
| | `-TemplateArgument type 'fast_argument<TimerSet::heap_element>':'fast_argument<TimerSet::heap_element, true>'
| `-CXXMethodDecl 0x56469ad226f8 <line:183:5, col:63> col:48 push_back 'typename A::enable_rvalue_reference (TimerSet::heap_element &&)' inline
|   `-ParmVarDecl 0x56469ad225f8 <col:58, col:62> col:62 v 'TimerSet::heap_element &&'
|-CXXMethodDecl 0x56469ad22878 <line:185:5, col:26> col:17 pop_back 'void ()' inline
|-CXXMethodDecl 0x56469ad229c8 <line:186:5, col:49> col:17 push_front 'void (Vector<TimerSet::heap_element>::value_argument_type)' inline
| `-ParmVarDecl 0x56469ad22938 <col:28, col:48> col:48 v 'Vector<TimerSet::heap_element>::value_argument_type':'const TimerSet::heap_element &'
|-CXXMethodDecl 0x56469ad22a80 <line:187:5, col:27> col:17 pop_front 'void ()' inline
|-CXXMethodDecl 0x56469ad22cc8 <line:189:5, col:62> col:21 insert 'Vector<TimerSet::heap_element>::iterator (Vector<TimerSet::heap_element>::iterator, Vector<TimerSet::heap_element>::value_argument_type)' inline
| |-ParmVarDecl 0x56469ad22b40 <col:28, col:37> col:37 it 'Vector<TimerSet::heap_element>::iterator':'TimerSet::heap_element *'
| `-ParmVarDecl 0x56469ad22bb8 <col:41, col:61> col:61 v 'Vector<TimerSet::heap_element>::value_argument_type':'const TimerSet::heap_element &'
|-CXXMethodDecl 0x56469ad22e88 <line:190:5, col:38> col:21 erase 'Vector<TimerSet::heap_element>::iterator (Vector<TimerSet::heap_element>::iterator)' inline
| `-ParmVarDecl 0x56469ad22d98 <col:27, col:36> col:36 it 'Vector<TimerSet::heap_element>::iterator':'TimerSet::heap_element *'
|-CXXMethodDecl 0x56469ad230d8 <line:191:5, col:49> col:21 erase 'Vector<TimerSet::heap_element>::iterator (Vector<TimerSet::heap_element>::iterator, Vector<TimerSet::heap_element>::iterator)' inline
| |-ParmVarDecl 0x56469ad22f50 <col:27, col:36> col:36 a 'Vector<TimerSet::heap_element>::iterator':'TimerSet::heap_element *'
| `-ParmVarDecl 0x56469ad22fc8 <col:39, col:48> col:48 b 'Vector<TimerSet::heap_element>::iterator':'TimerSet::heap_element *'
|-CXXMethodDecl 0x56469ad23198 <line:193:5, col:23> col:17 clear 'void ()' inline
|-CXXMethodDecl 0x56469ad233f8 <line:195:5, col:34> col:17 swap 'void (Vector<TimerSet::heap_element> &)' inline
| `-ParmVarDecl 0x56469ad23300 <col:22, col:33> col:33 x 'Vector<TimerSet::heap_element> &'
`-CXXDestructorDecl 0x56469ad234c8 <../dummy_inc/click/ipaddress.hh:13:29> col:29 implicit ~Vector 'void ()' inline default noexcept-unevaluated 0x56469ad234c8

Layout: <CGRecordLayout
  LLVMType:%class.Vector.0 = type { %class.vector_memory.1 }
  NonVirtualBaseLLVMType:%class.Vector.0 = type { %class.vector_memory.1 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x56469ad23610 <../dummy_inc/click/ipaddress.hh:13:1, col:29> ../dummy_inc/click/vector.hh:111:7 class Vector definition
|-DefinitionData standard_layout has_user_declared_ctor has_mutable_fields can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor non_trivial user_declared has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveConstructor exists non_trivial user_declared needs_overload_resolution
| |-CopyAssignment non_trivial has_const_param user_declared needs_overload_resolution implicit_has_const_param
| |-MoveAssignment exists non_trivial user_declared needs_overload_resolution
| `-Destructor simple non_trivial needs_overload_resolution
|-TemplateArgument type 'Timer *'
|-CXXRecordDecl 0x56469ad23818 prev 0x56469ad23610 <col:1, col:7> col:7 implicit class Vector
|-TypedefDecl 0x56469ad24960 <line:113:5, col:44> col:44 array_memory_type 'typename array_memory<Timer *>::type':'sized_array_memory<8>'
| `-ElaboratedType 0x56469ad24910 'typename array_memory<Timer *>::type' sugar
|   `-TypedefType 0x56469ad248f0 'conditional<true, sized_array_memory<8>, typed_array_memory<Timer *> >::type' sugar
|     |-Typedef 0x56469ad247a0 'type'
|     `-SubstTemplateTypeParmType 0x56469ad245c0 'sized_array_memory<8>' sugar
|       |-TemplateTypeParmType 0x56469a9bee80 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x56469a9bee28 'T'
|       `-RecordType 0x56469ad24110 'sized_array_memory<8>'
|         `-ClassTemplateSpecialization 0x56469ad24028 'sized_array_memory'
|-FieldDecl 0x56469ad285b0 <line:114:5, col:46> col:46 vm_ 'vector_memory<Vector<Timer *>::array_memory_type>':'vector_memory<sized_array_memory<8> >' mutable
|-AccessSpecDecl 0x56469ad28600 <line:116:3, col:9> col:3 public
|-TypedefDecl 0x56469ad28638 <line:118:5, col:15> col:15 value_type 'Timer *':'Timer *'
| `-SubstTemplateTypeParmType 0x56469ad238b0 'Timer *' sugar
|   |-TemplateTypeParmType 0x56469a9f6d90 'T' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x56469a9f6d38 'T'
|   `-PointerType 0x56469ac5b920 'Timer *'
|     `-RecordType 0x56469ac5aa70 'Timer'
|       `-CXXRecord 0x56469ac78598 'Timer'
|-TypedefDecl 0x56469ad286f8 <line:119:5, col:16> col:16 reference 'Timer *&'
| `-LValueReferenceType 0x56469ad286c0 'Timer *&'
|   `-SubstTemplateTypeParmType 0x56469ad238b0 'Timer *' sugar
|     |-TemplateTypeParmType 0x56469a9f6d90 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x56469a9f6d38 'T'
|     `-PointerType 0x56469ac5b920 'Timer *'
|       `-RecordType 0x56469ac5aa70 'Timer'
|         `-CXXRecord 0x56469ac78598 'Timer'
|-TypedefDecl 0x56469ad287b8 <line:120:5, col:22> col:22 const_reference 'Timer *const &'
| `-LValueReferenceType 0x56469ad28780 'Timer *const &'
|   `-QualType 0x56469ad238b1 'Timer *const' const
|     `-SubstTemplateTypeParmType 0x56469ad238b0 'Timer *' sugar
|       |-TemplateTypeParmType 0x56469a9f6d90 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x56469a9f6d38 'T'
|       `-PointerType 0x56469ac5b920 'Timer *'
|         `-RecordType 0x56469ac5aa70 'Timer'
|           `-CXXRecord 0x56469ac78598 'Timer'
|-TypedefDecl 0x56469ad28878 <line:121:5, col:16> col:16 pointer 'Timer **'
| `-PointerType 0x56469ad28840 'Timer **'
|   `-SubstTemplateTypeParmType 0x56469ad238b0 'Timer *' sugar
|     |-TemplateTypeParmType 0x56469a9f6d90 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x56469a9f6d38 'T'
|     `-PointerType 0x56469ac5b920 'Timer *'
|       `-RecordType 0x56469ac5aa70 'Timer'
|         `-CXXRecord 0x56469ac78598 'Timer'
|-TypedefDecl 0x56469ad28938 <line:122:5, col:22> col:22 const_pointer 'Timer *const *'
| `-PointerType 0x56469ad28900 'Timer *const *'
|   `-QualType 0x56469ad238b1 'Timer *const' const
|     `-SubstTemplateTypeParmType 0x56469ad238b0 'Timer *' sugar
|       |-TemplateTypeParmType 0x56469a9f6d90 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x56469a9f6d38 'T'
|       `-PointerType 0x56469ac5b920 'Timer *'
|         `-RecordType 0x56469ac5aa70 'Timer'
|           `-CXXRecord 0x56469ac78598 'Timer'
|-TypedefDecl 0x56469ad29510 <line:125:5, col:45> col:45 value_argument_type 'typename fast_argument<Timer *>::type':'Timer *'
| `-ElaboratedType 0x56469ad294c0 'typename fast_argument<Timer *>::type' sugar
|   `-TypedefType 0x56469ad294a0 'fast_argument<Timer *, false>::type' sugar
|     |-Typedef 0x56469ad29430 'type'
|     `-SubstTemplateTypeParmType 0x56469ad291f0 'Timer *' sugar
|       |-TemplateTypeParmType 0x56469a9c9ea0 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x56469a9c9e50 'T'
|       `-PointerType 0x56469ac5b920 'Timer *'
|         `-RecordType 0x56469ac5aa70 'Timer'
|           `-CXXRecord 0x56469ac78598 'Timer'
|-TypedefDecl 0x56469ad29578 <line:126:5, col:22> col:22 const_access_type 'Timer *const &'
| `-LValueReferenceType 0x56469ad28780 'Timer *const &'
|   `-QualType 0x56469ad238b1 'Timer *const' const
|     `-SubstTemplateTypeParmType 0x56469ad238b0 'Timer *' sugar
|       |-TemplateTypeParmType 0x56469a9f6d90 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x56469a9f6d38 'T'
|       `-PointerType 0x56469ac5b920 'Timer *'
|         `-RecordType 0x56469ac5aa70 'Timer'
|           `-CXXRecord 0x56469ac78598 'Timer'
|-TypedefDecl 0x56469ad295d0 <line:128:5, col:17> col:17 size_type 'int'
| `-BuiltinType 0x56469a6f2580 'int'
|-TypedefDecl 0x56469ad29638 <line:130:5, col:16> col:16 iterator 'Timer **'
| `-PointerType 0x56469ad28840 'Timer **'
|   `-SubstTemplateTypeParmType 0x56469ad238b0 'Timer *' sugar
|     |-TemplateTypeParmType 0x56469a9f6d90 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x56469a9f6d38 'T'
|     `-PointerType 0x56469ac5b920 'Timer *'
|       `-RecordType 0x56469ac5aa70 'Timer'
|         `-CXXRecord 0x56469ac78598 'Timer'
|-TypedefDecl 0x56469ad296a0 <line:131:5, col:22> col:22 const_iterator 'Timer *const *'
| `-PointerType 0x56469ad28900 'Timer *const *'
|   `-QualType 0x56469ad238b1 'Timer *const' const
|     `-SubstTemplateTypeParmType 0x56469ad238b0 'Timer *' sugar
|       |-TemplateTypeParmType 0x56469a9f6d90 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x56469a9f6d38 'T'
|       `-PointerType 0x56469ac5b920 'Timer *'
|         `-RecordType 0x56469ac5aa70 'Timer'
|           `-CXXRecord 0x56469ac78598 'Timer'
|-EnumDecl 0x56469ad296f8 <line:134:5> col:5
| `-EnumConstantDecl 0x56469ad297f0 <col:12, col:40> col:12 RESERVE_GROW 'Vector<Timer *>::(anonymous enum at ../dummy_inc/click/vector.hh:134:5)'
|   `-ConstantExpr 0x56469ad297d0 <col:27, col:40> 'Vector::size_type':'int' Int: -1
|     `-CStyleCastExpr 0x56469a9f8418 <col:27, col:40> 'Vector::size_type':'int' <NoOp>
|       `-UnaryOperator 0x56469a9f83f0 <col:39, col:40> 'int' prefix '-'
|         `-IntegerLiteral 0x56469a9f83d0 <col:40> 'int' 1
|-CXXConstructorDecl 0x56469ad29878 <line:137:5, col:28> col:21 Vector 'void ()' inline
|-CXXConstructorDecl 0x56469ad29b08 <line:138:5, col:62> col:21 Vector 'void (Vector::size_type, Vector<Timer *>::value_argument_type)' inline
| |-ParmVarDecl 0x56469ad29930 <col:28, col:38> col:38 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x56469ad299d0 <col:41, col:61> col:61 v 'Vector<Timer *>::value_argument_type':'Timer *'
|-CXXConstructorDecl 0x56469ad29dc8 <line:139:5, col:37> col:12 Vector 'void (const Vector<Timer *> &)' inline
| `-ParmVarDecl 0x56469ad29cb0 <col:19, col:36> col:36 x 'const Vector<Timer *> &'
|-CXXConstructorDecl 0x56469ad2a088 <line:141:5, col:32> col:12 Vector 'void (Vector<Timer *> &&)' inline
| `-ParmVarDecl 0x56469ad29f70 <col:19, col:31> col:31 x 'Vector<Timer *> &&'
|-CXXMethodDecl 0x56469ad2a3d0 <line:144:5, col:51> col:23 operator= 'Vector<Timer *> &(const Vector<Timer *> &)' inline
| `-ParmVarDecl 0x56469ad2a2b0 <col:33, col:50> col:50 x 'const Vector<Timer *> &'
|-CXXMethodDecl 0x56469ad2a6e0 <line:146:5, col:46> col:23 operator= 'Vector<Timer *> &(Vector<Timer *> &&)' inline
| `-ParmVarDecl 0x56469ad2a5c0 <col:33, col:45> col:45 x 'Vector<Timer *> &&'
|-CXXMethodDecl 0x56469ad2a9d0 <line:148:5, col:70> col:23 assign 'Vector<Timer *> &(Vector::size_type, Vector<Timer *>::value_argument_type)' inline
| |-ParmVarDecl 0x56469ad2a818 <col:30, col:40> col:40 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x56469ad2a890 <col:43, col:69> col:63 v 'Vector<Timer *>::value_argument_type':'Timer *'
|-CXXMethodDecl 0x56469ad2ab28 <line:150:5, col:55> col:49 begin 'Vector<Timer *>::iterator ()'
| |-NoInlineAttr 0x56469ad2ac08 <col:20> Inherited
| `-OptimizeNoneAttr 0x56469ad2ac60 <col:30> Inherited
|-CXXMethodDecl 0x56469ad2aca8 <line:151:5, col:53> col:49 end 'Vector<Timer *>::iterator ()'
| |-NoInlineAttr 0x56469ad2ad58 <col:20> Inherited
| `-OptimizeNoneAttr 0x56469ad2adb0 <col:30> Inherited
|-CXXMethodDecl 0x56469ad2ae78 <line:152:5, col:63> col:55 begin 'Vector<Timer *>::const_iterator () const'
| |-NoInlineAttr 0x56469ad2af28 <col:20> Inherited
| `-OptimizeNoneAttr 0x56469ad2af80 <col:30> Inherited
|-CXXMethodDecl 0x56469ad2afc8 <line:153:5, col:61> col:55 end 'Vector<Timer *>::const_iterator () const'
| |-NoInlineAttr 0x56469ad2b078 <col:20> Inherited
| `-OptimizeNoneAttr 0x56469ad2b0d0 <col:30> Inherited
|-CXXMethodDecl 0x56469ad2b118 <line:154:5, col:64> col:55 cbegin 'Vector<Timer *>::const_iterator () const'
| |-NoInlineAttr 0x56469ad2b1c8 <col:20> Inherited
| `-OptimizeNoneAttr 0x56469ad2b220 <col:30> Inherited
|-CXXMethodDecl 0x56469ad2b268 <line:155:5, col:62> col:55 cend 'Vector<Timer *>::const_iterator () const'
| |-NoInlineAttr 0x56469ad2b318 <col:20> Inherited
| `-OptimizeNoneAttr 0x56469ad2b370 <col:30> Inherited
|-CXXMethodDecl 0x56469ad2b398 <line:157:5, col:29> col:22 size 'Vector::size_type () const' inline
|-CXXMethodDecl 0x56469ad2b448 <line:158:5, col:33> col:22 capacity 'Vector::size_type () const' inline
|-CXXMethodDecl 0x56469ad2b4f8 <line:159:5, col:25> col:17 empty 'bool () const' inline
|-CXXMethodDecl 0x56469ad2b6b8 <line:160:5, col:64> col:17 resize 'void (Vector::size_type, Vector<Timer *>::value_argument_type)' inline
| |-ParmVarDecl 0x56469ad2b5a8 <col:24, col:34> col:34 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x56469ad2b620 <col:37, col:63> col:57 v 'Vector<Timer *>::value_argument_type':'Timer *'
|-CXXMethodDecl 0x56469ad2b808 <line:161:5, col:36> col:17 reserve 'bool (Vector::size_type)' inline
| `-ParmVarDecl 0x56469ad2b778 <col:25, col:35> col:35 n 'Vector::size_type':'int'
|-CXXMethodDecl 0x56469ad2b9b8 <line:163:5, col:65> col:43 operator[] 'Timer *&(Vector::size_type)'
| |-ParmVarDecl 0x56469ad2b8c0 <col:54, col:64> col:64 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x56469ad2ba70 <col:20>
| `-OptimizeNoneAttr 0x56469ad2bac8 <col:30>
|-CXXMethodDecl 0x56469ad2bbe8 <line:164:5, col:73> col:49 operator[] 'Timer *const &(Vector::size_type) const'
| |-ParmVarDecl 0x56469ad2baf0 <col:60, col:70> col:70 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x56469ad2bca0 <col:20>
| `-OptimizeNoneAttr 0x56469ad2bcf8 <col:30>
|-CXXMethodDecl 0x56469ad2bdb0 <line:165:5, col:29> col:15 at 'Timer *&(Vector::size_type)' inline
| `-ParmVarDecl 0x56469ad2bd20 <col:18, col:28> col:28 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x56469ad2bef8 <line:166:5, col:37> col:21 at 'Timer *const &(Vector::size_type) const' inline
| `-ParmVarDecl 0x56469ad2be68 <col:24, col:34> col:34 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x56469ad2c028 <line:167:5, col:21> col:15 front 'Timer *&()' inline
|-CXXMethodDecl 0x56469ad2c158 <line:168:5, col:29> col:21 front 'Timer *const &() const' inline
|-CXXMethodDecl 0x56469ad2c228 <line:169:5, col:20> col:15 back 'Timer *&()' inline
|-CXXMethodDecl 0x56469ad2c2f8 <line:170:5, col:28> col:21 back 'Timer *const &() const' inline
|-CXXMethodDecl 0x56469ad2c438 <line:172:5, col:39> col:15 unchecked_at 'Timer *&(Vector::size_type)' inline
| `-ParmVarDecl 0x56469ad2c3a8 <col:28, col:38> col:38 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x56469ad2c580 <line:173:5, col:47> col:21 unchecked_at 'Timer *const &(Vector::size_type) const' inline
| `-ParmVarDecl 0x56469ad2c4f0 <col:34, col:44> col:44 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x56469ad2c6c8 <line:174:5, col:59> col:15 at_u 'Timer *&(Vector::size_type)' inline
| |-ParmVarDecl 0x56469ad2c638 <col:20, col:30> col:30 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x56469ad2c780 <col:48> Inherited "" ""
|-CXXMethodDecl 0x56469ad2c880 <line:175:5, col:71> col:21 at_u 'Timer *const &(Vector::size_type) const' inline
| |-ParmVarDecl 0x56469ad2c7f0 <col:26, col:36> col:36 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x56469ad2c938 <col:60> Inherited "" ""
|-CXXMethodDecl 0x56469ad2c9f8 <line:177:5, col:20> col:15 data 'Timer **()' inline
|-CXXMethodDecl 0x56469ad2caf8 <line:178:5, col:28> col:21 data 'Timer *const *() const' inline
|-CXXMethodDecl 0x56469ad2cc78 <line:180:5, col:48> col:17 push_back 'void (Vector<Timer *>::value_argument_type)' inline
| `-ParmVarDecl 0x56469ad2cbb8 <col:27, col:47> col:47 v 'Vector<Timer *>::value_argument_type':'Timer *'
|-FunctionTemplateDecl 0x56469ad2d448 <line:182:5, line:183:63> col:48 push_back
| |-TemplateTypeParmDecl 0x56469ad2cd30 <line:182:15, col:43> col:24 typename depth 0 index 0 A
| | `-TemplateArgument type 'fast_argument<Timer *>':'fast_argument<Timer *, false>'
| `-CXXMethodDecl 0x56469ad2d3a8 <line:183:5, col:63> col:48 push_back 'typename A::enable_rvalue_reference (Timer *&&)' inline
|   `-ParmVarDecl 0x56469ad2d2a8 <col:58, col:62> col:62 v 'Timer *&&'
|-CXXMethodDecl 0x56469ad2d528 <line:185:5, col:26> col:17 pop_back 'void ()' inline
|-CXXMethodDecl 0x56469ad2d678 <line:186:5, col:49> col:17 push_front 'void (Vector<Timer *>::value_argument_type)' inline
| `-ParmVarDecl 0x56469ad2d5e8 <col:28, col:48> col:48 v 'Vector<Timer *>::value_argument_type':'Timer *'
|-CXXMethodDecl 0x56469ad2d730 <line:187:5, col:27> col:17 pop_front 'void ()' inline
|-CXXMethodDecl 0x56469ad2d978 <line:189:5, col:62> col:21 insert 'Vector<Timer *>::iterator (Vector<Timer *>::iterator, Vector<Timer *>::value_argument_type)' inline
| |-ParmVarDecl 0x56469ad2d7f0 <col:28, col:37> col:37 it 'Vector<Timer *>::iterator':'Timer **'
| `-ParmVarDecl 0x56469ad2d868 <col:41, col:61> col:61 v 'Vector<Timer *>::value_argument_type':'Timer *'
|-CXXMethodDecl 0x56469ad2db38 <line:190:5, col:38> col:21 erase 'Vector<Timer *>::iterator (Vector<Timer *>::iterator)' inline
| `-ParmVarDecl 0x56469ad2da48 <col:27, col:36> col:36 it 'Vector<Timer *>::iterator':'Timer **'
|-CXXMethodDecl 0x56469ad2dd88 <line:191:5, col:49> col:21 erase 'Vector<Timer *>::iterator (Vector<Timer *>::iterator, Vector<Timer *>::iterator)' inline
| |-ParmVarDecl 0x56469ad2dc00 <col:27, col:36> col:36 a 'Vector<Timer *>::iterator':'Timer **'
| `-ParmVarDecl 0x56469ad2dc78 <col:39, col:48> col:48 b 'Vector<Timer *>::iterator':'Timer **'
|-CXXMethodDecl 0x56469ad2de48 <line:193:5, col:23> col:17 clear 'void ()' inline
|-CXXMethodDecl 0x56469ad2e0a8 <line:195:5, col:34> col:17 swap 'void (Vector<Timer *> &)' inline
| `-ParmVarDecl 0x56469ad2dfb0 <col:22, col:33> col:33 x 'Vector<Timer *> &'
`-CXXDestructorDecl 0x56469ad2e178 <../dummy_inc/click/ipaddress.hh:13:29> col:29 implicit ~Vector 'void ()' inline default noexcept-unevaluated 0x56469ad2e178

Layout: <CGRecordLayout
  LLVMType:%class.Vector.3 = type { %class.vector_memory }
  NonVirtualBaseLLVMType:%class.Vector.3 = type { %class.vector_memory }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x56469ac74fd0 <../dummy_inc/click/sync.hh:194:1, line:211:1> line:194:7 referenced class SimpleSpinlock definition
|-DefinitionData empty standard_layout has_user_declared_ctor can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided defaulted_is_constexpr
| |-CopyConstructor simple trivial has_const_param implicit_has_const_param
| |-MoveConstructor
| |-CopyAssignment trivial has_const_param implicit_has_const_param
| |-MoveAssignment
| `-Destructor non_trivial user_declared
|-CXXRecordDecl 0x56469ac750e8 <col:1, col:7> col:7 implicit referenced class SimpleSpinlock
|-AccessSpecDecl 0x56469ac75178 <col:24, col:30> col:24 public
|-CXXConstructorDecl 0x56469ac75200 <line:196:5, col:27> col:12 SimpleSpinlock 'void ()' inline
|-CXXDestructorDecl 0x56469ac752f0 <line:197:5, col:28> col:12 ~SimpleSpinlock 'void () noexcept' inline
|-CXXMethodDecl 0x56469ac753f0 <line:199:5, col:25> col:17 acquire 'void ()' inline
|-CXXMethodDecl 0x56469ac754b0 <line:200:5, col:25> col:17 release 'void ()' inline
|-CXXMethodDecl 0x56469ac75570 <line:201:5, col:25> col:17 attempt 'bool ()' inline
|-CXXConstructorDecl 0x56469ac75698 <line:194:7> col:7 implicit constexpr SimpleSpinlock 'void (const SimpleSpinlock &)' inline default trivial noexcept-unevaluated 0x56469ac75698
| `-ParmVarDecl 0x56469ac757a8 <col:7> col:7 'const SimpleSpinlock &'
`-CXXMethodDecl 0x56469ad2ef28 <col:7> col:7 implicit operator= 'SimpleSpinlock &(const SimpleSpinlock &)' inline default trivial noexcept-unevaluated 0x56469ad2ef28
  `-ParmVarDecl 0x56469ad2f038 <col:7> col:7 'const SimpleSpinlock &'

Layout: <CGRecordLayout
  LLVMType:%class.SimpleSpinlock = type { i8 }
  NonVirtualBaseLLVMType:%class.SimpleSpinlock.base = type {}
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x56469ad0a8d0 prev 0x56469ac8e818 <../dummy_inc/click/timerset.hh:12:1, line:90:1> line:12:7 referenced class TimerSet definition
|-DefinitionData standard_layout has_user_declared_ctor has_mutable_fields can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor simple non_trivial has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveConstructor exists simple non_trivial needs_overload_resolution
| |-CopyAssignment non_trivial has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveAssignment exists simple non_trivial needs_overload_resolution
| `-Destructor simple non_trivial needs_overload_resolution
|-CXXRecordDecl 0x56469ad0a9c8 <col:1, col:7> col:7 implicit referenced class TimerSet
|-AccessSpecDecl 0x56469ad0aa58 <col:18, col:24> col:18 public
|-CXXConstructorDecl 0x56469ad0aae0 <line:14:5, col:14> col:5 TimerSet 'void ()'
|-CXXMethodDecl 0x56469ad0abd8 <line:16:5, col:67> col:15 timer_expiry_steady 'Timestamp () const'
| `-CompoundStmt 0x56469ad2f3a0 <col:43, col:67>
|   `-ReturnStmt 0x56469ad2f390 <col:45, col:52>
|     `-CXXConstructExpr 0x56469ad2f360 <col:52> 'Timestamp' 'void (const Timestamp &) noexcept'
|       `-MemberExpr 0x56469ad2f330 <col:52> 'const Timestamp' lvalue ->_timer_expiry 0x56469ad0c3c0
|         `-CXXThisExpr 0x56469ad2f320 <col:52> 'const TimerSet *' implicit this
|-CXXMethodDecl 0x56469ad0ac98 <line:17:5, col:53> col:22 used timer_expiry_steady_adjusted 'Timestamp () const' inline
|-CXXMethodDecl 0x56469ad0aea0 <line:19:5, col:64> col:16 next_timer_delay 'int (bool, Timestamp &) const' inline
| |-ParmVarDecl 0x56469ad0ad48 <col:33, col:38> col:38 more_tasks 'bool'
| `-ParmVarDecl 0x56469ad0adc0 <col:50, col:61> col:61 t 'Timestamp &'
|-CXXMethodDecl 0x56469ad0af98 <line:22:5, col:23> col:12 next_timer 'Timer *()'
|-CXXMethodDecl 0x56469ad0b060 <line:24:5, col:67> col:14 max_timer_stride 'unsigned int () const'
| `-CompoundStmt 0x56469ad2f420 <col:39, col:67>
|   `-ReturnStmt 0x56469ad2f410 <col:41, col:48>
|     `-ImplicitCastExpr 0x56469ad2f3f8 <col:48> 'unsigned int' <LValueToRValue>
|       `-MemberExpr 0x56469ad2f3c8 <col:48> 'const unsigned int' lvalue ->_max_timer_stride 0x56469ad0c4a8
|         `-CXXThisExpr 0x56469ad2f3b8 <col:48> 'const TimerSet *' implicit this
|-CXXMethodDecl 0x56469ad0b128 <line:25:5, col:59> col:14 timer_stride 'unsigned int () const'
| `-CompoundStmt 0x56469ad2f4a0 <col:35, col:59>
|   `-ReturnStmt 0x56469ad2f490 <col:37, col:44>
|     `-ImplicitCastExpr 0x56469ad2f478 <col:44> 'unsigned int' <LValueToRValue>
|       `-MemberExpr 0x56469ad2f448 <col:44> 'const unsigned int' lvalue ->_timer_stride 0x56469ad0c510
|         `-CXXThisExpr 0x56469ad2f438 <col:44> 'const TimerSet *' implicit this
|-CXXMethodDecl 0x56469ad0b270 <line:26:5, col:52> col:10 set_max_timer_stride 'void (unsigned int)'
| `-ParmVarDecl 0x56469ad0b1e0 <col:31, col:40> col:40 timer_stride 'unsigned int'
|-CXXMethodDecl 0x56469ad0b3b8 <line:28:5, col:36> col:10 kill_router 'void (Router *)'
| `-ParmVarDecl 0x56469ad0b328 <col:22, col:30> col:30 router 'Router *'
|-CXXMethodDecl 0x56469ad0b5b8 <line:30:5, col:57> col:10 run_timers 'void (RouterThread *, Master *)'
| |-ParmVarDecl 0x56469ad0b470 <col:21, col:35> col:35 thread 'RouterThread *'
| `-ParmVarDecl 0x56469ad0b4e8 <col:43, col:51> col:51 master 'Master *'
|-CXXMethodDecl 0x56469ad0b688 <line:32:5, col:23> col:17 fence 'void ()' inline
|-AccessSpecDecl 0x56469ad0b728 <line:34:3, col:10> col:3 private
|-CXXRecordDecl 0x56469ad0b750 <line:36:5, line:45:5> line:36:12 referenced struct heap_element definition
| |-DefinitionData pass_in_registers standard_layout trivially_copyable has_user_declared_ctor can_const_default_init
| | |-DefaultConstructor
| | |-CopyConstructor simple trivial has_const_param needs_implicit implicit_has_const_param
| | |-MoveConstructor exists simple trivial needs_implicit
| | |-CopyAssignment trivial has_const_param needs_implicit implicit_has_const_param
| | |-MoveAssignment exists simple trivial needs_implicit
| | `-Destructor simple irrelevant trivial needs_implicit
| |-CXXRecordDecl 0x56469ad0b868 <col:5, col:12> col:12 implicit referenced struct heap_element
| |-FieldDecl 0x56469ad0b908 <line:37:2, col:12> col:12 referenced expiry_s 'Timestamp'
| |-FieldDecl 0x56469ad0b968 <line:38:2, col:9> col:9 referenced t 'Timer *'
| `-CXXConstructorDecl 0x56469ad0ba98 <line:42:2, line:44:2> line:42:2 heap_element 'void (Timer *)'
|   |-ParmVarDecl 0x56469ad0b9c8 <col:15, col:22> col:22 used t_ 'Timer *'
|   |-CXXCtorInitializer Field 0x56469ad0b908 'expiry_s' 'Timestamp'
|   | `-CXXConstructExpr 0x56469ad2f578 <line:43:8, col:36> 'Timestamp' 'void (const Timestamp &) noexcept'
|   |   `-CXXMemberCallExpr 0x56469ad2f520 <col:17, col:35> 'const Timestamp' lvalue
|   |     `-MemberExpr 0x56469ad2f4f0 <col:17, col:21> '<bound member function type>' ->expiry_steady 0x56469ac79c08
|   |       `-ImplicitCastExpr 0x56469ad2f540 <col:17> 'const Timer *' <NoOp>
|   |         `-ImplicitCastExpr 0x56469ad2f4d8 <col:17> 'Timer *' <LValueToRValue>
|   |           `-DeclRefExpr 0x56469ad2f4b8 <col:17> 'Timer *' lvalue ParmVar 0x56469ad0b9c8 't_' 'Timer *'
|   |-CXXCtorInitializer Field 0x56469ad0b968 't' 'Timer *'
|   | `-ImplicitCastExpr 0x56469ad2f610 <col:41> 'Timer *' <LValueToRValue>
|   |   `-DeclRefExpr 0x56469ad2f5d0 <col:41> 'Timer *' lvalue ParmVar 0x56469ad0b9c8 't_' 'Timer *'
|   `-CompoundStmt 0x56469ad2f660 <col:45, line:44:2>
|-CXXRecordDecl 0x56469ad0bb60 <line:46:5, line:50:5> line:46:12 struct heap_less definition
| |-DefinitionData pass_in_registers empty aggregate standard_layout trivially_copyable pod trivial literal has_constexpr_non_copy_move_ctor can_const_default_init
| | |-DefaultConstructor exists trivial constexpr needs_implicit defaulted_is_constexpr
| | |-CopyConstructor simple trivial has_const_param needs_implicit implicit_has_const_param
| | |-MoveConstructor exists simple trivial needs_implicit
| | |-CopyAssignment trivial has_const_param needs_implicit implicit_has_const_param
| | |-MoveAssignment exists simple trivial needs_implicit
| | `-Destructor simple irrelevant trivial needs_implicit
| |-CXXRecordDecl 0x56469ad0bc78 <col:5, col:12> col:12 implicit struct heap_less
| `-CXXMethodDecl 0x56469ad0bec8 <line:47:2, line:49:2> line:47:14 operator() 'bool (const TimerSet::heap_element &, const TimerSet::heap_element &)' inline
|   |-ParmVarDecl 0x56469ad0bd48 <col:25, col:45> col:45 used a 'const TimerSet::heap_element &'
|   |-ParmVarDecl 0x56469ad0bdc0 <col:48, col:68> col:68 used b 'const TimerSet::heap_element &'
|   `-CompoundStmt 0x56469ad2f790 <col:71, line:49:2>
|     `-ReturnStmt 0x56469ad2f780 <line:48:6, col:28>
|       `-CXXOperatorCallExpr 0x56469ad2f748 <col:13, col:28> 'bool'
|         |-ImplicitCastExpr 0x56469ad2f730 <col:24> 'bool (*)(const Timestamp &, const Timestamp &)' <FunctionToPointerDecay>
|         | `-DeclRefExpr 0x56469ad2f710 <col:24> 'bool (const Timestamp &, const Timestamp &)' lvalue Function 0x56469ac18c88 'operator<' 'bool (const Timestamp &, const Timestamp &)'
|         |-MemberExpr 0x56469ad2f690 <col:13, col:15> 'const Timestamp' lvalue .expiry_s 0x56469ad0b908
|         | `-DeclRefExpr 0x56469ad2f670 <col:13> 'const TimerSet::heap_element' lvalue ParmVar 0x56469ad0bd48 'a' 'const TimerSet::heap_element &'
|         `-MemberExpr 0x56469ad2f6e0 <col:26, col:28> 'const Timestamp' lvalue .expiry_s 0x56469ad0b908
|           `-DeclRefExpr 0x56469ad2f6c0 <col:26> 'const TimerSet::heap_element' lvalue ParmVar 0x56469ad0bdc0 'b' 'const TimerSet::heap_element &'
|-CXXRecordDecl 0x56469ad0bf90 <line:51:5, line:55:5> line:51:12 struct heap_place definition
| |-DefinitionData pass_in_registers empty aggregate standard_layout trivially_copyable pod trivial literal has_constexpr_non_copy_move_ctor can_const_default_init
| | |-DefaultConstructor exists trivial constexpr needs_implicit defaulted_is_constexpr
| | |-CopyConstructor simple trivial has_const_param needs_implicit implicit_has_const_param
| | |-MoveConstructor exists simple trivial needs_implicit
| | |-CopyAssignment trivial has_const_param needs_implicit implicit_has_const_param
| | |-MoveAssignment exists simple trivial needs_implicit
| | `-Destructor simple irrelevant trivial needs_implicit
| |-CXXRecordDecl 0x56469ad0c0a8 <col:5, col:12> col:12 implicit struct heap_place
| `-CXXMethodDecl 0x56469ad0c2c8 <line:52:2, line:54:2> line:52:14 operator() 'void (TimerSet::heap_element *, TimerSet::heap_element *)' inline
|   |-ParmVarDecl 0x56469ad0c148 <col:25, col:39> col:39 used begin 'TimerSet::heap_element *'
|   |-ParmVarDecl 0x56469ad0c1c0 <col:46, col:60> col:60 used t 'TimerSet::heap_element *'
|   `-CompoundStmt 0x56469ad2f998 <col:63, line:54:2>
|     `-BinaryOperator 0x56469ad2f978 <line:53:6, col:39> 'int' lvalue '='
|       |-MemberExpr 0x56469ad2f828 <col:6, col:12> 'int' lvalue ->_schedpos1 0x56469ac8dcb8
|       | `-ImplicitCastExpr 0x56469ad2f810 <col:6, col:9> 'Timer *' <LValueToRValue>
|       |   `-MemberExpr 0x56469ad2f7e0 <col:6, col:9> 'Timer *' lvalue ->t 0x56469ad0b968
|       |     `-ImplicitCastExpr 0x56469ad2f7c8 <col:6> 'TimerSet::heap_element *' <LValueToRValue>
|       |       `-DeclRefExpr 0x56469ad2f7a8 <col:6> 'TimerSet::heap_element *' lvalue ParmVar 0x56469ad0c1c0 't' 'TimerSet::heap_element *'
|       `-ImplicitCastExpr 0x56469ad2f960 <col:25, col:39> 'int' <IntegralCast>
|         `-BinaryOperator 0x56469ad2f940 <col:25, col:39> 'long' '+'
|           |-ParenExpr 0x56469ad2f8e8 <col:25, col:35> 'long'
|           | `-BinaryOperator 0x56469ad2f8c8 <col:26, col:30> 'long' '-'
|           |   |-ImplicitCastExpr 0x56469ad2f898 <col:26> 'TimerSet::heap_element *' <LValueToRValue>
|           |   | `-DeclRefExpr 0x56469ad2f858 <col:26> 'TimerSet::heap_element *' lvalue ParmVar 0x56469ad0c1c0 't' 'TimerSet::heap_element *'
|           |   `-ImplicitCastExpr 0x56469ad2f8b0 <col:30> 'TimerSet::heap_element *' <LValueToRValue>
|           |     `-DeclRefExpr 0x56469ad2f878 <col:30> 'TimerSet::heap_element *' lvalue ParmVar 0x56469ad0c148 'begin' 'TimerSet::heap_element *'
|           `-ImplicitCastExpr 0x56469ad2f928 <col:39> 'long' <IntegralCast>
|             `-IntegerLiteral 0x56469ad2f908 <col:39> 'int' 1
|-FieldDecl 0x56469ad0c3c0 <line:58:5, col:15> col:15 referenced _timer_expiry 'Timestamp'
| `-AlignedAttr 0x56469ad0c430 <col:44, col:53> aligned
|   `-ConstantExpr 0x56469ad0c410 <col:52> 'int' Int: 8
|     `-IntegerLiteral 0x56469ad0c390 <col:52> 'int' 8
|-FieldDecl 0x56469ad0c4a8 <line:60:5, col:14> col:14 referenced _max_timer_stride 'unsigned int'
|-FieldDecl 0x56469ad0c510 <line:61:5, col:14> col:14 referenced _timer_stride 'unsigned int'
|-FieldDecl 0x56469ad0c578 <line:62:5, col:14> col:14 _timer_count 'unsigned int'
|-FieldDecl 0x56469ad235b0 <line:63:5, col:26> col:26 referenced _timer_heap 'Vector<TimerSet::heap_element>':'Vector<TimerSet::heap_element>'
|-FieldDecl 0x56469ad2e260 <line:64:5, col:21> col:21 _timer_runchunk 'Vector<Timer *>':'Vector<Timer *>'
|-FieldDecl 0x56469ad2e2c0 <line:65:5, col:20> col:20 _timer_lock 'SimpleSpinlock'
|-FieldDecl 0x56469ad2e320 <line:71:5, col:15> col:15 _timer_check 'Timestamp'
|-FieldDecl 0x56469ad2e380 <line:72:5, col:14> col:14 _timer_check_reports 'uint32_t':'unsigned int'
|-CXXMethodDecl 0x56469ad2e470 <line:74:5, col:38> col:17 run_one_timer 'void (Timer *)' inline
| `-ParmVarDecl 0x56469ad2e3e0 <col:31, col:37> col:38 'Timer *'
|-CXXMethodDecl 0x56469ad2e538 <line:76:5, line:81:5> line:76:10 set_timer_expiry 'void ()'
| `-CompoundStmt 0x56469ad2fdf0 <col:29, line:81:5>
|   `-IfStmt 0x56469ad2fdc8 <line:77:2, line:80:32> has_else
|     |-ImplicitCastExpr 0x56469ad2fa80 <line:77:6, col:23> 'bool' <IntegralToBoolean>
|     | `-CXXMemberCallExpr 0x56469ad2fa20 <col:6, col:23> 'Vector::size_type':'int'
|     |   `-MemberExpr 0x56469ad2f9f0 <col:6, col:18> '<bound member function type>' .size 0x56469ad206c8
|     |     `-ImplicitCastExpr 0x56469ad2fa68 <col:6> 'const Vector<TimerSet::heap_element>' lvalue <NoOp>
|     |       `-MemberExpr 0x56469ad2f9c0 <col:6> 'Vector<TimerSet::heap_element>':'Vector<TimerSet::heap_element>' lvalue ->_timer_heap 0x56469ad235b0
|     |         `-CXXThisExpr 0x56469ad2f9b0 <col:6> 'TimerSet *' implicit this
|     |-CXXOperatorCallExpr 0x56469ad2fc70 <line:78:6, col:50> 'Timestamp' lvalue
|     | |-ImplicitCastExpr 0x56469ad2fc58 <col:20> 'Timestamp &(*)(const Timestamp &) noexcept' <FunctionToPointerDecay>
|     | | `-DeclRefExpr 0x56469ad2fc38 <col:20> 'Timestamp &(const Timestamp &) noexcept' lvalue CXXMethod 0x56469a9024c8 'operator=' 'Timestamp &(const Timestamp &) noexcept'
|     | |-MemberExpr 0x56469ad2faa8 <col:6> 'Timestamp' lvalue ->_timer_expiry 0x56469ad0c3c0
|     | | `-CXXThisExpr 0x56469ad2fa98 <col:6> 'TimerSet *' implicit this
|     | `-ImplicitCastExpr 0x56469ad2fc20 <col:22, col:50> 'const Timestamp' lvalue <NoOp>
|     |   `-MemberExpr 0x56469ad2fbf0 <col:22, col:50> 'Timestamp' lvalue .expiry_s 0x56469ad0b908
|     |     `-CXXMemberCallExpr 0x56469ad2fbc8 <col:22, col:48> 'TimerSet::heap_element':'TimerSet::heap_element' lvalue
|     |       |-MemberExpr 0x56469ad2fb98 <col:22, col:34> '<bound member function type>' .unchecked_at 0x56469ad21768
|     |       | `-MemberExpr 0x56469ad2fae8 <col:22> 'Vector<TimerSet::heap_element>':'Vector<TimerSet::heap_element>' lvalue ->_timer_heap 0x56469ad235b0
|     |       |   `-CXXThisExpr 0x56469ad2fad8 <col:22> 'TimerSet *' implicit this
|     |       `-IntegerLiteral 0x56469ad2fb78 <col:47> 'int' 0
|     `-ExprWithCleanups 0x56469ad2fdb0 <line:80:6, col:32> 'Timestamp' lvalue
|       `-CXXOperatorCallExpr 0x56469ad2fd78 <col:6, col:32> 'Timestamp' lvalue
|         |-ImplicitCastExpr 0x56469ad2fd60 <col:20> 'Timestamp &(*)(Timestamp &&) noexcept' <FunctionToPointerDecay>
|         | `-DeclRefExpr 0x56469ad2fd40 <col:20> 'Timestamp &(Timestamp &&) noexcept' lvalue CXXMethod 0x56469a902978 'operator=' 'Timestamp &(Timestamp &&) noexcept'
|         |-MemberExpr 0x56469ad2fcb8 <col:6> 'Timestamp' lvalue ->_timer_expiry 0x56469ad0c3c0
|         | `-CXXThisExpr 0x56469ad2fca8 <col:6> 'TimerSet *' implicit this
|         `-MaterializeTemporaryExpr 0x56469ad2fd28 <col:22, col:32> 'Timestamp' xvalue
|           `-CXXTemporaryObjectExpr 0x56469ad2fcf8 <col:22, col:32> 'Timestamp' 'void ()'
|-CXXMethodDecl 0x56469ad2e678 <line:82:5, col:37> col:10 check_timer_expiry 'void (Timer *)'
| `-ParmVarDecl 0x56469ad2e5e8 <col:29, col:36> col:36 t 'Timer *'
|-CXXMethodDecl 0x56469ad2e740 <line:84:5, col:29> col:17 used lock_timers 'void ()' inline
|-CXXMethodDecl 0x56469ad2e800 <line:85:5, col:37> col:17 attempt_lock_timers 'bool ()' inline
|-CXXMethodDecl 0x56469ad2e8c0 <line:86:5, col:31> col:17 used unlock_timers 'void ()' inline
|-FriendDecl 0x56469ad2e9b0 <line:88:5, col:18> col:12 'class Timer':'Timer'
|-CXXConstructorDecl 0x56469ad2ea18 <line:12:7> col:7 implicit TimerSet 'void (const TimerSet &)' inline default noexcept-unevaluated 0x56469ad2ea18
| `-ParmVarDecl 0x56469ad2eb28 <col:7> col:7 'const TimerSet &'
|-CXXConstructorDecl 0x56469ad2ebc8 <col:7> col:7 implicit TimerSet 'void (TimerSet &&)' inline default noexcept-unevaluated 0x56469ad2ebc8
| `-ParmVarDecl 0x56469ad2ecd8 <col:7> col:7 'TimerSet &&'
|-CXXMethodDecl 0x56469ad2ed78 <col:7> col:7 implicit operator= 'TimerSet &(const TimerSet &)' inline default noexcept-unevaluated 0x56469ad2ed78
| `-ParmVarDecl 0x56469ad2ee88 <col:7> col:7 'const TimerSet &'
|-CXXMethodDecl 0x56469ad2f0a8 <col:7> col:7 implicit operator= 'TimerSet &(TimerSet &&)' inline default noexcept-unevaluated 0x56469ad2f0a8
| `-ParmVarDecl 0x56469ad2f1b8 <col:7> col:7 'TimerSet &&'
`-CXXDestructorDecl 0x56469ad2f240 <col:7> col:7 implicit ~TimerSet 'void ()' inline default noexcept-unevaluated 0x56469ad2f240

Layout: <CGRecordLayout
  LLVMType:%class.TimerSet = type <{ %class.Timestamp, i32, i32, i32, [4 x i8], %class.Vector.0, %class.Vector.3, %class.SimpleSpinlock, [7 x i8], %class.Timestamp, i32, [4 x i8] }>
  NonVirtualBaseLLVMType:%class.TimerSet.base = type <{ %class.Timestamp, i32, i32, i32, [4 x i8], %class.Vector.0, %class.Vector.3, %class.SimpleSpinlock, [7 x i8], %class.Timestamp, i32 }>
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x56469ad54048 <../dummy_inc/click/ipaddress.hh:13:1, col:29> ../dummy_inc/click/vector.hh:111:7 class Vector definition
|-DefinitionData standard_layout has_user_declared_ctor has_mutable_fields can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor non_trivial user_declared has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveConstructor exists non_trivial user_declared needs_overload_resolution
| |-CopyAssignment non_trivial has_const_param user_declared needs_overload_resolution implicit_has_const_param
| |-MoveAssignment exists non_trivial user_declared needs_overload_resolution
| `-Destructor simple non_trivial needs_overload_resolution
|-TemplateArgument type 'pollfd'
|-CXXRecordDecl 0x56469ad54258 prev 0x56469ad54048 <col:1, col:7> col:7 implicit class Vector
|-TypedefDecl 0x56469ad56360 <line:113:5, col:44> col:44 array_memory_type 'typename array_memory<pollfd>::type':'sized_array_memory<8>'
| `-ElaboratedType 0x56469ad56310 'typename array_memory<pollfd>::type' sugar
|   `-TypedefType 0x56469ad562f0 'conditional<true, sized_array_memory<8>, typed_array_memory<pollfd> >::type' sugar
|     |-Typedef 0x56469ad55170 'type'
|     `-SubstTemplateTypeParmType 0x56469ad245c0 'sized_array_memory<8>' sugar
|       |-TemplateTypeParmType 0x56469a9bee80 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x56469a9bee28 'T'
|       `-RecordType 0x56469ad24110 'sized_array_memory<8>'
|         `-ClassTemplateSpecialization 0x56469ad24028 'sized_array_memory'
|-FieldDecl 0x56469ad56460 <line:114:5, col:46> col:46 vm_ 'vector_memory<Vector<pollfd>::array_memory_type>':'vector_memory<sized_array_memory<8> >' mutable
|-AccessSpecDecl 0x56469ad564b0 <line:116:3, col:9> col:3 public
|-TypedefDecl 0x56469ad564e8 <line:118:5, col:15> col:15 value_type 'pollfd':'pollfd'
| `-SubstTemplateTypeParmType 0x56469ad542f0 'pollfd' sugar
|   |-TemplateTypeParmType 0x56469a9f6d90 'T' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x56469a9f6d38 'T'
|   `-RecordType 0x56469ad52100 'pollfd'
|     `-CXXRecord 0x56469ad52070 'pollfd'
|-TypedefDecl 0x56469ad565a8 <line:119:5, col:16> col:16 reference 'pollfd &'
| `-LValueReferenceType 0x56469ad56570 'pollfd &'
|   `-SubstTemplateTypeParmType 0x56469ad542f0 'pollfd' sugar
|     |-TemplateTypeParmType 0x56469a9f6d90 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x56469a9f6d38 'T'
|     `-RecordType 0x56469ad52100 'pollfd'
|       `-CXXRecord 0x56469ad52070 'pollfd'
|-TypedefDecl 0x56469ad56668 <line:120:5, col:22> col:22 const_reference 'const pollfd &'
| `-LValueReferenceType 0x56469ad56630 'const pollfd &'
|   `-QualType 0x56469ad542f1 'const pollfd' const
|     `-SubstTemplateTypeParmType 0x56469ad542f0 'pollfd' sugar
|       |-TemplateTypeParmType 0x56469a9f6d90 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x56469a9f6d38 'T'
|       `-RecordType 0x56469ad52100 'pollfd'
|         `-CXXRecord 0x56469ad52070 'pollfd'
|-TypedefDecl 0x56469ad566f8 <line:121:5, col:16> col:16 pointer 'pollfd *'
| `-PointerType 0x56469ad566c0 'pollfd *'
|   `-SubstTemplateTypeParmType 0x56469ad542f0 'pollfd' sugar
|     |-TemplateTypeParmType 0x56469a9f6d90 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x56469a9f6d38 'T'
|     `-RecordType 0x56469ad52100 'pollfd'
|       `-CXXRecord 0x56469ad52070 'pollfd'
|-TypedefDecl 0x56469ad567b8 <line:122:5, col:22> col:22 const_pointer 'const pollfd *'
| `-PointerType 0x56469ad56780 'const pollfd *'
|   `-QualType 0x56469ad542f1 'const pollfd' const
|     `-SubstTemplateTypeParmType 0x56469ad542f0 'pollfd' sugar
|       |-TemplateTypeParmType 0x56469a9f6d90 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x56469a9f6d38 'T'
|       `-RecordType 0x56469ad52100 'pollfd'
|         `-CXXRecord 0x56469ad52070 'pollfd'
|-TypedefDecl 0x56469ad57390 <line:125:5, col:45> col:45 value_argument_type 'typename fast_argument<pollfd>::type':'pollfd'
| `-ElaboratedType 0x56469ad57340 'typename fast_argument<pollfd>::type' sugar
|   `-TypedefType 0x56469ad57320 'fast_argument<pollfd, false>::type' sugar
|     |-Typedef 0x56469ad572b0 'type'
|     `-SubstTemplateTypeParmType 0x56469ad57070 'pollfd' sugar
|       |-TemplateTypeParmType 0x56469a9c9ea0 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x56469a9c9e50 'T'
|       `-RecordType 0x56469ad52100 'pollfd'
|         `-CXXRecord 0x56469ad52070 'pollfd'
|-TypedefDecl 0x56469ad573f8 <line:126:5, col:22> col:22 const_access_type 'const pollfd &'
| `-LValueReferenceType 0x56469ad56630 'const pollfd &'
|   `-QualType 0x56469ad542f1 'const pollfd' const
|     `-SubstTemplateTypeParmType 0x56469ad542f0 'pollfd' sugar
|       |-TemplateTypeParmType 0x56469a9f6d90 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x56469a9f6d38 'T'
|       `-RecordType 0x56469ad52100 'pollfd'
|         `-CXXRecord 0x56469ad52070 'pollfd'
|-TypedefDecl 0x56469ad57450 <line:128:5, col:17> col:17 size_type 'int'
| `-BuiltinType 0x56469a6f2580 'int'
|-TypedefDecl 0x56469ad574b8 <line:130:5, col:16> col:16 iterator 'pollfd *'
| `-PointerType 0x56469ad566c0 'pollfd *'
|   `-SubstTemplateTypeParmType 0x56469ad542f0 'pollfd' sugar
|     |-TemplateTypeParmType 0x56469a9f6d90 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x56469a9f6d38 'T'
|     `-RecordType 0x56469ad52100 'pollfd'
|       `-CXXRecord 0x56469ad52070 'pollfd'
|-TypedefDecl 0x56469ad57520 <line:131:5, col:22> col:22 const_iterator 'const pollfd *'
| `-PointerType 0x56469ad56780 'const pollfd *'
|   `-QualType 0x56469ad542f1 'const pollfd' const
|     `-SubstTemplateTypeParmType 0x56469ad542f0 'pollfd' sugar
|       |-TemplateTypeParmType 0x56469a9f6d90 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x56469a9f6d38 'T'
|       `-RecordType 0x56469ad52100 'pollfd'
|         `-CXXRecord 0x56469ad52070 'pollfd'
|-EnumDecl 0x56469ad57578 <line:134:5> col:5
| `-EnumConstantDecl 0x56469ad57670 <col:12, col:40> col:12 RESERVE_GROW 'Vector<pollfd>::(anonymous enum at ../dummy_inc/click/vector.hh:134:5)'
|   `-ConstantExpr 0x56469ad57650 <col:27, col:40> 'Vector::size_type':'int' Int: -1
|     `-CStyleCastExpr 0x56469a9f8418 <col:27, col:40> 'Vector::size_type':'int' <NoOp>
|       `-UnaryOperator 0x56469a9f83f0 <col:39, col:40> 'int' prefix '-'
|         `-IntegerLiteral 0x56469a9f83d0 <col:40> 'int' 1
|-CXXConstructorDecl 0x56469ad576f8 <line:137:5, col:28> col:21 Vector 'void ()' inline
|-CXXConstructorDecl 0x56469ad57988 <line:138:5, col:62> col:21 Vector 'void (Vector::size_type, Vector<pollfd>::value_argument_type)' inline
| |-ParmVarDecl 0x56469ad577b0 <col:28, col:38> col:38 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x56469ad57850 <col:41, col:61> col:61 v 'Vector<pollfd>::value_argument_type':'pollfd'
|-CXXConstructorDecl 0x56469ad57c48 <line:139:5, col:37> col:12 Vector 'void (const Vector<pollfd> &)' inline
| `-ParmVarDecl 0x56469ad57b30 <col:19, col:36> col:36 x 'const Vector<pollfd> &'
|-CXXConstructorDecl 0x56469ad57f08 <line:141:5, col:32> col:12 Vector 'void (Vector<pollfd> &&)' inline
| `-ParmVarDecl 0x56469ad57df0 <col:19, col:31> col:31 x 'Vector<pollfd> &&'
|-CXXMethodDecl 0x56469ad58250 <line:144:5, col:51> col:23 operator= 'Vector<pollfd> &(const Vector<pollfd> &)' inline
| `-ParmVarDecl 0x56469ad58130 <col:33, col:50> col:50 x 'const Vector<pollfd> &'
|-CXXMethodDecl 0x56469ad58560 <line:146:5, col:46> col:23 operator= 'Vector<pollfd> &(Vector<pollfd> &&)' inline
| `-ParmVarDecl 0x56469ad58440 <col:33, col:45> col:45 x 'Vector<pollfd> &&'
|-CXXMethodDecl 0x56469ad58850 <line:148:5, col:70> col:23 assign 'Vector<pollfd> &(Vector::size_type, Vector<pollfd>::value_argument_type)' inline
| |-ParmVarDecl 0x56469ad58698 <col:30, col:40> col:40 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x56469ad58710 <col:43, col:69> col:63 v 'Vector<pollfd>::value_argument_type':'pollfd'
|-CXXMethodDecl 0x56469ad589a8 <line:150:5, col:55> col:49 begin 'Vector<pollfd>::iterator ()'
| |-NoInlineAttr 0x56469ad58a88 <col:20> Inherited
| `-OptimizeNoneAttr 0x56469ad58ae0 <col:30> Inherited
|-CXXMethodDecl 0x56469ad58b28 <line:151:5, col:53> col:49 end 'Vector<pollfd>::iterator ()'
| |-NoInlineAttr 0x56469ad58bd8 <col:20> Inherited
| `-OptimizeNoneAttr 0x56469ad58c30 <col:30> Inherited
|-CXXMethodDecl 0x56469ad58cf8 <line:152:5, col:63> col:55 begin 'Vector<pollfd>::const_iterator () const'
| |-NoInlineAttr 0x56469ad58da8 <col:20> Inherited
| `-OptimizeNoneAttr 0x56469ad58e00 <col:30> Inherited
|-CXXMethodDecl 0x56469ad58e48 <line:153:5, col:61> col:55 end 'Vector<pollfd>::const_iterator () const'
| |-NoInlineAttr 0x56469ad58ef8 <col:20> Inherited
| `-OptimizeNoneAttr 0x56469ad58f50 <col:30> Inherited
|-CXXMethodDecl 0x56469ad58f98 <line:154:5, col:64> col:55 cbegin 'Vector<pollfd>::const_iterator () const'
| |-NoInlineAttr 0x56469ad59048 <col:20> Inherited
| `-OptimizeNoneAttr 0x56469ad590a0 <col:30> Inherited
|-CXXMethodDecl 0x56469ad590e8 <line:155:5, col:62> col:55 cend 'Vector<pollfd>::const_iterator () const'
| |-NoInlineAttr 0x56469ad59198 <col:20> Inherited
| `-OptimizeNoneAttr 0x56469ad591f0 <col:30> Inherited
|-CXXMethodDecl 0x56469ad59218 <line:157:5, col:29> col:22 size 'Vector::size_type () const' inline
|-CXXMethodDecl 0x56469ad592c8 <line:158:5, col:33> col:22 capacity 'Vector::size_type () const' inline
|-CXXMethodDecl 0x56469ad59378 <line:159:5, col:25> col:17 empty 'bool () const' inline
|-CXXMethodDecl 0x56469ad59538 <line:160:5, col:64> col:17 resize 'void (Vector::size_type, Vector<pollfd>::value_argument_type)' inline
| |-ParmVarDecl 0x56469ad59428 <col:24, col:34> col:34 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x56469ad594a0 <col:37, col:63> col:57 v 'Vector<pollfd>::value_argument_type':'pollfd'
|-CXXMethodDecl 0x56469ad59688 <line:161:5, col:36> col:17 reserve 'bool (Vector::size_type)' inline
| `-ParmVarDecl 0x56469ad595f8 <col:25, col:35> col:35 n 'Vector::size_type':'int'
|-CXXMethodDecl 0x56469ad59838 <line:163:5, col:65> col:43 operator[] 'pollfd &(Vector::size_type)'
| |-ParmVarDecl 0x56469ad59740 <col:54, col:64> col:64 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x56469ad598f0 <col:20>
| `-OptimizeNoneAttr 0x56469ad59948 <col:30>
|-CXXMethodDecl 0x56469ad59a68 <line:164:5, col:73> col:49 operator[] 'const pollfd &(Vector::size_type) const'
| |-ParmVarDecl 0x56469ad59970 <col:60, col:70> col:70 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x56469ad59b20 <col:20>
| `-OptimizeNoneAttr 0x56469ad59b78 <col:30>
|-CXXMethodDecl 0x56469ad59c30 <line:165:5, col:29> col:15 at 'pollfd &(Vector::size_type)' inline
| `-ParmVarDecl 0x56469ad59ba0 <col:18, col:28> col:28 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x56469ad59d78 <line:166:5, col:37> col:21 at 'const pollfd &(Vector::size_type) const' inline
| `-ParmVarDecl 0x56469ad59ce8 <col:24, col:34> col:34 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x56469ad59ea8 <line:167:5, col:21> col:15 front 'pollfd &()' inline
|-CXXMethodDecl 0x56469ad59fd8 <line:168:5, col:29> col:21 front 'const pollfd &() const' inline
|-CXXMethodDecl 0x56469ad5a0a8 <line:169:5, col:20> col:15 back 'pollfd &()' inline
|-CXXMethodDecl 0x56469ad5a178 <line:170:5, col:28> col:21 back 'const pollfd &() const' inline
|-CXXMethodDecl 0x56469ad5a2b8 <line:172:5, col:39> col:15 unchecked_at 'pollfd &(Vector::size_type)' inline
| `-ParmVarDecl 0x56469ad5a228 <col:28, col:38> col:38 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x56469ad5a400 <line:173:5, col:47> col:21 unchecked_at 'const pollfd &(Vector::size_type) const' inline
| `-ParmVarDecl 0x56469ad5a370 <col:34, col:44> col:44 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x56469ad5a548 <line:174:5, col:59> col:15 at_u 'pollfd &(Vector::size_type)' inline
| |-ParmVarDecl 0x56469ad5a4b8 <col:20, col:30> col:30 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x56469ad5a600 <col:48> Inherited "" ""
|-CXXMethodDecl 0x56469ad5a700 <line:175:5, col:71> col:21 at_u 'const pollfd &(Vector::size_type) const' inline
| |-ParmVarDecl 0x56469ad5a670 <col:26, col:36> col:36 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x56469ad5a7b8 <col:60> Inherited "" ""
|-CXXMethodDecl 0x56469ad5a878 <line:177:5, col:20> col:15 data 'pollfd *()' inline
|-CXXMethodDecl 0x56469ad5a978 <line:178:5, col:28> col:21 data 'const pollfd *() const' inline
|-CXXMethodDecl 0x56469ad5ab28 <line:180:5, col:48> col:17 push_back 'void (Vector<pollfd>::value_argument_type)' inline
| `-ParmVarDecl 0x56469ad5aa38 <col:27, col:47> col:47 v 'Vector<pollfd>::value_argument_type':'pollfd'
|-FunctionTemplateDecl 0x56469ad5b2e8 <line:182:5, line:183:63> col:48 push_back
| |-TemplateTypeParmDecl 0x56469ad5abe0 <line:182:15, col:43> col:24 typename depth 0 index 0 A
