; ModuleID = '../elements/etherswitch/spantree.cc'
source_filename = "../elements/etherswitch/spantree.cc"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%class.EtherSpanTree = type { %class.Element.base, %class.Suppressor*, %class.Suppressor*, %class.EtherSwitch*, %class.Timestamp*, i8, i64, i16, i16, [6 x i8], %class.BridgeMessage, %class.Vector, %class.Timer }
%class.Element.base = type <{ i32 (...)**, [2 x %"class.Element::Port"*], [4 x %"class.Element::Port"], [2 x i32], %class.Router*, i32 }>
%"class.Element::Port" = type <{ %class.Element*, i32, [4 x i8] }>
%class.Element = type <{ i32 (...)**, [2 x %"class.Element::Port"*], [4 x %"class.Element::Port"], [2 x i32], %class.Router*, i32, [4 x i8] }>
%class.Router = type opaque
%class.Suppressor = type { %class.Element.base, %class.Bitvector }
%class.Bitvector = type { i32, i32*, [2 x i32] }
%class.EtherSwitch = type opaque
%class.Timestamp = type { %"union.Timestamp::rep_t" }
%"union.Timestamp::rep_t" = type { i64 }
%class.BridgeMessage = type { i32, i32, i32, i64, i64, i32, i16, i8, %class.Timestamp }
%class.Vector = type { %class.vector_memory }
%class.vector_memory = type { %struct.char_array*, i32, i32 }
%struct.char_array = type { [72 x i8] }
%class.Timer = type { i32, %class.Timestamp, %union.anon, i8*, %class.Element*, %class.RouterThread* }
%union.anon = type { void (%class.Timer*, i8*)* }
%class.RouterThread = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !1, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !1971, imports: !2427, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "../elements/etherswitch/spantree.cc", directory: "/home/john/projects/click/ir-dir")
!2 = !{!3, !513, !1298, !1827, !1838, !1967}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PortState", scope: !5, file: !4, line: 101, baseType: !42, size: 32, elements: !1822, identifier: "_ZTSN13EtherSpanTree9PortStateE")
!4 = !DIFile(filename: "../elements/etherswitch/spantree.hh", directory: "/home/john/projects/click/ir-dir")
!5 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "EtherSpanTree", file: !4, line: 57, size: 2304, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !6, vtableHolder: !8)
!6 = !{!7, !10, !14, !15, !18, !555, !556, !557, !561, !562, !568, !649, !867, !981, !985, !986, !991, !992, !993, !1187, !1190, !1193, !1194, !1195, !1198, !1199, !1200, !1815, !1818, !1821}
!7 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !5, baseType: !8, flags: DIFlagPublic, extraData: i32 0)
!8 = !DICompositeType(tag: DW_TAG_class_type, name: "Element", file: !9, line: 29, flags: DIFlagFwdDecl, identifier: "_ZTS7Element")
!9 = !DIFile(filename: "../dummy_inc/click/element.hh", directory: "/home/john/projects/click/ir-dir")
!10 = !DIDerivedType(tag: DW_TAG_member, name: "_input_sup", scope: !5, file: !4, line: 84, baseType: !11, size: 64, offset: 896)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DICompositeType(tag: DW_TAG_class_type, name: "Suppressor", file: !13, line: 27, flags: DIFlagFwdDecl, identifier: "_ZTS10Suppressor")
!13 = !DIFile(filename: "../elements/standard/suppressor.hh", directory: "/home/john/projects/click/ir-dir")
!14 = !DIDerivedType(tag: DW_TAG_member, name: "_output_sup", scope: !5, file: !4, line: 85, baseType: !11, size: 64, offset: 960)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_switch", scope: !5, file: !4, line: 86, baseType: !16, size: 64, offset: 1024)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "EtherSwitch", file: !4, line: 8, flags: DIFlagFwdDecl, identifier: "_ZTS11EtherSwitch")
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_topology_change", scope: !5, file: !4, line: 87, baseType: !19, size: 64, offset: 1088)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Timestamp", file: !21, line: 122, size: 64, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !22, identifier: "_ZTS9Timestamp")
!21 = !DIFile(filename: "../dummy_inc/click/timestamp.hh", directory: "/home/john/projects/click/ir-dir")
!22 = !{!23, !32, !36, !43, !47, !51, !54, !58, !70, !81, !86, !95, !107, !111, !112, !115, !116, !117, !118, !121, !124, !125, !126, !127, !130, !131, !134, !137, !141, !142, !143, !146, !147, !148, !153, !157, !160, !163, !166, !169, !170, !171, !172, !173, !176, !177, !180, !181, !182, !183, !184, !185, !186, !189, !190, !191, !192, !193, !194, !195, !196, !197, !497, !498, !501, !502, !503, !504, !505, !506, !507, !510, !519, !523, !524, !527, !530, !531, !532, !533, !534, !535, !536, !539, !543, !546, !549, !552}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_t", scope: !20, file: !21, line: 672, baseType: !24, size: 64)
!24 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rep_t", scope: !20, file: !21, line: 539, size: 64, flags: DIFlagTypePassByValue, elements: !25, identifier: "_ZTSN9Timestamp5rep_tE")
!25 = !{!26}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !24, file: !21, line: 541, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !28, line: 27, baseType: !29)
!28 = !DIFile(filename: "/usr/include/bits/stdint-intn.h", directory: "")
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !30, line: 44, baseType: !31)
!30 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!31 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!32 = !DISubprogram(name: "Timestamp", scope: !20, file: !21, line: 174, type: !33, scopeLine: 174, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!33 = !DISubroutineType(types: !34)
!34 = !{null, !35}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!36 = !DISubprogram(name: "Timestamp", scope: !20, file: !21, line: 187, type: !37, scopeLine: 187, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!37 = !DISubroutineType(types: !38)
!38 = !{null, !35, !31, !39}
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !40, line: 26, baseType: !41)
!40 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "")
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !30, line: 42, baseType: !42)
!42 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!43 = !DISubprogram(name: "Timestamp", scope: !20, file: !21, line: 191, type: !44, scopeLine: 191, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !35, !46, !39}
!46 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!47 = !DISubprogram(name: "Timestamp", scope: !20, file: !21, line: 195, type: !48, scopeLine: 195, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !35, !50, !39}
!50 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!51 = !DISubprogram(name: "Timestamp", scope: !20, file: !21, line: 199, type: !52, scopeLine: 199, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!52 = !DISubroutineType(types: !53)
!53 = !{null, !35, !42, !39}
!54 = !DISubprogram(name: "Timestamp", scope: !20, file: !21, line: 203, type: !55, scopeLine: 203, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!55 = !DISubroutineType(types: !56)
!56 = !{null, !35, !57}
!57 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!58 = !DISubprogram(name: "Timestamp", scope: !20, file: !21, line: 206, type: !59, scopeLine: 206, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!59 = !DISubroutineType(types: !60)
!60 = !{null, !35, !61}
!61 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !64, line: 8, size: 128, flags: DIFlagTypePassByValue, elements: !65, identifier: "_ZTS7timeval")
!64 = !DIFile(filename: "/usr/include/bits/types/struct_timeval.h", directory: "")
!65 = !{!66, !68}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !63, file: !64, line: 10, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !30, line: 160, baseType: !31)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !63, file: !64, line: 11, baseType: !69, size: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !30, line: 162, baseType: !31)
!70 = !DISubprogram(name: "Timestamp", scope: !20, file: !21, line: 208, type: !71, scopeLine: 208, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!71 = !DISubroutineType(types: !72)
!72 = !{null, !35, !73}
!73 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !76, line: 10, size: 128, flags: DIFlagTypePassByValue, elements: !77, identifier: "_ZTS8timespec")
!76 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!77 = !{!78, !79}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !75, file: !76, line: 12, baseType: !67, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !75, file: !76, line: 16, baseType: !80, size: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !30, line: 196, baseType: !31)
!81 = !DISubprogram(name: "Timestamp", scope: !20, file: !21, line: 212, type: !82, scopeLine: 212, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!82 = !DISubroutineType(types: !83)
!83 = !{null, !35, !84}
!84 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!86 = !DISubprogram(name: "Timestamp", scope: !20, file: !21, line: 217, type: !87, scopeLine: 217, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!87 = !DISubroutineType(types: !88)
!88 = !{null, !35, !89}
!89 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "uninitialized_t", scope: !20, file: !21, line: 168, baseType: !92)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uninitialized_type", file: !93, line: 317, size: 8, flags: DIFlagTypePassByValue, elements: !94, identifier: "_ZTS18uninitialized_type")
!93 = !DIFile(filename: "../dummy_inc/click/config.h", directory: "/home/john/projects/click/ir-dir")
!94 = !{}
!95 = !DISubprogram(name: "operator int (Timestamp::*)() const", linkageName: "_ZNK9TimestampcvMS_KFivEEv", scope: !20, file: !21, line: 222, type: !96, scopeLine: 222, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!96 = !DISubroutineType(types: !97)
!97 = !{!98, !105}
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "unspecified_bool_type", scope: !20, file: !21, line: 221, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_ptr_to_member_type, baseType: !100, size: 128, extraData: !20)
!100 = !DISubroutineType(types: !101)
!101 = !{!102, !105}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "seconds_type", scope: !20, file: !21, line: 125, baseType: !103)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !28, line: 26, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !30, line: 41, baseType: !46)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!107 = !DISubprogram(name: "is_negative", linkageName: "_ZNK9Timestamp11is_negativeEv", scope: !20, file: !21, line: 225, type: !108, scopeLine: 225, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!108 = !DISubroutineType(types: !109)
!109 = !{!110, !105}
!110 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!111 = !DISubprogram(name: "sec", linkageName: "_ZNK9Timestamp3secEv", scope: !20, file: !21, line: 233, type: !100, scopeLine: 233, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!112 = !DISubprogram(name: "subsec", linkageName: "_ZNK9Timestamp6subsecEv", scope: !20, file: !21, line: 234, type: !113, scopeLine: 234, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!113 = !DISubroutineType(types: !114)
!114 = !{!39, !105}
!115 = !DISubprogram(name: "msec", linkageName: "_ZNK9Timestamp4msecEv", scope: !20, file: !21, line: 235, type: !113, scopeLine: 235, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!116 = !DISubprogram(name: "usec", linkageName: "_ZNK9Timestamp4usecEv", scope: !20, file: !21, line: 236, type: !113, scopeLine: 236, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!117 = !DISubprogram(name: "nsec", linkageName: "_ZNK9Timestamp4nsecEv", scope: !20, file: !21, line: 237, type: !113, scopeLine: 237, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!118 = !DISubprogram(name: "set_sec", linkageName: "_ZN9Timestamp7set_secEi", scope: !20, file: !21, line: 239, type: !119, scopeLine: 239, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!119 = !DISubroutineType(types: !120)
!120 = !{null, !35, !102}
!121 = !DISubprogram(name: "set_subsec", linkageName: "_ZN9Timestamp10set_subsecEj", scope: !20, file: !21, line: 240, type: !122, scopeLine: 240, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!122 = !DISubroutineType(types: !123)
!123 = !{null, !35, !39}
!124 = !DISubprogram(name: "msec1", linkageName: "_ZNK9Timestamp5msec1Ev", scope: !20, file: !21, line: 242, type: !100, scopeLine: 242, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!125 = !DISubprogram(name: "usec1", linkageName: "_ZNK9Timestamp5usec1Ev", scope: !20, file: !21, line: 243, type: !100, scopeLine: 243, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!126 = !DISubprogram(name: "nsec1", linkageName: "_ZNK9Timestamp5nsec1Ev", scope: !20, file: !21, line: 244, type: !100, scopeLine: 244, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!127 = !DISubprogram(name: "timeval", linkageName: "_ZNK9Timestamp7timevalEv", scope: !20, file: !21, line: 250, type: !128, scopeLine: 250, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!128 = !DISubroutineType(types: !129)
!129 = !{!63, !105}
!130 = !DISubprogram(name: "timeval_ceil", linkageName: "_ZNK9Timestamp12timeval_ceilEv", scope: !20, file: !21, line: 251, type: !128, scopeLine: 251, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!131 = !DISubprogram(name: "timespec", linkageName: "_ZNK9Timestamp8timespecEv", scope: !20, file: !21, line: 257, type: !132, scopeLine: 257, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!132 = !DISubroutineType(types: !133)
!133 = !{!75, !105}
!134 = !DISubprogram(name: "doubleval", linkageName: "_ZNK9Timestamp9doublevalEv", scope: !20, file: !21, line: 262, type: !135, scopeLine: 262, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!135 = !DISubroutineType(types: !136)
!136 = !{!57, !105}
!137 = !DISubprogram(name: "msecval", linkageName: "_ZNK9Timestamp7msecvalEv", scope: !20, file: !21, line: 265, type: !138, scopeLine: 265, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!138 = !DISubroutineType(types: !139)
!139 = !{!140, !105}
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "value_type", scope: !20, file: !21, line: 128, baseType: !27)
!141 = !DISubprogram(name: "usecval", linkageName: "_ZNK9Timestamp7usecvalEv", scope: !20, file: !21, line: 273, type: !138, scopeLine: 273, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!142 = !DISubprogram(name: "nsecval", linkageName: "_ZNK9Timestamp7nsecvalEv", scope: !20, file: !21, line: 281, type: !138, scopeLine: 281, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!143 = !DISubprogram(name: "msec_ceil", linkageName: "_ZNK9Timestamp9msec_ceilEv", scope: !20, file: !21, line: 290, type: !144, scopeLine: 290, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!144 = !DISubroutineType(types: !145)
!145 = !{!20, !105}
!146 = !DISubprogram(name: "usec_ceil", linkageName: "_ZNK9Timestamp9usec_ceilEv", scope: !20, file: !21, line: 295, type: !144, scopeLine: 295, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!147 = !DISubprogram(name: "nsec_ceil", linkageName: "_ZNK9Timestamp9nsec_ceilEv", scope: !20, file: !21, line: 304, type: !144, scopeLine: 304, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!148 = !DISubprogram(name: "make_jiffies", linkageName: "_ZN9Timestamp12make_jiffiesEj", scope: !20, file: !21, line: 310, type: !149, scopeLine: 310, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!149 = !DISubroutineType(types: !150)
!150 = !{!20, !151}
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "click_jiffies_t", file: !152, line: 477, baseType: !42)
!152 = !DIFile(filename: "../dummy_inc/click/glue.hh", directory: "/home/john/projects/click/ir-dir")
!153 = !DISubprogram(name: "make_jiffies", linkageName: "_ZN9Timestamp12make_jiffiesEi", scope: !20, file: !21, line: 312, type: !154, scopeLine: 312, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!154 = !DISubroutineType(types: !155)
!155 = !{!20, !156}
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "click_jiffies_difference_t", file: !152, line: 478, baseType: !46)
!157 = !DISubprogram(name: "jiffies", linkageName: "_ZNK9Timestamp7jiffiesEv", scope: !20, file: !21, line: 314, type: !158, scopeLine: 314, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!158 = !DISubroutineType(types: !159)
!159 = !{!151, !105}
!160 = !DISubprogram(name: "make_sec", linkageName: "_ZN9Timestamp8make_secEi", scope: !20, file: !21, line: 318, type: !161, scopeLine: 318, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!161 = !DISubroutineType(types: !162)
!162 = !{!20, !102}
!163 = !DISubprogram(name: "make_msec", linkageName: "_ZN9Timestamp9make_msecEij", scope: !20, file: !21, line: 324, type: !164, scopeLine: 324, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!164 = !DISubroutineType(types: !165)
!165 = !{!20, !102, !39}
!166 = !DISubprogram(name: "make_msec", linkageName: "_ZN9Timestamp9make_msecEl", scope: !20, file: !21, line: 328, type: !167, scopeLine: 328, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!167 = !DISubroutineType(types: !168)
!168 = !{!20, !140}
!169 = !DISubprogram(name: "make_usec", linkageName: "_ZN9Timestamp9make_usecEij", scope: !20, file: !21, line: 341, type: !164, scopeLine: 341, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!170 = !DISubprogram(name: "make_usec", linkageName: "_ZN9Timestamp9make_usecEl", scope: !20, file: !21, line: 345, type: !167, scopeLine: 345, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!171 = !DISubprogram(name: "make_nsec", linkageName: "_ZN9Timestamp9make_nsecEij", scope: !20, file: !21, line: 358, type: !164, scopeLine: 358, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!172 = !DISubprogram(name: "make_nsec", linkageName: "_ZN9Timestamp9make_nsecEl", scope: !20, file: !21, line: 362, type: !167, scopeLine: 362, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!173 = !DISubprogram(name: "epsilon", linkageName: "_ZN9Timestamp7epsilonEv", scope: !20, file: !21, line: 375, type: !174, scopeLine: 375, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!174 = !DISubroutineType(types: !175)
!175 = !{!20}
!176 = !DISubprogram(name: "clear", linkageName: "_ZN9Timestamp5clearEv", scope: !20, file: !21, line: 380, type: !33, scopeLine: 380, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!177 = !DISubprogram(name: "assign", linkageName: "_ZN9Timestamp6assignEij", scope: !20, file: !21, line: 388, type: !178, scopeLine: 388, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!178 = !DISubroutineType(types: !179)
!179 = !{null, !35, !102, !39}
!180 = !DISubprogram(name: "assign_usec", linkageName: "_ZN9Timestamp11assign_usecEij", scope: !20, file: !21, line: 397, type: !178, scopeLine: 397, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!181 = !DISubprogram(name: "assign_nsec", linkageName: "_ZN9Timestamp11assign_nsecEij", scope: !20, file: !21, line: 401, type: !178, scopeLine: 401, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!182 = !DISubprogram(name: "set", linkageName: "_ZN9Timestamp3setEij", scope: !20, file: !21, line: 408, type: !178, scopeLine: 408, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!183 = !DISubprogram(name: "set_usec", linkageName: "_ZN9Timestamp8set_usecEij", scope: !20, file: !21, line: 411, type: !178, scopeLine: 411, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!184 = !DISubprogram(name: "set_nsec", linkageName: "_ZN9Timestamp8set_nsecEij", scope: !20, file: !21, line: 414, type: !178, scopeLine: 414, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!185 = !DISubprogram(name: "set_now", linkageName: "_ZN9Timestamp7set_nowEv", scope: !20, file: !21, line: 417, type: !33, scopeLine: 417, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!186 = !DISubprogram(name: "set_timeval_ioctl", linkageName: "_ZN9Timestamp17set_timeval_ioctlEii", scope: !20, file: !21, line: 420, type: !187, scopeLine: 420, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!187 = !DISubroutineType(types: !188)
!188 = !{!46, !35, !46, !46}
!189 = !DISubprogram(name: "now", linkageName: "_ZN9Timestamp3nowEv", scope: !20, file: !21, line: 432, type: !174, scopeLine: 432, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!190 = !DISubprogram(name: "assign_now", linkageName: "_ZN9Timestamp10assign_nowEv", scope: !20, file: !21, line: 438, type: !33, scopeLine: 438, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!191 = !DISubprogram(name: "recent", linkageName: "_ZN9Timestamp6recentEv", scope: !20, file: !21, line: 446, type: !174, scopeLine: 446, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!192 = !DISubprogram(name: "assign_recent", linkageName: "_ZN9Timestamp13assign_recentEv", scope: !20, file: !21, line: 452, type: !33, scopeLine: 452, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!193 = !DISubprogram(name: "now_steady", linkageName: "_ZN9Timestamp10now_steadyEv", scope: !20, file: !21, line: 466, type: !174, scopeLine: 466, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!194 = !DISubprogram(name: "assign_now_steady", linkageName: "_ZN9Timestamp17assign_now_steadyEv", scope: !20, file: !21, line: 472, type: !33, scopeLine: 472, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!195 = !DISubprogram(name: "recent_steady", linkageName: "_ZN9Timestamp13recent_steadyEv", scope: !20, file: !21, line: 481, type: !174, scopeLine: 481, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!196 = !DISubprogram(name: "assign_recent_steady", linkageName: "_ZN9Timestamp20assign_recent_steadyEv", scope: !20, file: !21, line: 487, type: !33, scopeLine: 487, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!197 = !DISubprogram(name: "unparse", linkageName: "_ZNK9Timestamp7unparseEv", scope: !20, file: !21, line: 496, type: !198, scopeLine: 496, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!198 = !DISubroutineType(types: !199)
!199 = !{!200, !105}
!200 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "String", file: !201, line: 19, size: 192, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !202, identifier: "_ZTS6String")
!201 = !DIFile(filename: "../dummy_inc/click/string.hh", directory: "/home/john/projects/click/ir-dir")
!202 = !{!203, !209, !227, !228, !232, !236, !238, !239, !243, !248, !252, !255, !258, !264, !267, !270, !273, !276, !279, !282, !285, !288, !291, !295, !299, !302, !303, !306, !309, !310, !313, !316, !319, !323, !329, !333, !336, !337, !342, !345, !346, !350, !351, !354, !355, !358, !359, !362, !365, !368, !371, !374, !377, !380, !383, !386, !389, !392, !395, !396, !397, !398, !401, !404, !405, !406, !407, !408, !409, !410, !414, !417, !420, !423, !424, !425, !426, !427, !428, !431, !435, !436, !437, !438, !441, !442, !443, !444, !445, !446, !449, !450, !451, !452, !455, !458, !459, !462, !465, !468, !471, !474, !477, !480, !481, !482, !483, !486, !489, !492, !493, !494}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "bool_data", scope: !200, file: !201, line: 184, baseType: !204, flags: DIFlagPublic | DIFlagStaticMember)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 88, elements: !207)
!205 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !206)
!206 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!207 = !{!208}
!208 = !DISubrange(count: 11)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !200, file: !201, line: 211, baseType: !210, size: 192)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rep_t", scope: !200, file: !201, line: 204, size: 192, flags: DIFlagTypePassByValue, elements: !211, identifier: "_ZTSN6String5rep_tE")
!211 = !{!212, !214, !215}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !210, file: !201, line: 205, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !210, file: !201, line: 206, baseType: !46, size: 32, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "memo", scope: !210, file: !201, line: 207, baseType: !216, size: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "memo_t", scope: !200, file: !201, line: 189, size: 160, flags: DIFlagTypePassByValue, elements: !218, identifier: "_ZTSN6String6memo_tE")
!218 = !{!219, !221, !222, !223}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !217, file: !201, line: 190, baseType: !220, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !39)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !217, file: !201, line: 191, baseType: !39, size: 32, offset: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !217, file: !201, line: 192, baseType: !220, size: 32, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "real_data", scope: !217, file: !201, line: 197, baseType: !224, size: 64, offset: 96)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 64, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 8)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "null_data", scope: !200, file: !201, line: 292, baseType: !205, flags: DIFlagStaticMember)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "oom_data", scope: !200, file: !201, line: 293, baseType: !229, flags: DIFlagStaticMember)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 120, elements: !230)
!230 = !{!231}
!231 = !DISubrange(count: 15)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "int_data", scope: !200, file: !201, line: 294, baseType: !233, flags: DIFlagStaticMember)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 160, elements: !234)
!234 = !{!235}
!235 = !DISubrange(count: 20)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "null_string_rep", scope: !200, file: !201, line: 295, baseType: !237, flags: DIFlagStaticMember)
!237 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !210)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "oom_string_rep", scope: !200, file: !201, line: 296, baseType: !237, flags: DIFlagStaticMember)
!239 = !DISubprogram(name: "String", scope: !200, file: !201, line: 39, type: !240, scopeLine: 39, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!240 = !DISubroutineType(types: !241)
!241 = !{null, !242}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!243 = !DISubprogram(name: "String", scope: !200, file: !201, line: 40, type: !244, scopeLine: 40, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!244 = !DISubroutineType(types: !245)
!245 = !{null, !242, !246}
!246 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !200)
!248 = !DISubprogram(name: "String", scope: !200, file: !201, line: 42, type: !249, scopeLine: 42, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!249 = !DISubroutineType(types: !250)
!250 = !{null, !242, !251}
!251 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !200, size: 64)
!252 = !DISubprogram(name: "String", scope: !200, file: !201, line: 44, type: !253, scopeLine: 44, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!253 = !DISubroutineType(types: !254)
!254 = !{null, !242, !213}
!255 = !DISubprogram(name: "String", scope: !200, file: !201, line: 45, type: !256, scopeLine: 45, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!256 = !DISubroutineType(types: !257)
!257 = !{null, !242, !213, !46}
!258 = !DISubprogram(name: "String", scope: !200, file: !201, line: 46, type: !259, scopeLine: 46, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!259 = !DISubroutineType(types: !260)
!260 = !{null, !242, !261, !46}
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !263)
!263 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!264 = !DISubprogram(name: "String", scope: !200, file: !201, line: 47, type: !265, scopeLine: 47, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!265 = !DISubroutineType(types: !266)
!266 = !{null, !242, !213, !213}
!267 = !DISubprogram(name: "String", scope: !200, file: !201, line: 48, type: !268, scopeLine: 48, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!268 = !DISubroutineType(types: !269)
!269 = !{null, !242, !261, !261}
!270 = !DISubprogram(name: "String", scope: !200, file: !201, line: 49, type: !271, scopeLine: 49, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!271 = !DISubroutineType(types: !272)
!272 = !{null, !242, !110}
!273 = !DISubprogram(name: "String", scope: !200, file: !201, line: 50, type: !274, scopeLine: 50, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!274 = !DISubroutineType(types: !275)
!275 = !{null, !242, !206}
!276 = !DISubprogram(name: "String", scope: !200, file: !201, line: 51, type: !277, scopeLine: 51, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!277 = !DISubroutineType(types: !278)
!278 = !{null, !242, !263}
!279 = !DISubprogram(name: "String", scope: !200, file: !201, line: 52, type: !280, scopeLine: 52, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!280 = !DISubroutineType(types: !281)
!281 = !{null, !242, !46}
!282 = !DISubprogram(name: "String", scope: !200, file: !201, line: 53, type: !283, scopeLine: 53, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!283 = !DISubroutineType(types: !284)
!284 = !{null, !242, !42}
!285 = !DISubprogram(name: "String", scope: !200, file: !201, line: 54, type: !286, scopeLine: 54, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!286 = !DISubroutineType(types: !287)
!287 = !{null, !242, !31}
!288 = !DISubprogram(name: "String", scope: !200, file: !201, line: 55, type: !289, scopeLine: 55, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!289 = !DISubroutineType(types: !290)
!290 = !{null, !242, !50}
!291 = !DISubprogram(name: "String", scope: !200, file: !201, line: 57, type: !292, scopeLine: 57, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!292 = !DISubroutineType(types: !293)
!293 = !{null, !242, !294}
!294 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!295 = !DISubprogram(name: "String", scope: !200, file: !201, line: 58, type: !296, scopeLine: 58, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!296 = !DISubroutineType(types: !297)
!297 = !{null, !242, !298}
!298 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!299 = !DISubprogram(name: "String", scope: !200, file: !201, line: 65, type: !300, scopeLine: 65, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!300 = !DISubroutineType(types: !301)
!301 = !{null, !242, !57}
!302 = !DISubprogram(name: "~String", scope: !200, file: !201, line: 67, type: !240, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!303 = !DISubprogram(name: "make_empty", linkageName: "_ZN6String10make_emptyEv", scope: !200, file: !201, line: 69, type: !304, scopeLine: 69, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!304 = !DISubroutineType(types: !305)
!305 = !{!246}
!306 = !DISubprogram(name: "make_uninitialized", linkageName: "_ZN6String18make_uninitializedEi", scope: !200, file: !201, line: 70, type: !307, scopeLine: 70, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!307 = !DISubroutineType(types: !308)
!308 = !{!200, !46}
!309 = !DISubprogram(name: "make_garbage", linkageName: "_ZN6String12make_garbageEi", scope: !200, file: !201, line: 71, type: !307, scopeLine: 71, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!310 = !DISubprogram(name: "make_stable", linkageName: "_ZN6String11make_stableEPKc", scope: !200, file: !201, line: 72, type: !311, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!311 = !DISubroutineType(types: !312)
!312 = !{!200, !213}
!313 = !DISubprogram(name: "make_stable", linkageName: "_ZN6String11make_stableEPKci", scope: !200, file: !201, line: 73, type: !314, scopeLine: 73, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!314 = !DISubroutineType(types: !315)
!315 = !{!200, !213, !46}
!316 = !DISubprogram(name: "make_stable", linkageName: "_ZN6String11make_stableEPKcS1_", scope: !200, file: !201, line: 74, type: !317, scopeLine: 74, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!317 = !DISubroutineType(types: !318)
!318 = !{!200, !213, !213}
!319 = !DISubprogram(name: "make_numeric", linkageName: "_ZN6String12make_numericElib", scope: !200, file: !201, line: 75, type: !320, scopeLine: 75, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!320 = !DISubroutineType(types: !321)
!321 = !{!200, !322, !46, !110}
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", scope: !200, file: !201, line: 27, baseType: !27)
!323 = !DISubprogram(name: "make_numeric", linkageName: "_ZN6String12make_numericEmib", scope: !200, file: !201, line: 76, type: !324, scopeLine: 76, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!324 = !DISubroutineType(types: !325)
!325 = !{!200, !326, !46, !110}
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", scope: !200, file: !201, line: 28, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !40, line: 27, baseType: !328)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !30, line: 45, baseType: !50)
!329 = !DISubprogram(name: "data", linkageName: "_ZNK6String4dataEv", scope: !200, file: !201, line: 78, type: !330, scopeLine: 78, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!330 = !DISubroutineType(types: !331)
!331 = !{!213, !332}
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!333 = !DISubprogram(name: "length", linkageName: "_ZNK6String6lengthEv", scope: !200, file: !201, line: 79, type: !334, scopeLine: 79, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!334 = !DISubroutineType(types: !335)
!335 = !{!46, !332}
!336 = !DISubprogram(name: "c_str", linkageName: "_ZNK6String5c_strEv", scope: !200, file: !201, line: 81, type: !330, scopeLine: 81, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!337 = !DISubprogram(name: "operator int (String::*)() const", linkageName: "_ZNK6StringcvMS_KFivEEv", scope: !200, file: !201, line: 83, type: !338, scopeLine: 83, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!338 = !DISubroutineType(types: !339)
!339 = !{!340, !332}
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "unspecified_bool_type", scope: !200, file: !201, line: 24, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_ptr_to_member_type, baseType: !334, size: 128, extraData: !200)
!342 = !DISubprogram(name: "empty", linkageName: "_ZNK6String5emptyEv", scope: !200, file: !201, line: 84, type: !343, scopeLine: 84, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!343 = !DISubroutineType(types: !344)
!344 = !{!110, !332}
!345 = !DISubprogram(name: "operator!", linkageName: "_ZNK6StringntEv", scope: !200, file: !201, line: 85, type: !343, scopeLine: 85, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!346 = !DISubprogram(name: "begin", linkageName: "_ZNK6String5beginEv", scope: !200, file: !201, line: 87, type: !347, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!347 = !DISubroutineType(types: !348)
!348 = !{!349, !332}
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_iterator", scope: !200, file: !201, line: 21, baseType: !213)
!350 = !DISubprogram(name: "end", linkageName: "_ZNK6String3endEv", scope: !200, file: !201, line: 88, type: !347, scopeLine: 88, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!351 = !DISubprogram(name: "operator[]", linkageName: "_ZNK6StringixEi", scope: !200, file: !201, line: 90, type: !352, scopeLine: 90, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!352 = !DISubroutineType(types: !353)
!353 = !{!206, !332, !46}
!354 = !DISubprogram(name: "at", linkageName: "_ZNK6String2atEi", scope: !200, file: !201, line: 91, type: !352, scopeLine: 91, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!355 = !DISubprogram(name: "front", linkageName: "_ZNK6String5frontEv", scope: !200, file: !201, line: 92, type: !356, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!356 = !DISubroutineType(types: !357)
!357 = !{!206, !332}
!358 = !DISubprogram(name: "back", linkageName: "_ZNK6String4backEv", scope: !200, file: !201, line: 93, type: !356, scopeLine: 93, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!359 = !DISubprogram(name: "hashcode", linkageName: "_ZN6String8hashcodeEPKcS1_", scope: !200, file: !201, line: 95, type: !360, scopeLine: 95, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!360 = !DISubroutineType(types: !361)
!361 = !{!39, !213, !213}
!362 = !DISubprogram(name: "hashcode", linkageName: "_ZN6String8hashcodeEPKhS1_", scope: !200, file: !201, line: 96, type: !363, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!363 = !DISubroutineType(types: !364)
!364 = !{!39, !261, !261}
!365 = !DISubprogram(name: "hashcode", linkageName: "_ZNK6String8hashcodeEv", scope: !200, file: !201, line: 98, type: !366, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!366 = !DISubroutineType(types: !367)
!367 = !{!39, !332}
!368 = !DISubprogram(name: "substring", linkageName: "_ZNK6String9substringEPKcS1_", scope: !200, file: !201, line: 100, type: !369, scopeLine: 100, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!369 = !DISubroutineType(types: !370)
!370 = !{!200, !332, !213, !213}
!371 = !DISubprogram(name: "substring", linkageName: "_ZNK6String9substringEii", scope: !200, file: !201, line: 101, type: !372, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!372 = !DISubroutineType(types: !373)
!373 = !{!200, !332, !46, !46}
!374 = !DISubprogram(name: "substring", linkageName: "_ZNK6String9substringEi", scope: !200, file: !201, line: 102, type: !375, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!375 = !DISubroutineType(types: !376)
!376 = !{!200, !332, !46}
!377 = !DISubprogram(name: "trim_space", linkageName: "_ZNK6String10trim_spaceEv", scope: !200, file: !201, line: 103, type: !378, scopeLine: 103, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!378 = !DISubroutineType(types: !379)
!379 = !{!200, !332}
!380 = !DISubprogram(name: "equals", linkageName: "_ZNK6String6equalsERKS_", scope: !200, file: !201, line: 105, type: !381, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!381 = !DISubroutineType(types: !382)
!382 = !{!110, !332, !246}
!383 = !DISubprogram(name: "equals", linkageName: "_ZNK6String6equalsEPKci", scope: !200, file: !201, line: 106, type: !384, scopeLine: 106, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!384 = !DISubroutineType(types: !385)
!385 = !{!110, !332, !213, !46}
!386 = !DISubprogram(name: "compare", linkageName: "_ZN6String7compareERKS_S1_", scope: !200, file: !201, line: 107, type: !387, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!387 = !DISubroutineType(types: !388)
!388 = !{!46, !246, !246}
!389 = !DISubprogram(name: "compare", linkageName: "_ZNK6String7compareERKS_", scope: !200, file: !201, line: 108, type: !390, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!390 = !DISubroutineType(types: !391)
!391 = !{!46, !332, !246}
!392 = !DISubprogram(name: "compare", linkageName: "_ZNK6String7compareEPKci", scope: !200, file: !201, line: 109, type: !393, scopeLine: 109, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!393 = !DISubroutineType(types: !394)
!394 = !{!46, !332, !213, !46}
!395 = !DISubprogram(name: "starts_with", linkageName: "_ZNK6String11starts_withERKS_", scope: !200, file: !201, line: 110, type: !381, scopeLine: 110, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!396 = !DISubprogram(name: "starts_with", linkageName: "_ZNK6String11starts_withEPKci", scope: !200, file: !201, line: 111, type: !384, scopeLine: 111, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!397 = !DISubprogram(name: "glob_match", linkageName: "_ZNK6String10glob_matchERKS_", scope: !200, file: !201, line: 112, type: !381, scopeLine: 112, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!398 = !DISubprogram(name: "find_left", linkageName: "_ZNK6String9find_leftEci", scope: !200, file: !201, line: 125, type: !399, scopeLine: 125, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!399 = !DISubroutineType(types: !400)
!400 = !{!46, !332, !206, !46}
!401 = !DISubprogram(name: "find_left", linkageName: "_ZNK6String9find_leftERKS_i", scope: !200, file: !201, line: 126, type: !402, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!402 = !DISubroutineType(types: !403)
!403 = !{!46, !332, !246, !46}
!404 = !DISubprogram(name: "find_right", linkageName: "_ZNK6String10find_rightEci", scope: !200, file: !201, line: 127, type: !399, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!405 = !DISubprogram(name: "lower", linkageName: "_ZNK6String5lowerEv", scope: !200, file: !201, line: 129, type: !378, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!406 = !DISubprogram(name: "upper", linkageName: "_ZNK6String5upperEv", scope: !200, file: !201, line: 130, type: !378, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!407 = !DISubprogram(name: "printable", linkageName: "_ZNK6String9printableEv", scope: !200, file: !201, line: 131, type: !378, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!408 = !DISubprogram(name: "quoted_hex", linkageName: "_ZNK6String10quoted_hexEv", scope: !200, file: !201, line: 132, type: !378, scopeLine: 132, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!409 = !DISubprogram(name: "encode_json", linkageName: "_ZNK6String11encode_jsonEv", scope: !200, file: !201, line: 133, type: !378, scopeLine: 133, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!410 = !DISubprogram(name: "operator=", linkageName: "_ZN6StringaSERKS_", scope: !200, file: !201, line: 135, type: !411, scopeLine: 135, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!411 = !DISubroutineType(types: !412)
!412 = !{!413, !242, !246}
!413 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !200, size: 64)
!414 = !DISubprogram(name: "operator=", linkageName: "_ZN6StringaSEOS_", scope: !200, file: !201, line: 137, type: !415, scopeLine: 137, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!415 = !DISubroutineType(types: !416)
!416 = !{!413, !242, !251}
!417 = !DISubprogram(name: "operator=", linkageName: "_ZN6StringaSEPKc", scope: !200, file: !201, line: 139, type: !418, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!418 = !DISubroutineType(types: !419)
!419 = !{!413, !242, !213}
!420 = !DISubprogram(name: "swap", linkageName: "_ZN6String4swapERS_", scope: !200, file: !201, line: 141, type: !421, scopeLine: 141, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!421 = !DISubroutineType(types: !422)
!422 = !{null, !242, !413}
!423 = !DISubprogram(name: "append", linkageName: "_ZN6String6appendERKS_", scope: !200, file: !201, line: 143, type: !244, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!424 = !DISubprogram(name: "append", linkageName: "_ZN6String6appendEPKc", scope: !200, file: !201, line: 144, type: !253, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!425 = !DISubprogram(name: "append", linkageName: "_ZN6String6appendEPKci", scope: !200, file: !201, line: 145, type: !256, scopeLine: 145, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!426 = !DISubprogram(name: "append", linkageName: "_ZN6String6appendEPKcS1_", scope: !200, file: !201, line: 146, type: !265, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!427 = !DISubprogram(name: "append", linkageName: "_ZN6String6appendEc", scope: !200, file: !201, line: 147, type: !274, scopeLine: 147, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!428 = !DISubprogram(name: "append_fill", linkageName: "_ZN6String11append_fillEii", scope: !200, file: !201, line: 148, type: !429, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!429 = !DISubroutineType(types: !430)
!430 = !{null, !242, !46, !46}
!431 = !DISubprogram(name: "append_uninitialized", linkageName: "_ZN6String20append_uninitializedEi", scope: !200, file: !201, line: 149, type: !432, scopeLine: 149, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!432 = !DISubroutineType(types: !433)
!433 = !{!434, !242, !46}
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!435 = !DISubprogram(name: "append_garbage", linkageName: "_ZN6String14append_garbageEi", scope: !200, file: !201, line: 150, type: !432, scopeLine: 150, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!436 = !DISubprogram(name: "operator+=", linkageName: "_ZN6StringpLERKS_", scope: !200, file: !201, line: 152, type: !411, scopeLine: 152, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!437 = !DISubprogram(name: "operator+=", linkageName: "_ZN6StringpLEPKc", scope: !200, file: !201, line: 153, type: !418, scopeLine: 153, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!438 = !DISubprogram(name: "operator+=", linkageName: "_ZN6StringpLEc", scope: !200, file: !201, line: 154, type: !439, scopeLine: 154, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!439 = !DISubroutineType(types: !440)
!440 = !{!413, !242, !206}
!441 = !DISubprogram(name: "is_shared", linkageName: "_ZNK6String9is_sharedEv", scope: !200, file: !201, line: 160, type: !343, scopeLine: 160, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!442 = !DISubprogram(name: "is_stable", linkageName: "_ZNK6String9is_stableEv", scope: !200, file: !201, line: 161, type: !343, scopeLine: 161, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!443 = !DISubprogram(name: "unique", linkageName: "_ZNK6String6uniqueEv", scope: !200, file: !201, line: 163, type: !378, scopeLine: 163, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!444 = !DISubprogram(name: "unshared", linkageName: "_ZNK6String8unsharedEv", scope: !200, file: !201, line: 164, type: !378, scopeLine: 164, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!445 = !DISubprogram(name: "compact", linkageName: "_ZNK6String7compactEv", scope: !200, file: !201, line: 165, type: !378, scopeLine: 165, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!446 = !DISubprogram(name: "mutable_data", linkageName: "_ZN6String12mutable_dataEv", scope: !200, file: !201, line: 167, type: !447, scopeLine: 167, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!447 = !DISubroutineType(types: !448)
!448 = !{!434, !242}
!449 = !DISubprogram(name: "mutable_c_str", linkageName: "_ZN6String13mutable_c_strEv", scope: !200, file: !201, line: 168, type: !447, scopeLine: 168, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!450 = !DISubprogram(name: "make_out_of_memory", linkageName: "_ZN6String18make_out_of_memoryEv", scope: !200, file: !201, line: 170, type: !304, scopeLine: 170, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!451 = !DISubprogram(name: "out_of_memory", linkageName: "_ZNK6String13out_of_memoryEv", scope: !200, file: !201, line: 171, type: !343, scopeLine: 171, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!452 = !DISubprogram(name: "out_of_memory_data", linkageName: "_ZN6String18out_of_memory_dataEv", scope: !200, file: !201, line: 172, type: !453, scopeLine: 172, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!453 = !DISubroutineType(types: !454)
!454 = !{!213}
!455 = !DISubprogram(name: "out_of_memory_length", linkageName: "_ZN6String20out_of_memory_lengthEv", scope: !200, file: !201, line: 173, type: !456, scopeLine: 173, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!456 = !DISubroutineType(types: !457)
!457 = !{!46}
!458 = !DISubprogram(name: "empty_data", linkageName: "_ZN6String10empty_dataEv", scope: !200, file: !201, line: 174, type: !453, scopeLine: 174, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!459 = !DISubprogram(name: "skip_utf8_char", linkageName: "_ZN6String14skip_utf8_charEPKcS1_", scope: !200, file: !201, line: 180, type: !460, scopeLine: 180, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!460 = !DISubroutineType(types: !461)
!461 = !{!213, !213, !213}
!462 = !DISubprogram(name: "skip_utf8_char", linkageName: "_ZN6String14skip_utf8_charEPKhS1_", scope: !200, file: !201, line: 181, type: !463, scopeLine: 181, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!463 = !DISubroutineType(types: !464)
!464 = !{!261, !261, !261}
!465 = !DISubprogram(name: "assign_memo", linkageName: "_ZNK6String11assign_memoEPKciPNS_6memo_tE", scope: !200, file: !201, line: 256, type: !466, scopeLine: 256, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!466 = !DISubroutineType(types: !467)
!467 = !{null, !332, !213, !46, !216}
!468 = !DISubprogram(name: "String", scope: !200, file: !201, line: 263, type: !469, scopeLine: 263, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!469 = !DISubroutineType(types: !470)
!470 = !{null, !242, !213, !46, !216}
!471 = !DISubprogram(name: "assign", linkageName: "_ZNK6String6assignERKS_", scope: !200, file: !201, line: 267, type: !472, scopeLine: 267, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!472 = !DISubroutineType(types: !473)
!473 = !{null, !332, !246}
!474 = !DISubprogram(name: "deref", linkageName: "_ZNK6String5derefEv", scope: !200, file: !201, line: 271, type: !475, scopeLine: 271, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!475 = !DISubroutineType(types: !476)
!476 = !{null, !332}
!477 = !DISubprogram(name: "assign", linkageName: "_ZN6String6assignEPKcib", scope: !200, file: !201, line: 280, type: !478, scopeLine: 280, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!478 = !DISubroutineType(types: !479)
!479 = !{null, !242, !213, !46, !110}
!480 = !DISubprogram(name: "assign_out_of_memory", linkageName: "_ZN6String20assign_out_of_memoryEv", scope: !200, file: !201, line: 281, type: !240, scopeLine: 281, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!481 = !DISubprogram(name: "append", linkageName: "_ZN6String6appendEPKciPNS_6memo_tE", scope: !200, file: !201, line: 282, type: !469, scopeLine: 282, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!482 = !DISubprogram(name: "hard_make_stable", linkageName: "_ZN6String16hard_make_stableEPKci", scope: !200, file: !201, line: 283, type: !314, scopeLine: 283, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!483 = !DISubprogram(name: "absent_memo", linkageName: "_ZN6String11absent_memoEv", scope: !200, file: !201, line: 284, type: !484, scopeLine: 284, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!484 = !DISubroutineType(types: !485)
!485 = !{!216}
!486 = !DISubprogram(name: "create_memo", linkageName: "_ZN6String11create_memoEPcii", scope: !200, file: !201, line: 287, type: !487, scopeLine: 287, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!487 = !DISubroutineType(types: !488)
!488 = !{!216, !434, !46, !46}
!489 = !DISubprogram(name: "delete_memo", linkageName: "_ZN6String11delete_memoEPNS_6memo_tE", scope: !200, file: !201, line: 288, type: !490, scopeLine: 288, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!490 = !DISubroutineType(types: !491)
!491 = !{null, !216}
!492 = !DISubprogram(name: "hard_c_str", linkageName: "_ZNK6String10hard_c_strEv", scope: !200, file: !201, line: 289, type: !330, scopeLine: 289, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!493 = !DISubprogram(name: "hard_equals", linkageName: "_ZNK6String11hard_equalsEPKci", scope: !200, file: !201, line: 290, type: !384, scopeLine: 290, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!494 = !DISubprogram(name: "make_claim", linkageName: "_ZN6String10make_claimEPcii", scope: !200, file: !201, line: 299, type: !495, scopeLine: 299, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!495 = !DISubroutineType(types: !496)
!496 = !{!200, !434, !46, !46}
!497 = !DISubprogram(name: "unparse_interval", linkageName: "_ZNK9Timestamp16unparse_intervalEv", scope: !20, file: !21, line: 501, type: !198, scopeLine: 501, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!498 = !DISubprogram(name: "msec_to_subsec", linkageName: "_ZN9Timestamp14msec_to_subsecEj", scope: !20, file: !21, line: 510, type: !499, scopeLine: 510, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!499 = !DISubroutineType(types: !500)
!500 = !{!39, !39}
!501 = !DISubprogram(name: "usec_to_subsec", linkageName: "_ZN9Timestamp14usec_to_subsecEj", scope: !20, file: !21, line: 514, type: !499, scopeLine: 514, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!502 = !DISubprogram(name: "nsec_to_subsec", linkageName: "_ZN9Timestamp14nsec_to_subsecEj", scope: !20, file: !21, line: 518, type: !499, scopeLine: 518, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!503 = !DISubprogram(name: "subsec_to_msec", linkageName: "_ZN9Timestamp14subsec_to_msecEj", scope: !20, file: !21, line: 522, type: !499, scopeLine: 522, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!504 = !DISubprogram(name: "subsec_to_usec", linkageName: "_ZN9Timestamp14subsec_to_usecEj", scope: !20, file: !21, line: 526, type: !499, scopeLine: 526, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!505 = !DISubprogram(name: "subsec_to_nsec", linkageName: "_ZN9Timestamp14subsec_to_nsecEj", scope: !20, file: !21, line: 530, type: !499, scopeLine: 530, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!506 = !DISubprogram(name: "warp_class", linkageName: "_ZN9Timestamp10warp_classEv", scope: !20, file: !21, line: 581, type: !456, scopeLine: 581, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!507 = !DISubprogram(name: "warp_speed", linkageName: "_ZN9Timestamp10warp_speedEv", scope: !20, file: !21, line: 588, type: !508, scopeLine: 588, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!508 = !DISubroutineType(types: !509)
!509 = !{!57}
!510 = !DISubprogram(name: "warp_set_class", linkageName: "_ZN9Timestamp14warp_set_classENS_15warp_class_typeEd", scope: !20, file: !21, line: 621, type: !511, scopeLine: 621, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!511 = !DISubroutineType(types: !512)
!512 = !{null, !513, !57}
!513 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "warp_class_type", scope: !20, file: !21, line: 571, baseType: !42, size: 32, elements: !514, identifier: "_ZTSN9Timestamp15warp_class_typeE")
!514 = !{!515, !516, !517, !518}
!515 = !DIEnumerator(name: "warp_none", value: 0, isUnsigned: true)
!516 = !DIEnumerator(name: "warp_linear", value: 1, isUnsigned: true)
!517 = !DIEnumerator(name: "warp_nowait", value: 2, isUnsigned: true)
!518 = !DIEnumerator(name: "warp_simulation", value: 3, isUnsigned: true)
!519 = !DISubprogram(name: "warp_set_now", linkageName: "_ZN9Timestamp12warp_set_nowERKS_S1_", scope: !20, file: !21, line: 628, type: !520, scopeLine: 628, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!520 = !DISubroutineType(types: !521)
!521 = !{null, !522, !522}
!522 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !106, size: 64)
!523 = !DISubprogram(name: "warp_real_delay", linkageName: "_ZNK9Timestamp15warp_real_delayEv", scope: !20, file: !21, line: 632, type: !144, scopeLine: 632, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!524 = !DISubprogram(name: "warp_jumping", linkageName: "_ZN9Timestamp12warp_jumpingEv", scope: !20, file: !21, line: 635, type: !525, scopeLine: 635, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!525 = !DISubroutineType(types: !526)
!526 = !{!110}
!527 = !DISubprogram(name: "warp_jump_steady", linkageName: "_ZN9Timestamp16warp_jump_steadyERKS_", scope: !20, file: !21, line: 640, type: !528, scopeLine: 640, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!528 = !DISubroutineType(types: !529)
!529 = !{null, !522}
!530 = !DISubprogram(name: "now_unwarped", linkageName: "_ZN9Timestamp12now_unwarpedEv", scope: !20, file: !21, line: 647, type: !174, scopeLine: 647, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!531 = !DISubprogram(name: "assign_now_unwarped", linkageName: "_ZN9Timestamp19assign_now_unwarpedEv", scope: !20, file: !21, line: 653, type: !33, scopeLine: 653, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!532 = !DISubprogram(name: "now_steady_unwarped", linkageName: "_ZN9Timestamp19now_steady_unwarpedEv", scope: !20, file: !21, line: 659, type: !174, scopeLine: 659, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!533 = !DISubprogram(name: "assign_now_steady_unwarped", linkageName: "_ZN9Timestamp26assign_now_steady_unwarpedEv", scope: !20, file: !21, line: 666, type: !33, scopeLine: 666, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!534 = !DISubprogram(name: "add_fix", linkageName: "_ZN9Timestamp7add_fixEv", scope: !20, file: !21, line: 674, type: !33, scopeLine: 674, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!535 = !DISubprogram(name: "sub_fix", linkageName: "_ZN9Timestamp7sub_fixEv", scope: !20, file: !21, line: 686, type: !33, scopeLine: 686, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!536 = !DISubprogram(name: "value_div", linkageName: "_ZN9Timestamp9value_divElj", scope: !20, file: !21, line: 698, type: !537, scopeLine: 698, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!537 = !DISubroutineType(types: !538)
!538 = !{!140, !140, !39}
!539 = !DISubprogram(name: "value_div_mod", linkageName: "_ZN9Timestamp13value_div_modERiS0_lj", scope: !20, file: !21, line: 702, type: !540, scopeLine: 702, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!540 = !DISubroutineType(types: !541)
!541 = !{null, !542, !542, !140, !39}
!542 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !103, size: 64)
!543 = !DISubprogram(name: "assign_now", linkageName: "_ZN9Timestamp10assign_nowEbbb", scope: !20, file: !21, line: 709, type: !544, scopeLine: 709, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!544 = !DISubroutineType(types: !545)
!545 = !{null, !35, !110, !110, !110}
!546 = !DISubprogram(name: "warp_adjust", linkageName: "_ZN9Timestamp11warp_adjustEbRKS_S1_", scope: !20, file: !21, line: 712, type: !547, scopeLine: 712, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!547 = !DISubroutineType(types: !548)
!548 = !{null, !110, !522, !522}
!549 = !DISubprogram(name: "warped", linkageName: "_ZNK9Timestamp6warpedEb", scope: !20, file: !21, line: 713, type: !550, scopeLine: 713, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!550 = !DISubroutineType(types: !551)
!551 = !{!20, !105, !110}
!552 = !DISubprogram(name: "warp", linkageName: "_ZN9Timestamp4warpEbb", scope: !20, file: !21, line: 714, type: !553, scopeLine: 714, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!553 = !DISubroutineType(types: !554)
!554 = !{null, !35, !110, !110}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_send_tc_msg", scope: !5, file: !4, line: 88, baseType: !110, size: 8, offset: 1152)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_bridge_id", scope: !5, file: !4, line: 90, baseType: !327, size: 64, offset: 1216)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_bridge_priority", scope: !5, file: !4, line: 92, baseType: !558, size: 16, offset: 1280)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !40, line: 25, baseType: !559)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !30, line: 40, baseType: !560)
!560 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_long_cache_timeout", scope: !5, file: !4, line: 93, baseType: !558, size: 16, offset: 1296)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_addr", scope: !5, file: !4, line: 95, baseType: !563, size: 48, offset: 1312)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !564, size: 48, elements: !566)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !40, line: 24, baseType: !565)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !30, line: 38, baseType: !263)
!566 = !{!567}
!567 = !DISubrange(count: 6)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "_best", scope: !5, file: !4, line: 97, baseType: !569, size: 384, offset: 1408)
!569 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "BridgeMessage", file: !570, line: 9, size: 384, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !571, identifier: "_ZTS13BridgeMessage")
!570 = !DIFile(filename: "../elements/etherswitch/bridgemessage.hh", directory: "/home/john/projects/click/ir-dir")
!571 = !{!572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !586, !618, !621, !622, !628, !631, !634, !635, !639, !642, !645, !648}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_max_age", scope: !569, file: !570, line: 71, baseType: !39, size: 32, flags: DIFlagPublic)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "_hello_time", scope: !569, file: !570, line: 72, baseType: !39, size: 32, offset: 32, flags: DIFlagPublic)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_forward_delay", scope: !569, file: !570, line: 73, baseType: !39, size: 32, offset: 64, flags: DIFlagPublic)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "_root", scope: !569, file: !570, line: 76, baseType: !327, size: 64, offset: 128)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_bridge_id", scope: !569, file: !570, line: 77, baseType: !327, size: 64, offset: 192)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "_cost", scope: !569, file: !570, line: 78, baseType: !39, size: 32, offset: 256, flags: DIFlagPublic)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_port_id", scope: !569, file: !570, line: 79, baseType: !558, size: 16, offset: 288)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_tc", scope: !569, file: !570, line: 81, baseType: !110, size: 8, offset: 304)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_timestamp", scope: !569, file: !570, line: 83, baseType: !20, size: 64, offset: 320)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_all_bridges", scope: !569, file: !570, line: 87, baseType: !563, flags: DIFlagStaticMember)
!582 = !DISubprogram(name: "BridgeMessage", scope: !569, file: !570, line: 13, type: !583, scopeLine: 13, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!583 = !DISubroutineType(types: !584)
!584 = !{null, !585}
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!586 = !DISubprogram(name: "BridgeMessage", scope: !569, file: !570, line: 14, type: !587, scopeLine: 14, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!587 = !DISubroutineType(types: !588)
!588 = !{null, !585, !589}
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !591)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wire", scope: !569, file: !570, line: 40, size: 480, flags: DIFlagTypePassByValue, elements: !592, identifier: "_ZTSN13BridgeMessage4wireE")
!592 = !{!593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !614}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !591, file: !570, line: 40, baseType: !563, size: 48)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !591, file: !570, line: 40, baseType: !563, size: 48, offset: 48)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !591, file: !570, line: 40, baseType: !558, size: 16, offset: 96)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "sap", scope: !591, file: !570, line: 40, baseType: !558, size: 16, offset: 112)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "ctl", scope: !591, file: !570, line: 40, baseType: !564, size: 8, offset: 128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !591, file: !570, line: 40, baseType: !558, size: 16, offset: 136)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !591, file: !570, line: 40, baseType: !564, size: 8, offset: 152)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !591, file: !570, line: 40, baseType: !564, size: 8, offset: 160)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !591, file: !570, line: 40, baseType: !42, size: 1, offset: 168, flags: DIFlagBitField, extraData: i64 168)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !591, file: !570, line: 40, baseType: !42, size: 6, offset: 169, flags: DIFlagBitField, extraData: i64 168)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "tca", scope: !591, file: !570, line: 40, baseType: !42, size: 1, offset: 175, flags: DIFlagBitField, extraData: i64 168)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !591, file: !570, line: 40, baseType: !327, size: 64, offset: 176)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !591, file: !570, line: 40, baseType: !39, size: 32, offset: 240)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "bridge_id", scope: !591, file: !570, line: 40, baseType: !327, size: 64, offset: 272)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "port_id", scope: !591, file: !570, line: 40, baseType: !558, size: 16, offset: 336)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "message_age", scope: !591, file: !570, line: 40, baseType: !558, size: 16, offset: 352)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "max_age", scope: !591, file: !570, line: 40, baseType: !558, size: 16, offset: 368)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "hello_time", scope: !591, file: !570, line: 40, baseType: !558, size: 16, offset: 384)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "forward_delay", scope: !591, file: !570, line: 40, baseType: !558, size: 16, offset: 400)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !591, file: !570, line: 40, baseType: !613, size: 64, offset: 416)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !564, size: 64, elements: !225)
!614 = !DISubprogram(name: "s", linkageName: "_ZNK13BridgeMessage4wire1sE6String", scope: !591, file: !570, line: 40, type: !615, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!615 = !DISubroutineType(types: !616)
!616 = !{!200, !617, !200}
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!618 = !DISubprogram(name: "reset", linkageName: "_ZN13BridgeMessage5resetEm", scope: !569, file: !570, line: 17, type: !619, scopeLine: 17, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!619 = !DISubroutineType(types: !620)
!620 = !{null, !585, !327}
!621 = !DISubprogram(name: "from_wire", linkageName: "_ZN13BridgeMessage9from_wireEPKNS_4wireE", scope: !569, file: !570, line: 18, type: !587, scopeLine: 18, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!622 = !DISubprogram(name: "to_wire", linkageName: "_ZNK13BridgeMessage7to_wireEPNS_4wireE", scope: !569, file: !570, line: 19, type: !623, scopeLine: 19, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!623 = !DISubroutineType(types: !624)
!624 = !{null, !625, !627}
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!626 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !569)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!628 = !DISubprogram(name: "fill_tcm", linkageName: "_ZN13BridgeMessage8fill_tcmEPNS_4wireE", scope: !569, file: !570, line: 20, type: !629, scopeLine: 20, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!629 = !DISubroutineType(types: !630)
!630 = !{null, !627}
!631 = !DISubprogram(name: "expire", linkageName: "_ZN13BridgeMessage6expireERK9Timestamp", scope: !569, file: !570, line: 23, type: !632, scopeLine: 23, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!632 = !DISubroutineType(types: !633)
!633 = !{!110, !585, !522}
!634 = !DISubprogram(name: "expire", linkageName: "_ZN13BridgeMessage6expireEv", scope: !569, file: !570, line: 24, type: !583, scopeLine: 24, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!635 = !DISubprogram(name: "compare", linkageName: "_ZNK13BridgeMessage7compareEPKS_", scope: !569, file: !570, line: 33, type: !636, scopeLine: 33, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!636 = !DISubroutineType(types: !637)
!637 = !{!46, !625, !638}
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!639 = !DISubprogram(name: "compare", linkageName: "_ZNK13BridgeMessage7compareEPKNS_4wireE", scope: !569, file: !570, line: 34, type: !640, scopeLine: 34, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!640 = !DISubroutineType(types: !641)
!641 = !{!46, !625, !589}
!642 = !DISubprogram(name: "compare", linkageName: "_ZNK13BridgeMessage7compareEPKS_mt", scope: !569, file: !570, line: 35, type: !643, scopeLine: 35, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!643 = !DISubroutineType(types: !644)
!644 = !{!46, !625, !638, !327, !558}
!645 = !DISubprogram(name: "s", linkageName: "_ZNK13BridgeMessage1sE6String", scope: !569, file: !570, line: 38, type: !646, scopeLine: 38, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!646 = !DISubroutineType(types: !647)
!647 = !{!200, !625, !200}
!648 = !DISubprogram(name: "prep_msg", linkageName: "_ZN13BridgeMessage8prep_msgEPNS_4wireE", scope: !569, file: !570, line: 86, type: !629, scopeLine: 86, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_port", scope: !5, file: !4, line: 112, baseType: !650, size: 128, offset: 1792)
!650 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Vector<EtherSpanTree::PortInfo>", file: !651, line: 111, size: 128, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !652, templateParams: !866, identifier: "_ZTS6VectorIN13EtherSpanTree8PortInfoEE")
!651 = !DIFile(filename: "../dummy_inc/click/vector.hh", directory: "/home/john/projects/click/ir-dir")
!652 = !{!653, !746, !750, !775, !780, !784, !788, !791, !794, !799, !800, !806, !807, !808, !809, !812, !813, !816, !817, !820, !824, !827, !828, !829, !832, !835, !836, !837, !838, !839, !840, !841, !844, !847, !850, !851, !852, !853, !856, !859, !862, !863}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "vm_", scope: !650, file: !651, line: 114, baseType: !654, size: 128)
!654 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "vector_memory<sized_array_memory<72> >", file: !651, line: 11, size: 128, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !655, templateParams: !744, identifier: "_ZTS13vector_memoryI18sized_array_memoryILm72EEE")
!655 = !{!656, !695, !697, !698, !705, !709, !710, !714, !717, !718, !722, !723, !726, !729, !732, !735, !736, !737, !740}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "l_", scope: !654, file: !651, line: 68, baseType: !657, size: 64, flags: DIFlagPublic)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "type", scope: !654, file: !651, line: 13, baseType: !659)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "type", scope: !661, file: !660, line: 11, baseType: !686)
!660 = !DIFile(filename: "../dummy_inc/click/array_memory.hh", directory: "/home/john/projects/click/ir-dir")
!661 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "sized_array_memory<72>", file: !660, line: 10, size: 8, flags: DIFlagTypePassByValue, elements: !662, templateParams: !684, identifier: "_ZTS18sized_array_memoryILm72EE")
!662 = !{!663, !671, !674, !677, !678, !679, !682, !683}
!663 = !DISubprogram(name: "fill", linkageName: "_ZN18sized_array_memoryILm72EE4fillEPvmPKv", scope: !661, file: !660, line: 19, type: !664, scopeLine: 19, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!664 = !DISubroutineType(types: !665)
!665 = !{null, !666, !667, !669}
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !668, line: 46, baseType: !50)
!668 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!671 = !DISubprogram(name: "move_construct", linkageName: "_ZN18sized_array_memoryILm72EE14move_constructEPvS1_", scope: !661, file: !660, line: 23, type: !672, scopeLine: 23, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!672 = !DISubroutineType(types: !673)
!673 = !{null, !666, !666}
!674 = !DISubprogram(name: "copy", linkageName: "_ZN18sized_array_memoryILm72EE4copyEPvPKvm", scope: !661, file: !660, line: 26, type: !675, scopeLine: 26, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!675 = !DISubroutineType(types: !676)
!676 = !{null, !666, !669, !667}
!677 = !DISubprogram(name: "move", linkageName: "_ZN18sized_array_memoryILm72EE4moveEPvPKvm", scope: !661, file: !660, line: 30, type: !675, scopeLine: 30, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!678 = !DISubprogram(name: "move_onto", linkageName: "_ZN18sized_array_memoryILm72EE9move_ontoEPvPKvm", scope: !661, file: !660, line: 34, type: !675, scopeLine: 34, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!679 = !DISubprogram(name: "destroy", linkageName: "_ZN18sized_array_memoryILm72EE7destroyEPvm", scope: !661, file: !660, line: 38, type: !680, scopeLine: 38, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!680 = !DISubroutineType(types: !681)
!681 = !{null, !666, !667}
!682 = !DISubprogram(name: "mark_noaccess", linkageName: "_ZN18sized_array_memoryILm72EE13mark_noaccessEPvm", scope: !661, file: !660, line: 41, type: !680, scopeLine: 41, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!683 = !DISubprogram(name: "mark_undefined", linkageName: "_ZN18sized_array_memoryILm72EE14mark_undefinedEPvm", scope: !661, file: !660, line: 48, type: !680, scopeLine: 48, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!684 = !{!685}
!685 = !DITemplateValueParameter(name: "s", type: !50, value: i64 72)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "char_array<72>", file: !687, line: 165, size: 576, flags: DIFlagTypePassByValue, elements: !688, templateParams: !693, identifier: "_ZTS10char_arrayILm72EE")
!687 = !DIFile(filename: "../dummy_inc/click/type_traits.hh", directory: "/home/john/projects/click/ir-dir")
!688 = !{!689}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !686, file: !687, line: 166, baseType: !690, size: 576)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 576, elements: !691)
!691 = !{!692}
!692 = !DISubrange(count: 72)
!693 = !{!694}
!694 = !DITemplateValueParameter(name: "S", type: !50, value: i64 72)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "n_", scope: !654, file: !651, line: 69, baseType: !696, size: 32, offset: 64, flags: DIFlagPublic)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", file: !651, line: 12, baseType: !46)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "capacity_", scope: !654, file: !651, line: 70, baseType: !696, size: 32, offset: 96, flags: DIFlagPublic)
!698 = !DISubprogram(name: "need_argument_copy", linkageName: "_ZNK13vector_memoryI18sized_array_memoryILm72EEE18need_argument_copyEPK10char_arrayILm72EE", scope: !654, file: !651, line: 15, type: !699, scopeLine: 15, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!699 = !DISubroutineType(types: !700)
!700 = !{!110, !701, !703}
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!702 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !654)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !658)
!705 = !DISubprogram(name: "vector_memory", scope: !654, file: !651, line: 20, type: !706, scopeLine: 20, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!706 = !DISubroutineType(types: !707)
!707 = !{null, !708}
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!709 = !DISubprogram(name: "~vector_memory", scope: !654, file: !651, line: 23, type: !706, scopeLine: 23, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!710 = !DISubprogram(name: "assign", linkageName: "_ZN13vector_memoryI18sized_array_memoryILm72EEE6assignERKS2_", scope: !654, file: !651, line: 25, type: !711, scopeLine: 25, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!711 = !DISubroutineType(types: !712)
!712 = !{null, !708, !713}
!713 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !702, size: 64)
!714 = !DISubprogram(name: "assign", linkageName: "_ZN13vector_memoryI18sized_array_memoryILm72EEE6assignEiPK10char_arrayILm72EE", scope: !654, file: !651, line: 26, type: !715, scopeLine: 26, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!715 = !DISubroutineType(types: !716)
!716 = !{null, !708, !696, !703}
!717 = !DISubprogram(name: "resize", linkageName: "_ZN13vector_memoryI18sized_array_memoryILm72EEE6resizeEiPK10char_arrayILm72EE", scope: !654, file: !651, line: 27, type: !715, scopeLine: 27, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!718 = !DISubprogram(name: "begin", linkageName: "_ZN13vector_memoryI18sized_array_memoryILm72EEE5beginEv", scope: !654, file: !651, line: 28, type: !719, scopeLine: 28, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!719 = !DISubroutineType(types: !720)
!720 = !{!721, !708}
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "iterator", scope: !654, file: !651, line: 14, baseType: !657)
!722 = !DISubprogram(name: "end", linkageName: "_ZN13vector_memoryI18sized_array_memoryILm72EEE3endEv", scope: !654, file: !651, line: 31, type: !719, scopeLine: 31, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!723 = !DISubprogram(name: "insert", linkageName: "_ZN13vector_memoryI18sized_array_memoryILm72EEE6insertEP10char_arrayILm72EEPKS4_", scope: !654, file: !651, line: 34, type: !724, scopeLine: 34, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!724 = !DISubroutineType(types: !725)
!725 = !{!721, !708, !721, !703}
!726 = !DISubprogram(name: "erase", linkageName: "_ZN13vector_memoryI18sized_array_memoryILm72EEE5eraseEP10char_arrayILm72EES5_", scope: !654, file: !651, line: 35, type: !727, scopeLine: 35, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!727 = !DISubroutineType(types: !728)
!728 = !{!721, !708, !721, !721}
!729 = !DISubprogram(name: "push_back", linkageName: "_ZN13vector_memoryI18sized_array_memoryILm72EEE9push_backEPK10char_arrayILm72EE", scope: !654, file: !651, line: 36, type: !730, scopeLine: 36, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!730 = !DISubroutineType(types: !731)
!731 = !{null, !708, !703}
!732 = !DISubprogram(name: "move_construct_back", linkageName: "_ZN13vector_memoryI18sized_array_memoryILm72EEE19move_construct_backEP10char_arrayILm72EE", scope: !654, file: !651, line: 45, type: !733, scopeLine: 45, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!733 = !DISubroutineType(types: !734)
!734 = !{null, !708, !657}
!735 = !DISubprogram(name: "pop_back", linkageName: "_ZN13vector_memoryI18sized_array_memoryILm72EEE8pop_backEv", scope: !654, file: !651, line: 54, type: !706, scopeLine: 54, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!736 = !DISubprogram(name: "clear", linkageName: "_ZN13vector_memoryI18sized_array_memoryILm72EEE5clearEv", scope: !654, file: !651, line: 60, type: !706, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!737 = !DISubprogram(name: "reserve_and_push_back", linkageName: "_ZN13vector_memoryI18sized_array_memoryILm72EEE21reserve_and_push_backEiPK10char_arrayILm72EE", scope: !654, file: !651, line: 65, type: !738, scopeLine: 65, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!738 = !DISubroutineType(types: !739)
!739 = !{!110, !708, !696, !703}
!740 = !DISubprogram(name: "swap", linkageName: "_ZN13vector_memoryI18sized_array_memoryILm72EEE4swapERS2_", scope: !654, file: !651, line: 66, type: !741, scopeLine: 66, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!741 = !DISubroutineType(types: !742)
!742 = !{null, !708, !743}
!743 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !654, size: 64)
!744 = !{!745}
!745 = !DITemplateTypeParameter(name: "AM", type: !661)
!746 = !DISubprogram(name: "Vector", scope: !650, file: !651, line: 137, type: !747, scopeLine: 137, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!747 = !DISubroutineType(types: !748)
!748 = !{null, !749}
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!750 = !DISubprogram(name: "Vector", scope: !650, file: !651, line: 138, type: !751, scopeLine: 138, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!751 = !DISubroutineType(types: !752)
!752 = !{null, !749, !753, !754}
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", file: !651, line: 128, baseType: !46)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "value_argument_type", scope: !650, file: !651, line: 125, baseType: !755)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "type", scope: !756, file: !687, line: 150, baseType: !773)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fast_argument<EtherSpanTree::PortInfo, true>", file: !687, line: 148, size: 8, flags: DIFlagTypePassByValue, elements: !757, templateParams: !760, identifier: "_ZTS13fast_argumentIN13EtherSpanTree8PortInfoELb1EE")
!757 = !{!758}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "is_reference", scope: !756, file: !687, line: 149, baseType: !759, flags: DIFlagStaticMember, extraData: i1 true)
!759 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!760 = !{!761, !772}
!761 = !DITemplateTypeParameter(name: "T", type: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PortInfo", scope: !5, file: !4, line: 102, size: 576, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !763, identifier: "_ZTSN13EtherSpanTree8PortInfoE")
!763 = !{!764, !765, !766, !767, !768}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !762, file: !4, line: 103, baseType: !3, size: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "since", scope: !762, file: !4, line: 104, baseType: !20, size: 64, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "needs_tca", scope: !762, file: !4, line: 105, baseType: !110, size: 8, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !762, file: !4, line: 106, baseType: !569, size: 384, offset: 192)
!768 = !DISubprogram(name: "PortInfo", scope: !762, file: !4, line: 107, type: !769, scopeLine: 107, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!769 = !DISubroutineType(types: !770)
!770 = !{null, !771}
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!772 = !DITemplateValueParameter(name: "use_reference", type: !110, value: i8 1)
!773 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !774, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !762)
!775 = !DISubprogram(name: "Vector", scope: !650, file: !651, line: 139, type: !776, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!776 = !DISubroutineType(types: !777)
!777 = !{null, !749, !778}
!778 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !779, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !650)
!780 = !DISubprogram(name: "Vector", scope: !650, file: !651, line: 141, type: !781, scopeLine: 141, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!781 = !DISubroutineType(types: !782)
!782 = !{null, !749, !783}
!783 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !650, size: 64)
!784 = !DISubprogram(name: "operator=", linkageName: "_ZN6VectorIN13EtherSpanTree8PortInfoEEaSERKS2_", scope: !650, file: !651, line: 144, type: !785, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!785 = !DISubroutineType(types: !786)
!786 = !{!787, !749, !778}
!787 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !650, size: 64)
!788 = !DISubprogram(name: "operator=", linkageName: "_ZN6VectorIN13EtherSpanTree8PortInfoEEaSEOS2_", scope: !650, file: !651, line: 146, type: !789, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!789 = !DISubroutineType(types: !790)
!790 = !{!787, !749, !783}
!791 = !DISubprogram(name: "assign", linkageName: "_ZN6VectorIN13EtherSpanTree8PortInfoEE6assignEiRKS1_", scope: !650, file: !651, line: 148, type: !792, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!792 = !DISubroutineType(types: !793)
!793 = !{!787, !749, !753, !754}
!794 = !DISubprogram(name: "begin", linkageName: "_ZN6VectorIN13EtherSpanTree8PortInfoEE5beginEv", scope: !650, file: !651, line: 150, type: !795, scopeLine: 150, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!795 = !DISubroutineType(types: !796)
!796 = !{!797, !749}
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "iterator", scope: !650, file: !651, line: 130, baseType: !798)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!799 = !DISubprogram(name: "end", linkageName: "_ZN6VectorIN13EtherSpanTree8PortInfoEE3endEv", scope: !650, file: !651, line: 151, type: !795, scopeLine: 151, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!800 = !DISubprogram(name: "begin", linkageName: "_ZNK6VectorIN13EtherSpanTree8PortInfoEE5beginEv", scope: !650, file: !651, line: 152, type: !801, scopeLine: 152, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!801 = !DISubroutineType(types: !802)
!802 = !{!803, !805}
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_iterator", scope: !650, file: !651, line: 131, baseType: !804)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!806 = !DISubprogram(name: "end", linkageName: "_ZNK6VectorIN13EtherSpanTree8PortInfoEE3endEv", scope: !650, file: !651, line: 153, type: !801, scopeLine: 153, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!807 = !DISubprogram(name: "cbegin", linkageName: "_ZNK6VectorIN13EtherSpanTree8PortInfoEE6cbeginEv", scope: !650, file: !651, line: 154, type: !801, scopeLine: 154, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!808 = !DISubprogram(name: "cend", linkageName: "_ZNK6VectorIN13EtherSpanTree8PortInfoEE4cendEv", scope: !650, file: !651, line: 155, type: !801, scopeLine: 155, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!809 = !DISubprogram(name: "size", linkageName: "_ZNK6VectorIN13EtherSpanTree8PortInfoEE4sizeEv", scope: !650, file: !651, line: 157, type: !810, scopeLine: 157, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!810 = !DISubroutineType(types: !811)
!811 = !{!753, !805}
!812 = !DISubprogram(name: "capacity", linkageName: "_ZNK6VectorIN13EtherSpanTree8PortInfoEE8capacityEv", scope: !650, file: !651, line: 158, type: !810, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!813 = !DISubprogram(name: "empty", linkageName: "_ZNK6VectorIN13EtherSpanTree8PortInfoEE5emptyEv", scope: !650, file: !651, line: 159, type: !814, scopeLine: 159, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!814 = !DISubroutineType(types: !815)
!815 = !{!110, !805}
!816 = !DISubprogram(name: "resize", linkageName: "_ZN6VectorIN13EtherSpanTree8PortInfoEE6resizeEiRKS1_", scope: !650, file: !651, line: 160, type: !751, scopeLine: 160, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!817 = !DISubprogram(name: "reserve", linkageName: "_ZN6VectorIN13EtherSpanTree8PortInfoEE7reserveEi", scope: !650, file: !651, line: 161, type: !818, scopeLine: 161, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!818 = !DISubroutineType(types: !819)
!819 = !{!110, !749, !753}
!820 = !DISubprogram(name: "operator[]", linkageName: "_ZN6VectorIN13EtherSpanTree8PortInfoEEixEi", scope: !650, file: !651, line: 163, type: !821, scopeLine: 163, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!821 = !DISubroutineType(types: !822)
!822 = !{!823, !749, !753}
!823 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !762, size: 64)
!824 = !DISubprogram(name: "operator[]", linkageName: "_ZNK6VectorIN13EtherSpanTree8PortInfoEEixEi", scope: !650, file: !651, line: 164, type: !825, scopeLine: 164, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!825 = !DISubroutineType(types: !826)
!826 = !{!773, !805, !753}
!827 = !DISubprogram(name: "at", linkageName: "_ZN6VectorIN13EtherSpanTree8PortInfoEE2atEi", scope: !650, file: !651, line: 165, type: !821, scopeLine: 165, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!828 = !DISubprogram(name: "at", linkageName: "_ZNK6VectorIN13EtherSpanTree8PortInfoEE2atEi", scope: !650, file: !651, line: 166, type: !825, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!829 = !DISubprogram(name: "front", linkageName: "_ZN6VectorIN13EtherSpanTree8PortInfoEE5frontEv", scope: !650, file: !651, line: 167, type: !830, scopeLine: 167, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!830 = !DISubroutineType(types: !831)
!831 = !{!823, !749}
!832 = !DISubprogram(name: "front", linkageName: "_ZNK6VectorIN13EtherSpanTree8PortInfoEE5frontEv", scope: !650, file: !651, line: 168, type: !833, scopeLine: 168, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!833 = !DISubroutineType(types: !834)
!834 = !{!773, !805}
!835 = !DISubprogram(name: "back", linkageName: "_ZN6VectorIN13EtherSpanTree8PortInfoEE4backEv", scope: !650, file: !651, line: 169, type: !830, scopeLine: 169, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!836 = !DISubprogram(name: "back", linkageName: "_ZNK6VectorIN13EtherSpanTree8PortInfoEE4backEv", scope: !650, file: !651, line: 170, type: !833, scopeLine: 170, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!837 = !DISubprogram(name: "unchecked_at", linkageName: "_ZN6VectorIN13EtherSpanTree8PortInfoEE12unchecked_atEi", scope: !650, file: !651, line: 172, type: !821, scopeLine: 172, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!838 = !DISubprogram(name: "unchecked_at", linkageName: "_ZNK6VectorIN13EtherSpanTree8PortInfoEE12unchecked_atEi", scope: !650, file: !651, line: 173, type: !825, scopeLine: 173, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!839 = !DISubprogram(name: "at_u", linkageName: "_ZN6VectorIN13EtherSpanTree8PortInfoEE4at_uEi", scope: !650, file: !651, line: 174, type: !821, scopeLine: 174, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!840 = !DISubprogram(name: "at_u", linkageName: "_ZNK6VectorIN13EtherSpanTree8PortInfoEE4at_uEi", scope: !650, file: !651, line: 175, type: !825, scopeLine: 175, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!841 = !DISubprogram(name: "data", linkageName: "_ZN6VectorIN13EtherSpanTree8PortInfoEE4dataEv", scope: !650, file: !651, line: 177, type: !842, scopeLine: 177, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!842 = !DISubroutineType(types: !843)
!843 = !{!798, !749}
!844 = !DISubprogram(name: "data", linkageName: "_ZNK6VectorIN13EtherSpanTree8PortInfoEE4dataEv", scope: !650, file: !651, line: 178, type: !845, scopeLine: 178, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!845 = !DISubroutineType(types: !846)
!846 = !{!804, !805}
!847 = !DISubprogram(name: "push_back", linkageName: "_ZN6VectorIN13EtherSpanTree8PortInfoEE9push_backERKS1_", scope: !650, file: !651, line: 180, type: !848, scopeLine: 180, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!848 = !DISubroutineType(types: !849)
!849 = !{null, !749, !754}
!850 = !DISubprogram(name: "pop_back", linkageName: "_ZN6VectorIN13EtherSpanTree8PortInfoEE8pop_backEv", scope: !650, file: !651, line: 185, type: !747, scopeLine: 185, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!851 = !DISubprogram(name: "push_front", linkageName: "_ZN6VectorIN13EtherSpanTree8PortInfoEE10push_frontERKS1_", scope: !650, file: !651, line: 186, type: !848, scopeLine: 186, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!852 = !DISubprogram(name: "pop_front", linkageName: "_ZN6VectorIN13EtherSpanTree8PortInfoEE9pop_frontEv", scope: !650, file: !651, line: 187, type: !747, scopeLine: 187, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!853 = !DISubprogram(name: "insert", linkageName: "_ZN6VectorIN13EtherSpanTree8PortInfoEE6insertEPS1_RKS1_", scope: !650, file: !651, line: 189, type: !854, scopeLine: 189, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!854 = !DISubroutineType(types: !855)
!855 = !{!797, !749, !797, !754}
!856 = !DISubprogram(name: "erase", linkageName: "_ZN6VectorIN13EtherSpanTree8PortInfoEE5eraseEPS1_", scope: !650, file: !651, line: 190, type: !857, scopeLine: 190, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
