
*** Dumping AST Record Layout
         0 | struct __pthread_cond_s::(anonymous at /usr/include/bits/thread-shared-types.h:97:5)
         0 |   unsigned int __low
         4 |   unsigned int __high
           | [sizeof=8, dsize=8, align=4,
           |  nvsize=8, nvalign=4]

*** Dumping AST Record Layout
         0 | union __pthread_cond_s::(anonymous at /usr/include/bits/thread-shared-types.h:94:17)
         0 |   unsigned long long __wseq
         0 |   struct __pthread_cond_s::(anonymous at /usr/include/bits/thread-shared-types.h:97:5) __wseq32
         0 |     unsigned int __low
         4 |     unsigned int __high
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __pthread_internal_list
         0 |   struct __pthread_internal_list * __prev
         8 |   struct __pthread_internal_list * __next
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __pthread_mutex_s
         0 |   int __lock
         4 |   unsigned int __count
         8 |   int __owner
        12 |   unsigned int __nusers
        16 |   int __kind
        20 |   short __spins
        22 |   short __elision
        24 |   struct __pthread_internal_list __list
        24 |     struct __pthread_internal_list * __prev
        32 |     struct __pthread_internal_list * __next
           | [sizeof=40, dsize=40, align=8,
           |  nvsize=40, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __pthread_cond_s::(anonymous at /usr/include/bits/thread-shared-types.h:106:5)
         0 |   unsigned int __low
         4 |   unsigned int __high
           | [sizeof=8, dsize=8, align=4,
           |  nvsize=8, nvalign=4]

*** Dumping AST Record Layout
         0 | union __pthread_cond_s::(anonymous at /usr/include/bits/thread-shared-types.h:103:17)
         0 |   unsigned long long __g1_start
         0 |   struct __pthread_cond_s::(anonymous at /usr/include/bits/thread-shared-types.h:106:5) __g1_start32
         0 |     unsigned int __low
         4 |     unsigned int __high
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __pthread_cond_s
         0 |   union __pthread_cond_s::(anonymous at /usr/include/bits/thread-shared-types.h:94:17) 
         0 |     unsigned long long __wseq
         0 |     struct __pthread_cond_s::(anonymous at /usr/include/bits/thread-shared-types.h:97:5) __wseq32
         0 |       unsigned int __low
         4 |       unsigned int __high
         8 |   union __pthread_cond_s::(anonymous at /usr/include/bits/thread-shared-types.h:103:17) 
         8 |     unsigned long long __g1_start
         8 |     struct __pthread_cond_s::(anonymous at /usr/include/bits/thread-shared-types.h:106:5) __g1_start32
         8 |       unsigned int __low
        12 |       unsigned int __high
        16 |   unsigned int [2] __g_refs
        24 |   unsigned int [2] __g_size
        32 |   unsigned int __g1_orig_size
        36 |   unsigned int __wrefs
        40 |   unsigned int [2] __g_signals
           | [sizeof=48, dsize=48, align=8,
           |  nvsize=48, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __pthread_rwlock_arch_t
         0 |   unsigned int __readers
         4 |   unsigned int __writers
         8 |   unsigned int __wrphase_futex
        12 |   unsigned int __writers_futex
        16 |   unsigned int __pad3
        20 |   unsigned int __pad4
        24 |   int __cur_writer
        28 |   int __shared
        32 |   signed char __rwelision
        33 |   unsigned char [7] __pad1
        40 |   unsigned long __pad2
        48 |   unsigned int __flags
           | [sizeof=56, dsize=56, align=8,
           |  nvsize=56, nvalign=8]

*** Dumping AST Record Layout
         0 | lldiv_t
         0 |   long long quot
         8 |   long long rem
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct msghdr
         0 |   void * msg_name
         8 |   socklen_t msg_namelen
        16 |   struct iovec * msg_iov
        24 |   size_t msg_iovlen
        32 |   void * msg_control
        40 |   size_t msg_controllen
        48 |   int msg_flags
           | [sizeof=56, dsize=56, align=8,
           |  nvsize=56, nvalign=8]

*** Dumping AST Record Layout
         0 | struct in_addr
         0 |   in_addr_t s_addr
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | union in6_addr::(anonymous at /usr/include/netinet/in.h:214:5)
         0 |   uint8_t [16] __u6_addr8
         0 |   uint16_t [8] __u6_addr16
         0 |   uint32_t [4] __u6_addr32
           | [sizeof=16, dsize=16, align=4,
           |  nvsize=16, nvalign=4]

*** Dumping AST Record Layout
         0 | struct sockaddr
         0 |   sa_family_t sa_family
         2 |   char [14] sa_data
           | [sizeof=16, dsize=16, align=2,
           |  nvsize=16, nvalign=2]

*** Dumping AST Record Layout
         0 | struct in6_addr
         0 |   union in6_addr::(anonymous at /usr/include/netinet/in.h:214:5) __in6_u
         0 |     uint8_t [16] __u6_addr8
         0 |     uint16_t [8] __u6_addr16
         0 |     uint32_t [4] __u6_addr32
           | [sizeof=16, dsize=16, align=4,
           |  nvsize=16, nvalign=4]

*** Dumping AST Record Layout
         0 | struct sockaddr_storage
         0 |   sa_family_t ss_family
         2 |   char [118] __ss_padding
       120 |   unsigned long __ss_align
           | [sizeof=128, dsize=128, align=8,
           |  nvsize=128, nvalign=8]

*** Dumping AST Record Layout
         0 | struct sockaddr_in6
         0 |   sa_family_t sin6_family
         2 |   in_port_t sin6_port
         4 |   uint32_t sin6_flowinfo
         8 |   struct in6_addr sin6_addr
         8 |     union in6_addr::(anonymous at /usr/include/netinet/in.h:214:5) __in6_u
         8 |       uint8_t [16] __u6_addr8
         8 |       uint16_t [8] __u6_addr16
         8 |       uint32_t [4] __u6_addr32
        24 |   uint32_t sin6_scope_id
           | [sizeof=28, dsize=28, align=4,
           |  nvsize=28, nvalign=4]

*** Dumping AST Record Layout
         0 | struct timeval
         0 |   __time_t tv_sec
         8 |   __suseconds_t tv_usec
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct String::memo_t
         0 |   volatile uint32_t refcount
         4 |   uint32_t capacity
         8 |   volatile uint32_t dirty
        12 |   char [8] real_data
           | [sizeof=20, dsize=20, align=4,
           |  nvsize=20, nvalign=4]

*** Dumping AST Record Layout
         0 | class IPAddress
         0 |   uint32_t _addr
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | union Timestamp::rep_t
         0 |   int64_t x
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class Timestamp
         0 |   union Timestamp::rep_t _t
         0 |     int64_t x
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct timespec
         0 |   __time_t tv_sec
         8 |   __syscall_slong_t tv_nsec
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class Element::Port
         0 |   class Element * _e
         8 |   int _port
           | [sizeof=16, dsize=12, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | struct libdivide_u32_t
         0 |   uint32_t magic
         4 |   uint8_t more
           | [sizeof=8, dsize=8, align=4,
           |  nvsize=8, nvalign=4]

*** Dumping AST Record Layout
         0 | class IPFlowID
         0 |   class IPAddress _saddr
         0 |     uint32_t _addr
         4 |   class IPAddress _daddr
         4 |     uint32_t _addr
         8 |   uint16_t _sport
        10 |   uint16_t _dport
           | [sizeof=12, dsize=12, align=4,
           |  nvsize=12, nvalign=4]

*** Dumping AST Record Layout
         0 | class IPRewriterEntry
         0 |   class IPFlowID _flowid
         0 |     class IPAddress _saddr
         0 |       uint32_t _addr
         4 |     class IPAddress _daddr
         4 |       uint32_t _addr
         8 |     uint16_t _sport
        10 |     uint16_t _dport
   12:0-23 |   uint32_t _output
        15 |   uint8_t _direction
        16 |   class IPRewriterEntry * _hashnext
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class vector_memory<class sized_array_memory<8> >
         0 |   vector_memory<class sized_array_memory<8> >::type * l_
         8 |   vector_memory::size_type n_
        12 |   vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class Vector<class IPRewriterFlow *>
         0 |   class vector_memory<class sized_array_memory<8> > vm_
         0 |     vector_memory<class sized_array_memory<8> >::type * l_
         8 |     vector_memory::size_type n_
        12 |     vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union IPRewriterInput::(anonymous at ../elements/ip/iprewriterbase.hh:23:5)
         0 |   class IPRewriterPattern * pattern
         0 |   class IPMapper * mapper
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class IPRewriterInput
         0 |   class IPRewriterBase * owner
         8 |   int owner_input
        12 |   int kind
        16 |   int foutput
        24 |   class IPRewriterBase * reply_element
        32 |   int routput
        36 |   uint32_t count
        40 |   uint32_t failures
        48 |   union IPRewriterInput::(anonymous at ../elements/ip/iprewriterbase.hh:23:5) u
        48 |     class IPRewriterPattern * pattern
        48 |     class IPMapper * mapper
           | [sizeof=56, dsize=56, align=8,
           |  nvsize=56, nvalign=8]

*** Dumping AST Record Layout
         0 | class HashContainer_const_iterator<class IPRewriterEntry, class HashContainer_adapter<class IPRewriterEntry> >
         0 |   class IPRewriterEntry * _element
         8 |   class IPRewriterEntry ** _pprev
        16 |   HashContainer_const_iterator<class IPRewriterEntry, class HashContainer_adapter<class IPRewriterEntry> >::bucket_count_type _bucket
        24 |   const HashContainer<class IPRewriterEntry, class HashContainer_adapter<class IPRewriterEntry> > * _hc
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | class HashContainer_iterator<class IPRewriterEntry, class HashContainer_adapter<class IPRewriterEntry> >
         0 |   class HashContainer_const_iterator<class IPRewriterEntry, class HashContainer_adapter<class IPRewriterEntry> > (base)
         0 |     class IPRewriterEntry * _element
         8 |     class IPRewriterEntry ** _pprev
        16 |     HashContainer_const_iterator<class IPRewriterEntry, class HashContainer_adapter<class IPRewriterEntry> >::bucket_count_type _bucket
        24 |     const HashContainer<class IPRewriterEntry, class HashContainer_adapter<class IPRewriterEntry> > * _hc
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | class IPRewriterFlow
         0 |   class IPRewriterEntry [2] _e
        48 |   uint16_t _ip_csum_delta
        50 |   uint16_t _udp_csum_delta
        52 |   click_jiffies_t _expiry_j
   56:0-31 |   size_t _place
        60 |   uint8_t _ip_p
        61 |   uint8_t _tflags
        62 |   _Bool _guaranteed
        63 |   uint8_t _reply_anno
        64 |   class IPRewriterInput * _owner
           | [sizeof=72, dsize=72, align=8,
           |  nvsize=72, nvalign=8]

*** Dumping AST Record Layout
         0 | class TCPRewriter::TCPFlow
         0 |   class IPRewriterFlow (base)
         0 |     class IPRewriterEntry [2] _e
        48 |     uint16_t _ip_csum_delta
        50 |     uint16_t _udp_csum_delta
        52 |     click_jiffies_t _expiry_j
   56:0-31 |     size_t _place
        60 |     uint8_t _ip_p
        61 |     uint8_t _tflags
        62 |     _Bool _guaranteed
        63 |     uint8_t _reply_anno
        64 |     class IPRewriterInput * _owner
        72 |   struct TCPRewriter::TCPFlow::delta_transition * _dt
           | [sizeof=80, dsize=80, align=8,
           |  nvsize=80, nvalign=8]

*** Dumping AST Record Layout
         0 | class UDPRewriter::UDPFlow
         0 |   class IPRewriterFlow (base)
         0 |     class IPRewriterEntry [2] _e
        48 |     uint16_t _ip_csum_delta
        50 |     uint16_t _udp_csum_delta
        52 |     click_jiffies_t _expiry_j
   56:0-31 |     size_t _place
        60 |     uint8_t _ip_p
        61 |     uint8_t _tflags
        62 |     _Bool _guaranteed
        63 |     uint8_t _reply_anno
        64 |     class IPRewriterInput * _owner
           | [sizeof=72, dsize=72, align=8,
           |  nvsize=72, nvalign=8]

*** Dumping AST Record Layout
         0 | struct String::rep_t
         0 |   const char * data
         8 |   int length
        16 |   struct String::memo_t * memo
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class String
         0 |   struct String::rep_t _r
         0 |     const char * data
         8 |     int length
        16 |     struct String::memo_t * memo
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct StringAccum::rep_t
         0 |   unsigned char * s
         8 |   int len
        12 |   int cap
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct TimerSet::heap_element
         0 |   class Timestamp expiry_s
         0 |     union Timestamp::rep_t _t
         0 |       int64_t x
         8 |   class Timer * t
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct pollfd
         0 |   int fd
         4 |   short events
         6 |   short revents
           | [sizeof=8, dsize=8, align=4,
           |  nvsize=8, nvalign=4]

*** Dumping AST Record Layout
         0 | struct SelectSet::SelectorInfo
         0 |   class Element * read
         8 |   class Element * write
        16 |   int pollfd
           | [sizeof=24, dsize=20, align=8,
           |  nvsize=20, nvalign=8]

*** Dumping AST Record Layout
         0 | struct Router::Port
         0 |   int idx
         4 |   int port
           | [sizeof=8, dsize=8, align=4,
           |  nvsize=8, nvalign=4]

*** Dumping AST Record Layout
         0 | struct Router::element_landmark_t
         0 |   uint32_t first_landmarkid
         8 |   class String filename
         8 |     struct String::rep_t _r
         8 |       const char * data
        16 |       int length
        24 |       struct String::memo_t * memo
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | class vector_memory<class sized_array_memory<4> >
         0 |   vector_memory<class sized_array_memory<4> >::type * l_
         8 |   vector_memory::size_type n_
        12 |   vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class Vector<int>
         0 |   class vector_memory<class sized_array_memory<4> > vm_
         0 |     vector_memory<class sized_array_memory<4> >::type * l_
         8 |     vector_memory::size_type n_
        12 |     vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct Router::Connection
         0 |   struct Router::Port [2] p
           | [sizeof=16, dsize=16, align=4,
           |  nvsize=16, nvalign=4]

*** Dumping AST Record Layout
         0 | class atomic_uint32_t
         0 |   uint32_t _val
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | class Element
         0 |   (Element vtable pointer)
         8 |   class Element::Port *[2] _ports
        24 |   class Element::Port [4] _inline_ports
        88 |   int [2] _nports
        96 |   class Router * _router
       104 |   int _eindex
           | [sizeof=112, dsize=108, align=8,
           |  nvsize=108, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x55c810895bb8 prev 0x55c81088d328 <../dummy_inc/click/element.hh:214:5, line:252:5> line:214:11 referenced class Port definition
|-DefinitionData pass_in_registers standard_layout trivially_copyable has_user_declared_ctor can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor simple trivial has_const_param implicit_has_const_param
| |-MoveConstructor exists simple trivial
| |-CopyAssignment trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveAssignment exists simple trivial needs_implicit
| `-Destructor simple irrelevant trivial
|-CXXRecordDecl 0x55c810895cb0 <col:5, col:11> col:11 implicit referenced class Port
|-AccessSpecDecl 0x55c810895d40 <col:18, col:24> col:18 public
|-CXXMethodDecl 0x55c810895db8 <line:216:9, col:30> col:21 used active 'bool () const' inline
|-CXXMethodDecl 0x55c810895e78 <line:217:9, col:35> col:25 element 'Element *() const' inline
|-CXXMethodDecl 0x55c810895f40 <line:218:9, col:27> col:20 port 'int () const' inline
|-CXXMethodDecl 0x55c8108960b8 <line:220:9, col:65> col:49 used push 'void (Packet *) const'
| |-ParmVarDecl 0x55c810895ff0 <col:54, col:62> col:62 p 'Packet *'
| |-NoInlineAttr 0x55c810896160 <col:24>
| `-OptimizeNoneAttr 0x55c8108961b8 <col:34>
|-CXXMethodDecl 0x55c810896200 <line:221:9, col:31> col:24 used pull 'Packet *() const' inline
|-CXXMethodDecl 0x55c8108964b8 <line:227:9, col:63> col:21 used assign 'void (bool, Element *, int)' inline
| |-ParmVarDecl 0x55c8108962b0 <col:28, col:33> col:33 isoutput 'bool'
| |-ParmVarDecl 0x55c810896328 <col:43, col:52> col:52 e 'Element *'
| `-ParmVarDecl 0x55c8108963a8 <col:55, col:59> col:59 port 'int'
|-AccessSpecDecl 0x55c810896580 <line:229:7, col:14> col:7 private
|-FieldDecl 0x55c8108965b8 <line:231:9, col:18> col:18 referenced _e 'Element *'
|-FieldDecl 0x55c810896620 <line:232:9, col:13> col:13 referenced _port 'int'
|-CXXConstructorDecl 0x55c8108966a8 <line:247:9, col:21> col:16 Port 'void ()' inline
|-CXXMethodDecl 0x55c8108969c8 <line:248:9, col:79> col:21 assign 'void (bool, Element *, Element *, int)' inline
| |-ParmVarDecl 0x55c810896760 <col:28, col:33> col:33 isoutput 'bool'
| |-ParmVarDecl 0x55c8108967d8 <col:43, col:52> col:52 owner 'Element *'
| |-ParmVarDecl 0x55c810896850 <col:59, col:68> col:68 e 'Element *'
| `-ParmVarDecl 0x55c8108968d0 <col:71, col:75> col:75 port 'int'
|-FriendDecl 0x55c810896ae0 <line:250:9, col:22> col:16 'class Element':'Element'
|-CXXConstructorDecl 0x55c810807ad8 <line:214:11> col:11 implicit constexpr Port 'void (const Element::Port &)' inline default trivial noexcept-unevaluated 0x55c810807ad8
| `-ParmVarDecl 0x55c810807be8 <col:11> col:11 'const Element::Port &'
|-CXXConstructorDecl 0x55c810807c88 <col:11> col:11 implicit constexpr Port 'void (Element::Port &&)' inline default trivial noexcept-unevaluated 0x55c810807c88
| `-ParmVarDecl 0x55c810807d98 <col:11> col:11 'Element::Port &&'
`-CXXDestructorDecl 0x55c810b41000 <col:11> col:11 implicit ~Port 'void () noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.Element::Port" = type <{ %class.Element*, i32, [4 x i8] }>
  NonVirtualBaseLLVMType:%"class.Element::Port.base" = type <{ %class.Element*, i32 }>
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class Vector<class Element *>
         0 |   class vector_memory<class sized_array_memory<8> > vm_
         0 |     vector_memory<class sized_array_memory<8> >::type * l_
         8 |     vector_memory::size_type n_
        12 |     vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class vector_memory<class typed_array_memory<class String> >
         0 |   vector_memory<class typed_array_memory<class String> >::type * l_
         8 |   vector_memory::size_type n_
        12 |   vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class Vector<class String>
         0 |   class vector_memory<class typed_array_memory<class String> > vm_
         0 |     vector_memory<class typed_array_memory<class String> >::type * l_
         8 |     vector_memory::size_type n_
        12 |     vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class Vector<unsigned int>
         0 |   class vector_memory<class sized_array_memory<4> > vm_
         0 |     vector_memory<class sized_array_memory<4> >::type * l_
         8 |     vector_memory::size_type n_
        12 |     vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class vector_memory<class typed_array_memory<struct Router::element_landmark_t> >
         0 |   vector_memory<class typed_array_memory<struct Router::element_landmark_t> >::type * l_
         8 |   vector_memory::size_type n_
        12 |   vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class Vector<struct Router::element_landmark_t>
         0 |   class vector_memory<class typed_array_memory<struct Router::element_landmark_t> > vm_
         0 |     vector_memory<class typed_array_memory<struct Router::element_landmark_t> >::type * l_
         8 |     vector_memory::size_type n_
        12 |     vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class vector_memory<class sized_array_memory<16> >
         0 |   vector_memory<class sized_array_memory<16> >::type * l_
         8 |   vector_memory::size_type n_
        12 |   vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class Vector<struct Router::Connection>
         0 |   class vector_memory<class sized_array_memory<16> > vm_
         0 |     vector_memory<class sized_array_memory<16> >::type * l_
         8 |     vector_memory::size_type n_
        12 |     vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class Vector<void *>
         0 |   class vector_memory<class sized_array_memory<8> > vm_
         0 |     vector_memory<class sized_array_memory<8> >::type * l_
         8 |     vector_memory::size_type n_
        12 |     vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class Router
         0 |   class Master * _master
         8 |   class atomic_uint32_t _runcount
         8 |     uint32_t _val
        12 |   volatile int _state
    16:0-0 |   _Bool _have_connections
    16:1-1 |   _Bool _conn_sorted
    16:2-2 |   _Bool _have_configuration
        20 |   volatile int _running
        24 |   class atomic_uint32_t _refcount
        24 |     uint32_t _val
        32 |   class Vector<class Element *> _elements
        32 |     class vector_memory<class sized_array_memory<8> > vm_
        32 |       vector_memory<class sized_array_memory<8> >::type * l_
        40 |       vector_memory::size_type n_
        44 |       vector_memory::size_type capacity_
        48 |   class Vector<class String> _element_names
        48 |     class vector_memory<class typed_array_memory<class String> > vm_
        48 |       vector_memory<class typed_array_memory<class String> >::type * l_
        56 |       vector_memory::size_type n_
        60 |       vector_memory::size_type capacity_
        64 |   class Vector<class String> _element_configurations
        64 |     class vector_memory<class typed_array_memory<class String> > vm_
        64 |       vector_memory<class typed_array_memory<class String> >::type * l_
        72 |       vector_memory::size_type n_
        76 |       vector_memory::size_type capacity_
        80 |   class Vector<unsigned int> _element_landmarkids
        80 |     class vector_memory<class sized_array_memory<4> > vm_
        80 |       vector_memory<class sized_array_memory<4> >::type * l_
        88 |       vector_memory::size_type n_
        92 |       vector_memory::size_type capacity_
        96 |   class Vector<int> _element_home_thread_ids
        96 |     class vector_memory<class sized_array_memory<4> > vm_
        96 |       vector_memory<class sized_array_memory<4> >::type * l_
       104 |       vector_memory::size_type n_
       108 |       vector_memory::size_type capacity_
       112 |   class Vector<struct Router::element_landmark_t> _element_landmarks
       112 |     class vector_memory<class typed_array_memory<struct Router::element_landmark_t> > vm_
       112 |       vector_memory<class typed_array_memory<struct Router::element_landmark_t> >::type * l_
       120 |       vector_memory::size_type n_
       124 |       vector_memory::size_type capacity_
       128 |   uint32_t _last_landmarkid
       136 |   class Vector<int> _element_name_sorter
       136 |     class vector_memory<class sized_array_memory<4> > vm_
       136 |       vector_memory<class sized_array_memory<4> >::type * l_
       144 |       vector_memory::size_type n_
       148 |       vector_memory::size_type capacity_
       152 |   Vector<int> [2] _element_gport_offset
       184 |   class Vector<int> _element_configure_order
       184 |     class vector_memory<class sized_array_memory<4> > vm_
       184 |       vector_memory<class sized_array_memory<4> >::type * l_
       192 |       vector_memory::size_type n_
       196 |       vector_memory::size_type capacity_
       200 |   class Vector<struct Router::Connection> _conn
       200 |     class vector_memory<class sized_array_memory<16> > vm_
       200 |       vector_memory<class sized_array_memory<16> >::type * l_
       208 |       vector_memory::size_type n_
       212 |       vector_memory::size_type capacity_
       216 |   class Vector<int> _conn_output_sorter
       216 |     class vector_memory<class sized_array_memory<4> > vm_
       216 |       vector_memory<class sized_array_memory<4> >::type * l_
       224 |       vector_memory::size_type n_
       228 |       vector_memory::size_type capacity_
       232 |   class Vector<class String> _requirements
       232 |     class vector_memory<class typed_array_memory<class String> > vm_
       232 |       vector_memory<class typed_array_memory<class String> >::type * l_
       240 |       vector_memory::size_type n_
       244 |       vector_memory::size_type capacity_
       248 |   class Vector<int> _ehandler_first_by_element
       248 |     class vector_memory<class sized_array_memory<4> > vm_
       248 |       vector_memory<class sized_array_memory<4> >::type * l_
       256 |       vector_memory::size_type n_
       260 |       vector_memory::size_type capacity_
       264 |   class Vector<int> _ehandler_to_handler
       264 |     class vector_memory<class sized_array_memory<4> > vm_
       264 |       vector_memory<class sized_array_memory<4> >::type * l_
       272 |       vector_memory::size_type n_
       276 |       vector_memory::size_type capacity_
       280 |   class Vector<int> _ehandler_next
       280 |     class vector_memory<class sized_array_memory<4> > vm_
       280 |       vector_memory<class sized_array_memory<4> >::type * l_
       288 |       vector_memory::size_type n_
       292 |       vector_memory::size_type capacity_
       296 |   class Vector<int> _handler_first_by_name
       296 |     class vector_memory<class sized_array_memory<4> > vm_
       296 |       vector_memory<class sized_array_memory<4> >::type * l_
       304 |       vector_memory::size_type n_
       308 |       vector_memory::size_type capacity_
       312 |   class Handler ** _handler_bufs
       320 |   int _nhandlers_bufs
       324 |   int _free_handler
       328 |   class Vector<class String> _attachment_names
       328 |     class vector_memory<class typed_array_memory<class String> > vm_
       328 |       vector_memory<class typed_array_memory<class String> >::type * l_
       336 |       vector_memory::size_type n_
       340 |       vector_memory::size_type capacity_
       344 |   class Vector<void *> _attachments
       344 |     class vector_memory<class sized_array_memory<8> > vm_
       344 |       vector_memory<class sized_array_memory<8> >::type * l_
       352 |       vector_memory::size_type n_
       356 |       vector_memory::size_type capacity_
       360 |   class Element * _root_element
       368 |   class String _configuration
       368 |     struct String::rep_t _r
       368 |       const char * data
       376 |       int length
       384 |       struct String::memo_t * memo
       392 |   struct Router::notifier_signals_t * _notifier_signals
       400 |   class HashMap_ArenaFactory * _arena_factory
       408 |   class Router * _hotswap_router
       416 |   class ThreadSched * _thread_sched
       424 |   class NameInfo * _name_info
       432 |   class Vector<int> _flow_code_override_eindex
       432 |     class vector_memory<class sized_array_memory<4> > vm_
       432 |       vector_memory<class sized_array_memory<4> >::type * l_
       440 |       vector_memory::size_type n_
       444 |       vector_memory::size_type capacity_
       448 |   class Vector<class String> _flow_code_override
       448 |     class vector_memory<class typed_array_memory<class String> > vm_
       448 |       vector_memory<class typed_array_memory<class String> >::type * l_
       456 |       vector_memory::size_type n_
       460 |       vector_memory::size_type capacity_
       464 |   class Router * _next_router
           | [sizeof=472, dsize=472, align=8,
           |  nvsize=472, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x55c8105dd630 <../dummy_inc/click/atomic.hh:52:1, line:94:1> line:52:7 referenced class atomic_uint32_t definition
|-DefinitionData pass_in_registers standard_layout trivially_copyable trivial literal
| |-DefaultConstructor exists trivial
| |-CopyConstructor simple trivial has_const_param implicit_has_const_param
| |-MoveConstructor exists simple trivial
| |-CopyAssignment trivial has_const_param implicit_has_const_param
| |-MoveAssignment exists simple trivial
| `-Destructor simple irrelevant trivial
|-CXXRecordDecl 0x55c8105dd748 <col:1, col:7> col:7 implicit referenced class atomic_uint32_t
|-AccessSpecDecl 0x55c8105dd7d8 <col:25, col:31> col:25 public
|-CXXMethodDecl 0x55c8105dd8a8 <line:57:5, col:29> col:21 used value 'uint32_t () const' inline
|-CXXConversionDecl 0x55c8105dd990 <line:58:5, col:32> col:12 operator unsigned int 'uint32_t () const' inline
|-CXXMethodDecl 0x55c8105ddba8 <line:60:5, col:49> col:29 used operator= 'atomic_uint32_t &(uint32_t)' inline
| `-ParmVarDecl 0x55c8105dda50 <col:39, col:48> col:48 x 'uint32_t':'unsigned int'
|-CXXMethodDecl 0x55c8105ddd58 <line:62:5, col:53> col:29 operator+= 'atomic_uint32_t &(int32_t)' inline
| `-ParmVarDecl 0x55c8105ddc60 <col:40, col:48> col:48 delta 'int32_t':'int'
|-CXXMethodDecl 0x55c8105ddea0 <line:63:5, col:53> col:29 operator-= 'atomic_uint32_t &(int32_t)' inline
| `-ParmVarDecl 0x55c8105dde10 <col:40, col:48> col:48 delta 'int32_t':'int'
|-CXXMethodDecl 0x55c8105de980 <line:64:5, col:53> col:29 operator|= 'atomic_uint32_t &(uint32_t)' inline
| `-ParmVarDecl 0x55c8105de8f0 <col:40, col:49> col:49 mask 'uint32_t':'unsigned int'
|-CXXMethodDecl 0x55c8105deac8 <line:65:5, col:53> col:29 operator&= 'atomic_uint32_t &(uint32_t)' inline
| `-ParmVarDecl 0x55c8105dea38 <col:40, col:49> col:49 mask 'uint32_t':'unsigned int'
|-CXXMethodDecl 0x55c8105deb90 <line:67:5, col:28> col:17 used operator++ 'void ()' inline
|-CXXMethodDecl 0x55c8105decd8 <line:68:5, col:31> col:17 used operator++ 'void (int)' inline
| `-ParmVarDecl 0x55c8105dec48 <col:28> col:31 'int'
|-CXXMethodDecl 0x55c8105deda0 <line:69:5, col:28> col:17 used operator-- 'void ()' inline
|-CXXMethodDecl 0x55c8105deee8 <line:70:5, col:31> col:17 operator-- 'void (int)' inline
| `-ParmVarDecl 0x55c8105dee58 <col:28> col:31 'int'
|-CXXMethodDecl 0x55c8105df068 <line:72:5, col:42> col:21 swap 'uint32_t (uint32_t)' inline
| `-ParmVarDecl 0x55c8105defa0 <col:26, col:35> col:35 desired 'uint32_t':'unsigned int'
|-CXXMethodDecl 0x55c8105df1b0 <line:73:5, col:49> col:21 fetch_and_add 'uint32_t (uint32_t)' inline
| `-ParmVarDecl 0x55c8105df120 <col:35, col:44> col:44 delta 'uint32_t':'unsigned int'
|-CXXMethodDecl 0x55c8105df278 <line:74:5, col:30> col:17 dec_and_test 'bool ()' inline
|-CXXMethodDecl 0x55c8105df438 <line:75:5, col:69> col:21 used compare_swap 'uint32_t (uint32_t, uint32_t)' inline
| |-ParmVarDecl 0x55c8105df328 <col:34, col:43> col:43 expected 'uint32_t':'unsigned int'
| `-ParmVarDecl 0x55c8105df3a0 <col:53, col:62> col:62 desired 'uint32_t':'unsigned int'
|-CXXMethodDecl 0x55c8105df688 <line:76:5, col:97> col:17 compare_and_swap 'bool (uint32_t, uint32_t)' inline
| |-ParmVarDecl 0x55c8105df4f8 <col:34, col:43> col:43 expected 'uint32_t':'unsigned int'
| |-ParmVarDecl 0x55c8105df570 <col:53, col:62> col:62 desired 'uint32_t':'unsigned int'
| `-DeprecatedAttr 0x55c8105df738 <col:86> "" ""
|-CXXMethodDecl 0x55c8105df9a8 <line:78:5, col:71> col:28 used swap 'uint32_t (volatile uint32_t &, uint32_t)' static inline
| |-ParmVarDecl 0x55c8105df818 <col:33, col:52> col:52 x 'volatile uint32_t &'
| `-ParmVarDecl 0x55c8105df890 <col:55, col:64> col:64 desired 'uint32_t':'unsigned int'
|-CXXMethodDecl 0x55c8105dfb58 <line:79:5, col:48> col:24 used inc 'void (volatile uint32_t &)' static inline
| `-ParmVarDecl 0x55c8105dfa68 <col:28, col:47> col:47 x 'volatile uint32_t &'
|-CXXMethodDecl 0x55c8105dfd08 <line:80:5, col:57> col:24 used dec_and_test 'bool (volatile uint32_t &)' static inline
| `-ParmVarDecl 0x55c8105dfc10 <col:37, col:56> col:56 x 'volatile uint32_t &'
|-CXXMethodDecl 0x55c8105dffd8 <line:81:5, col:98> col:28 compare_swap 'uint32_t (volatile uint32_t &, uint32_t, uint32_t)' static inline
| |-ParmVarDecl 0x55c8105dfdc0 <col:41, col:60> col:60 x 'volatile uint32_t &'
| |-ParmVarDecl 0x55c8105dfe38 <col:63, col:72> col:72 expected 'uint32_t':'unsigned int'
| `-ParmVarDecl 0x55c8105dfeb0 <col:82, col:91> col:91 desired 'uint32_t':'unsigned int'
|-CXXMethodDecl 0x55c8105e02b8 <line:82:5, col:126> col:24 compare_and_swap 'bool (volatile uint32_t &, uint32_t, uint32_t)' static inline
| |-ParmVarDecl 0x55c8105e00a0 <col:41, col:60> col:60 x 'volatile uint32_t &'
| |-ParmVarDecl 0x55c8105e0118 <col:63, col:72> col:72 expected 'uint32_t':'unsigned int'
| |-ParmVarDecl 0x55c8105e0190 <col:82, col:91> col:91 desired 'uint32_t':'unsigned int'
| `-DeprecatedAttr 0x55c8105e0370 <col:115> "" ""
|-AccessSpecDecl 0x55c8105e03e0 <line:84:3, col:10> col:3 private
|-FieldDecl 0x55c8105e0418 <line:91:5, col:14> col:14 referenced _val 'uint32_t':'unsigned int'
|-CXXMethodDecl 0x55c8105e0b20 <line:52:7> col:7 implicit constexpr operator= 'atomic_uint32_t &(const atomic_uint32_t &)' inline default trivial noexcept-unevaluated 0x55c8105e0b20
| `-ParmVarDecl 0x55c8105e0c28 <col:7> col:7 'const atomic_uint32_t &'
|-CXXMethodDecl 0x55c8105e0cc8 <col:7> col:7 implicit constexpr operator= 'atomic_uint32_t &(atomic_uint32_t &&)' inline default trivial noexcept-unevaluated 0x55c8105e0cc8
| `-ParmVarDecl 0x55c8105e0dd8 <col:7> col:7 'atomic_uint32_t &&'
|-CXXConstructorDecl 0x55c81067f7e8 <col:7> col:7 implicit used atomic_uint32_t 'void () noexcept' inline default trivial
| `-CompoundStmt 0x55c810872770 <col:7>
|-CXXConstructorDecl 0x55c81067f8c0 <col:7> col:7 implicit constexpr atomic_uint32_t 'void (const atomic_uint32_t &)' inline default trivial noexcept-unevaluated 0x55c81067f8c0
| `-ParmVarDecl 0x55c81067f9d8 <col:7> col:7 'const atomic_uint32_t &'
|-CXXConstructorDecl 0x55c81067fa48 <col:7> col:7 implicit constexpr atomic_uint32_t 'void (atomic_uint32_t &&)' inline default trivial noexcept-unevaluated 0x55c81067fa48
| `-ParmVarDecl 0x55c81067fb58 <col:7> col:7 'atomic_uint32_t &&'
`-CXXDestructorDecl 0x55c8108750e0 <col:7> col:7 implicit referenced ~atomic_uint32_t 'void () noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%class.atomic_uint32_t = type { i32 }
  NonVirtualBaseLLVMType:%class.atomic_uint32_t = type { i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x55c8109543f0 <../dummy_inc/click/vector.hh:11:1, line:71:1> line:11:30 class vector_memory definition
|-DefinitionData standard_layout has_user_declared_ctor can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor simple trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveConstructor
| |-CopyAssignment trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveAssignment
| `-Destructor non_trivial user_declared
|-TemplateArgument type 'sized_array_memory<8>'
|-CXXRecordDecl 0x55c8109545c8 prev 0x55c8109543f0 <col:24, col:30> col:30 implicit class vector_memory
|-AccessSpecDecl 0x55c810954658 <col:46, col:52> col:46 public
|-TypedefDecl 0x55c810954680 <line:12:5, col:17> col:17 size_type 'int'
| `-BuiltinType 0x55c810317580 'int'
|-TypedefDecl 0x55c810956250 <line:13:5, col:31> col:31 type 'typename sized_array_memory<8>::type':'char_array<8>'
| `-ElaboratedType 0x55c810956200 'typename sized_array_memory<8>::type' sugar
|   `-TypedefType 0x55c810954b30 'sized_array_memory<8>::type' sugar
|     |-Typedef 0x55c810954a30 'type'
|     `-TemplateSpecializationType 0x55c8109549c0 'char_array<8UL>' sugar char_array
|       |-TemplateArgument expr
|       | `-ConstantExpr 0x55c8109548a0 <../dummy_inc/click/array_memory.hh:11:24> 'unsigned long' Int: 8
|       |   `-SubstNonTypeTemplateParmExpr 0x55c810954880 <col:24> 'unsigned long'
|       |     `-IntegerLiteral 0x55c810954860 <col:24> 'unsigned long' 8
|       `-RecordType 0x55c8109549a0 'char_array<8>'
|         `-ClassTemplateSpecialization 0x55c8109548c0 'char_array'
|-TypedefDecl 0x55c810956308 <../dummy_inc/click/vector.hh:14:5, col:19> col:19 iterator 'vector_memory<sized_array_memory<8> >::type *'
| `-PointerType 0x55c8109562d0 'vector_memory<sized_array_memory<8> >::type *'
|   `-TypedefType 0x55c8109562b0 'vector_memory<sized_array_memory<8> >::type' sugar
|     |-Typedef 0x55c810956250 'type'
|     `-ElaboratedType 0x55c810956200 'typename sized_array_memory<8>::type' sugar
|       `-TypedefType 0x55c810954b30 'sized_array_memory<8>::type' sugar
|         |-Typedef 0x55c810954a30 'type'
|         `-TemplateSpecializationType 0x55c8109549c0 'char_array<8UL>' sugar char_array
|           |-TemplateArgument expr
|           | `-ConstantExpr 0x55c8109548a0 <../dummy_inc/click/array_memory.hh:11:24> 'unsigned long' Int: 8
|           |   `-SubstNonTypeTemplateParmExpr 0x55c810954880 <col:24> 'unsigned long'
|           |     `-IntegerLiteral 0x55c810954860 <col:24> 'unsigned long' 8
|           `-RecordType 0x55c8109549a0 'char_array<8>'
|             `-ClassTemplateSpecialization 0x55c8109548c0 'char_array'
|-CXXMethodDecl 0x55c810956488 <../dummy_inc/click/vector.hh:15:5, line:18:5> line:15:17 need_argument_copy 'bool (const vector_memory<sized_array_memory<8> >::type *) const' inline
| `-ParmVarDecl 0x55c810956398 <col:36, col:48> col:48 argp 'const vector_memory<sized_array_memory<8> >::type *'
|-CXXConstructorDecl 0x55c810956578 <line:20:5, line:22:5> line:20:5 vector_memory 'void ()'
|-CXXDestructorDecl 0x55c810956658 <line:23:5, col:20> col:5 used ~vector_memory 'void () noexcept'
|-CXXMethodDecl 0x55c810956928 <line:25:5, col:43> col:10 assign 'void (const vector_memory<sized_array_memory<8> > &)'
| `-ParmVarDecl 0x55c810956830 <col:17, col:42> col:42 x 'const vector_memory<sized_array_memory<8> > &'
|-CXXMethodDecl 0x55c810956b68 <line:26:5, col:44> col:10 assign 'void (vector_memory::size_type, const vector_memory<sized_array_memory<8> >::type *)'
| |-ParmVarDecl 0x55c8109569e0 <col:17, col:27> col:27 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55c810956a58 <col:30, col:42> col:42 vp 'const vector_memory<sized_array_memory<8> >::type *'
|-CXXMethodDecl 0x55c810956d38 <line:27:5, col:44> col:10 resize 'void (vector_memory::size_type, const vector_memory<sized_array_memory<8> >::type *)'
| |-ParmVarDecl 0x55c810956c28 <col:17, col:27> col:27 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55c810956ca0 <col:30, col:42> col:42 vp 'const vector_memory<sized_array_memory<8> >::type *'
|-CXXMethodDecl 0x55c810956e98 <line:28:5, line:30:5> line:28:14 begin 'vector_memory<sized_array_memory<8> >::iterator ()'
|-CXXMethodDecl 0x55c810956f68 <line:31:5, line:33:5> line:31:14 end 'vector_memory<sized_array_memory<8> >::iterator ()'
|-CXXMethodDecl 0x55c8109571b8 <line:34:5, col:48> col:14 insert 'vector_memory<sized_array_memory<8> >::iterator (vector_memory<sized_array_memory<8> >::iterator, const vector_memory<sized_array_memory<8> >::type *)'
| |-ParmVarDecl 0x55c810957028 <col:21, col:30> col:30 it 'vector_memory<sized_array_memory<8> >::iterator':'vector_memory<sized_array_memory<8> >::type *'
| `-ParmVarDecl 0x55c8109570a0 <col:34, col:46> col:46 vp 'const vector_memory<sized_array_memory<8> >::type *'
|-CXXMethodDecl 0x55c810957418 <line:35:5, col:42> col:14 erase 'vector_memory<sized_array_memory<8> >::iterator (vector_memory<sized_array_memory<8> >::iterator, vector_memory<sized_array_memory<8> >::iterator)'
| |-ParmVarDecl 0x55c810957288 <col:20, col:29> col:29 a 'vector_memory<sized_array_memory<8> >::iterator':'vector_memory<sized_array_memory<8> >::type *'
| `-ParmVarDecl 0x55c810957300 <col:32, col:41> col:41 b 'vector_memory<sized_array_memory<8> >::iterator':'vector_memory<sized_array_memory<8> >::type *'
|-CXXMethodDecl 0x55c8109575d8 <line:36:5, line:43:5> line:36:17 push_back 'void (const vector_memory<sized_array_memory<8> >::type *)' inline
| `-ParmVarDecl 0x55c8109574e8 <col:27, col:39> col:39 vp 'const vector_memory<sized_array_memory<8> >::type *'
|-CXXMethodDecl 0x55c810957798 <line:45:5, line:52:5> line:45:17 move_construct_back 'void (vector_memory<sized_array_memory<8> >::type *)' inline
| `-ParmVarDecl 0x55c8109576a0 <col:37, col:43> col:43 vp 'vector_memory<sized_array_memory<8> >::type *'
|-CXXMethodDecl 0x55c810957850 <line:54:5, line:59:5> line:54:17 pop_back 'void ()' inline
|-CXXMethodDecl 0x55c81095af40 <line:60:5, line:64:5> line:60:17 clear 'void ()' inline
|-CXXMethodDecl 0x55c81095b178 <line:65:5, col:59> col:10 reserve_and_push_back 'bool (vector_memory::size_type, const vector_memory<sized_array_memory<8> >::type *)'
| |-ParmVarDecl 0x55c81095aff0 <col:32, col:42> col:42 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55c81095b068 <col:45, col:57> col:57 vp 'const vector_memory<sized_array_memory<8> >::type *'
|-CXXMethodDecl 0x55c81095b418 <line:66:5, col:35> col:10 swap 'void (vector_memory<sized_array_memory<8> > &)'
| `-ParmVarDecl 0x55c81095b320 <col:15, col:34> col:34 x 'vector_memory<sized_array_memory<8> > &'
|-FieldDecl 0x55c81095b4e0 <line:68:5, col:11> col:11 l_ 'vector_memory<sized_array_memory<8> >::type *'
|-FieldDecl 0x55c81095b530 <line:69:5, col:15> col:15 n_ 'vector_memory::size_type':'int'
`-FieldDecl 0x55c81095b580 <line:70:5, col:15> col:15 capacity_ 'vector_memory::size_type':'int'

Layout: <CGRecordLayout
  LLVMType:%class.vector_memory = type { %struct.char_array*, i32, i32 }
  NonVirtualBaseLLVMType:%class.vector_memory = type { %struct.char_array*, i32, i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x55c810aed718 <../dummy_inc/click/ipaddress.hh:13:1, col:29> ../dummy_inc/click/vector.hh:111:7 class Vector definition
|-DefinitionData standard_layout has_user_declared_ctor has_mutable_fields can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor non_trivial user_declared has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveConstructor exists non_trivial user_declared needs_overload_resolution
| |-CopyAssignment non_trivial has_const_param user_declared needs_overload_resolution implicit_has_const_param
| |-MoveAssignment exists non_trivial user_declared needs_overload_resolution
| `-Destructor simple non_trivial needs_overload_resolution
|-TemplateArgument type 'Element *'
|-CXXRecordDecl 0x55c810af80f8 prev 0x55c810aed718 <col:1, col:7> col:7 implicit class Vector
|-TypedefDecl 0x55c810af9110 <line:113:5, col:44> col:44 array_memory_type 'typename array_memory<Element *>::type':'sized_array_memory<8>'
| `-ElaboratedType 0x55c810af90c0 'typename array_memory<Element *>::type' sugar
|   `-TypedefType 0x55c810af90a0 'conditional<true, sized_array_memory<8>, typed_array_memory<Element *> >::type' sugar
|     |-Typedef 0x55c810af8f50 'type'
|     `-SubstTemplateTypeParmType 0x55c810953fc0 'sized_array_memory<8>' sugar
|       |-TemplateTypeParmType 0x55c8105fd290 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55c8105fd238 'T'
|       `-RecordType 0x55c810953b10 'sized_array_memory<8>'
|         `-ClassTemplateSpecialization 0x55c810953a28 'sized_array_memory'
|-FieldDecl 0x55c810af9210 <line:114:5, col:46> col:46 vm_ 'vector_memory<Vector<Element *>::array_memory_type>':'vector_memory<sized_array_memory<8> >' mutable
|-AccessSpecDecl 0x55c810af9260 <line:116:3, col:9> col:3 public
|-TypedefDecl 0x55c810af9298 <line:118:5, col:15> col:15 value_type 'Element *':'Element *'
| `-SubstTemplateTypeParmType 0x55c810af8190 'Element *' sugar
|   |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x55c8106333f8 'T'
|   `-PointerType 0x55c81087f130 'Element *'
|     `-RecordType 0x55c81087eeb0 'Element'
|       `-CXXRecord 0x55c810888b70 'Element'
|-TypedefDecl 0x55c810af9328 <line:119:5, col:16> col:16 reference 'Element *&'
| `-LValueReferenceType 0x55c810af92f0 'Element *&'
|   `-SubstTemplateTypeParmType 0x55c810af8190 'Element *' sugar
|     |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55c8106333f8 'T'
|     `-PointerType 0x55c81087f130 'Element *'
|       `-RecordType 0x55c81087eeb0 'Element'
|         `-CXXRecord 0x55c810888b70 'Element'
|-TypedefDecl 0x55c810af93e8 <line:120:5, col:22> col:22 const_reference 'Element *const &'
| `-LValueReferenceType 0x55c810af93b0 'Element *const &'
|   `-QualType 0x55c810af8191 'Element *const' const
|     `-SubstTemplateTypeParmType 0x55c810af8190 'Element *' sugar
|       |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55c8106333f8 'T'
|       `-PointerType 0x55c81087f130 'Element *'
|         `-RecordType 0x55c81087eeb0 'Element'
|           `-CXXRecord 0x55c810888b70 'Element'
|-TypedefDecl 0x55c810af9478 <line:121:5, col:16> col:16 pointer 'Element **'
| `-PointerType 0x55c810af9440 'Element **'
|   `-SubstTemplateTypeParmType 0x55c810af8190 'Element *' sugar
|     |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55c8106333f8 'T'
|     `-PointerType 0x55c81087f130 'Element *'
|       `-RecordType 0x55c81087eeb0 'Element'
|         `-CXXRecord 0x55c810888b70 'Element'
|-TypedefDecl 0x55c810af9538 <line:122:5, col:22> col:22 const_pointer 'Element *const *'
| `-PointerType 0x55c810af9500 'Element *const *'
|   `-QualType 0x55c810af8191 'Element *const' const
|     `-SubstTemplateTypeParmType 0x55c810af8190 'Element *' sugar
|       |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55c8106333f8 'T'
|       `-PointerType 0x55c81087f130 'Element *'
|         `-RecordType 0x55c81087eeb0 'Element'
|           `-CXXRecord 0x55c810888b70 'Element'
|-TypedefDecl 0x55c810afa110 <line:125:5, col:45> col:45 value_argument_type 'typename fast_argument<Element *>::type':'Element *'
| `-ElaboratedType 0x55c810afa0c0 'typename fast_argument<Element *>::type' sugar
|   `-TypedefType 0x55c810afa0a0 'fast_argument<Element *, false>::type' sugar
|     |-Typedef 0x55c810afa030 'type'
|     `-SubstTemplateTypeParmType 0x55c810af9df0 'Element *' sugar
|       |-TemplateTypeParmType 0x55c810605490 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55c810605440 'T'
|       `-PointerType 0x55c81087f130 'Element *'
|         `-RecordType 0x55c81087eeb0 'Element'
|           `-CXXRecord 0x55c810888b70 'Element'
|-TypedefDecl 0x55c810afa178 <line:126:5, col:22> col:22 const_access_type 'Element *const &'
| `-LValueReferenceType 0x55c810af93b0 'Element *const &'
|   `-QualType 0x55c810af8191 'Element *const' const
|     `-SubstTemplateTypeParmType 0x55c810af8190 'Element *' sugar
|       |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55c8106333f8 'T'
|       `-PointerType 0x55c81087f130 'Element *'
|         `-RecordType 0x55c81087eeb0 'Element'
|           `-CXXRecord 0x55c810888b70 'Element'
|-TypedefDecl 0x55c810afa1d0 <line:128:5, col:17> col:17 size_type 'int'
| `-BuiltinType 0x55c810317580 'int'
|-TypedefDecl 0x55c810afa238 <line:130:5, col:16> col:16 iterator 'Element **'
| `-PointerType 0x55c810af9440 'Element **'
|   `-SubstTemplateTypeParmType 0x55c810af8190 'Element *' sugar
|     |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55c8106333f8 'T'
|     `-PointerType 0x55c81087f130 'Element *'
|       `-RecordType 0x55c81087eeb0 'Element'
|         `-CXXRecord 0x55c810888b70 'Element'
|-TypedefDecl 0x55c810afa2a0 <line:131:5, col:22> col:22 const_iterator 'Element *const *'
| `-PointerType 0x55c810af9500 'Element *const *'
|   `-QualType 0x55c810af8191 'Element *const' const
|     `-SubstTemplateTypeParmType 0x55c810af8190 'Element *' sugar
|       |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55c8106333f8 'T'
|       `-PointerType 0x55c81087f130 'Element *'
|         `-RecordType 0x55c81087eeb0 'Element'
|           `-CXXRecord 0x55c810888b70 'Element'
|-EnumDecl 0x55c810afa2f8 <line:134:5> col:5
| `-EnumConstantDecl 0x55c810afa3f0 <col:12, col:40> col:12 RESERVE_GROW 'Vector<Element *>::(anonymous enum at ../dummy_inc/click/vector.hh:134:5)'
|   `-ConstantExpr 0x55c810afa3d0 <col:27, col:40> 'Vector::size_type':'int' Int: -1
|     `-CStyleCastExpr 0x55c810634618 <col:27, col:40> 'Vector::size_type':'int' <NoOp>
|       `-UnaryOperator 0x55c8106345f0 <col:39, col:40> 'int' prefix '-'
|         `-IntegerLiteral 0x55c8106345d0 <col:40> 'int' 1
|-CXXConstructorDecl 0x55c810afa478 <line:137:5, col:28> col:21 Vector 'void ()' inline
|-CXXConstructorDecl 0x55c810afa708 <line:138:5, col:62> col:21 Vector 'void (Vector::size_type, Vector<Element *>::value_argument_type)' inline
| |-ParmVarDecl 0x55c810afa530 <col:28, col:38> col:38 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55c810afa5d0 <col:41, col:61> col:61 v 'Vector<Element *>::value_argument_type':'Element *'
|-CXXConstructorDecl 0x55c810b01d38 <line:139:5, col:37> col:12 Vector 'void (const Vector<Element *> &)' inline
| `-ParmVarDecl 0x55c810afa880 <col:19, col:36> col:36 x 'const Vector<Element *> &'
|-CXXConstructorDecl 0x55c810b01ff8 <line:141:5, col:32> col:12 Vector 'void (Vector<Element *> &&)' inline
| `-ParmVarDecl 0x55c810b01ee0 <col:19, col:31> col:31 x 'Vector<Element *> &&'
|-CXXMethodDecl 0x55c810b02310 <line:144:5, col:51> col:23 operator= 'Vector<Element *> &(const Vector<Element *> &)' inline
| `-ParmVarDecl 0x55c810b021f0 <col:33, col:50> col:50 x 'const Vector<Element *> &'
|-CXXMethodDecl 0x55c810b02620 <line:146:5, col:46> col:23 operator= 'Vector<Element *> &(Vector<Element *> &&)' inline
| `-ParmVarDecl 0x55c810b02500 <col:33, col:45> col:45 x 'Vector<Element *> &&'
|-CXXMethodDecl 0x55c810b02910 <line:148:5, col:70> col:23 assign 'Vector<Element *> &(Vector::size_type, Vector<Element *>::value_argument_type)' inline
| |-ParmVarDecl 0x55c810b02758 <col:30, col:40> col:40 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55c810b027d0 <col:43, col:69> col:63 v 'Vector<Element *>::value_argument_type':'Element *'
|-CXXMethodDecl 0x55c810b02a68 <line:150:5, col:55> col:49 begin 'Vector<Element *>::iterator ()'
| |-NoInlineAttr 0x55c810b02b48 <col:20> Inherited
| `-OptimizeNoneAttr 0x55c810b02ba0 <col:30> Inherited
|-CXXMethodDecl 0x55c810b02be8 <line:151:5, col:53> col:49 end 'Vector<Element *>::iterator ()'
| |-NoInlineAttr 0x55c810b02c98 <col:20> Inherited
| `-OptimizeNoneAttr 0x55c810b02cf0 <col:30> Inherited
|-CXXMethodDecl 0x55c810b02db8 <line:152:5, col:63> col:55 begin 'Vector<Element *>::const_iterator () const'
| |-NoInlineAttr 0x55c810b02e68 <col:20> Inherited
| `-OptimizeNoneAttr 0x55c810b02ec0 <col:30> Inherited
|-CXXMethodDecl 0x55c810b02f08 <line:153:5, col:61> col:55 end 'Vector<Element *>::const_iterator () const'
| |-NoInlineAttr 0x55c810b02fb8 <col:20> Inherited
| `-OptimizeNoneAttr 0x55c810b03010 <col:30> Inherited
|-CXXMethodDecl 0x55c810b03058 <line:154:5, col:64> col:55 cbegin 'Vector<Element *>::const_iterator () const'
| |-NoInlineAttr 0x55c810b03108 <col:20> Inherited
| `-OptimizeNoneAttr 0x55c810b03160 <col:30> Inherited
|-CXXMethodDecl 0x55c810b031a8 <line:155:5, col:62> col:55 cend 'Vector<Element *>::const_iterator () const'
| |-NoInlineAttr 0x55c810b03258 <col:20> Inherited
| `-OptimizeNoneAttr 0x55c810b032b0 <col:30> Inherited
|-CXXMethodDecl 0x55c810b032d8 <line:157:5, col:29> col:22 used size 'Vector::size_type () const' inline
|-CXXMethodDecl 0x55c810b03388 <line:158:5, col:33> col:22 capacity 'Vector::size_type () const' inline
|-CXXMethodDecl 0x55c810b03438 <line:159:5, col:25> col:17 empty 'bool () const' inline
|-CXXMethodDecl 0x55c810b035f8 <line:160:5, col:64> col:17 resize 'void (Vector::size_type, Vector<Element *>::value_argument_type)' inline
| |-ParmVarDecl 0x55c810b034e8 <col:24, col:34> col:34 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55c810b03560 <col:37, col:63> col:57 v 'Vector<Element *>::value_argument_type':'Element *'
|-CXXMethodDecl 0x55c810b03748 <line:161:5, col:36> col:17 reserve 'bool (Vector::size_type)' inline
| `-ParmVarDecl 0x55c810b036b8 <col:25, col:35> col:35 n 'Vector::size_type':'int'
|-CXXMethodDecl 0x55c810b038f8 <line:163:5, col:65> col:43 operator[] 'Element *&(Vector::size_type)'
| |-ParmVarDecl 0x55c810b03800 <col:54, col:64> col:64 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x55c810b039b0 <col:20>
| `-OptimizeNoneAttr 0x55c810b03a08 <col:30>
|-CXXMethodDecl 0x55c810b03b28 <line:164:5, col:73> col:49 operator[] 'Element *const &(Vector::size_type) const'
| |-ParmVarDecl 0x55c810b03a30 <col:60, col:70> col:70 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x55c810b03be0 <col:20>
| `-OptimizeNoneAttr 0x55c810b03c38 <col:30>
|-CXXMethodDecl 0x55c810b03cf0 <line:165:5, col:29> col:15 at 'Element *&(Vector::size_type)' inline
| `-ParmVarDecl 0x55c810b03c60 <col:18, col:28> col:28 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55c810b03e38 <line:166:5, col:37> col:21 at 'Element *const &(Vector::size_type) const' inline
| `-ParmVarDecl 0x55c810b03da8 <col:24, col:34> col:34 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55c810b03f68 <line:167:5, col:21> col:15 front 'Element *&()' inline
|-CXXMethodDecl 0x55c810b04098 <line:168:5, col:29> col:21 front 'Element *const &() const' inline
|-CXXMethodDecl 0x55c810b04168 <line:169:5, col:20> col:15 back 'Element *&()' inline
|-CXXMethodDecl 0x55c810b04238 <line:170:5, col:28> col:21 back 'Element *const &() const' inline
|-CXXMethodDecl 0x55c810b04378 <line:172:5, col:39> col:15 unchecked_at 'Element *&(Vector::size_type)' inline
| `-ParmVarDecl 0x55c810b042e8 <col:28, col:38> col:38 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55c810b044c0 <line:173:5, col:47> col:21 unchecked_at 'Element *const &(Vector::size_type) const' inline
| `-ParmVarDecl 0x55c810b04430 <col:34, col:44> col:44 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55c810b04608 <line:174:5, col:59> col:15 at_u 'Element *&(Vector::size_type)' inline
| |-ParmVarDecl 0x55c810b04578 <col:20, col:30> col:30 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x55c810b046c0 <col:48> Inherited "" ""
|-CXXMethodDecl 0x55c810b047c0 <line:175:5, col:71> col:21 at_u 'Element *const &(Vector::size_type) const' inline
| |-ParmVarDecl 0x55c810b04730 <col:26, col:36> col:36 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x55c810b04878 <col:60> Inherited "" ""
|-CXXMethodDecl 0x55c810b04938 <line:177:5, col:20> col:15 data 'Element **()' inline
|-CXXMethodDecl 0x55c810b04a38 <line:178:5, col:28> col:21 data 'Element *const *() const' inline
|-CXXMethodDecl 0x55c810b04bb8 <line:180:5, col:48> col:17 push_back 'void (Vector<Element *>::value_argument_type)' inline
| `-ParmVarDecl 0x55c810b04af8 <col:27, col:47> col:47 v 'Vector<Element *>::value_argument_type':'Element *'
|-FunctionTemplateDecl 0x55c810b05378 <line:182:5, line:183:63> col:48 push_back
| |-TemplateTypeParmDecl 0x55c810b04c70 <line:182:15, col:43> col:24 typename depth 0 index 0 A
| | `-TemplateArgument type 'fast_argument<Element *>':'fast_argument<Element *, false>'
| `-CXXMethodDecl 0x55c810b052d8 <line:183:5, col:63> col:48 push_back 'typename A::enable_rvalue_reference (Element *&&)' inline
|   `-ParmVarDecl 0x55c810b051d8 <col:58, col:62> col:62 v 'Element *&&'
|-CXXMethodDecl 0x55c810b05458 <line:185:5, col:26> col:17 pop_back 'void ()' inline
|-CXXMethodDecl 0x55c810b055a8 <line:186:5, col:49> col:17 push_front 'void (Vector<Element *>::value_argument_type)' inline
| `-ParmVarDecl 0x55c810b05518 <col:28, col:48> col:48 v 'Vector<Element *>::value_argument_type':'Element *'
|-CXXMethodDecl 0x55c810b05660 <line:187:5, col:27> col:17 pop_front 'void ()' inline
|-CXXMethodDecl 0x55c810b058a8 <line:189:5, col:62> col:21 insert 'Vector<Element *>::iterator (Vector<Element *>::iterator, Vector<Element *>::value_argument_type)' inline
| |-ParmVarDecl 0x55c810b05720 <col:28, col:37> col:37 it 'Vector<Element *>::iterator':'Element **'
| `-ParmVarDecl 0x55c810b05798 <col:41, col:61> col:61 v 'Vector<Element *>::value_argument_type':'Element *'
|-CXXMethodDecl 0x55c810b05a68 <line:190:5, col:38> col:21 erase 'Vector<Element *>::iterator (Vector<Element *>::iterator)' inline
| `-ParmVarDecl 0x55c810b05978 <col:27, col:36> col:36 it 'Vector<Element *>::iterator':'Element **'
|-CXXMethodDecl 0x55c810b05cb8 <line:191:5, col:49> col:21 erase 'Vector<Element *>::iterator (Vector<Element *>::iterator, Vector<Element *>::iterator)' inline
| |-ParmVarDecl 0x55c810b05b30 <col:27, col:36> col:36 a 'Vector<Element *>::iterator':'Element **'
| `-ParmVarDecl 0x55c810b05ba8 <col:39, col:48> col:48 b 'Vector<Element *>::iterator':'Element **'
|-CXXMethodDecl 0x55c810b05d78 <line:193:5, col:23> col:17 clear 'void ()' inline
|-CXXMethodDecl 0x55c810b05fd8 <line:195:5, col:34> col:17 swap 'void (Vector<Element *> &)' inline
| `-ParmVarDecl 0x55c810b05ee0 <col:22, col:33> col:33 x 'Vector<Element *> &'
`-CXXDestructorDecl 0x55c810b060a8 <../dummy_inc/click/ipaddress.hh:13:29> col:29 implicit ~Vector 'void ()' inline default noexcept-unevaluated 0x55c810b060a8

Layout: <CGRecordLayout
  LLVMType:%class.Vector = type { %class.vector_memory }
  NonVirtualBaseLLVMType:%class.Vector = type { %class.vector_memory }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x55c81065d2c0 <../dummy_inc/click/string.hh:189:5, line:198:5> line:189:12 referenced struct memo_t definition
|-DefinitionData pass_in_registers aggregate standard_layout trivially_copyable pod trivial
| |-DefaultConstructor exists trivial needs_implicit
| |-CopyConstructor simple trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveConstructor exists simple trivial needs_implicit
| |-CopyAssignment trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveAssignment exists simple trivial needs_implicit
| `-Destructor simple irrelevant trivial needs_implicit
|-CXXRecordDecl 0x55c81065d3d8 <col:5, col:12> col:12 implicit struct memo_t
|-FieldDecl 0x55c81065d478 <line:190:2, col:20> col:20 referenced refcount 'volatile uint32_t':'volatile unsigned int'
|-FieldDecl 0x55c81065d4d8 <line:191:2, col:11> col:11 referenced capacity 'uint32_t':'unsigned int'
|-FieldDecl 0x55c81065d538 <line:192:2, col:20> col:20 dirty 'volatile uint32_t':'volatile unsigned int'
`-FieldDecl 0x55c81065d5e8 <line:197:2, col:18> col:7 real_data 'char [8]'

Layout: <CGRecordLayout
  LLVMType:%"struct.String::memo_t" = type { i32, i32, i32, [8 x i8] }
  NonVirtualBaseLLVMType:%"struct.String::memo_t" = type { i32, i32, i32, [8 x i8] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x55c81065d8f0 <../dummy_inc/click/string.hh:204:5, line:208:5> line:204:12 referenced struct rep_t definition
|-DefinitionData pass_in_registers aggregate standard_layout trivially_copyable pod trivial literal
| |-DefaultConstructor exists trivial
| |-CopyConstructor simple trivial has_const_param implicit_has_const_param
| |-MoveConstructor exists simple trivial
| |-CopyAssignment trivial has_const_param implicit_has_const_param
| |-MoveAssignment exists simple trivial
| `-Destructor simple irrelevant trivial
|-CXXRecordDecl 0x55c81065da08 <col:5, col:12> col:12 implicit struct rep_t
|-FieldDecl 0x55c81065dab0 <line:205:2, col:14> col:14 referenced data 'const char *'
|-FieldDecl 0x55c81065db18 <line:206:2, col:6> col:6 referenced length 'int'
|-FieldDecl 0x55c81065dba8 <line:207:2, col:10> col:10 referenced memo 'String::memo_t *'
|-CXXConstructorDecl 0x55c810662390 <line:204:12> col:12 implicit used rep_t 'void () noexcept' inline default trivial
| `-CompoundStmt 0x55c8106627c8 <col:12>
|-CXXConstructorDecl 0x55c810662498 <col:12> col:12 implicit used constexpr rep_t 'void (const String::rep_t &) noexcept' inline default trivial
| |-ParmVarDecl 0x55c8106625a8 <col:12> col:12 used 'const String::rep_t &'
| |-CXXCtorInitializer Field 0x55c81065dab0 'data' 'const char *'
| | `-ImplicitCastExpr 0x55c810665c10 <col:12> 'const char *' <LValueToRValue>
| |   `-MemberExpr 0x55c810665be0 <col:12> 'const char *const' lvalue .data 0x55c81065dab0
| |     `-DeclRefExpr 0x55c810665bc0 <col:12> 'const String::rep_t' lvalue ParmVar 0x55c8106625a8 '' 'const String::rep_t &'
| |-CXXCtorInitializer Field 0x55c81065db18 'length' 'int'
| | `-ImplicitCastExpr 0x55c810665ca0 <col:12> 'int' <LValueToRValue>
| |   `-MemberExpr 0x55c810665c70 <col:12> 'const int' lvalue .length 0x55c81065db18
| |     `-DeclRefExpr 0x55c810665c50 <col:12> 'const String::rep_t' lvalue ParmVar 0x55c8106625a8 '' 'const String::rep_t &'
| |-CXXCtorInitializer Field 0x55c81065dba8 'memo' 'String::memo_t *'
| | `-ImplicitCastExpr 0x55c810665d30 <col:12> 'String::memo_t *' <LValueToRValue>
| |   `-MemberExpr 0x55c810665d00 <col:12> 'String::memo_t *const' lvalue .memo 0x55c81065dba8
| |     `-DeclRefExpr 0x55c810665ce0 <col:12> 'const String::rep_t' lvalue ParmVar 0x55c8106625a8 '' 'const String::rep_t &'
| `-CompoundStmt 0x55c810665d88 <col:12>
|-CXXConstructorDecl 0x55c810662648 <col:12> col:12 implicit constexpr rep_t 'void (String::rep_t &&)' inline default trivial noexcept-unevaluated 0x55c810662648
| `-ParmVarDecl 0x55c810662758 <col:12> col:12 'String::rep_t &&'
|-CXXDestructorDecl 0x55c810668ab0 <col:12> col:12 implicit ~rep_t 'void () noexcept' inline default trivial
|-CXXMethodDecl 0x55c810672138 <col:12> col:12 implicit used constexpr operator= 'String::rep_t &(const String::rep_t &) noexcept' inline default trivial
| |-ParmVarDecl 0x55c810672248 <col:12> col:12 used 'const String::rep_t &'
| `-CompoundStmt 0x55c810672760 <col:12>
|   |-BinaryOperator 0x55c810672578 <col:12> 'const char *' lvalue '='
|   | |-MemberExpr 0x55c810672530 <col:12> 'const char *' lvalue ->data 0x55c81065dab0
|   | | `-CXXThisExpr 0x55c810672520 <col:12> 'String::rep_t *' this
|   | `-ImplicitCastExpr 0x55c810672560 <col:12> 'const char *' <LValueToRValue>
|   |   `-MemberExpr 0x55c8106724f0 <col:12> 'const char *const' lvalue .data 0x55c81065dab0
|   |     `-DeclRefExpr 0x55c8106724d0 <col:12> 'const String::rep_t' lvalue ParmVar 0x55c810672248 '' 'const String::rep_t &'
|   |-BinaryOperator 0x55c810672640 <col:12> 'int' lvalue '='
|   | |-MemberExpr 0x55c8106725f8 <col:12> 'int' lvalue ->length 0x55c81065db18
|   | | `-CXXThisExpr 0x55c8106725e8 <col:12> 'String::rep_t *' this
|   | `-ImplicitCastExpr 0x55c810672628 <col:12> 'int' <LValueToRValue>
|   |   `-MemberExpr 0x55c8106725b8 <col:12> 'const int' lvalue .length 0x55c81065db18
|   |     `-DeclRefExpr 0x55c810672598 <col:12> 'const String::rep_t' lvalue ParmVar 0x55c810672248 '' 'const String::rep_t &'
|   |-BinaryOperator 0x55c810672708 <col:12> 'String::memo_t *' lvalue '='
|   | |-MemberExpr 0x55c8106726c0 <col:12> 'String::memo_t *' lvalue ->memo 0x55c81065dba8
|   | | `-CXXThisExpr 0x55c8106726b0 <col:12> 'String::rep_t *' this
|   | `-ImplicitCastExpr 0x55c8106726f0 <col:12> 'String::memo_t *' <LValueToRValue>
|   |   `-MemberExpr 0x55c810672680 <col:12> 'String::memo_t *const' lvalue .memo 0x55c81065dba8
|   |     `-DeclRefExpr 0x55c810672660 <col:12> 'const String::rep_t' lvalue ParmVar 0x55c810672248 '' 'const String::rep_t &'
|   `-ReturnStmt 0x55c810672750 <col:12>
|     `-UnaryOperator 0x55c810672738 <col:12> 'String::rep_t' lvalue prefix '*' cannot overflow
|       `-CXXThisExpr 0x55c810672728 <col:12> 'String::rep_t *' this
`-CXXMethodDecl 0x55c8106722b8 <col:12> col:12 implicit constexpr operator= 'String::rep_t &(String::rep_t &&)' inline default trivial noexcept-unevaluated 0x55c8106722b8
  `-ParmVarDecl 0x55c8106723c8 <col:12> col:12 'String::rep_t &&'

Layout: <CGRecordLayout
  LLVMType:%"struct.String::rep_t" = type { i8*, i32, %"struct.String::memo_t"* }
  NonVirtualBaseLLVMType:%"struct.String::rep_t" = type { i8*, i32, %"struct.String::memo_t"* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x55c810653830 <../dummy_inc/click/string.hh:19:1, line:304:1> line:19:7 referenced class String definition
|-DefinitionData standard_layout has_user_declared_ctor has_mutable_fields can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor non_trivial user_declared has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveConstructor exists non_trivial user_declared
| |-CopyAssignment non_trivial has_const_param user_declared needs_overload_resolution implicit_has_const_param
| |-MoveAssignment exists non_trivial user_declared
| `-Destructor non_trivial user_declared
|-CXXRecordDecl 0x55c810653948 <col:1, col:7> col:7 implicit referenced class String
|-AccessSpecDecl 0x55c8106539d8 <col:16, col:22> col:16 public
|-TypedefDecl 0x55c810653a18 <line:21:5, col:25> col:25 referenced const_iterator 'const char *'
| `-PointerType 0x55c810317fd0 'const char *'
|   `-QualType 0x55c810317521 'const char' const
|     `-BuiltinType 0x55c810317520 'char'
|-TypedefDecl 0x55c810653aa0 <line:22:5, col:28> col:28 iterator 'String::const_iterator':'const char *'
| `-TypedefType 0x55c810653a70 'String::const_iterator' sugar
|   |-Typedef 0x55c810653a18 'const_iterator'
|   `-PointerType 0x55c810317fd0 'const char *'
|     `-QualType 0x55c810317521 'const char' const
|       `-BuiltinType 0x55c810317520 'char'
|-TypedefDecl 0x55c810653c10 <line:24:5, col:52> col:27 referenced unspecified_bool_type 'int (String::*)() const'
| `-MemberPointerType 0x55c810653b80 'int (String::*)() const'
|   |-RecordType 0x55c8106538c0 'String'
|   | `-CXXRecord 0x55c810653830 'String'
|   `-ParenType 0x55c810653b20 'int () const' sugar
|     `-FunctionProtoType 0x55c810636250 'int () const' const cdecl
|       `-BuiltinType 0x55c810317580 'int'
|-TypedefDecl 0x55c810653c78 <line:27:5, col:21> col:21 referenced intmax_t 'int64_t':'long'
| `-TypedefType 0x55c810474130 'int64_t' sugar
|   |-Typedef 0x55c810380390 'int64_t'
|   `-TypedefType 0x55c810359630 '__int64_t' sugar
|     |-Typedef 0x55c810359208 '__int64_t'
|     `-BuiltinType 0x55c8103175a0 'long'
|-TypedefDecl 0x55c810653ce0 <line:28:5, col:22> col:22 referenced uintmax_t 'uint64_t':'unsigned long'
| `-TypedefType 0x55c810474050 'uint64_t' sugar
|   |-Typedef 0x55c810380530 'uint64_t'
|   `-TypedefType 0x55c8103596c0 '__uint64_t' sugar
|     |-Typedef 0x55c810359278 '__uint64_t'
|     `-BuiltinType 0x55c810317640 'unsigned long'
|-TypedefDecl 0x55c810653d70 <line:36:5, col:22> col:22 int_large_t 'String::intmax_t':'long'
| `-TypedefType 0x55c810653d40 'String::intmax_t' sugar
|   |-Typedef 0x55c810653c78 'intmax_t'
|   `-TypedefType 0x55c810474130 'int64_t' sugar
|     |-Typedef 0x55c810380390 'int64_t'
|     `-TypedefType 0x55c810359630 '__int64_t' sugar
|       |-Typedef 0x55c810359208 '__int64_t'
|       `-BuiltinType 0x55c8103175a0 'long'
|-TypedefDecl 0x55c810653e00 <line:37:5, col:23> col:23 uint_large_t 'String::uintmax_t':'unsigned long'
| `-TypedefType 0x55c810653dd0 'String::uintmax_t' sugar
|   |-Typedef 0x55c810653ce0 'uintmax_t'
|   `-TypedefType 0x55c810474050 'uint64_t' sugar
|     |-Typedef 0x55c810380530 'uint64_t'
|     `-TypedefType 0x55c8103596c0 '__uint64_t' sugar
|       |-Typedef 0x55c810359278 '__uint64_t'
|       `-BuiltinType 0x55c810317640 'unsigned long'
|-CXXConstructorDecl 0x55c810653ec0 <line:39:5, col:19> col:12 used String 'void ()' inline
|-CXXConstructorDecl 0x55c810654068 <line:40:5, col:34> col:12 used String 'void (const String &)' inline
| `-ParmVarDecl 0x55c810653fa8 <col:19, col:33> col:33 x 'const String &'
|-CXXConstructorDecl 0x55c810654218 <line:42:5, col:29> col:12 used String 'void (String &&)' inline
| `-ParmVarDecl 0x55c810654158 <col:19, col:28> col:28 x 'String &&'
|-CXXConstructorDecl 0x55c810654370 <line:44:5, col:35> col:12 used String 'void (const char *)' inline
| `-ParmVarDecl 0x55c8106542e0 <col:19, col:31> col:31 cstr 'const char *'
|-CXXConstructorDecl 0x55c810654588 <line:45:5, col:41> col:12 String 'void (const char *, int)' inline
| |-ParmVarDecl 0x55c810654438 <col:19, col:31> col:31 s 'const char *'
| `-ParmVarDecl 0x55c8106544b8 <col:34, col:38> col:38 len 'int'
|-CXXConstructorDecl 0x55c8106547a8 <line:46:5, col:50> col:12 String 'void (const unsigned char *, int)' inline
| |-ParmVarDecl 0x55c810654658 <col:19, col:40> col:40 s 'const unsigned char *'
| `-ParmVarDecl 0x55c8106546d8 <col:43, col:47> col:47 len 'int'
|-CXXConstructorDecl 0x55c8106549c8 <line:47:5, col:54> col:12 used String 'void (const char *, const char *)' inline
| |-ParmVarDecl 0x55c810654878 <col:19, col:31> col:31 first 'const char *'
| `-ParmVarDecl 0x55c8106548f8 <col:38, col:50> col:50 last 'const char *'
|-CXXConstructorDecl 0x55c810654be8 <line:48:5, col:72> col:12 String 'void (const unsigned char *, const unsigned char *)' inline
| |-ParmVarDecl 0x55c810654a98 <col:19, col:40> col:40 first 'const unsigned char *'
| `-ParmVarDecl 0x55c810654b18 <col:47, col:68> col:68 last 'const unsigned char *'
|-CXXConstructorDecl 0x55c810654d78 <line:49:5, col:34> col:21 used String 'void (bool)' inline
| `-ParmVarDecl 0x55c810654cb0 <col:28, col:33> col:33 x 'bool'
|-CXXConstructorDecl 0x55c810654ef8 <line:50:5, col:34> col:21 String 'void (char)' inline
| `-ParmVarDecl 0x55c810654e38 <col:28, col:33> col:33 c 'char'
|-CXXConstructorDecl 0x55c810655088 <line:51:5, col:43> col:21 String 'void (unsigned char)' inline
| `-ParmVarDecl 0x55c810654fc0 <col:28, col:42> col:42 c 'unsigned char'
|-CXXConstructorDecl 0x55c8106551e0 <line:52:5, col:26> col:14 String 'void (int)'
| `-ParmVarDecl 0x55c810655150 <col:21, col:25> col:25 x 'int'
|-CXXConstructorDecl 0x55c810655368 <line:53:5, col:31> col:14 String 'void (unsigned int)'
| `-ParmVarDecl 0x55c8106552a8 <col:21, col:30> col:30 x 'unsigned int'
|-CXXConstructorDecl 0x55c8106554c0 <line:54:5, col:27> col:14 String 'void (long)'
| `-ParmVarDecl 0x55c810655430 <col:21, col:26> col:26 x 'long'
|-CXXConstructorDecl 0x55c810655648 <line:55:5, col:36> col:14 String 'void (unsigned long)'
| `-ParmVarDecl 0x55c810655588 <col:21, col:35> col:35 x 'unsigned long'
|-CXXConstructorDecl 0x55c8106557d8 <line:57:5, col:32> col:14 String 'void (long long)'
| `-ParmVarDecl 0x55c810655710 <col:21, col:31> col:31 x 'long long'
|-CXXConstructorDecl 0x55c810655968 <line:58:5, col:41> col:14 String 'void (unsigned long long)'
| `-ParmVarDecl 0x55c8106558a0 <col:21, col:40> col:40 x 'unsigned long long'
|-CXXConstructorDecl 0x55c810655af8 <line:65:5, col:29> col:14 String 'void (double)'
| `-ParmVarDecl 0x55c810655a30 <col:21, col:28> col:28 x 'double'
|-CXXDestructorDecl 0x55c810655bf0 <line:67:5, col:20> col:12 used ~String 'void () noexcept' inline
|-CXXMethodDecl 0x55c810655d18 <line:69:5, col:44> col:33 make_empty 'const String &()' static inline
|-CXXMethodDecl 0x55c810655e98 <line:70:5, col:52> col:26 used make_uninitialized 'String (int)' static inline
| `-ParmVarDecl 0x55c810655dd0 <col:45, col:49> col:49 len 'int'
|-CXXMethodDecl 0x55c810655fe8 <line:71:5, col:74> col:26 make_garbage 'String (int)' static inline
| |-ParmVarDecl 0x55c810655f58 <col:39, col:43> col:43 len 'int'
| `-DeprecatedAttr 0x55c810656090 <col:63> "" ""
|-CXXMethodDecl 0x55c8106561d8 <line:72:5, col:54> col:26 make_stable 'String (const char *)' static inline
| `-ParmVarDecl 0x55c810656118 <col:38, col:50> col:50 cstr 'const char *'
|-CXXMethodDecl 0x55c8106563e8 <line:73:5, col:60> col:26 make_stable 'String (const char *, int)' static inline
| |-ParmVarDecl 0x55c810656298 <col:38, col:50> col:50 s 'const char *'
| `-ParmVarDecl 0x55c810656318 <col:53, col:57> col:57 len 'int'
|-CXXMethodDecl 0x55c810656608 <line:74:5, col:73> col:26 make_stable 'String (const char *, const char *)' static inline
| |-ParmVarDecl 0x55c8106564b0 <col:38, col:50> col:50 first 'const char *'
| `-ParmVarDecl 0x55c810656530 <col:57, col:69> col:69 last 'const char *'
|-CXXMethodDecl 0x55c8106568e8 <line:75:5, col:80> col:19 make_numeric 'String (String::intmax_t, int, bool)' static
| |-ParmVarDecl 0x55c8106566c8 <col:32, col:41> col:41 x 'String::intmax_t':'long'
| |-ParmVarDecl 0x55c810656748 <col:44, col:55> col:48 base 'int' cinit
| | `-IntegerLiteral 0x55c810661e60 <col:55> 'int' 10
| `-ParmVarDecl 0x55c8106567c0 <col:59, col:76> col:64 uppercase 'bool' cinit
|   `-CXXBoolLiteralExpr 0x55c810661e80 <col:76> 'bool' true
|-CXXMethodDecl 0x55c810656bc8 <line:76:5, col:81> col:19 make_numeric 'String (String::uintmax_t, int, bool)' static
| |-ParmVarDecl 0x55c8106569b0 <col:32, col:42> col:42 x 'String::uintmax_t':'unsigned long'
| |-ParmVarDecl 0x55c810656a30 <col:45, col:56> col:49 base 'int' cinit
| | `-IntegerLiteral 0x55c810661e90 <col:56> 'int' 10
| `-ParmVarDecl 0x55c810656aa8 <col:60, col:77> col:65 uppercase 'bool' cinit
|   `-CXXBoolLiteralExpr 0x55c810661eb0 <col:77> 'bool' true
|-CXXMethodDecl 0x55c810656cd0 <line:78:5, col:31> col:24 used data 'const char *() const' inline
|-CXXMethodDecl 0x55c810656d98 <line:79:5, col:25> col:16 used length 'int () const' inline
|-CXXMethodDecl 0x55c810656e60 <line:81:5, col:60> col:52 c_str 'const char *() const'
| |-NoInlineAttr 0x55c810656f00 <col:20>
| `-OptimizeNoneAttr 0x55c810656f58 <col:30>
|-CXXConversionDecl 0x55c810657048 <line:83:5, col:45> col:12 used operator int (String::*)() const 'String::unspecified_bool_type () const' inline
|-CXXMethodDecl 0x55c810657118 <line:84:5, col:25> col:17 used empty 'bool () const' inline
|-CXXMethodDecl 0x55c8106571d8 <line:85:5, col:29> col:17 operator! 'bool () const' inline
|-CXXMethodDecl 0x55c8106572c8 <line:87:5, col:35> col:27 used begin 'String::const_iterator () const' inline
|-CXXMethodDecl 0x55c810657388 <line:88:5, col:33> col:27 used end 'String::const_iterator () const' inline
|-CXXMethodDecl 0x55c810657508 <line:90:5, col:35> col:17 used operator[] 'char (int) const' inline
| `-ParmVarDecl 0x55c810657440 <col:28, col:32> col:32 i 'int'
|-CXXMethodDecl 0x55c810657658 <line:91:5, col:27> col:17 at 'char (int) const' inline
| `-ParmVarDecl 0x55c8106575c8 <col:20, col:24> col:24 i 'int'
|-CXXMethodDecl 0x55c810657748 <line:92:5, col:25> col:17 front 'char () const' inline
|-CXXMethodDecl 0x55c810657808 <line:93:5, col:24> col:17 back 'char () const' inline
|-CXXMethodDecl 0x55c810657a58 <line:95:5, col:64> col:21 used hashcode 'uint32_t (const char *, const char *)' static
| |-ParmVarDecl 0x55c8106578c0 <col:30, col:42> col:42 begin 'const char *'
| `-ParmVarDecl 0x55c810657940 <col:49, col:61> col:61 end 'const char *'
|-CXXMethodDecl 0x55c810657cb8 <line:96:5, line:97:33> line:96:28 hashcode 'uint32_t (const unsigned char *, const unsigned char *)' static inline
| |-ParmVarDecl 0x55c810657b20 <col:37, col:58> col:58 begin 'const unsigned char *'
| `-ParmVarDecl 0x55c810657ba0 <line:97:9, col:30> col:30 end 'const unsigned char *'
|-CXXMethodDecl 0x55c810657d88 <line:98:5, col:32> col:21 hashcode 'uint32_t () const' inline
|-CXXMethodDecl 0x55c810657f98 <line:100:5, col:65> col:19 substring 'String (const char *, const char *) const' inline
| |-ParmVarDecl 0x55c810657e40 <col:29, col:41> col:41 begin 'const char *'
| `-ParmVarDecl 0x55c810657ec0 <col:48, col:60> col:60 end 'const char *'
|-CXXMethodDecl 0x55c8106581b8 <line:101:5, col:40> col:12 used substring 'String (int, int) const'
| |-ParmVarDecl 0x55c810658060 <col:22, col:26> col:26 pos 'int'
| `-ParmVarDecl 0x55c8106580e0 <col:31, col:35> col:35 len 'int'
|-CXXMethodDecl 0x55c810658348 <line:102:5, col:38> col:19 substring 'String (int) const' inline
| `-ParmVarDecl 0x55c810658280 <col:29, col:33> col:33 pos 'int'
|-CXXMethodDecl 0x55c810658438 <line:103:5, col:25> col:12 trim_space 'String () const'
|-CXXMethodDecl 0x55c8106585a8 <line:105:5, col:41> col:17 equals 'bool (const String &) const' inline
| `-ParmVarDecl 0x55c8106584e8 <col:24, col:38> col:38 x 'const String &'
|-CXXMethodDecl 0x55c8106587b8 <line:106:5, col:48> col:17 used equals 'bool (const char *, int) const' inline
| |-ParmVarDecl 0x55c810658668 <col:24, col:36> col:36 s 'const char *'
| `-ParmVarDecl 0x55c8106586e8 <col:39, col:43> col:43 len 'int'
|-CXXMethodDecl 0x55c8106589d0 <line:107:5, col:63> col:23 used compare 'int (const String &, const String &)' static inline
| |-ParmVarDecl 0x55c810658878 <col:31, col:45> col:45 a 'const String &'
| `-ParmVarDecl 0x55c8106588f0 <col:48, col:62> col:62 b 'const String &'
|-CXXMethodDecl 0x55c810658b60 <line:108:5, col:41> col:16 used compare 'int (const String &) const' inline
| `-ParmVarDecl 0x55c810658a90 <col:24, col:38> col:38 x 'const String &'
|-CXXMethodDecl 0x55c810658d80 <line:109:5, col:41> col:9 used compare 'int (const char *, int) const'
| |-ParmVarDecl 0x55c810658c20 <col:17, col:29> col:29 s 'const char *'
| `-ParmVarDecl 0x55c810658ca0 <col:32, col:36> col:36 len 'int'
|-CXXMethodDecl 0x55c810658ed0 <line:110:5, col:46> col:17 starts_with 'bool (const String &) const' inline
| `-ParmVarDecl 0x55c810658e40 <col:29, col:43> col:43 x 'const String &'
|-CXXMethodDecl 0x55c8106590a8 <line:111:5, col:46> col:10 used starts_with 'bool (const char *, int) const'
| |-ParmVarDecl 0x55c810658f90 <col:22, col:34> col:34 s 'const char *'
| `-ParmVarDecl 0x55c810659010 <col:37, col:41> col:41 len 'int'
|-CXXMethodDecl 0x55c8106591f8 <line:112:5, col:44> col:10 glob_match 'bool (const String &) const'
| `-ParmVarDecl 0x55c810659168 <col:21, col:35> col:35 pattern 'const String &'
|-CXXMethodDecl 0x55c81065a440 <line:125:5, col:42> col:9 find_left 'int (char, int) const'
| |-ParmVarDecl 0x55c8106592b0 <col:19, col:24> col:24 c 'char'
| `-ParmVarDecl 0x55c81065a360 <col:27, col:39> col:31 start 'int' cinit
|   `-IntegerLiteral 0x55c810661ec0 <col:39> 'int' 0
|-CXXMethodDecl 0x55c81065a660 <line:126:5, col:51> col:9 find_left 'int (const String &, int) const'
| |-ParmVarDecl 0x55c81065a500 <col:19, col:33> col:33 x 'const String &'
| `-ParmVarDecl 0x55c81065a580 <col:36, col:48> col:40 start 'int' cinit
|   `-IntegerLiteral 0x55c810661ee0 <col:48> 'int' 0
|-CXXMethodDecl 0x55c81065a840 <line:127:5, col:52> col:9 find_right 'int (char, int) const'
| |-ParmVarDecl 0x55c81065a720 <col:20, col:25> col:25 c 'char'
| `-ParmVarDecl 0x55c81065a7a0 <col:28, col:40> col:32 start 'int' cinit
|   `-IntegerLiteral 0x55c810661f00 <col:40> 'int' 2147483647
|-CXXMethodDecl 0x55c81065a910 <line:129:5, col:20> col:12 lower 'String () const'
|-CXXMethodDecl 0x55c81065a9d0 <line:130:5, col:20> col:12 upper 'String () const'
|-CXXMethodDecl 0x55c81065aa90 <line:131:5, col:24> col:12 printable 'String () const'
|-CXXMethodDecl 0x55c81065ab50 <line:132:5, col:25> col:12 quoted_hex 'String () const'
|-CXXMethodDecl 0x55c81065ac10 <line:133:5, col:26> col:12 encode_json 'String () const'
|-CXXMethodDecl 0x55c81065adb8 <line:135:5, col:45> col:20 used operator= 'String &(const String &)' inline
| `-ParmVarDecl 0x55c81065acc0 <col:30, col:44> col:44 x 'const String &'
|-CXXMethodDecl 0x55c81065af38 <line:137:5, col:40> col:20 used operator= 'String &(String &&)' inline
| `-ParmVarDecl 0x55c81065ae70 <col:30, col:39> col:39 x 'String &&'
|-CXXMethodDecl 0x55c81065b0b8 <line:139:5, col:46> col:20 operator= 'String &(const char *)' inline
| `-ParmVarDecl 0x55c81065aff8 <col:30, col:42> col:42 cstr 'const char *'
|-CXXMethodDecl 0x55c81065b238 <line:141:5, col:31> col:17 swap 'void (String &)' inline
| `-ParmVarDecl 0x55c81065b170 <col:22, col:30> col:30 x 'String &'
|-CXXMethodDecl 0x55c81065b380 <line:143:5, col:39> col:17 append 'void (const String &)' inline
| `-ParmVarDecl 0x55c81065b2f0 <col:24, col:38> col:38 x 'const String &'
|-CXXMethodDecl 0x55c81065b4d0 <line:144:5, col:40> col:17 used append 'void (const char *)' inline
| `-ParmVarDecl 0x55c81065b440 <col:24, col:36> col:36 cstr 'const char *'
|-CXXMethodDecl 0x55c81065b6a8 <line:145:5, col:46> col:17 used append 'void (const char *, int)' inline
| |-ParmVarDecl 0x55c81065b590 <col:24, col:36> col:36 s 'const char *'
| `-ParmVarDecl 0x55c81065b610 <col:39, col:43> col:43 len 'int'
|-CXXMethodDecl 0x55c81065b888 <line:146:5, col:59> col:17 append 'void (const char *, const char *)' inline
| |-ParmVarDecl 0x55c81065b770 <col:24, col:36> col:36 first 'const char *'
| `-ParmVarDecl 0x55c81065b7f0 <col:43, col:55> col:55 last 'const char *'
|-CXXMethodDecl 0x55c81065b9d8 <line:147:5, col:30> col:17 append 'void (char)' inline
| `-ParmVarDecl 0x55c81065b948 <col:24, col:29> col:29 c 'char'
|-CXXMethodDecl 0x55c81065bbe8 <line:148:5, col:36> col:10 append_fill 'void (int, int)'
| |-ParmVarDecl 0x55c81065ba98 <col:22, col:26> col:26 c 'int'
| `-ParmVarDecl 0x55c81065bb18 <col:29, col:33> col:33 len 'int'
|-CXXMethodDecl 0x55c81065bd48 <line:149:5, col:39> col:11 used append_uninitialized 'char *(int)'
| `-ParmVarDecl 0x55c81065bcb0 <col:32, col:36> col:36 len 'int'
|-CXXMethodDecl 0x55c81065bea0 <line:150:5, col:68> col:18 append_garbage 'char *(int)' inline
| |-ParmVarDecl 0x55c81065be08 <col:33, col:37> col:37 len 'int'
| `-DeprecatedAttr 0x55c81065bf48 <col:57> "" ""
|-CXXMethodDecl 0x55c81065c058 <line:152:5, col:46> col:20 used operator+= 'String &(const String &)' inline
| `-ParmVarDecl 0x55c81065bfc8 <col:31, col:45> col:45 x 'const String &'
|-CXXMethodDecl 0x55c81065c1a8 <line:153:5, col:47> col:20 operator+= 'String &(const char *)' inline
| `-ParmVarDecl 0x55c81065c118 <col:31, col:43> col:43 cstr 'const char *'
|-CXXMethodDecl 0x55c81065c328 <line:154:5, col:37> col:20 operator+= 'String &(char)' inline
| `-ParmVarDecl 0x55c81065c260 <col:31, col:36> col:36 c 'char'
|-CXXMethodDecl 0x55c81065c3f0 <line:160:5, col:29> col:17 is_shared 'bool () const' inline
|-CXXMethodDecl 0x55c81065c4b0 <line:161:5, col:29> col:17 is_stable 'bool () const' inline
|-CXXMethodDecl 0x55c81065c570 <line:163:5, col:60> col:19 unique 'String () const' inline
| `-DeprecatedAttr 0x55c81065c610 <col:49> "" ""
|-CXXMethodDecl 0x55c81065c6a0 <line:164:5, col:30> col:19 used unshared 'String () const' inline
|-CXXMethodDecl 0x55c81065c760 <line:165:5, col:29> col:19 compact 'String () const' inline
|-CXXMethodDecl 0x55c81065c850 <line:167:5, col:24> col:11 mutable_data 'char *()'
|-CXXMethodDecl 0x55c81065c918 <line:168:5, col:25> col:11 mutable_c_str 'char *()'
|-CXXMethodDecl 0x55c81065c9d8 <line:170:5, col:52> col:33 make_out_of_memory 'const String &()' static inline
|-CXXMethodDecl 0x55c81065ca98 <line:171:5, col:33> col:17 out_of_memory 'bool () const' inline
|-CXXMethodDecl 0x55c81065cb90 <line:172:5, col:50> col:31 out_of_memory_data 'const char *()' static inline
|-CXXMethodDecl 0x55c81065cc58 <line:173:5, col:44> col:23 out_of_memory_length 'int ()' static inline
|-CXXMethodDecl 0x55c81065cd20 <line:174:5, col:42> col:31 used empty_data 'const char *()' static inline
|-CXXMethodDecl 0x55c81065cef8 <line:180:5, col:81> col:31 skip_utf8_char 'const char *(const char *, const char *)' static inline
| |-ParmVarDecl 0x55c81065cdd8 <col:46, col:58> col:58 first 'const char *'
| `-ParmVarDecl 0x55c81065ce58 <col:65, col:77> col:77 last 'const char *'
|-CXXMethodDecl 0x55c81065d120 <line:181:5, line:182:38> line:181:33 used skip_utf8_char 'const unsigned char *(const unsigned char *, const unsigned char *)' static
| |-ParmVarDecl 0x55c81065cfc0 <col:48, col:69> col:69 first 'const unsigned char *'
| `-ParmVarDecl 0x55c81065d040 <line:182:13, col:34> col:34 last 'const unsigned char *'
|-VarDecl 0x55c81065d230 <line:184:5, col:35> col:23 used bool_data 'const char [11]' static
|-AccessSpecDecl 0x55c81065d298 <line:186:3, col:10> col:3 private
|-CXXRecordDecl 0x55c81065d2c0 <line:189:5, line:198:5> line:189:12 referenced struct memo_t definition
| |-DefinitionData pass_in_registers aggregate standard_layout trivially_copyable pod trivial
| | |-DefaultConstructor exists trivial needs_implicit
| | |-CopyConstructor simple trivial has_const_param needs_implicit implicit_has_const_param
| | |-MoveConstructor exists simple trivial needs_implicit
| | |-CopyAssignment trivial has_const_param needs_implicit implicit_has_const_param
| | |-MoveAssignment exists simple trivial needs_implicit
| | `-Destructor simple irrelevant trivial needs_implicit
| |-CXXRecordDecl 0x55c81065d3d8 <col:5, col:12> col:12 implicit struct memo_t
| |-FieldDecl 0x55c81065d478 <line:190:2, col:20> col:20 referenced refcount 'volatile uint32_t':'volatile unsigned int'
| |-FieldDecl 0x55c81065d4d8 <line:191:2, col:11> col:11 referenced capacity 'uint32_t':'unsigned int'
| |-FieldDecl 0x55c81065d538 <line:192:2, col:20> col:20 dirty 'volatile uint32_t':'volatile unsigned int'
| `-FieldDecl 0x55c81065d5e8 <line:197:2, col:18> col:7 real_data 'char [8]'
|-EnumDecl 0x55c81065d650 <line:200:5, line:202:5> line:200:5
| `-EnumConstantDecl 0x55c81065d888 <line:201:2, col:32> col:2 referenced MEMO_SPACE 'String::(anonymous enum at ../dummy_inc/click/string.hh:200:5)'
|   `-ImplicitCastExpr 0x55c81065d8d8 <col:15, col:32> 'unsigned int' <IntegralCast>
|     `-ConstantExpr 0x55c81065d868 <col:15, col:32> 'unsigned long' Int: 12
|       `-BinaryOperator 0x55c81065d778 <col:15, col:32> 'unsigned long' '-'
|         |-UnaryExprOrTypeTraitExpr 0x55c81065d720 <col:15, col:28> 'unsigned long' sizeof 'String::memo_t'
|         `-ImplicitCastExpr 0x55c81065d760 <col:32> 'unsigned long' <IntegralCast>
|           `-IntegerLiteral 0x55c81065d740 <col:32> 'int' 8
|-CXXRecordDecl 0x55c81065d8f0 <line:204:5, line:208:5> line:204:12 referenced struct rep_t definition
| |-DefinitionData pass_in_registers aggregate standard_layout trivially_copyable pod trivial literal
| | |-DefaultConstructor exists trivial
| | |-CopyConstructor simple trivial has_const_param implicit_has_const_param
| | |-MoveConstructor exists simple trivial
| | |-CopyAssignment trivial has_const_param implicit_has_const_param
| | |-MoveAssignment exists simple trivial
| | `-Destructor simple irrelevant trivial
| |-CXXRecordDecl 0x55c81065da08 <col:5, col:12> col:12 implicit struct rep_t
| |-FieldDecl 0x55c81065dab0 <line:205:2, col:14> col:14 referenced data 'const char *'
| |-FieldDecl 0x55c81065db18 <line:206:2, col:6> col:6 referenced length 'int'
| |-FieldDecl 0x55c81065dba8 <line:207:2, col:10> col:10 referenced memo 'String::memo_t *'
| |-CXXConstructorDecl 0x55c810662390 <line:204:12> col:12 implicit used rep_t 'void () noexcept' inline default trivial
| | `-CompoundStmt 0x55c8106627c8 <col:12>
| |-CXXConstructorDecl 0x55c810662498 <col:12> col:12 implicit used constexpr rep_t 'void (const String::rep_t &) noexcept' inline default trivial
| | |-ParmVarDecl 0x55c8106625a8 <col:12> col:12 used 'const String::rep_t &'
| | |-CXXCtorInitializer Field 0x55c81065dab0 'data' 'const char *'
| | | `-ImplicitCastExpr 0x55c810665c10 <col:12> 'const char *' <LValueToRValue>
| | |   `-MemberExpr 0x55c810665be0 <col:12> 'const char *const' lvalue .data 0x55c81065dab0
| | |     `-DeclRefExpr 0x55c810665bc0 <col:12> 'const String::rep_t' lvalue ParmVar 0x55c8106625a8 '' 'const String::rep_t &'
| | |-CXXCtorInitializer Field 0x55c81065db18 'length' 'int'
| | | `-ImplicitCastExpr 0x55c810665ca0 <col:12> 'int' <LValueToRValue>
| | |   `-MemberExpr 0x55c810665c70 <col:12> 'const int' lvalue .length 0x55c81065db18
| | |     `-DeclRefExpr 0x55c810665c50 <col:12> 'const String::rep_t' lvalue ParmVar 0x55c8106625a8 '' 'const String::rep_t &'
| | |-CXXCtorInitializer Field 0x55c81065dba8 'memo' 'String::memo_t *'
| | | `-ImplicitCastExpr 0x55c810665d30 <col:12> 'String::memo_t *' <LValueToRValue>
| | |   `-MemberExpr 0x55c810665d00 <col:12> 'String::memo_t *const' lvalue .memo 0x55c81065dba8
| | |     `-DeclRefExpr 0x55c810665ce0 <col:12> 'const String::rep_t' lvalue ParmVar 0x55c8106625a8 '' 'const String::rep_t &'
| | `-CompoundStmt 0x55c810665d88 <col:12>
| |-CXXConstructorDecl 0x55c810662648 <col:12> col:12 implicit constexpr rep_t 'void (String::rep_t &&)' inline default trivial noexcept-unevaluated 0x55c810662648
| | `-ParmVarDecl 0x55c810662758 <col:12> col:12 'String::rep_t &&'
| |-CXXDestructorDecl 0x55c810668ab0 <col:12> col:12 implicit ~rep_t 'void () noexcept' inline default trivial
| |-CXXMethodDecl 0x55c810672138 <col:12> col:12 implicit used constexpr operator= 'String::rep_t &(const String::rep_t &) noexcept' inline default trivial
| | |-ParmVarDecl 0x55c810672248 <col:12> col:12 used 'const String::rep_t &'
| | `-CompoundStmt 0x55c810672760 <col:12>
| |   |-BinaryOperator 0x55c810672578 <col:12> 'const char *' lvalue '='
| |   | |-MemberExpr 0x55c810672530 <col:12> 'const char *' lvalue ->data 0x55c81065dab0
| |   | | `-CXXThisExpr 0x55c810672520 <col:12> 'String::rep_t *' this
| |   | `-ImplicitCastExpr 0x55c810672560 <col:12> 'const char *' <LValueToRValue>
| |   |   `-MemberExpr 0x55c8106724f0 <col:12> 'const char *const' lvalue .data 0x55c81065dab0
| |   |     `-DeclRefExpr 0x55c8106724d0 <col:12> 'const String::rep_t' lvalue ParmVar 0x55c810672248 '' 'const String::rep_t &'
| |   |-BinaryOperator 0x55c810672640 <col:12> 'int' lvalue '='
| |   | |-MemberExpr 0x55c8106725f8 <col:12> 'int' lvalue ->length 0x55c81065db18
| |   | | `-CXXThisExpr 0x55c8106725e8 <col:12> 'String::rep_t *' this
| |   | `-ImplicitCastExpr 0x55c810672628 <col:12> 'int' <LValueToRValue>
| |   |   `-MemberExpr 0x55c8106725b8 <col:12> 'const int' lvalue .length 0x55c81065db18
| |   |     `-DeclRefExpr 0x55c810672598 <col:12> 'const String::rep_t' lvalue ParmVar 0x55c810672248 '' 'const String::rep_t &'
| |   |-BinaryOperator 0x55c810672708 <col:12> 'String::memo_t *' lvalue '='
| |   | |-MemberExpr 0x55c8106726c0 <col:12> 'String::memo_t *' lvalue ->memo 0x55c81065dba8
| |   | | `-CXXThisExpr 0x55c8106726b0 <col:12> 'String::rep_t *' this
| |   | `-ImplicitCastExpr 0x55c8106726f0 <col:12> 'String::memo_t *' <LValueToRValue>
| |   |   `-MemberExpr 0x55c810672680 <col:12> 'String::memo_t *const' lvalue .memo 0x55c81065dba8
| |   |     `-DeclRefExpr 0x55c810672660 <col:12> 'const String::rep_t' lvalue ParmVar 0x55c810672248 '' 'const String::rep_t &'
| |   `-ReturnStmt 0x55c810672750 <col:12>
| |     `-UnaryOperator 0x55c810672738 <col:12> 'String::rep_t' lvalue prefix '*' cannot overflow
| |       `-CXXThisExpr 0x55c810672728 <col:12> 'String::rep_t *' this
| `-CXXMethodDecl 0x55c8106722b8 <col:12> col:12 implicit constexpr operator= 'String::rep_t &(String::rep_t &&)' inline default trivial noexcept-unevaluated 0x55c8106722b8
|   `-ParmVarDecl 0x55c8106723c8 <col:12> col:12 'String::rep_t &&'
|-FieldDecl 0x55c81065dc20 <line:211:5, col:19> col:19 referenced _r 'String::rep_t' mutable
|-CXXMethodDecl 0x55c81065de68 <line:256:5, line:261:5> line:256:17 used assign_memo 'void (const char *, int, String::memo_t *) const' inline
| |-ParmVarDecl 0x55c81065dc88 <col:29, col:41> col:41 used data 'const char *'
| |-ParmVarDecl 0x55c81065dd08 <col:47, col:51> col:51 used length 'int'
| |-ParmVarDecl 0x55c81065dd80 <col:59, col:67> col:67 used memo 'String::memo_t *'
| `-CompoundStmt 0x55c810662350 <col:79, line:261:5>
|   |-BinaryOperator 0x55c810661fc8 <line:257:2, col:12> 'const char *' lvalue '='
|   | |-MemberExpr 0x55c810661f60 <col:2, col:5> 'const char *' lvalue .data 0x55c81065dab0
|   | | `-MemberExpr 0x55c810661f30 <col:2> 'String::rep_t' lvalue ->_r 0x55c81065dc20
|   | |   `-CXXThisExpr 0x55c810661f20 <col:2> 'const String *' implicit this
|   | `-ImplicitCastExpr 0x55c810661fb0 <col:12> 'const char *' <LValueToRValue>
|   |   `-DeclRefExpr 0x55c810661f90 <col:12> 'const char *' lvalue ParmVar 0x55c81065dc88 'data' 'const char *'
|   |-BinaryOperator 0x55c810662090 <line:258:2, col:14> 'int' lvalue '='
|   | |-MemberExpr 0x55c810662028 <col:2, col:5> 'int' lvalue .length 0x55c81065db18
|   | | `-MemberExpr 0x55c810661ff8 <col:2> 'String::rep_t' lvalue ->_r 0x55c81065dc20
|   | |   `-CXXThisExpr 0x55c810661fe8 <col:2> 'const String *' implicit this
|   | `-ImplicitCastExpr 0x55c810662078 <col:14> 'int' <LValueToRValue>
|   |   `-DeclRefExpr 0x55c810662058 <col:14> 'int' lvalue ParmVar 0x55c81065dd08 'length' 'int'
|   `-IfStmt 0x55c810662338 <line:259:2, line:260:41>
|     |-ImplicitCastExpr 0x55c8106621b0 <line:259:6, col:21> 'bool' <PointerToBoolean>
|     | `-ImplicitCastExpr 0x55c810662198 <col:6, col:21> 'String::memo_t *' <LValueToRValue>
|     |   `-ParenExpr 0x55c810662178 <col:6, col:21> 'String::memo_t *' lvalue
|     |     `-BinaryOperator 0x55c810662158 <col:7, col:17> 'String::memo_t *' lvalue '='
|     |       |-MemberExpr 0x55c8106620f0 <col:7, col:10> 'String::memo_t *' lvalue .memo 0x55c81065dba8
|     |       | `-MemberExpr 0x55c8106620c0 <col:7> 'String::rep_t' lvalue ->_r 0x55c81065dc20
|     |       |   `-CXXThisExpr 0x55c8106620b0 <col:7> 'const String *' implicit this
|     |       `-ImplicitCastExpr 0x55c810662140 <col:17> 'String::memo_t *' <LValueToRValue>
|     |         `-DeclRefExpr 0x55c810662120 <col:17> 'String::memo_t *' lvalue ParmVar 0x55c81065dd80 'memo' 'String::memo_t *'
|     `-CallExpr 0x55c810662310 <line:260:6, col:41> 'void'
|       |-ImplicitCastExpr 0x55c8106622f8 <col:6, col:23> 'void (*)(volatile uint32_t &)' <FunctionToPointerDecay>
|       | `-DeclRefExpr 0x55c810662200 <col:6, col:23> 'void (volatile uint32_t &)' lvalue CXXMethod 0x55c8105e1b88 'inc' 'void (volatile uint32_t &)'
|       `-MemberExpr 0x55c810662268 <col:27, col:33> 'volatile uint32_t':'volatile unsigned int' lvalue ->refcount 0x55c81065d478
|         `-ImplicitCastExpr 0x55c810662250 <col:27> 'String::memo_t *' <LValueToRValue>
|           `-DeclRefExpr 0x55c810662230 <col:27> 'String::memo_t *' lvalue ParmVar 0x55c81065dd80 'memo' 'String::memo_t *'
|-CXXConstructorDecl 0x55c81065e118 <line:263:5, line:265:5> line:263:12 used String 'void (const char *, int, String::memo_t *)' inline
| |-ParmVarDecl 0x55c81065df38 <col:19, col:31> col:31 used data 'const char *'
| |-ParmVarDecl 0x55c81065dfb8 <col:37, col:41> col:41 used length 'int'
| |-ParmVarDecl 0x55c81065e030 <col:49, col:57> col:57 used memo 'String::memo_t *'
| |-CXXCtorInitializer Field 0x55c81065dc20 '_r' 'String::rep_t'
| | `-CXXConstructExpr 0x55c8106627d8 <col:12> 'String::rep_t' 'void () noexcept'
| `-CompoundStmt 0x55c810662968 <col:63, line:265:5>
|   `-CXXMemberCallExpr 0x55c8106628d0 <line:264:2, col:32> 'void'
|     |-MemberExpr 0x55c810662840 <col:2> '<bound member function type>' ->assign_memo 0x55c81065de68
|     | `-ImplicitCastExpr 0x55c810662908 <col:2> 'const String *' <NoOp>
|     |   `-CXXThisExpr 0x55c810662830 <col:2> 'String *' implicit this
|     |-ImplicitCastExpr 0x55c810662920 <col:14> 'const char *' <LValueToRValue>
|     | `-DeclRefExpr 0x55c810662870 <col:14> 'const char *' lvalue ParmVar 0x55c81065df38 'data' 'const char *'
|     |-ImplicitCastExpr 0x55c810662938 <col:20> 'int' <LValueToRValue>
|     | `-DeclRefExpr 0x55c810662890 <col:20> 'int' lvalue ParmVar 0x55c81065dfb8 'length' 'int'
|     `-ImplicitCastExpr 0x55c810662950 <col:28> 'String::memo_t *' <LValueToRValue>
|       `-DeclRefExpr 0x55c8106628b0 <col:28> 'String::memo_t *' lvalue ParmVar 0x55c81065e030 'memo' 'String::memo_t *'
|-CXXMethodDecl 0x55c81065e2a8 <line:267:5, line:269:5> line:267:17 used assign 'void (const String &) const' inline
| |-ParmVarDecl 0x55c81065e1e8 <col:24, col:38> col:38 used x 'const String &'
| `-CompoundStmt 0x55c810662bc0 <col:47, line:269:5>
|   `-CXXMemberCallExpr 0x55c810662b40 <line:268:2, col:47> 'void'
|     |-MemberExpr 0x55c810662990 <col:2> '<bound member function type>' ->assign_memo 0x55c81065de68
|     | `-CXXThisExpr 0x55c810662980 <col:2> 'const String *' implicit this
|     |-ImplicitCastExpr 0x55c810662b78 <col:14, col:19> 'const char *' <LValueToRValue>
|     | `-MemberExpr 0x55c810662a10 <col:14, col:19> 'const char *' lvalue .data 0x55c81065dab0
|     |   `-MemberExpr 0x55c8106629e0 <col:14, col:16> 'String::rep_t' lvalue ._r 0x55c81065dc20
|     |     `-DeclRefExpr 0x55c8106629c0 <col:14> 'const String' lvalue ParmVar 0x55c81065e1e8 'x' 'const String &'
|     |-ImplicitCastExpr 0x55c810662b90 <col:25, col:30> 'int' <LValueToRValue>
|     | `-MemberExpr 0x55c810662a90 <col:25, col:30> 'int' lvalue .length 0x55c81065db18
|     |   `-MemberExpr 0x55c810662a60 <col:25, col:27> 'String::rep_t' lvalue ._r 0x55c81065dc20
|     |     `-DeclRefExpr 0x55c810662a40 <col:25> 'const String' lvalue ParmVar 0x55c81065e1e8 'x' 'const String &'
|     `-ImplicitCastExpr 0x55c810662ba8 <col:38, col:43> 'String::memo_t *' <LValueToRValue>
|       `-MemberExpr 0x55c810662b10 <col:38, col:43> 'String::memo_t *' lvalue .memo 0x55c81065dba8
|         `-MemberExpr 0x55c810662ae0 <col:38, col:40> 'String::rep_t' lvalue ._r 0x55c81065dc20
|           `-DeclRefExpr 0x55c810662ac0 <col:38> 'const String' lvalue ParmVar 0x55c81065e1e8 'x' 'const String &'
|-CXXMethodDecl 0x55c8106605c0 <line:271:5, line:278:5> line:271:17 used deref 'void () const' inline
| `-CompoundStmt 0x55c810663580 <col:31, line:278:5>
|   `-IfStmt 0x55c810663568 <line:272:2, line:277:2>
|     |-ImplicitCastExpr 0x55c810662c60 <line:272:6, col:9> 'bool' <PointerToBoolean>
|     | `-ImplicitCastExpr 0x55c810662c48 <col:6, col:9> 'String::memo_t *' <LValueToRValue>
|     |   `-MemberExpr 0x55c810662c18 <col:6, col:9> 'String::memo_t *' lvalue .memo 0x55c81065dba8
|     |     `-MemberExpr 0x55c810662be8 <col:6> 'String::rep_t' lvalue ->_r 0x55c81065dc20
|     |       `-CXXThisExpr 0x55c810662bd8 <col:6> 'const String *' implicit this
|     `-CompoundStmt 0x55c810663540 <col:15, line:277:2>
|       |-ParenExpr 0x55c810663110 <line:273:6, col:166> 'void'
|       | `-ConditionalOperator 0x55c8106630e0 <col:7, col:165> 'void'
|       |   |-CXXStaticCastExpr 0x55c810662d70 <col:7, col:44> 'bool' static_cast<_Bool> <NoOp>
|       |   | `-ImplicitCastExpr 0x55c810662d58 <col:27, col:36> 'bool' <IntegralToBoolean> part_of_explicit_cast
|       |   |   `-ImplicitCastExpr 0x55c810662d40 <col:27, col:36> 'uint32_t':'unsigned int' <LValueToRValue> part_of_explicit_cast
|       |   |     `-MemberExpr 0x55c810662d00 <col:27, col:36> 'volatile uint32_t':'volatile unsigned int' lvalue ->refcount 0x55c81065d478
|       |   |       `-ImplicitCastExpr 0x55c810662ce8 <col:27, col:30> 'String::memo_t *' <LValueToRValue>
|       |   |         `-MemberExpr 0x55c810662cb8 <col:27, col:30> 'String::memo_t *' lvalue .memo 0x55c81065dba8
|       |   |           `-MemberExpr 0x55c810662c88 <col:27> 'String::rep_t' lvalue ->_r 0x55c81065dc20
|       |   |             `-CXXThisExpr 0x55c810662c78 <col:27> 'const String *' implicit this
|       |   |-CXXFunctionalCastExpr 0x55c810662dd0 <col:48, col:55> 'void' functional cast to void <ToVoid>
|       |   | `-IntegerLiteral 0x55c810662db0 <col:54> 'int' 0
|       |   `-CallExpr 0x55c810663040 <col:59, col:165> 'void'
|       |     |-ImplicitCastExpr 0x55c810663028 <col:59> 'void (*)(const char *, const char *, unsigned int, const char *) __attribute__((noreturn)) throw()' <FunctionToPointerDecay>
|       |     | `-DeclRefExpr 0x55c810662fa8 <col:59> 'void (const char *, const char *, unsigned int, const char *) __attribute__((noreturn)) throw()' lvalue Function 0x55c8103ba6e0 '__assert_fail' 'void (const char *, const char *, unsigned int, const char *) __attribute__((noreturn)) throw()'
|       |     |-ImplicitCastExpr 0x55c810663080 <col:74> 'const char *' <ArrayToPointerDecay>
|       |     | `-StringLiteral 0x55c810662eb8 <col:74> 'const char [18]' lvalue "_r.memo->refcount"
|       |     |-ImplicitCastExpr 0x55c810663098 <col:95> 'const char *' <ArrayToPointerDecay>
|       |     | `-StringLiteral 0x55c810662ee8 <col:95> 'const char [29]' lvalue "../dummy_inc/click/string.hh"
|       |     |-ImplicitCastExpr 0x55c8106630b0 <col:127> 'unsigned int' <IntegralCast>
|       |     | `-IntegerLiteral 0x55c810662f20 <col:127> 'int' 273
|       |     `-ImplicitCastExpr 0x55c8106630c8 <col:132, col:146> 'const char *' <ArrayToPointerDecay>
|       |       `-UnaryOperator 0x55c810662f90 <col:132, col:146> 'const char [27]' lvalue prefix '__extension__' cannot overflow
|       |         `-PredefinedExpr 0x55c810662f78 <col:146> 'const char [27]' lvalue __PRETTY_FUNCTION__
|       |           `-StringLiteral 0x55c810662f40 <col:146> 'const char [27]' lvalue "void String::deref() const"
|       |-IfStmt 0x55c810663460 <line:274:6, line:275:22>
|       | |-CallExpr 0x55c810663320 <line:274:10, col:57> 'bool'
|       | | |-ImplicitCastExpr 0x55c810663308 <col:10, col:27> 'bool (*)(volatile uint32_t &)' <FunctionToPointerDecay>
|       | | | `-DeclRefExpr 0x55c810663280 <col:10, col:27> 'bool (volatile uint32_t &)' lvalue CXXMethod 0x55c8105e4370 'dec_and_test' 'bool (volatile uint32_t &)'
|       | | `-MemberExpr 0x55c810663250 <col:40, col:49> 'volatile uint32_t':'volatile unsigned int' lvalue ->refcount 0x55c81065d478
|       | |   `-ImplicitCastExpr 0x55c810663238 <col:40, col:43> 'String::memo_t *' <LValueToRValue>
|       | |     `-MemberExpr 0x55c810663208 <col:40, col:43> 'String::memo_t *' lvalue .memo 0x55c81065dba8
|       | |       `-MemberExpr 0x55c8106631d8 <col:40> 'String::rep_t' lvalue ->_r 0x55c81065dc20
|       | |         `-CXXThisExpr 0x55c8106631c8 <col:40> 'const String *' implicit this
|       | `-CallExpr 0x55c810663420 <line:275:3, col:22> 'void'
|       |   |-ImplicitCastExpr 0x55c810663408 <col:3> 'void (*)(String::memo_t *)' <FunctionToPointerDecay>
|       |   | `-DeclRefExpr 0x55c810663348 <col:3> 'void (String::memo_t *)' lvalue CXXMethod 0x55c810661298 'delete_memo' 'void (String::memo_t *)'
|       |   `-ImplicitCastExpr 0x55c810663448 <col:15, col:18> 'String::memo_t *' <LValueToRValue>
|       |     `-MemberExpr 0x55c8106633a8 <col:15, col:18> 'String::memo_t *' lvalue .memo 0x55c81065dba8
|       |       `-MemberExpr 0x55c810663378 <col:15> 'String::rep_t' lvalue ->_r 0x55c81065dc20
|       |         `-CXXThisExpr 0x55c810663368 <col:15> 'const String *' implicit this
|       `-BinaryOperator 0x55c810663520 <line:276:6, col:16> 'String::memo_t *' lvalue '='
|         |-MemberExpr 0x55c8106634b8 <col:6, col:9> 'String::memo_t *' lvalue .memo 0x55c81065dba8
|         | `-MemberExpr 0x55c810663488 <col:6> 'String::rep_t' lvalue ->_r 0x55c81065dc20
|         |   `-CXXThisExpr 0x55c810663478 <col:6> 'const String *' implicit this
|         `-ImplicitCastExpr 0x55c810663508 <col:16> 'String::memo_t *' <NullToPointer>
|           `-IntegerLiteral 0x55c8106634e8 <col:16> 'int' 0
|-CXXMethodDecl 0x55c810660858 <line:280:5, col:56> col:10 used assign 'void (const char *, int, bool)'
| |-ParmVarDecl 0x55c810660678 <col:17, col:29> col:29 s 'const char *'
| |-ParmVarDecl 0x55c8106606f8 <col:32, col:36> col:36 len 'int'
| `-ParmVarDecl 0x55c810660770 <col:41, col:46> col:46 need_deref 'bool'
|-CXXMethodDecl 0x55c810660930 <line:281:5, col:31> col:10 assign_out_of_memory 'void ()'
|-CXXMethodDecl 0x55c810660b80 <line:282:5, col:53> col:10 used append 'void (const char *, int, String::memo_t *)'
| |-ParmVarDecl 0x55c8106609e8 <col:17, col:29> col:29 s 'const char *'
| |-ParmVarDecl 0x55c810660a68 <col:32, col:36> col:36 len 'int'
| `-ParmVarDecl 0x55c810660ae0 <col:41, col:49> col:49 memo 'String::memo_t *'
|-CXXMethodDecl 0x55c810660d68 <line:283:5, col:58> col:19 used hard_make_stable 'String (const char *, int)' static
| |-ParmVarDecl 0x55c810660c50 <col:36, col:48> col:48 s 'const char *'
| `-ParmVarDecl 0x55c810660cd0 <col:51, col:55> col:55 len 'int'
|-CXXMethodDecl 0x55c810660e68 <line:284:5, line:286:5> line:284:27 used absent_memo 'String::memo_t *()' static inline
| `-CompoundStmt 0x55c810663658 <col:41, line:286:5>
|   `-ReturnStmt 0x55c810663648 <line:285:2, col:48>
|     `-CXXReinterpretCastExpr 0x55c810663618 <col:9, col:48> 'String::memo_t *' reinterpret_cast<struct String::memo_t *> <IntegralToPointer>
|       `-CXXFunctionalCastExpr 0x55c8106635e0 <col:36, col:47> 'uintptr_t':'unsigned long' functional cast to uintptr_t <NoOp>
|         `-ImplicitCastExpr 0x55c8106635c8 <col:46> 'uintptr_t':'unsigned long' <IntegralCast> part_of_explicit_cast
|           `-IntegerLiteral 0x55c8106635a8 <col:46> 'int' 1
|-CXXMethodDecl 0x55c810661108 <line:287:5, col:68> col:20 create_memo 'String::memo_t *(char *, int, int)' static
| |-ParmVarDecl 0x55c810660f20 <col:32, col:38> col:38 space 'char *'
| |-ParmVarDecl 0x55c810660fa0 <col:45, col:49> col:49 dirty 'int'
| `-ParmVarDecl 0x55c810661020 <col:56, col:60> col:60 capacity 'int'
|-CXXMethodDecl 0x55c810661298 <line:288:5, col:41> col:17 used delete_memo 'void (String::memo_t *)' static
| `-ParmVarDecl 0x55c8106611d0 <col:29, col:37> col:37 memo 'String::memo_t *'
|-CXXMethodDecl 0x55c810661368 <line:289:5, col:30> col:17 hard_c_str 'const char *() const'
|-CXXMethodDecl 0x55c810661538 <line:290:5, col:46> col:10 used hard_equals 'bool (const char *, int) const'
| |-ParmVarDecl 0x55c810661420 <col:22, col:34> col:34 s 'const char *'
| `-ParmVarDecl 0x55c8106614a0 <col:37, col:41> col:41 len 'int'
|-VarDecl 0x55c8106615f8 <line:292:5, col:23> col:23 used null_data 'const char' static
|-VarDecl 0x55c8106616c0 <line:293:5, col:34> col:23 used oom_data 'const char [15]' static
|-VarDecl 0x55c8106617c8 <line:294:5, col:34> col:23 int_data 'const char [20]' static
|-VarDecl 0x55c810661840 <line:295:5, col:24> col:24 used null_string_rep 'const String::rep_t' static
|-VarDecl 0x55c8106618b8 <line:296:5, col:24> col:24 used oom_string_rep 'const String::rep_t' static
|-EnumDecl 0x55c810661920 <line:297:5, col:25> col:5
| `-EnumConstantDecl 0x55c810661a20 <col:12, col:22> col:12 referenced oom_len 'String::(anonymous enum at ../dummy_inc/click/string.hh:297:5)'
|   `-ImplicitCastExpr 0x55c810661a70 <col:22> 'unsigned int' <IntegralCast>
|     `-ConstantExpr 0x55c810661a00 <col:22> 'int' Int: 14
|       `-IntegerLiteral 0x55c8106619e0 <col:22> 'int' 14
|-CXXMethodDecl 0x55c810661c88 <line:299:5, col:46> col:19 make_claim 'String (char *, int, int)' static
| |-ParmVarDecl 0x55c810661aa0 <col:30, col:35> col:36 'char *'
| |-ParmVarDecl 0x55c810661b20 <col:38> col:41 'int'
| `-ParmVarDecl 0x55c810661ba0 <col:43> col:46 'int'
|-FriendDecl 0x55c810661d90 <line:301:5, col:19> col:12 'struct rep_t':'String::rep_t'
`-FriendDecl 0x55c810661e20 <line:302:5, col:18> col:12 'class StringAccum':'StringAccum'

Layout: <CGRecordLayout
  LLVMType:%class.String = type { %"struct.String::rep_t" }
  NonVirtualBaseLLVMType:%class.String = type { %"struct.String::rep_t" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x55c8109d2ac0 <../dummy_inc/click/vector.hh:11:1, line:71:1> line:11:30 class vector_memory definition
|-DefinitionData standard_layout has_user_declared_ctor can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor simple trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveConstructor
| |-CopyAssignment trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveAssignment
| `-Destructor non_trivial user_declared
|-TemplateArgument type 'typed_array_memory<String>'
|-CXXRecordDecl 0x55c8109d2c98 prev 0x55c8109d2ac0 <col:24, col:30> col:30 implicit class vector_memory
|-AccessSpecDecl 0x55c8109d2d28 <col:46, col:52> col:46 public
|-TypedefDecl 0x55c8109d2d50 <line:12:5, col:17> col:17 size_type 'int'
| `-BuiltinType 0x55c810317580 'int'
|-TypedefDecl 0x55c8109d46b0 <line:13:5, col:31> col:31 type 'typename typed_array_memory<String>::type':'String'
| `-ElaboratedType 0x55c8109d4660 'typename typed_array_memory<String>::type' sugar
|   `-TypedefType 0x55c8109d4640 'typed_array_memory<String>::type' sugar
|     |-Typedef 0x55c8109d2f68 'type'
|     `-SubstTemplateTypeParmType 0x55c8109d2f30 'String' sugar
|       |-TemplateTypeParmType 0x55c810623c80 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55c810623c30 'T'
|       `-RecordType 0x55c8106538c0 'String'
|         `-CXXRecord 0x55c810653830 'String'
|-TypedefDecl 0x55c8109d4768 <line:14:5, col:19> col:19 iterator 'vector_memory<typed_array_memory<String> >::type *'
| `-PointerType 0x55c8109d4730 'vector_memory<typed_array_memory<String> >::type *'
|   `-TypedefType 0x55c8109d4710 'vector_memory<typed_array_memory<String> >::type' sugar
|     |-Typedef 0x55c8109d46b0 'type'
|     `-ElaboratedType 0x55c8109d4660 'typename typed_array_memory<String>::type' sugar
|       `-TypedefType 0x55c8109d4640 'typed_array_memory<String>::type' sugar
|         |-Typedef 0x55c8109d2f68 'type'
|         `-SubstTemplateTypeParmType 0x55c8109d2f30 'String' sugar
|           |-TemplateTypeParmType 0x55c810623c80 'T' dependent depth 0 index 0
|           | `-TemplateTypeParm 0x55c810623c30 'T'
|           `-RecordType 0x55c8106538c0 'String'
|             `-CXXRecord 0x55c810653830 'String'
|-CXXMethodDecl 0x55c8109d48e8 <line:15:5, line:18:5> line:15:17 need_argument_copy 'bool (const vector_memory<typed_array_memory<String> >::type *) const' inline
| `-ParmVarDecl 0x55c8109d47f8 <col:36, col:48> col:48 argp 'const vector_memory<typed_array_memory<String> >::type *'
|-CXXConstructorDecl 0x55c8109d49d8 <line:20:5, line:22:5> line:20:5 vector_memory 'void ()'
|-CXXDestructorDecl 0x55c8109d4ab8 <line:23:5, col:20> col:5 ~vector_memory 'void ()' noexcept-unevaluated 0x55c8109d4ab8
|-CXXMethodDecl 0x55c8109d4d88 <line:25:5, col:43> col:10 assign 'void (const vector_memory<typed_array_memory<String> > &)'
| `-ParmVarDecl 0x55c8109d4c90 <col:17, col:42> col:42 x 'const vector_memory<typed_array_memory<String> > &'
|-CXXMethodDecl 0x55c8109d4fc8 <line:26:5, col:44> col:10 assign 'void (vector_memory::size_type, const vector_memory<typed_array_memory<String> >::type *)'
| |-ParmVarDecl 0x55c8109d4e40 <col:17, col:27> col:27 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55c8109d4eb8 <col:30, col:42> col:42 vp 'const vector_memory<typed_array_memory<String> >::type *'
|-CXXMethodDecl 0x55c8109d5198 <line:27:5, col:44> col:10 resize 'void (vector_memory::size_type, const vector_memory<typed_array_memory<String> >::type *)'
| |-ParmVarDecl 0x55c8109d5088 <col:17, col:27> col:27 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55c8109d5100 <col:30, col:42> col:42 vp 'const vector_memory<typed_array_memory<String> >::type *'
|-CXXMethodDecl 0x55c8109d52f8 <line:28:5, line:30:5> line:28:14 begin 'vector_memory<typed_array_memory<String> >::iterator ()'
|-CXXMethodDecl 0x55c8109d53c8 <line:31:5, line:33:5> line:31:14 end 'vector_memory<typed_array_memory<String> >::iterator ()'
|-CXXMethodDecl 0x55c8109d5618 <line:34:5, col:48> col:14 insert 'vector_memory<typed_array_memory<String> >::iterator (vector_memory<typed_array_memory<String> >::iterator, const vector_memory<typed_array_memory<String> >::type *)'
| |-ParmVarDecl 0x55c8109d5488 <col:21, col:30> col:30 it 'vector_memory<typed_array_memory<String> >::iterator':'vector_memory<typed_array_memory<String> >::type *'
| `-ParmVarDecl 0x55c8109d5500 <col:34, col:46> col:46 vp 'const vector_memory<typed_array_memory<String> >::type *'
|-CXXMethodDecl 0x55c8109d5878 <line:35:5, col:42> col:14 erase 'vector_memory<typed_array_memory<String> >::iterator (vector_memory<typed_array_memory<String> >::iterator, vector_memory<typed_array_memory<String> >::iterator)'
| |-ParmVarDecl 0x55c8109d56e8 <col:20, col:29> col:29 a 'vector_memory<typed_array_memory<String> >::iterator':'vector_memory<typed_array_memory<String> >::type *'
| `-ParmVarDecl 0x55c8109d5760 <col:32, col:41> col:41 b 'vector_memory<typed_array_memory<String> >::iterator':'vector_memory<typed_array_memory<String> >::type *'
|-CXXMethodDecl 0x55c8109d5a38 <line:36:5, line:43:5> line:36:17 push_back 'void (const vector_memory<typed_array_memory<String> >::type *)' inline
| `-ParmVarDecl 0x55c8109d5948 <col:27, col:39> col:39 vp 'const vector_memory<typed_array_memory<String> >::type *'
|-CXXMethodDecl 0x55c8109d5bf8 <line:45:5, line:52:5> line:45:17 move_construct_back 'void (vector_memory<typed_array_memory<String> >::type *)' inline
| `-ParmVarDecl 0x55c8109d5b00 <col:37, col:43> col:43 vp 'vector_memory<typed_array_memory<String> >::type *'
|-CXXMethodDecl 0x55c8109d5cb0 <line:54:5, line:59:5> line:54:17 pop_back 'void ()' inline
|-CXXMethodDecl 0x55c8109d5d60 <line:60:5, line:64:5> line:60:17 clear 'void ()' inline
|-CXXMethodDecl 0x55c8109d5f98 <line:65:5, col:59> col:10 reserve_and_push_back 'bool (vector_memory::size_type, const vector_memory<typed_array_memory<String> >::type *)'
| |-ParmVarDecl 0x55c8109d5e10 <col:32, col:42> col:42 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55c8109d5e88 <col:45, col:57> col:57 vp 'const vector_memory<typed_array_memory<String> >::type *'
|-CXXMethodDecl 0x55c8109d6238 <line:66:5, col:35> col:10 swap 'void (vector_memory<typed_array_memory<String> > &)'
| `-ParmVarDecl 0x55c8109d6140 <col:15, col:34> col:34 x 'vector_memory<typed_array_memory<String> > &'
|-FieldDecl 0x55c8109d6300 <line:68:5, col:11> col:11 l_ 'vector_memory<typed_array_memory<String> >::type *'
|-FieldDecl 0x55c8109d6350 <line:69:5, col:15> col:15 n_ 'vector_memory::size_type':'int'
`-FieldDecl 0x55c8109d63a0 <line:70:5, col:15> col:15 capacity_ 'vector_memory::size_type':'int'

Layout: <CGRecordLayout
  LLVMType:%class.vector_memory.1 = type { %class.String*, i32, i32 }
  NonVirtualBaseLLVMType:%class.vector_memory.1 = type { %class.String*, i32, i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x55c81088b7e0 <../dummy_inc/click/ipaddress.hh:13:1, col:29> ../dummy_inc/click/vector.hh:111:7 class Vector definition
|-DefinitionData standard_layout has_user_declared_ctor has_mutable_fields can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor non_trivial user_declared has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveConstructor exists non_trivial user_declared needs_overload_resolution
| |-CopyAssignment non_trivial has_const_param user_declared needs_overload_resolution implicit_has_const_param
| |-MoveAssignment exists non_trivial user_declared needs_overload_resolution
| `-Destructor simple non_trivial needs_overload_resolution
|-TemplateArgument type 'String'
|-CXXRecordDecl 0x55c8109d1768 prev 0x55c81088b7e0 <col:1, col:7> col:7 implicit class Vector
|-TypedefDecl 0x55c8109d2a30 <line:113:5, col:44> col:44 array_memory_type 'typename array_memory<String>::type':'typed_array_memory<String>'
| `-ElaboratedType 0x55c8109d29e0 'typename array_memory<String>::type' sugar
|   `-TypedefType 0x55c8109d29c0 'conditional<false, sized_array_memory<24>, typed_array_memory<String> >::type' sugar
|     |-Typedef 0x55c8109d2870 'type'
|     `-SubstTemplateTypeParmType 0x55c8109d2700 'typed_array_memory<String>' sugar
|       |-TemplateTypeParmType 0x55c8105fda80 'F' dependent depth 0 index 1
|       | `-TemplateTypeParm 0x55c8105fda28 'F'
|       `-RecordType 0x55c8109d2360 'typed_array_memory<String>'
|         `-ClassTemplateSpecialization 0x55c8109d2280 'typed_array_memory'
|-FieldDecl 0x55c8109d63f0 <line:114:5, col:46> col:46 vm_ 'vector_memory<Vector<String>::array_memory_type>':'vector_memory<typed_array_memory<String> >' mutable
|-AccessSpecDecl 0x55c8109d6440 <line:116:3, col:9> col:3 public
|-TypedefDecl 0x55c8109d6478 <line:118:5, col:15> col:15 value_type 'String':'String'
| `-SubstTemplateTypeParmType 0x55c8109d1800 'String' sugar
|   |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x55c8106333f8 'T'
|   `-RecordType 0x55c8106538c0 'String'
|     `-CXXRecord 0x55c810653830 'String'
|-TypedefDecl 0x55c8109d6508 <line:119:5, col:16> col:16 reference 'String &'
| `-LValueReferenceType 0x55c8109d64d0 'String &'
|   `-SubstTemplateTypeParmType 0x55c8109d1800 'String' sugar
|     |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55c8106333f8 'T'
|     `-RecordType 0x55c8106538c0 'String'
|       `-CXXRecord 0x55c810653830 'String'
|-TypedefDecl 0x55c8109d6598 <line:120:5, col:22> col:22 const_reference 'const String &'
| `-LValueReferenceType 0x55c8109d6560 'const String &'
|   `-QualType 0x55c8109d1801 'const String' const
|     `-SubstTemplateTypeParmType 0x55c8109d1800 'String' sugar
|       |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55c8106333f8 'T'
|       `-RecordType 0x55c8106538c0 'String'
|         `-CXXRecord 0x55c810653830 'String'
|-TypedefDecl 0x55c8109d6628 <line:121:5, col:16> col:16 pointer 'String *'
| `-PointerType 0x55c8109d65f0 'String *'
|   `-SubstTemplateTypeParmType 0x55c8109d1800 'String' sugar
|     |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55c8106333f8 'T'
|     `-RecordType 0x55c8106538c0 'String'
|       `-CXXRecord 0x55c810653830 'String'
|-TypedefDecl 0x55c8109d66b8 <line:122:5, col:22> col:22 const_pointer 'const String *'
| `-PointerType 0x55c8109d6680 'const String *'
|   `-QualType 0x55c8109d1801 'const String' const
|     `-SubstTemplateTypeParmType 0x55c8109d1800 'String' sugar
|       |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55c8106333f8 'T'
|       `-RecordType 0x55c8106538c0 'String'
|         `-CXXRecord 0x55c810653830 'String'
|-TypedefDecl 0x55c8109d7310 <line:125:5, col:45> col:45 value_argument_type 'typename fast_argument<String>::type':'const String &'
| `-ElaboratedType 0x55c8109d72c0 'typename fast_argument<String>::type' sugar
|   `-TypedefType 0x55c8109d72a0 'fast_argument<String, true>::type' sugar
|     |-Typedef 0x55c8109d71d8 'type'
|     `-LValueReferenceType 0x55c8109d71a0 'const String &'
|       `-QualType 0x55c8109d6f41 'const String' const
|         `-SubstTemplateTypeParmType 0x55c8109d6f40 'String' sugar
|           |-TemplateTypeParmType 0x55c810604d60 'T' dependent depth 0 index 0
|           | `-TemplateTypeParm 0x55c810604d08 'T'
|           `-RecordType 0x55c8106538c0 'String'
|             `-CXXRecord 0x55c810653830 'String'
|-TypedefDecl 0x55c8109d7378 <line:126:5, col:22> col:22 const_access_type 'const String &'
| `-LValueReferenceType 0x55c8109d6560 'const String &'
|   `-QualType 0x55c8109d1801 'const String' const
|     `-SubstTemplateTypeParmType 0x55c8109d1800 'String' sugar
|       |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55c8106333f8 'T'
|       `-RecordType 0x55c8106538c0 'String'
|         `-CXXRecord 0x55c810653830 'String'
|-TypedefDecl 0x55c8109d73d0 <line:128:5, col:17> col:17 size_type 'int'
| `-BuiltinType 0x55c810317580 'int'
|-TypedefDecl 0x55c8109d7438 <line:130:5, col:16> col:16 iterator 'String *'
| `-PointerType 0x55c8109d65f0 'String *'
|   `-SubstTemplateTypeParmType 0x55c8109d1800 'String' sugar
|     |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55c8106333f8 'T'
|     `-RecordType 0x55c8106538c0 'String'
|       `-CXXRecord 0x55c810653830 'String'
|-TypedefDecl 0x55c8109d74a0 <line:131:5, col:22> col:22 const_iterator 'const String *'
| `-PointerType 0x55c8109d6680 'const String *'
|   `-QualType 0x55c8109d1801 'const String' const
|     `-SubstTemplateTypeParmType 0x55c8109d1800 'String' sugar
|       |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55c8106333f8 'T'
|       `-RecordType 0x55c8106538c0 'String'
|         `-CXXRecord 0x55c810653830 'String'
|-EnumDecl 0x55c8109d74f8 <line:134:5> col:5
| `-EnumConstantDecl 0x55c8109d75f0 <col:12, col:40> col:12 RESERVE_GROW 'Vector<String>::(anonymous enum at ../dummy_inc/click/vector.hh:134:5)'
|   `-ConstantExpr 0x55c8109d75d0 <col:27, col:40> 'Vector::size_type':'int' Int: -1
|     `-CStyleCastExpr 0x55c810634618 <col:27, col:40> 'Vector::size_type':'int' <NoOp>
|       `-UnaryOperator 0x55c8106345f0 <col:39, col:40> 'int' prefix '-'
|         `-IntegerLiteral 0x55c8106345d0 <col:40> 'int' 1
|-CXXConstructorDecl 0x55c8109d7678 <line:137:5, col:28> col:21 Vector 'void ()' inline
|-CXXConstructorDecl 0x55c8109d7908 <line:138:5, col:62> col:21 Vector 'void (Vector::size_type, Vector<String>::value_argument_type)' inline
| |-ParmVarDecl 0x55c8109d7730 <col:28, col:38> col:38 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55c8109d77d0 <col:41, col:61> col:61 v 'Vector<String>::value_argument_type':'const String &'
|-CXXConstructorDecl 0x55c8109d7b98 <line:139:5, col:37> col:12 Vector 'void (const Vector<String> &)' inline
| `-ParmVarDecl 0x55c8109d7a80 <col:19, col:36> col:36 x 'const Vector<String> &'
|-CXXConstructorDecl 0x55c8109d7e58 <line:141:5, col:32> col:12 Vector 'void (Vector<String> &&)' inline
| `-ParmVarDecl 0x55c8109d7d40 <col:19, col:31> col:31 x 'Vector<String> &&'
|-CXXMethodDecl 0x55c8109d8170 <line:144:5, col:51> col:23 operator= 'Vector<String> &(const Vector<String> &)' inline
| `-ParmVarDecl 0x55c8109d8050 <col:33, col:50> col:50 x 'const Vector<String> &'
|-CXXMethodDecl 0x55c8109d8480 <line:146:5, col:46> col:23 operator= 'Vector<String> &(Vector<String> &&)' inline
| `-ParmVarDecl 0x55c8109d8360 <col:33, col:45> col:45 x 'Vector<String> &&'
|-CXXMethodDecl 0x55c8109d8770 <line:148:5, col:70> col:23 assign 'Vector<String> &(Vector::size_type, Vector<String>::value_argument_type)' inline
| |-ParmVarDecl 0x55c8109d85b8 <col:30, col:40> col:40 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55c8109d8630 <col:43, col:69> col:63 v 'Vector<String>::value_argument_type':'const String &'
|-CXXMethodDecl 0x55c8109d8898 <line:150:5, col:55> col:49 begin 'Vector<String>::iterator ()'
| |-NoInlineAttr 0x55c8109d8948 <col:20> Inherited
| `-OptimizeNoneAttr 0x55c8109d89a0 <col:30> Inherited
|-CXXMethodDecl 0x55c8109d89e8 <line:151:5, col:53> col:49 end 'Vector<String>::iterator ()'
| |-NoInlineAttr 0x55c8109d8a98 <col:20> Inherited
| `-OptimizeNoneAttr 0x55c8109d8af0 <col:30> Inherited
|-CXXMethodDecl 0x55c8109d8bb8 <line:152:5, col:63> col:55 used begin 'Vector<String>::const_iterator () const'
| |-NoInlineAttr 0x55c8109d8c68 <col:20> Inherited
| `-OptimizeNoneAttr 0x55c8109d8cc0 <col:30> Inherited
|-CXXMethodDecl 0x55c8109d8d08 <line:153:5, col:61> col:55 used end 'Vector<String>::const_iterator () const'
| |-NoInlineAttr 0x55c8109d8db8 <col:20> Inherited
| `-OptimizeNoneAttr 0x55c8109d8e10 <col:30> Inherited
|-CXXMethodDecl 0x55c8109d8ef0 <line:154:5, col:64> col:55 cbegin 'Vector<String>::const_iterator () const'
| |-NoInlineAttr 0x55c8109d8fa0 <col:20> Inherited
| `-OptimizeNoneAttr 0x55c8109d8ff8 <col:30> Inherited
|-CXXMethodDecl 0x55c8109d9040 <line:155:5, col:62> col:55 cend 'Vector<String>::const_iterator () const'
| |-NoInlineAttr 0x55c8109d90f0 <col:20> Inherited
| `-OptimizeNoneAttr 0x55c8109d9148 <col:30> Inherited
|-CXXMethodDecl 0x55c8109d9170 <line:157:5, col:29> col:22 used size 'Vector::size_type () const' inline
|-CXXMethodDecl 0x55c8109d9220 <line:158:5, col:33> col:22 capacity 'Vector::size_type () const' inline
|-CXXMethodDecl 0x55c8109d92d0 <line:159:5, col:25> col:17 empty 'bool () const' inline
|-CXXMethodDecl 0x55c8109d9490 <line:160:5, col:64> col:17 resize 'void (Vector::size_type, Vector<String>::value_argument_type)' inline
| |-ParmVarDecl 0x55c8109d9380 <col:24, col:34> col:34 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55c8109d93f8 <col:37, col:63> col:57 v 'Vector<String>::value_argument_type':'const String &'
|-CXXMethodDecl 0x55c8109d95e0 <line:161:5, col:36> col:17 reserve 'bool (Vector::size_type)' inline
| `-ParmVarDecl 0x55c8109d9550 <col:25, col:35> col:35 n 'Vector::size_type':'int'
|-CXXMethodDecl 0x55c8109d9788 <line:163:5, col:65> col:43 operator[] 'String &(Vector::size_type)'
| |-ParmVarDecl 0x55c8109d9698 <col:54, col:64> col:64 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x55c8109d9840 <col:20>
| `-OptimizeNoneAttr 0x55c8109d9898 <col:30>
|-CXXMethodDecl 0x55c8109d99b8 <line:164:5, col:73> col:49 operator[] 'const String &(Vector::size_type) const'
| |-ParmVarDecl 0x55c8109d98c0 <col:60, col:70> col:70 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x55c8109d9a70 <col:20>
| `-OptimizeNoneAttr 0x55c8109d9ac8 <col:30>
|-CXXMethodDecl 0x55c8109d9b80 <line:165:5, col:29> col:15 at 'String &(Vector::size_type)' inline
| `-ParmVarDecl 0x55c8109d9af0 <col:18, col:28> col:28 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55c8109d9cc8 <line:166:5, col:37> col:21 at 'const String &(Vector::size_type) const' inline
| `-ParmVarDecl 0x55c8109d9c38 <col:24, col:34> col:34 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55c8109d9df8 <line:167:5, col:21> col:15 front 'String &()' inline
|-CXXMethodDecl 0x55c8109d9ef8 <line:168:5, col:29> col:21 front 'const String &() const' inline
|-CXXMethodDecl 0x55c8109d9fc8 <line:169:5, col:20> col:15 back 'String &()' inline
|-CXXMethodDecl 0x55c8109da098 <line:170:5, col:28> col:21 back 'const String &() const' inline
|-CXXMethodDecl 0x55c8109da1d8 <line:172:5, col:39> col:15 unchecked_at 'String &(Vector::size_type)' inline
| `-ParmVarDecl 0x55c8109da148 <col:28, col:38> col:38 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55c8109da320 <line:173:5, col:47> col:21 unchecked_at 'const String &(Vector::size_type) const' inline
| `-ParmVarDecl 0x55c8109da290 <col:34, col:44> col:44 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55c8109da468 <line:174:5, col:59> col:15 at_u 'String &(Vector::size_type)' inline
| |-ParmVarDecl 0x55c8109da3d8 <col:20, col:30> col:30 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x55c8109da520 <col:48> Inherited "" ""
|-CXXMethodDecl 0x55c8109da620 <line:175:5, col:71> col:21 at_u 'const String &(Vector::size_type) const' inline
| |-ParmVarDecl 0x55c8109da590 <col:26, col:36> col:36 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x55c8109da6d8 <col:60> Inherited "" ""
|-CXXMethodDecl 0x55c8109da798 <line:177:5, col:20> col:15 data 'String *()' inline
|-CXXMethodDecl 0x55c8109da898 <line:178:5, col:28> col:21 data 'const String *() const' inline
|-CXXMethodDecl 0x55c8109daa18 <line:180:5, col:48> col:17 used push_back 'void (Vector<String>::value_argument_type)' inline
| `-ParmVarDecl 0x55c8109da958 <col:27, col:47> col:47 v 'Vector<String>::value_argument_type':'const String &'
|-FunctionTemplateDecl 0x55c8109db1a8 <line:182:5, line:183:63> col:48 push_back
| |-TemplateTypeParmDecl 0x55c8109daad0 <line:182:15, col:43> col:24 typename depth 0 index 0 A
| | `-TemplateArgument type 'fast_argument<String>':'fast_argument<String, true>'
| `-CXXMethodDecl 0x55c8109db108 <line:183:5, col:63> col:48 push_back 'typename A::enable_rvalue_reference (String &&)' inline
|   `-ParmVarDecl 0x55c8109db008 <col:58, col:62> col:62 v 'String &&'
|-CXXMethodDecl 0x55c8109db288 <line:185:5, col:26> col:17 pop_back 'void ()' inline
|-CXXMethodDecl 0x55c8109db3d8 <line:186:5, col:49> col:17 push_front 'void (Vector<String>::value_argument_type)' inline
| `-ParmVarDecl 0x55c8109db348 <col:28, col:48> col:48 v 'Vector<String>::value_argument_type':'const String &'
|-CXXMethodDecl 0x55c8109db490 <line:187:5, col:27> col:17 pop_front 'void ()' inline
|-CXXMethodDecl 0x55c8109db6d8 <line:189:5, col:62> col:21 insert 'Vector<String>::iterator (Vector<String>::iterator, Vector<String>::value_argument_type)' inline
| |-ParmVarDecl 0x55c8109db550 <col:28, col:37> col:37 it 'Vector<String>::iterator':'String *'
| `-ParmVarDecl 0x55c8109db5c8 <col:41, col:61> col:61 v 'Vector<String>::value_argument_type':'const String &'
|-CXXMethodDecl 0x55c8109db868 <line:190:5, col:38> col:21 erase 'Vector<String>::iterator (Vector<String>::iterator)' inline
| `-ParmVarDecl 0x55c8109db7a8 <col:27, col:36> col:36 it 'Vector<String>::iterator':'String *'
|-CXXMethodDecl 0x55c8109dba78 <line:191:5, col:49> col:21 erase 'Vector<String>::iterator (Vector<String>::iterator, Vector<String>::iterator)' inline
| |-ParmVarDecl 0x55c8109db930 <col:27, col:36> col:36 a 'Vector<String>::iterator':'String *'
| `-ParmVarDecl 0x55c8109db9a8 <col:39, col:48> col:48 b 'Vector<String>::iterator':'String *'
|-CXXMethodDecl 0x55c8109dbb38 <line:193:5, col:23> col:17 used clear 'void ()' inline
|-CXXMethodDecl 0x55c8109dbd98 <line:195:5, col:34> col:17 swap 'void (Vector<String> &)' inline
| `-ParmVarDecl 0x55c8109dbca0 <col:22, col:33> col:33 x 'Vector<String> &'
`-CXXDestructorDecl 0x55c8109dbe68 <../dummy_inc/click/ipaddress.hh:13:29> col:29 implicit ~Vector 'void ()' inline default noexcept-unevaluated 0x55c8109dbe68

Layout: <CGRecordLayout
  LLVMType:%class.Vector.0 = type { %class.vector_memory.1 }
  NonVirtualBaseLLVMType:%class.Vector.0 = type { %class.vector_memory.1 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x55c810a21c40 <../dummy_inc/click/vector.hh:11:1, line:71:1> line:11:30 class vector_memory definition
|-DefinitionData standard_layout has_user_declared_ctor can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor simple trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveConstructor
| |-CopyAssignment trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveAssignment
| `-Destructor non_trivial user_declared
|-TemplateArgument type 'sized_array_memory<4>'
|-CXXRecordDecl 0x55c810a21e18 prev 0x55c810a21c40 <col:24, col:30> col:30 implicit class vector_memory
|-AccessSpecDecl 0x55c810a21ea8 <col:46, col:52> col:46 public
|-TypedefDecl 0x55c810a21ed0 <line:12:5, col:17> col:17 size_type 'int'
| `-BuiltinType 0x55c810317580 'int'
|-TypedefDecl 0x55c810a23aa0 <line:13:5, col:31> col:31 type 'typename sized_array_memory<4>::type':'char_array<4>'
| `-ElaboratedType 0x55c810a23a50 'typename sized_array_memory<4>::type' sugar
|   `-TypedefType 0x55c810a22380 'sized_array_memory<4>::type' sugar
|     |-Typedef 0x55c810a22280 'type'
|     `-TemplateSpecializationType 0x55c810a22210 'char_array<4UL>' sugar char_array
|       |-TemplateArgument expr
|       | `-ConstantExpr 0x55c810a220f0 <../dummy_inc/click/array_memory.hh:11:24> 'unsigned long' Int: 4
|       |   `-SubstNonTypeTemplateParmExpr 0x55c810a220d0 <col:24> 'unsigned long'
|       |     `-IntegerLiteral 0x55c810a220b0 <col:24> 'unsigned long' 4
|       `-RecordType 0x55c810a221f0 'char_array<4>'
|         `-ClassTemplateSpecialization 0x55c810a22110 'char_array'
|-TypedefDecl 0x55c810a23b58 <../dummy_inc/click/vector.hh:14:5, col:19> col:19 iterator 'vector_memory<sized_array_memory<4> >::type *'
| `-PointerType 0x55c810a23b20 'vector_memory<sized_array_memory<4> >::type *'
|   `-TypedefType 0x55c810a23b00 'vector_memory<sized_array_memory<4> >::type' sugar
|     |-Typedef 0x55c810a23aa0 'type'
|     `-ElaboratedType 0x55c810a23a50 'typename sized_array_memory<4>::type' sugar
|       `-TypedefType 0x55c810a22380 'sized_array_memory<4>::type' sugar
|         |-Typedef 0x55c810a22280 'type'
|         `-TemplateSpecializationType 0x55c810a22210 'char_array<4UL>' sugar char_array
|           |-TemplateArgument expr
|           | `-ConstantExpr 0x55c810a220f0 <../dummy_inc/click/array_memory.hh:11:24> 'unsigned long' Int: 4
|           |   `-SubstNonTypeTemplateParmExpr 0x55c810a220d0 <col:24> 'unsigned long'
|           |     `-IntegerLiteral 0x55c810a220b0 <col:24> 'unsigned long' 4
|           `-RecordType 0x55c810a221f0 'char_array<4>'
|             `-ClassTemplateSpecialization 0x55c810a22110 'char_array'
|-CXXMethodDecl 0x55c810a23cd8 <../dummy_inc/click/vector.hh:15:5, line:18:5> line:15:17 need_argument_copy 'bool (const vector_memory<sized_array_memory<4> >::type *) const' inline
| `-ParmVarDecl 0x55c810a23be8 <col:36, col:48> col:48 argp 'const vector_memory<sized_array_memory<4> >::type *'
|-CXXConstructorDecl 0x55c810a23dc8 <line:20:5, line:22:5> line:20:5 vector_memory 'void ()'
|-CXXDestructorDecl 0x55c810a23ea8 <line:23:5, col:20> col:5 ~vector_memory 'void ()' noexcept-unevaluated 0x55c810a23ea8
|-CXXMethodDecl 0x55c810a24178 <line:25:5, col:43> col:10 assign 'void (const vector_memory<sized_array_memory<4> > &)'
| `-ParmVarDecl 0x55c810a24080 <col:17, col:42> col:42 x 'const vector_memory<sized_array_memory<4> > &'
|-CXXMethodDecl 0x55c810a243b8 <line:26:5, col:44> col:10 assign 'void (vector_memory::size_type, const vector_memory<sized_array_memory<4> >::type *)'
| |-ParmVarDecl 0x55c810a24230 <col:17, col:27> col:27 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55c810a242a8 <col:30, col:42> col:42 vp 'const vector_memory<sized_array_memory<4> >::type *'
|-CXXMethodDecl 0x55c810a24588 <line:27:5, col:44> col:10 resize 'void (vector_memory::size_type, const vector_memory<sized_array_memory<4> >::type *)'
| |-ParmVarDecl 0x55c810a24478 <col:17, col:27> col:27 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55c810a244f0 <col:30, col:42> col:42 vp 'const vector_memory<sized_array_memory<4> >::type *'
|-CXXMethodDecl 0x55c810a246e8 <line:28:5, line:30:5> line:28:14 begin 'vector_memory<sized_array_memory<4> >::iterator ()'
|-CXXMethodDecl 0x55c810a247b8 <line:31:5, line:33:5> line:31:14 end 'vector_memory<sized_array_memory<4> >::iterator ()'
|-CXXMethodDecl 0x55c810a24a08 <line:34:5, col:48> col:14 insert 'vector_memory<sized_array_memory<4> >::iterator (vector_memory<sized_array_memory<4> >::iterator, const vector_memory<sized_array_memory<4> >::type *)'
| |-ParmVarDecl 0x55c810a24878 <col:21, col:30> col:30 it 'vector_memory<sized_array_memory<4> >::iterator':'vector_memory<sized_array_memory<4> >::type *'
| `-ParmVarDecl 0x55c810a248f0 <col:34, col:46> col:46 vp 'const vector_memory<sized_array_memory<4> >::type *'
|-CXXMethodDecl 0x55c810a24c68 <line:35:5, col:42> col:14 erase 'vector_memory<sized_array_memory<4> >::iterator (vector_memory<sized_array_memory<4> >::iterator, vector_memory<sized_array_memory<4> >::iterator)'
| |-ParmVarDecl 0x55c810a24ad8 <col:20, col:29> col:29 a 'vector_memory<sized_array_memory<4> >::iterator':'vector_memory<sized_array_memory<4> >::type *'
| `-ParmVarDecl 0x55c810a24b50 <col:32, col:41> col:41 b 'vector_memory<sized_array_memory<4> >::iterator':'vector_memory<sized_array_memory<4> >::type *'
|-CXXMethodDecl 0x55c810a24e28 <line:36:5, line:43:5> line:36:17 push_back 'void (const vector_memory<sized_array_memory<4> >::type *)' inline
| `-ParmVarDecl 0x55c810a24d38 <col:27, col:39> col:39 vp 'const vector_memory<sized_array_memory<4> >::type *'
|-CXXMethodDecl 0x55c810a24fe8 <line:45:5, line:52:5> line:45:17 move_construct_back 'void (vector_memory<sized_array_memory<4> >::type *)' inline
| `-ParmVarDecl 0x55c810a24ef0 <col:37, col:43> col:43 vp 'vector_memory<sized_array_memory<4> >::type *'
|-CXXMethodDecl 0x55c810a250a0 <line:54:5, line:59:5> line:54:17 pop_back 'void ()' inline
|-CXXMethodDecl 0x55c810a25150 <line:60:5, line:64:5> line:60:17 clear 'void ()' inline
|-CXXMethodDecl 0x55c810a25388 <line:65:5, col:59> col:10 reserve_and_push_back 'bool (vector_memory::size_type, const vector_memory<sized_array_memory<4> >::type *)'
| |-ParmVarDecl 0x55c810a25200 <col:32, col:42> col:42 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55c810a25278 <col:45, col:57> col:57 vp 'const vector_memory<sized_array_memory<4> >::type *'
|-CXXMethodDecl 0x55c810a25628 <line:66:5, col:35> col:10 swap 'void (vector_memory<sized_array_memory<4> > &)'
| `-ParmVarDecl 0x55c810a25530 <col:15, col:34> col:34 x 'vector_memory<sized_array_memory<4> > &'
|-FieldDecl 0x55c810a256f0 <line:68:5, col:11> col:11 l_ 'vector_memory<sized_array_memory<4> >::type *'
|-FieldDecl 0x55c810a25740 <line:69:5, col:15> col:15 n_ 'vector_memory::size_type':'int'
`-FieldDecl 0x55c810a25790 <line:70:5, col:15> col:15 capacity_ 'vector_memory::size_type':'int'

Layout: <CGRecordLayout
  LLVMType:%class.vector_memory.3 = type { %struct.char_array.4*, i32, i32 }
  NonVirtualBaseLLVMType:%class.vector_memory.3 = type { %struct.char_array.4*, i32, i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x55c810b063f0 <../dummy_inc/click/ipaddress.hh:13:1, col:29> ../dummy_inc/click/vector.hh:111:7 class Vector definition
|-DefinitionData standard_layout has_user_declared_ctor has_mutable_fields can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor non_trivial user_declared has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveConstructor exists non_trivial user_declared needs_overload_resolution
| |-CopyAssignment non_trivial has_const_param user_declared needs_overload_resolution implicit_has_const_param
| |-MoveAssignment exists non_trivial user_declared needs_overload_resolution
| `-Destructor simple non_trivial needs_overload_resolution
|-TemplateArgument type 'unsigned int'
|-CXXRecordDecl 0x55c810b065f8 prev 0x55c810b063f0 <col:1, col:7> col:7 implicit class Vector
|-TypedefDecl 0x55c810b07610 <line:113:5, col:44> col:44 array_memory_type 'typename array_memory<unsigned int>::type':'sized_array_memory<4>'
| `-ElaboratedType 0x55c810b075c0 'typename array_memory<unsigned int>::type' sugar
|   `-TypedefType 0x55c810b075a0 'conditional<true, sized_array_memory<4>, typed_array_memory<unsigned int> >::type' sugar
|     |-Typedef 0x55c810b07450 'type'
|     `-SubstTemplateTypeParmType 0x55c810a21810 'sized_array_memory<4>' sugar
|       |-TemplateTypeParmType 0x55c8105fd290 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55c8105fd238 'T'
|       `-RecordType 0x55c810a21360 'sized_array_memory<4>'
|         `-ClassTemplateSpecialization 0x55c810a21278 'sized_array_memory'
|-FieldDecl 0x55c810b07710 <line:114:5, col:46> col:46 vm_ 'vector_memory<Vector<unsigned int>::array_memory_type>':'vector_memory<sized_array_memory<4> >' mutable
|-AccessSpecDecl 0x55c810b07760 <line:116:3, col:9> col:3 public
|-TypedefDecl 0x55c810b07798 <line:118:5, col:15> col:15 value_type 'unsigned int':'unsigned int'
| `-SubstTemplateTypeParmType 0x55c810b06690 'unsigned int' sugar
|   |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x55c8106333f8 'T'
|   `-BuiltinType 0x55c810317620 'unsigned int'
|-TypedefDecl 0x55c810b07828 <line:119:5, col:16> col:16 reference 'unsigned int &'
| `-LValueReferenceType 0x55c810b077f0 'unsigned int &'
|   `-SubstTemplateTypeParmType 0x55c810b06690 'unsigned int' sugar
|     |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55c8106333f8 'T'
|     `-BuiltinType 0x55c810317620 'unsigned int'
|-TypedefDecl 0x55c810b078b8 <line:120:5, col:22> col:22 const_reference 'const unsigned int &'
| `-LValueReferenceType 0x55c810b07880 'const unsigned int &'
|   `-QualType 0x55c810b06691 'const unsigned int' const
|     `-SubstTemplateTypeParmType 0x55c810b06690 'unsigned int' sugar
|       |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55c8106333f8 'T'
|       `-BuiltinType 0x55c810317620 'unsigned int'
|-TypedefDecl 0x55c810b07948 <line:121:5, col:16> col:16 pointer 'unsigned int *'
| `-PointerType 0x55c810b07910 'unsigned int *'
|   `-SubstTemplateTypeParmType 0x55c810b06690 'unsigned int' sugar
|     |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55c8106333f8 'T'
|     `-BuiltinType 0x55c810317620 'unsigned int'
|-TypedefDecl 0x55c810b079d8 <line:122:5, col:22> col:22 const_pointer 'const unsigned int *'
| `-PointerType 0x55c810b079a0 'const unsigned int *'
|   `-QualType 0x55c810b06691 'const unsigned int' const
|     `-SubstTemplateTypeParmType 0x55c810b06690 'unsigned int' sugar
|       |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55c8106333f8 'T'
|       `-BuiltinType 0x55c810317620 'unsigned int'
|-TypedefDecl 0x55c810b085c0 <line:125:5, col:45> col:45 value_argument_type 'typename fast_argument<unsigned int>::type':'unsigned int'
| `-ElaboratedType 0x55c810b08570 'typename fast_argument<unsigned int>::type' sugar
|   `-TypedefType 0x55c810b08550 'fast_argument<unsigned int, false>::type' sugar
|     |-Typedef 0x55c810b084e0 'type'
|     `-SubstTemplateTypeParmType 0x55c810b082a0 'unsigned int' sugar
|       |-TemplateTypeParmType 0x55c810605490 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55c810605440 'T'
|       `-BuiltinType 0x55c810317620 'unsigned int'
|-TypedefDecl 0x55c810b08628 <line:126:5, col:22> col:22 const_access_type 'const unsigned int &'
| `-LValueReferenceType 0x55c810b07880 'const unsigned int &'
|   `-QualType 0x55c810b06691 'const unsigned int' const
|     `-SubstTemplateTypeParmType 0x55c810b06690 'unsigned int' sugar
|       |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55c8106333f8 'T'
|       `-BuiltinType 0x55c810317620 'unsigned int'
|-TypedefDecl 0x55c810b08680 <line:128:5, col:17> col:17 size_type 'int'
| `-BuiltinType 0x55c810317580 'int'
|-TypedefDecl 0x55c810b086e8 <line:130:5, col:16> col:16 iterator 'unsigned int *'
| `-PointerType 0x55c810b07910 'unsigned int *'
|   `-SubstTemplateTypeParmType 0x55c810b06690 'unsigned int' sugar
|     |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55c8106333f8 'T'
|     `-BuiltinType 0x55c810317620 'unsigned int'
|-TypedefDecl 0x55c810b08750 <line:131:5, col:22> col:22 const_iterator 'const unsigned int *'
| `-PointerType 0x55c810b079a0 'const unsigned int *'
|   `-QualType 0x55c810b06691 'const unsigned int' const
|     `-SubstTemplateTypeParmType 0x55c810b06690 'unsigned int' sugar
|       |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55c8106333f8 'T'
|       `-BuiltinType 0x55c810317620 'unsigned int'
|-EnumDecl 0x55c810b087a8 <line:134:5> col:5
| `-EnumConstantDecl 0x55c810b088a0 <col:12, col:40> col:12 RESERVE_GROW 'Vector<unsigned int>::(anonymous enum at ../dummy_inc/click/vector.hh:134:5)'
|   `-ConstantExpr 0x55c810b08880 <col:27, col:40> 'Vector::size_type':'int' Int: -1
|     `-CStyleCastExpr 0x55c810634618 <col:27, col:40> 'Vector::size_type':'int' <NoOp>
|       `-UnaryOperator 0x55c8106345f0 <col:39, col:40> 'int' prefix '-'
|         `-IntegerLiteral 0x55c8106345d0 <col:40> 'int' 1
|-CXXConstructorDecl 0x55c810b08928 <line:137:5, col:28> col:21 Vector 'void ()' inline
|-CXXConstructorDecl 0x55c810b08b78 <line:138:5, col:62> col:21 Vector 'void (Vector::size_type, Vector<unsigned int>::value_argument_type)' inline
| |-ParmVarDecl 0x55c810b089e0 <col:28, col:38> col:38 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55c810b08a80 <col:41, col:61> col:61 v 'Vector<unsigned int>::value_argument_type':'unsigned int'
|-CXXConstructorDecl 0x55c810b08e38 <line:139:5, col:37> col:12 Vector 'void (const Vector<unsigned int> &)' inline
| `-ParmVarDecl 0x55c810b08d20 <col:19, col:36> col:36 x 'const Vector<unsigned int> &'
|-CXXConstructorDecl 0x55c810b090f8 <line:141:5, col:32> col:12 Vector 'void (Vector<unsigned int> &&)' inline
| `-ParmVarDecl 0x55c810b08fe0 <col:19, col:31> col:31 x 'Vector<unsigned int> &&'
|-CXXMethodDecl 0x55c810b09440 <line:144:5, col:51> col:23 operator= 'Vector<unsigned int> &(const Vector<unsigned int> &)' inline
| `-ParmVarDecl 0x55c810b09320 <col:33, col:50> col:50 x 'const Vector<unsigned int> &'
|-CXXMethodDecl 0x55c810b09750 <line:146:5, col:46> col:23 operator= 'Vector<unsigned int> &(Vector<unsigned int> &&)' inline
| `-ParmVarDecl 0x55c810b09630 <col:33, col:45> col:45 x 'Vector<unsigned int> &&'
|-CXXMethodDecl 0x55c810b09a40 <line:148:5, col:70> col:23 assign 'Vector<unsigned int> &(Vector::size_type, Vector<unsigned int>::value_argument_type)' inline
| |-ParmVarDecl 0x55c810b09888 <col:30, col:40> col:40 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55c810b09900 <col:43, col:69> col:63 v 'Vector<unsigned int>::value_argument_type':'unsigned int'
|-CXXMethodDecl 0x55c810b09b68 <line:150:5, col:55> col:49 begin 'Vector<unsigned int>::iterator ()'
| |-NoInlineAttr 0x55c810b09c48 <col:20> Inherited
| `-OptimizeNoneAttr 0x55c810b09ca0 <col:30> Inherited
|-CXXMethodDecl 0x55c810b0b180 <line:151:5, col:53> col:49 end 'Vector<unsigned int>::iterator ()'
| |-NoInlineAttr 0x55c810b0b230 <col:20> Inherited
| `-OptimizeNoneAttr 0x55c810b0b288 <col:30> Inherited
|-CXXMethodDecl 0x55c810b0b318 <line:152:5, col:63> col:55 begin 'Vector<unsigned int>::const_iterator () const'
| |-NoInlineAttr 0x55c810b0b3c8 <col:20> Inherited
| `-OptimizeNoneAttr 0x55c810b0b420 <col:30> Inherited
|-CXXMethodDecl 0x55c810b0b468 <line:153:5, col:61> col:55 end 'Vector<unsigned int>::const_iterator () const'
| |-NoInlineAttr 0x55c810b0b518 <col:20> Inherited
| `-OptimizeNoneAttr 0x55c810b0b570 <col:30> Inherited
|-CXXMethodDecl 0x55c810b0b5b8 <line:154:5, col:64> col:55 cbegin 'Vector<unsigned int>::const_iterator () const'
| |-NoInlineAttr 0x55c810b0b668 <col:20> Inherited
| `-OptimizeNoneAttr 0x55c810b0b6c0 <col:30> Inherited
|-CXXMethodDecl 0x55c810b0b708 <line:155:5, col:62> col:55 cend 'Vector<unsigned int>::const_iterator () const'
| |-NoInlineAttr 0x55c810b0b7b8 <col:20> Inherited
| `-OptimizeNoneAttr 0x55c810b0b810 <col:30> Inherited
|-CXXMethodDecl 0x55c810b0b838 <line:157:5, col:29> col:22 size 'Vector::size_type () const' inline
|-CXXMethodDecl 0x55c810b0b8e8 <line:158:5, col:33> col:22 capacity 'Vector::size_type () const' inline
|-CXXMethodDecl 0x55c810b0b998 <line:159:5, col:25> col:17 empty 'bool () const' inline
|-CXXMethodDecl 0x55c810b0bb58 <line:160:5, col:64> col:17 resize 'void (Vector::size_type, Vector<unsigned int>::value_argument_type)' inline
| |-ParmVarDecl 0x55c810b0ba48 <col:24, col:34> col:34 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55c810b0bac0 <col:37, col:63> col:57 v 'Vector<unsigned int>::value_argument_type':'unsigned int'
|-CXXMethodDecl 0x55c810b0bca8 <line:161:5, col:36> col:17 reserve 'bool (Vector::size_type)' inline
| `-ParmVarDecl 0x55c810b0bc18 <col:25, col:35> col:35 n 'Vector::size_type':'int'
|-CXXMethodDecl 0x55c810b0be58 <line:163:5, col:65> col:43 operator[] 'unsigned int &(Vector::size_type)'
| |-ParmVarDecl 0x55c810b0bd60 <col:54, col:64> col:64 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x55c810b0bf10 <col:20>
| `-OptimizeNoneAttr 0x55c810b0bf68 <col:30>
|-CXXMethodDecl 0x55c810b0c088 <line:164:5, col:73> col:49 operator[] 'const unsigned int &(Vector::size_type) const'
| |-ParmVarDecl 0x55c810b0bf90 <col:60, col:70> col:70 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x55c810b0c140 <col:20>
| `-OptimizeNoneAttr 0x55c810b0c198 <col:30>
|-CXXMethodDecl 0x55c810b0c250 <line:165:5, col:29> col:15 at 'unsigned int &(Vector::size_type)' inline
| `-ParmVarDecl 0x55c810b0c1c0 <col:18, col:28> col:28 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55c810b0c398 <line:166:5, col:37> col:21 at 'const unsigned int &(Vector::size_type) const' inline
| `-ParmVarDecl 0x55c810b0c308 <col:24, col:34> col:34 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55c810b0c4c8 <line:167:5, col:21> col:15 front 'unsigned int &()' inline
|-CXXMethodDecl 0x55c810b0c5f8 <line:168:5, col:29> col:21 front 'const unsigned int &() const' inline
|-CXXMethodDecl 0x55c810b0c6c8 <line:169:5, col:20> col:15 back 'unsigned int &()' inline
|-CXXMethodDecl 0x55c810b0c798 <line:170:5, col:28> col:21 back 'const unsigned int &() const' inline
|-CXXMethodDecl 0x55c810b0c8d8 <line:172:5, col:39> col:15 unchecked_at 'unsigned int &(Vector::size_type)' inline
| `-ParmVarDecl 0x55c810b0c848 <col:28, col:38> col:38 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55c810b0ca20 <line:173:5, col:47> col:21 unchecked_at 'const unsigned int &(Vector::size_type) const' inline
| `-ParmVarDecl 0x55c810b0c990 <col:34, col:44> col:44 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55c810b0cb68 <line:174:5, col:59> col:15 at_u 'unsigned int &(Vector::size_type)' inline
| |-ParmVarDecl 0x55c810b0cad8 <col:20, col:30> col:30 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x55c810b0cc20 <col:48> Inherited "" ""
|-CXXMethodDecl 0x55c810b0cd20 <line:175:5, col:71> col:21 at_u 'const unsigned int &(Vector::size_type) const' inline
| |-ParmVarDecl 0x55c810b0cc90 <col:26, col:36> col:36 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x55c810b0cdd8 <col:60> Inherited "" ""
|-CXXMethodDecl 0x55c810b0ce98 <line:177:5, col:20> col:15 data 'unsigned int *()' inline
|-CXXMethodDecl 0x55c810b0cf98 <line:178:5, col:28> col:21 data 'const unsigned int *() const' inline
|-CXXMethodDecl 0x55c810b0d118 <line:180:5, col:48> col:17 push_back 'void (Vector<unsigned int>::value_argument_type)' inline
| `-ParmVarDecl 0x55c810b0d058 <col:27, col:47> col:47 v 'Vector<unsigned int>::value_argument_type':'unsigned int'
|-FunctionTemplateDecl 0x55c810b0d8d8 <line:182:5, line:183:63> col:48 push_back
| |-TemplateTypeParmDecl 0x55c810b0d1d0 <line:182:15, col:43> col:24 typename depth 0 index 0 A
| | `-TemplateArgument type 'fast_argument<unsigned int>':'fast_argument<unsigned int, false>'
| `-CXXMethodDecl 0x55c810b0d838 <line:183:5, col:63> col:48 push_back 'typename A::enable_rvalue_reference (unsigned int &&)' inline
|   `-ParmVarDecl 0x55c810b0d738 <col:58, col:62> col:62 v 'unsigned int &&'
|-CXXMethodDecl 0x55c810b0d9b8 <line:185:5, col:26> col:17 pop_back 'void ()' inline
|-CXXMethodDecl 0x55c810b0db08 <line:186:5, col:49> col:17 push_front 'void (Vector<unsigned int>::value_argument_type)' inline
| `-ParmVarDecl 0x55c810b0da78 <col:28, col:48> col:48 v 'Vector<unsigned int>::value_argument_type':'unsigned int'
|-CXXMethodDecl 0x55c810b0dbc0 <line:187:5, col:27> col:17 pop_front 'void ()' inline
|-CXXMethodDecl 0x55c810b0de08 <line:189:5, col:62> col:21 insert 'Vector<unsigned int>::iterator (Vector<unsigned int>::iterator, Vector<unsigned int>::value_argument_type)' inline
| |-ParmVarDecl 0x55c810b0dc80 <col:28, col:37> col:37 it 'Vector<unsigned int>::iterator':'unsigned int *'
| `-ParmVarDecl 0x55c810b0dcf8 <col:41, col:61> col:61 v 'Vector<unsigned int>::value_argument_type':'unsigned int'
|-CXXMethodDecl 0x55c810b0dfc8 <line:190:5, col:38> col:21 erase 'Vector<unsigned int>::iterator (Vector<unsigned int>::iterator)' inline
| `-ParmVarDecl 0x55c810b0ded8 <col:27, col:36> col:36 it 'Vector<unsigned int>::iterator':'unsigned int *'
|-CXXMethodDecl 0x55c810b0e218 <line:191:5, col:49> col:21 erase 'Vector<unsigned int>::iterator (Vector<unsigned int>::iterator, Vector<unsigned int>::iterator)' inline
| |-ParmVarDecl 0x55c810b0e090 <col:27, col:36> col:36 a 'Vector<unsigned int>::iterator':'unsigned int *'
| `-ParmVarDecl 0x55c810b0e108 <col:39, col:48> col:48 b 'Vector<unsigned int>::iterator':'unsigned int *'
|-CXXMethodDecl 0x55c810b0e2d8 <line:193:5, col:23> col:17 clear 'void ()' inline
|-CXXMethodDecl 0x55c810b0e538 <line:195:5, col:34> col:17 swap 'void (Vector<unsigned int> &)' inline
| `-ParmVarDecl 0x55c810b0e440 <col:22, col:33> col:33 x 'Vector<unsigned int> &'
`-CXXDestructorDecl 0x55c810b0e608 <../dummy_inc/click/ipaddress.hh:13:29> col:29 implicit ~Vector 'void ()' inline default noexcept-unevaluated 0x55c810b0e608

Layout: <CGRecordLayout
  LLVMType:%class.Vector.2 = type { %class.vector_memory.3 }
  NonVirtualBaseLLVMType:%class.Vector.2 = type { %class.vector_memory.3 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x55c810a137a8 <../dummy_inc/click/ipaddress.hh:13:1, col:29> ../dummy_inc/click/vector.hh:111:7 class Vector definition
|-DefinitionData standard_layout has_user_declared_ctor has_mutable_fields can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor non_trivial user_declared has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveConstructor exists non_trivial user_declared needs_overload_resolution
| |-CopyAssignment non_trivial has_const_param user_declared needs_overload_resolution implicit_has_const_param
| |-MoveAssignment exists non_trivial user_declared needs_overload_resolution
| `-Destructor simple non_trivial needs_overload_resolution
|-TemplateArgument type 'int'
|-CXXRecordDecl 0x55c810a139b8 prev 0x55c810a137a8 <col:1, col:7> col:7 implicit class Vector
|-TypedefDecl 0x55c810a21bb0 <line:113:5, col:44> col:44 array_memory_type 'typename array_memory<int>::type':'sized_array_memory<4>'
| `-ElaboratedType 0x55c810a21b60 'typename array_memory<int>::type' sugar
|   `-TypedefType 0x55c810a21b40 'conditional<true, sized_array_memory<4>, typed_array_memory<int> >::type' sugar
|     |-Typedef 0x55c810a219f0 'type'
|     `-SubstTemplateTypeParmType 0x55c810a21810 'sized_array_memory<4>' sugar
|       |-TemplateTypeParmType 0x55c8105fd290 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55c8105fd238 'T'
|       `-RecordType 0x55c810a21360 'sized_array_memory<4>'
|         `-ClassTemplateSpecialization 0x55c810a21278 'sized_array_memory'
|-FieldDecl 0x55c810a257e0 <line:114:5, col:46> col:46 vm_ 'vector_memory<Vector<int>::array_memory_type>':'vector_memory<sized_array_memory<4> >' mutable
|-AccessSpecDecl 0x55c810a25830 <line:116:3, col:9> col:3 public
|-TypedefDecl 0x55c810a25868 <line:118:5, col:15> col:15 value_type 'int':'int'
| `-SubstTemplateTypeParmType 0x55c810a13a50 'int' sugar
|   |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x55c8106333f8 'T'
|   `-BuiltinType 0x55c810317580 'int'
|-TypedefDecl 0x55c810a258f8 <line:119:5, col:16> col:16 reference 'int &'
| `-LValueReferenceType 0x55c810a258c0 'int &'
|   `-SubstTemplateTypeParmType 0x55c810a13a50 'int' sugar
|     |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55c8106333f8 'T'
|     `-BuiltinType 0x55c810317580 'int'
|-TypedefDecl 0x55c810a25988 <line:120:5, col:22> col:22 const_reference 'const int &'
| `-LValueReferenceType 0x55c810a25950 'const int &'
|   `-QualType 0x55c810a13a51 'const int' const
|     `-SubstTemplateTypeParmType 0x55c810a13a50 'int' sugar
|       |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55c8106333f8 'T'
|       `-BuiltinType 0x55c810317580 'int'
|-TypedefDecl 0x55c810a25a18 <line:121:5, col:16> col:16 pointer 'int *'
| `-PointerType 0x55c810a259e0 'int *'
|   `-SubstTemplateTypeParmType 0x55c810a13a50 'int' sugar
|     |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55c8106333f8 'T'
|     `-BuiltinType 0x55c810317580 'int'
|-TypedefDecl 0x55c810a25aa8 <line:122:5, col:22> col:22 const_pointer 'const int *'
| `-PointerType 0x55c810a25a70 'const int *'
|   `-QualType 0x55c810a13a51 'const int' const
|     `-SubstTemplateTypeParmType 0x55c810a13a50 'int' sugar
|       |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55c8106333f8 'T'
|       `-BuiltinType 0x55c810317580 'int'
|-TypedefDecl 0x55c810a26690 <line:125:5, col:45> col:45 value_argument_type 'typename fast_argument<int>::type':'int'
| `-ElaboratedType 0x55c810a26640 'typename fast_argument<int>::type' sugar
|   `-TypedefType 0x55c810a26620 'fast_argument<int, false>::type' sugar
|     |-Typedef 0x55c810a265b0 'type'
|     `-SubstTemplateTypeParmType 0x55c810a26370 'int' sugar
|       |-TemplateTypeParmType 0x55c810605490 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55c810605440 'T'
|       `-BuiltinType 0x55c810317580 'int'
|-TypedefDecl 0x55c810a266f8 <line:126:5, col:22> col:22 const_access_type 'const int &'
| `-LValueReferenceType 0x55c810a25950 'const int &'
|   `-QualType 0x55c810a13a51 'const int' const
|     `-SubstTemplateTypeParmType 0x55c810a13a50 'int' sugar
|       |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55c8106333f8 'T'
|       `-BuiltinType 0x55c810317580 'int'
|-TypedefDecl 0x55c810a26750 <line:128:5, col:17> col:17 size_type 'int'
| `-BuiltinType 0x55c810317580 'int'
|-TypedefDecl 0x55c810a267b8 <line:130:5, col:16> col:16 iterator 'int *'
| `-PointerType 0x55c810a259e0 'int *'
|   `-SubstTemplateTypeParmType 0x55c810a13a50 'int' sugar
|     |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55c8106333f8 'T'
|     `-BuiltinType 0x55c810317580 'int'
|-TypedefDecl 0x55c810a26820 <line:131:5, col:22> col:22 const_iterator 'const int *'
| `-PointerType 0x55c810a25a70 'const int *'
|   `-QualType 0x55c810a13a51 'const int' const
|     `-SubstTemplateTypeParmType 0x55c810a13a50 'int' sugar
|       |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55c8106333f8 'T'
|       `-BuiltinType 0x55c810317580 'int'
|-EnumDecl 0x55c810a26878 <line:134:5> col:5
| `-EnumConstantDecl 0x55c810a26970 <col:12, col:40> col:12 RESERVE_GROW 'Vector<int>::(anonymous enum at ../dummy_inc/click/vector.hh:134:5)'
|   `-ConstantExpr 0x55c810a26950 <col:27, col:40> 'Vector::size_type':'int' Int: -1
|     `-CStyleCastExpr 0x55c810634618 <col:27, col:40> 'Vector::size_type':'int' <NoOp>
|       `-UnaryOperator 0x55c8106345f0 <col:39, col:40> 'int' prefix '-'
|         `-IntegerLiteral 0x55c8106345d0 <col:40> 'int' 1
|-CXXConstructorDecl 0x55c810a269f8 <line:137:5, col:28> col:21 Vector 'void ()' inline
|-CXXConstructorDecl 0x55c810a26c48 <line:138:5, col:62> col:21 Vector 'void (Vector::size_type, Vector<int>::value_argument_type)' inline
| |-ParmVarDecl 0x55c810a26ab0 <col:28, col:38> col:38 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55c810a26b50 <col:41, col:61> col:61 v 'Vector<int>::value_argument_type':'int'
|-CXXConstructorDecl 0x55c810a26f08 <line:139:5, col:37> col:12 Vector 'void (const Vector<int> &)' inline
| `-ParmVarDecl 0x55c810a26df0 <col:19, col:36> col:36 x 'const Vector<int> &'
|-CXXConstructorDecl 0x55c810a271c8 <line:141:5, col:32> col:12 Vector 'void (Vector<int> &&)' inline
| `-ParmVarDecl 0x55c810a270b0 <col:19, col:31> col:31 x 'Vector<int> &&'
|-CXXMethodDecl 0x55c810a27510 <line:144:5, col:51> col:23 operator= 'Vector<int> &(const Vector<int> &)' inline
| `-ParmVarDecl 0x55c810a273f0 <col:33, col:50> col:50 x 'const Vector<int> &'
|-CXXMethodDecl 0x55c810a27820 <line:146:5, col:46> col:23 operator= 'Vector<int> &(Vector<int> &&)' inline
| `-ParmVarDecl 0x55c810a27700 <col:33, col:45> col:45 x 'Vector<int> &&'
|-CXXMethodDecl 0x55c810a27b10 <line:148:5, col:70> col:23 assign 'Vector<int> &(Vector::size_type, Vector<int>::value_argument_type)' inline
| |-ParmVarDecl 0x55c810a27958 <col:30, col:40> col:40 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55c810a279d0 <col:43, col:69> col:63 v 'Vector<int>::value_argument_type':'int'
|-CXXMethodDecl 0x55c810a27c38 <line:150:5, col:55> col:49 begin 'Vector<int>::iterator ()'
| |-NoInlineAttr 0x55c810a27d18 <col:20> Inherited
| `-OptimizeNoneAttr 0x55c810a27d70 <col:30> Inherited
|-CXXMethodDecl 0x55c810a27db8 <line:151:5, col:53> col:49 end 'Vector<int>::iterator ()'
| |-NoInlineAttr 0x55c810a27e68 <col:20> Inherited
| `-OptimizeNoneAttr 0x55c810a27ec0 <col:30> Inherited
|-CXXMethodDecl 0x55c810a27f88 <line:152:5, col:63> col:55 begin 'Vector<int>::const_iterator () const'
| |-NoInlineAttr 0x55c810a28038 <col:20> Inherited
| `-OptimizeNoneAttr 0x55c810a28090 <col:30> Inherited
|-CXXMethodDecl 0x55c810a280d8 <line:153:5, col:61> col:55 end 'Vector<int>::const_iterator () const'
| |-NoInlineAttr 0x55c810a28188 <col:20> Inherited
| `-OptimizeNoneAttr 0x55c810a281e0 <col:30> Inherited
|-CXXMethodDecl 0x55c810a28228 <line:154:5, col:64> col:55 cbegin 'Vector<int>::const_iterator () const'
| |-NoInlineAttr 0x55c810a282d8 <col:20> Inherited
| `-OptimizeNoneAttr 0x55c810a28330 <col:30> Inherited
|-CXXMethodDecl 0x55c810a28378 <line:155:5, col:62> col:55 cend 'Vector<int>::const_iterator () const'
| |-NoInlineAttr 0x55c810a28428 <col:20> Inherited
| `-OptimizeNoneAttr 0x55c810a28480 <col:30> Inherited
|-CXXMethodDecl 0x55c810a284a8 <line:157:5, col:29> col:22 size 'Vector::size_type () const' inline
|-CXXMethodDecl 0x55c810a28558 <line:158:5, col:33> col:22 capacity 'Vector::size_type () const' inline
|-CXXMethodDecl 0x55c810a28608 <line:159:5, col:25> col:17 empty 'bool () const' inline
|-CXXMethodDecl 0x55c810a287c8 <line:160:5, col:64> col:17 resize 'void (Vector::size_type, Vector<int>::value_argument_type)' inline
| |-ParmVarDecl 0x55c810a286b8 <col:24, col:34> col:34 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55c810a28730 <col:37, col:63> col:57 v 'Vector<int>::value_argument_type':'int'
|-CXXMethodDecl 0x55c810a28918 <line:161:5, col:36> col:17 reserve 'bool (Vector::size_type)' inline
| `-ParmVarDecl 0x55c810a28888 <col:25, col:35> col:35 n 'Vector::size_type':'int'
|-CXXMethodDecl 0x55c810a28ac8 <line:163:5, col:65> col:43 used operator[] 'int &(Vector::size_type)'
| |-ParmVarDecl 0x55c810a289d0 <col:54, col:64> col:64 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x55c810a28b80 <col:20>
| `-OptimizeNoneAttr 0x55c810a28bd8 <col:30>
|-CXXMethodDecl 0x55c810a28cf8 <line:164:5, col:73> col:49 operator[] 'const int &(Vector::size_type) const'
| |-ParmVarDecl 0x55c810a28c00 <col:60, col:70> col:70 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x55c810a28db0 <col:20>
| `-OptimizeNoneAttr 0x55c810a28e08 <col:30>
|-CXXMethodDecl 0x55c810a28ec0 <line:165:5, col:29> col:15 at 'int &(Vector::size_type)' inline
| `-ParmVarDecl 0x55c810a28e30 <col:18, col:28> col:28 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55c810a2a5d0 <line:166:5, col:37> col:21 at 'const int &(Vector::size_type) const' inline
| `-ParmVarDecl 0x55c810a28f78 <col:24, col:34> col:34 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55c810a2a708 <line:167:5, col:21> col:15 front 'int &()' inline
|-CXXMethodDecl 0x55c810a2a838 <line:168:5, col:29> col:21 front 'const int &() const' inline
|-CXXMethodDecl 0x55c810a2a908 <line:169:5, col:20> col:15 back 'int &()' inline
|-CXXMethodDecl 0x55c810a2a9d8 <line:170:5, col:28> col:21 used back 'const int &() const' inline
|-CXXMethodDecl 0x55c810a2ab18 <line:172:5, col:39> col:15 unchecked_at 'int &(Vector::size_type)' inline
| `-ParmVarDecl 0x55c810a2aa88 <col:28, col:38> col:38 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55c810a2ac60 <line:173:5, col:47> col:21 unchecked_at 'const int &(Vector::size_type) const' inline
| `-ParmVarDecl 0x55c810a2abd0 <col:34, col:44> col:44 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55c810a2ada8 <line:174:5, col:59> col:15 at_u 'int &(Vector::size_type)' inline
| |-ParmVarDecl 0x55c810a2ad18 <col:20, col:30> col:30 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x55c810a2ae60 <col:48> Inherited "" ""
|-CXXMethodDecl 0x55c810a2af60 <line:175:5, col:71> col:21 at_u 'const int &(Vector::size_type) const' inline
| |-ParmVarDecl 0x55c810a2aed0 <col:26, col:36> col:36 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x55c810a2b018 <col:60> Inherited "" ""
|-CXXMethodDecl 0x55c810a2b0d8 <line:177:5, col:20> col:15 data 'int *()' inline
|-CXXMethodDecl 0x55c810a2b1d8 <line:178:5, col:28> col:21 data 'const int *() const' inline
|-CXXMethodDecl 0x55c810a2b358 <line:180:5, col:48> col:17 push_back 'void (Vector<int>::value_argument_type)' inline
| `-ParmVarDecl 0x55c810a2b298 <col:27, col:47> col:47 v 'Vector<int>::value_argument_type':'int'
|-FunctionTemplateDecl 0x55c810a2bb18 <line:182:5, line:183:63> col:48 push_back
| |-TemplateTypeParmDecl 0x55c810a2b410 <line:182:15, col:43> col:24 typename depth 0 index 0 A
| | `-TemplateArgument type 'fast_argument<int>':'fast_argument<int, false>'
| `-CXXMethodDecl 0x55c810a2ba78 <line:183:5, col:63> col:48 push_back 'typename A::enable_rvalue_reference (int &&)' inline
|   `-ParmVarDecl 0x55c810a2b978 <col:58, col:62> col:62 v 'int &&'
|-CXXMethodDecl 0x55c810a2bbf8 <line:185:5, col:26> col:17 pop_back 'void ()' inline
|-CXXMethodDecl 0x55c810a2bd48 <line:186:5, col:49> col:17 push_front 'void (Vector<int>::value_argument_type)' inline
| `-ParmVarDecl 0x55c810a2bcb8 <col:28, col:48> col:48 v 'Vector<int>::value_argument_type':'int'
|-CXXMethodDecl 0x55c810a2be00 <line:187:5, col:27> col:17 pop_front 'void ()' inline
|-CXXMethodDecl 0x55c810a2c048 <line:189:5, col:62> col:21 insert 'Vector<int>::iterator (Vector<int>::iterator, Vector<int>::value_argument_type)' inline
| |-ParmVarDecl 0x55c810a2bec0 <col:28, col:37> col:37 it 'Vector<int>::iterator':'int *'
| `-ParmVarDecl 0x55c810a2bf38 <col:41, col:61> col:61 v 'Vector<int>::value_argument_type':'int'
|-CXXMethodDecl 0x55c810a2c208 <line:190:5, col:38> col:21 erase 'Vector<int>::iterator (Vector<int>::iterator)' inline
| `-ParmVarDecl 0x55c810a2c118 <col:27, col:36> col:36 it 'Vector<int>::iterator':'int *'
|-CXXMethodDecl 0x55c810a2c458 <line:191:5, col:49> col:21 erase 'Vector<int>::iterator (Vector<int>::iterator, Vector<int>::iterator)' inline
| |-ParmVarDecl 0x55c810a2c2d0 <col:27, col:36> col:36 a 'Vector<int>::iterator':'int *'
| `-ParmVarDecl 0x55c810a2c348 <col:39, col:48> col:48 b 'Vector<int>::iterator':'int *'
|-CXXMethodDecl 0x55c810a2c518 <line:193:5, col:23> col:17 used clear 'void ()' inline
|-CXXMethodDecl 0x55c810a2c778 <line:195:5, col:34> col:17 swap 'void (Vector<int> &)' inline
| `-ParmVarDecl 0x55c810a2c680 <col:22, col:33> col:33 x 'Vector<int> &'
`-CXXDestructorDecl 0x55c810a2c848 <../dummy_inc/click/ipaddress.hh:13:29> col:29 implicit ~Vector 'void ()' inline default noexcept-unevaluated 0x55c810a2c848

Layout: <CGRecordLayout
  LLVMType:%class.Vector.5 = type { %class.vector_memory.3 }
  NonVirtualBaseLLVMType:%class.Vector.5 = type { %class.vector_memory.3 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x55c810b0e850 <../dummy_inc/click/router.hh:247:5, line:250:5> line:247:12 referenced struct element_landmark_t definition
|-DefinitionData aggregate standard_layout has_mutable_fields
| |-DefaultConstructor exists non_trivial needs_implicit
| |-CopyConstructor simple non_trivial has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveConstructor exists simple non_trivial needs_overload_resolution
| |-CopyAssignment non_trivial has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveAssignment exists simple non_trivial needs_overload_resolution
| `-Destructor simple non_trivial needs_overload_resolution
|-CXXRecordDecl 0x55c810b0e968 <col:5, col:12> col:12 implicit struct element_landmark_t
|-FieldDecl 0x55c810b0ea08 <line:248:9, col:18> col:18 first_landmarkid 'uint32_t':'unsigned int'
|-FieldDecl 0x55c810b0ea68 <line:249:9, col:16> col:16 filename 'String'
|-CXXConstructorDecl 0x55c810b0eb00 <line:247:12> col:12 implicit element_landmark_t 'void (const Router::element_landmark_t &)' inline default noexcept-unevaluated 0x55c810b0eb00
| `-ParmVarDecl 0x55c810b0ec18 <col:12> col:12 'const Router::element_landmark_t &'
|-CXXConstructorDecl 0x55c810b0ecb8 <col:12> col:12 implicit element_landmark_t 'void (Router::element_landmark_t &&)' inline default noexcept-unevaluated 0x55c810b0ecb8
| `-ParmVarDecl 0x55c810b0edc8 <col:12> col:12 'Router::element_landmark_t &&'
|-CXXMethodDecl 0x55c810b0ee68 <col:12> col:12 implicit operator= 'Router::element_landmark_t &(const Router::element_landmark_t &)' inline default noexcept-unevaluated 0x55c810b0ee68
| `-ParmVarDecl 0x55c810b0ef78 <col:12> col:12 'const Router::element_landmark_t &'
|-CXXMethodDecl 0x55c810b0efe8 <col:12> col:12 implicit operator= 'Router::element_landmark_t &(Router::element_landmark_t &&)' inline default noexcept-unevaluated 0x55c810b0efe8
| `-ParmVarDecl 0x55c810b0f0f8 <col:12> col:12 'Router::element_landmark_t &&'
`-CXXDestructorDecl 0x55c810b0f180 <col:12> col:12 implicit ~element_landmark_t 'void ()' inline default noexcept-unevaluated 0x55c810b0f180

Layout: <CGRecordLayout
  LLVMType:%"struct.Router::element_landmark_t" = type { i32, %class.String }
  NonVirtualBaseLLVMType:%"struct.Router::element_landmark_t" = type { i32, %class.String }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x55c810b10710 <../dummy_inc/click/vector.hh:11:1, line:71:1> line:11:30 class vector_memory definition
|-DefinitionData standard_layout has_user_declared_ctor can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor simple trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveConstructor
| |-CopyAssignment trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveAssignment
| `-Destructor non_trivial user_declared
|-TemplateArgument type 'typed_array_memory<Router::element_landmark_t>'
|-CXXRecordDecl 0x55c810b108e8 prev 0x55c810b10710 <col:24, col:30> col:30 implicit class vector_memory
|-AccessSpecDecl 0x55c810b10978 <col:46, col:52> col:46 public
|-TypedefDecl 0x55c810b109a0 <line:12:5, col:17> col:17 size_type 'int'
| `-BuiltinType 0x55c810317580 'int'
|-TypedefDecl 0x55c810b12360 <line:13:5, col:31> col:31 type 'typename typed_array_memory<element_landmark_t>::type':'Router::element_landmark_t'
| `-ElaboratedType 0x55c810b12310 'typename typed_array_memory<element_landmark_t>::type' sugar
|   `-TypedefType 0x55c810b122f0 'typed_array_memory<Router::element_landmark_t>::type' sugar
|     |-Typedef 0x55c810b10bb8 'type'
|     `-SubstTemplateTypeParmType 0x55c810b10b80 'Router::element_landmark_t' sugar
|       |-TemplateTypeParmType 0x55c810623c80 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55c810623c30 'T'
|       `-RecordType 0x55c810b0e8e0 'Router::element_landmark_t'
|         `-CXXRecord 0x55c810b0e850 'element_landmark_t'
|-TypedefDecl 0x55c810b12418 <line:14:5, col:19> col:19 iterator 'vector_memory<typed_array_memory<Router::element_landmark_t> >::type *'
| `-PointerType 0x55c810b123e0 'vector_memory<typed_array_memory<Router::element_landmark_t> >::type *'
|   `-TypedefType 0x55c810b123c0 'vector_memory<typed_array_memory<Router::element_landmark_t> >::type' sugar
|     |-Typedef 0x55c810b12360 'type'
|     `-ElaboratedType 0x55c810b12310 'typename typed_array_memory<element_landmark_t>::type' sugar
|       `-TypedefType 0x55c810b122f0 'typed_array_memory<Router::element_landmark_t>::type' sugar
|         |-Typedef 0x55c810b10bb8 'type'
|         `-SubstTemplateTypeParmType 0x55c810b10b80 'Router::element_landmark_t' sugar
|           |-TemplateTypeParmType 0x55c810623c80 'T' dependent depth 0 index 0
|           | `-TemplateTypeParm 0x55c810623c30 'T'
|           `-RecordType 0x55c810b0e8e0 'Router::element_landmark_t'
|             `-CXXRecord 0x55c810b0e850 'element_landmark_t'
|-CXXMethodDecl 0x55c810b12598 <line:15:5, line:18:5> line:15:17 need_argument_copy 'bool (const vector_memory<typed_array_memory<Router::element_landmark_t> >::type *) const' inline
| `-ParmVarDecl 0x55c810b124a8 <col:36, col:48> col:48 argp 'const vector_memory<typed_array_memory<Router::element_landmark_t> >::type *'
|-CXXConstructorDecl 0x55c810b12688 <line:20:5, line:22:5> line:20:5 vector_memory 'void ()'
|-CXXDestructorDecl 0x55c810b12768 <line:23:5, col:20> col:5 ~vector_memory 'void ()' noexcept-unevaluated 0x55c810b12768
|-CXXMethodDecl 0x55c810b12a38 <line:25:5, col:43> col:10 assign 'void (const vector_memory<typed_array_memory<Router::element_landmark_t> > &)'
| `-ParmVarDecl 0x55c810b12940 <col:17, col:42> col:42 x 'const vector_memory<typed_array_memory<Router::element_landmark_t> > &'
|-CXXMethodDecl 0x55c810b12c78 <line:26:5, col:44> col:10 assign 'void (vector_memory::size_type, const vector_memory<typed_array_memory<Router::element_landmark_t> >::type *)'
| |-ParmVarDecl 0x55c810b12af0 <col:17, col:27> col:27 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55c810b12b68 <col:30, col:42> col:42 vp 'const vector_memory<typed_array_memory<Router::element_landmark_t> >::type *'
|-CXXMethodDecl 0x55c810b12e48 <line:27:5, col:44> col:10 resize 'void (vector_memory::size_type, const vector_memory<typed_array_memory<Router::element_landmark_t> >::type *)'
| |-ParmVarDecl 0x55c810b12d38 <col:17, col:27> col:27 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55c810b12db0 <col:30, col:42> col:42 vp 'const vector_memory<typed_array_memory<Router::element_landmark_t> >::type *'
|-CXXMethodDecl 0x55c810b12fa8 <line:28:5, line:30:5> line:28:14 begin 'vector_memory<typed_array_memory<Router::element_landmark_t> >::iterator ()'
|-CXXMethodDecl 0x55c810b13078 <line:31:5, line:33:5> line:31:14 end 'vector_memory<typed_array_memory<Router::element_landmark_t> >::iterator ()'
|-CXXMethodDecl 0x55c810b150c8 <line:34:5, col:48> col:14 insert 'vector_memory<typed_array_memory<Router::element_landmark_t> >::iterator (vector_memory<typed_array_memory<Router::element_landmark_t> >::iterator, const vector_memory<typed_array_memory<Router::element_landmark_t> >::type *)'
| |-ParmVarDecl 0x55c810b14f40 <col:21, col:30> col:30 it 'vector_memory<typed_array_memory<Router::element_landmark_t> >::iterator':'vector_memory<typed_array_memory<Router::element_landmark_t> >::type *'
| `-ParmVarDecl 0x55c810b14fb8 <col:34, col:46> col:46 vp 'const vector_memory<typed_array_memory<Router::element_landmark_t> >::type *'
|-CXXMethodDecl 0x55c810b15328 <line:35:5, col:42> col:14 erase 'vector_memory<typed_array_memory<Router::element_landmark_t> >::iterator (vector_memory<typed_array_memory<Router::element_landmark_t> >::iterator, vector_memory<typed_array_memory<Router::element_landmark_t> >::iterator)'
| |-ParmVarDecl 0x55c810b15198 <col:20, col:29> col:29 a 'vector_memory<typed_array_memory<Router::element_landmark_t> >::iterator':'vector_memory<typed_array_memory<Router::element_landmark_t> >::type *'
| `-ParmVarDecl 0x55c810b15210 <col:32, col:41> col:41 b 'vector_memory<typed_array_memory<Router::element_landmark_t> >::iterator':'vector_memory<typed_array_memory<Router::element_landmark_t> >::type *'
|-CXXMethodDecl 0x55c810b154e8 <line:36:5, line:43:5> line:36:17 push_back 'void (const vector_memory<typed_array_memory<Router::element_landmark_t> >::type *)' inline
| `-ParmVarDecl 0x55c810b153f8 <col:27, col:39> col:39 vp 'const vector_memory<typed_array_memory<Router::element_landmark_t> >::type *'
|-CXXMethodDecl 0x55c810b156a8 <line:45:5, line:52:5> line:45:17 move_construct_back 'void (vector_memory<typed_array_memory<Router::element_landmark_t> >::type *)' inline
| `-ParmVarDecl 0x55c810b155b0 <col:37, col:43> col:43 vp 'vector_memory<typed_array_memory<Router::element_landmark_t> >::type *'
|-CXXMethodDecl 0x55c810b15760 <line:54:5, line:59:5> line:54:17 pop_back 'void ()' inline
|-CXXMethodDecl 0x55c810b15810 <line:60:5, line:64:5> line:60:17 clear 'void ()' inline
|-CXXMethodDecl 0x55c810b15a48 <line:65:5, col:59> col:10 reserve_and_push_back 'bool (vector_memory::size_type, const vector_memory<typed_array_memory<Router::element_landmark_t> >::type *)'
| |-ParmVarDecl 0x55c810b158c0 <col:32, col:42> col:42 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55c810b15938 <col:45, col:57> col:57 vp 'const vector_memory<typed_array_memory<Router::element_landmark_t> >::type *'
|-CXXMethodDecl 0x55c810b15ce8 <line:66:5, col:35> col:10 swap 'void (vector_memory<typed_array_memory<Router::element_landmark_t> > &)'
| `-ParmVarDecl 0x55c810b15bf0 <col:15, col:34> col:34 x 'vector_memory<typed_array_memory<Router::element_landmark_t> > &'
|-FieldDecl 0x55c810b15db0 <line:68:5, col:11> col:11 l_ 'vector_memory<typed_array_memory<Router::element_landmark_t> >::type *'
|-FieldDecl 0x55c810b15e00 <line:69:5, col:15> col:15 n_ 'vector_memory::size_type':'int'
`-FieldDecl 0x55c810b15e50 <line:70:5, col:15> col:15 capacity_ 'vector_memory::size_type':'int'

Layout: <CGRecordLayout
  LLVMType:%class.vector_memory.7 = type { %"struct.Router::element_landmark_t"*, i32, i32 }
  NonVirtualBaseLLVMType:%class.vector_memory.7 = type { %"struct.Router::element_landmark_t"*, i32, i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x55c810b0f270 <../dummy_inc/click/ipaddress.hh:13:1, col:29> ../dummy_inc/click/vector.hh:111:7 class Vector definition
|-DefinitionData standard_layout has_user_declared_ctor has_mutable_fields can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor non_trivial user_declared has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveConstructor exists non_trivial user_declared needs_overload_resolution
| |-CopyAssignment non_trivial has_const_param user_declared needs_overload_resolution implicit_has_const_param
| |-MoveAssignment exists non_trivial user_declared needs_overload_resolution
| `-Destructor simple non_trivial needs_overload_resolution
|-TemplateArgument type 'Router::element_landmark_t'
|-CXXRecordDecl 0x55c810b0f478 prev 0x55c810b0f270 <col:1, col:7> col:7 implicit class Vector
|-TypedefDecl 0x55c810b10680 <line:113:5, col:44> col:44 array_memory_type 'typename array_memory<element_landmark_t>::type':'typed_array_memory<Router::element_landmark_t>'
| `-ElaboratedType 0x55c810b10630 'typename array_memory<element_landmark_t>::type' sugar
|   `-TypedefType 0x55c810b10610 'conditional<false, sized_array_memory<32>, typed_array_memory<Router::element_landmark_t> >::type' sugar
|     |-Typedef 0x55c810b104c0 'type'
|     `-SubstTemplateTypeParmType 0x55c810b10350 'typed_array_memory<Router::element_landmark_t>' sugar
|       |-TemplateTypeParmType 0x55c8105fda80 'F' dependent depth 0 index 1
|       | `-TemplateTypeParm 0x55c8105fda28 'F'
|       `-RecordType 0x55c810b0ffb0 'typed_array_memory<Router::element_landmark_t>'
|         `-ClassTemplateSpecialization 0x55c810b0fed0 'typed_array_memory'
|-FieldDecl 0x55c810b15ea0 <line:114:5, col:46> col:46 vm_ 'vector_memory<Vector<Router::element_landmark_t>::array_memory_type>':'vector_memory<typed_array_memory<Router::element_landmark_t> >' mutable
|-AccessSpecDecl 0x55c810b15ef0 <line:116:3, col:9> col:3 public
|-TypedefDecl 0x55c810b15f28 <line:118:5, col:15> col:15 value_type 'Router::element_landmark_t':'Router::element_landmark_t'
| `-SubstTemplateTypeParmType 0x55c810b0f510 'Router::element_landmark_t' sugar
|   |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x55c8106333f8 'T'
|   `-RecordType 0x55c810b0e8e0 'Router::element_landmark_t'
|     `-CXXRecord 0x55c810b0e850 'element_landmark_t'
|-TypedefDecl 0x55c810b15fb8 <line:119:5, col:16> col:16 reference 'Router::element_landmark_t &'
| `-LValueReferenceType 0x55c810b15f80 'Router::element_landmark_t &'
|   `-SubstTemplateTypeParmType 0x55c810b0f510 'Router::element_landmark_t' sugar
|     |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55c8106333f8 'T'
|     `-RecordType 0x55c810b0e8e0 'Router::element_landmark_t'
|       `-CXXRecord 0x55c810b0e850 'element_landmark_t'
|-TypedefDecl 0x55c810b16048 <line:120:5, col:22> col:22 const_reference 'const Router::element_landmark_t &'
| `-LValueReferenceType 0x55c810b16010 'const Router::element_landmark_t &'
|   `-QualType 0x55c810b0f511 'const Router::element_landmark_t' const
|     `-SubstTemplateTypeParmType 0x55c810b0f510 'Router::element_landmark_t' sugar
|       |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55c8106333f8 'T'
|       `-RecordType 0x55c810b0e8e0 'Router::element_landmark_t'
|         `-CXXRecord 0x55c810b0e850 'element_landmark_t'
|-TypedefDecl 0x55c810b160d8 <line:121:5, col:16> col:16 pointer 'Router::element_landmark_t *'
| `-PointerType 0x55c810b160a0 'Router::element_landmark_t *'
|   `-SubstTemplateTypeParmType 0x55c810b0f510 'Router::element_landmark_t' sugar
|     |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55c8106333f8 'T'
|     `-RecordType 0x55c810b0e8e0 'Router::element_landmark_t'
|       `-CXXRecord 0x55c810b0e850 'element_landmark_t'
|-TypedefDecl 0x55c810b16168 <line:122:5, col:22> col:22 const_pointer 'const Router::element_landmark_t *'
| `-PointerType 0x55c810b16130 'const Router::element_landmark_t *'
|   `-QualType 0x55c810b0f511 'const Router::element_landmark_t' const
|     `-SubstTemplateTypeParmType 0x55c810b0f510 'Router::element_landmark_t' sugar
|       |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55c8106333f8 'T'
|       `-RecordType 0x55c810b0e8e0 'Router::element_landmark_t'
|         `-CXXRecord 0x55c810b0e850 'element_landmark_t'
|-TypedefDecl 0x55c810b16dc0 <line:125:5, col:45> col:45 value_argument_type 'typename fast_argument<element_landmark_t>::type':'const Router::element_landmark_t &'
| `-ElaboratedType 0x55c810b16d70 'typename fast_argument<element_landmark_t>::type' sugar
|   `-TypedefType 0x55c810b16d50 'fast_argument<Router::element_landmark_t, true>::type' sugar
|     |-Typedef 0x55c810b16c88 'type'
|     `-LValueReferenceType 0x55c810b16c50 'const Router::element_landmark_t &'
|       `-QualType 0x55c810b169f1 'const Router::element_landmark_t' const
|         `-SubstTemplateTypeParmType 0x55c810b169f0 'Router::element_landmark_t' sugar
|           |-TemplateTypeParmType 0x55c810604d60 'T' dependent depth 0 index 0
|           | `-TemplateTypeParm 0x55c810604d08 'T'
|           `-RecordType 0x55c810b0e8e0 'Router::element_landmark_t'
|             `-CXXRecord 0x55c810b0e850 'element_landmark_t'
|-TypedefDecl 0x55c810b16e28 <line:126:5, col:22> col:22 const_access_type 'const Router::element_landmark_t &'
| `-LValueReferenceType 0x55c810b16010 'const Router::element_landmark_t &'
|   `-QualType 0x55c810b0f511 'const Router::element_landmark_t' const
|     `-SubstTemplateTypeParmType 0x55c810b0f510 'Router::element_landmark_t' sugar
|       |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55c8106333f8 'T'
|       `-RecordType 0x55c810b0e8e0 'Router::element_landmark_t'
|         `-CXXRecord 0x55c810b0e850 'element_landmark_t'
|-TypedefDecl 0x55c810b16e80 <line:128:5, col:17> col:17 size_type 'int'
| `-BuiltinType 0x55c810317580 'int'
|-TypedefDecl 0x55c810b16ee8 <line:130:5, col:16> col:16 iterator 'Router::element_landmark_t *'
| `-PointerType 0x55c810b160a0 'Router::element_landmark_t *'
|   `-SubstTemplateTypeParmType 0x55c810b0f510 'Router::element_landmark_t' sugar
|     |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55c8106333f8 'T'
|     `-RecordType 0x55c810b0e8e0 'Router::element_landmark_t'
|       `-CXXRecord 0x55c810b0e850 'element_landmark_t'
|-TypedefDecl 0x55c810b16f50 <line:131:5, col:22> col:22 const_iterator 'const Router::element_landmark_t *'
| `-PointerType 0x55c810b16130 'const Router::element_landmark_t *'
|   `-QualType 0x55c810b0f511 'const Router::element_landmark_t' const
|     `-SubstTemplateTypeParmType 0x55c810b0f510 'Router::element_landmark_t' sugar
|       |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55c8106333f8 'T'
|       `-RecordType 0x55c810b0e8e0 'Router::element_landmark_t'
|         `-CXXRecord 0x55c810b0e850 'element_landmark_t'
|-EnumDecl 0x55c810b16fa8 <line:134:5> col:5
| `-EnumConstantDecl 0x55c810b170a0 <col:12, col:40> col:12 RESERVE_GROW 'Vector<Router::element_landmark_t>::(anonymous enum at ../dummy_inc/click/vector.hh:134:5)'
|   `-ConstantExpr 0x55c810b17080 <col:27, col:40> 'Vector::size_type':'int' Int: -1
|     `-CStyleCastExpr 0x55c810634618 <col:27, col:40> 'Vector::size_type':'int' <NoOp>
|       `-UnaryOperator 0x55c8106345f0 <col:39, col:40> 'int' prefix '-'
|         `-IntegerLiteral 0x55c8106345d0 <col:40> 'int' 1
|-CXXConstructorDecl 0x55c810b17128 <line:137:5, col:28> col:21 Vector 'void ()' inline
|-CXXConstructorDecl 0x55c810b173b8 <line:138:5, col:62> col:21 Vector 'void (Vector::size_type, Vector<Router::element_landmark_t>::value_argument_type)' inline
| |-ParmVarDecl 0x55c810b171e0 <col:28, col:38> col:38 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55c810b17280 <col:41, col:61> col:61 v 'Vector<Router::element_landmark_t>::value_argument_type':'const Router::element_landmark_t &'
|-CXXConstructorDecl 0x55c810b17678 <line:139:5, col:37> col:12 Vector 'void (const Vector<Router::element_landmark_t> &)' inline
| `-ParmVarDecl 0x55c810b17560 <col:19, col:36> col:36 x 'const Vector<Router::element_landmark_t> &'
|-CXXConstructorDecl 0x55c810b17938 <line:141:5, col:32> col:12 Vector 'void (Vector<Router::element_landmark_t> &&)' inline
| `-ParmVarDecl 0x55c810b17820 <col:19, col:31> col:31 x 'Vector<Router::element_landmark_t> &&'
|-CXXMethodDecl 0x55c810b17c80 <line:144:5, col:51> col:23 operator= 'Vector<Router::element_landmark_t> &(const Vector<Router::element_landmark_t> &)' inline
| `-ParmVarDecl 0x55c810b17b60 <col:33, col:50> col:50 x 'const Vector<Router::element_landmark_t> &'
|-CXXMethodDecl 0x55c810b17f90 <line:146:5, col:46> col:23 operator= 'Vector<Router::element_landmark_t> &(Vector<Router::element_landmark_t> &&)' inline
| `-ParmVarDecl 0x55c810b17e70 <col:33, col:45> col:45 x 'Vector<Router::element_landmark_t> &&'
|-CXXMethodDecl 0x55c810b18280 <line:148:5, col:70> col:23 assign 'Vector<Router::element_landmark_t> &(Vector::size_type, Vector<Router::element_landmark_t>::value_argument_type)' inline
| |-ParmVarDecl 0x55c810b180c8 <col:30, col:40> col:40 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55c810b18140 <col:43, col:69> col:63 v 'Vector<Router::element_landmark_t>::value_argument_type':'const Router::element_landmark_t &'
|-CXXMethodDecl 0x55c810b183a8 <line:150:5, col:55> col:49 begin 'Vector<Router::element_landmark_t>::iterator ()'
| |-NoInlineAttr 0x55c810b18488 <col:20> Inherited
| `-OptimizeNoneAttr 0x55c810b184e0 <col:30> Inherited
|-CXXMethodDecl 0x55c810b18528 <line:151:5, col:53> col:49 end 'Vector<Router::element_landmark_t>::iterator ()'
| |-NoInlineAttr 0x55c810b185d8 <col:20> Inherited
| `-OptimizeNoneAttr 0x55c810b18630 <col:30> Inherited
|-CXXMethodDecl 0x55c810b186f8 <line:152:5, col:63> col:55 begin 'Vector<Router::element_landmark_t>::const_iterator () const'
| |-NoInlineAttr 0x55c810b187a8 <col:20> Inherited
| `-OptimizeNoneAttr 0x55c810b18800 <col:30> Inherited
|-CXXMethodDecl 0x55c810b18848 <line:153:5, col:61> col:55 end 'Vector<Router::element_landmark_t>::const_iterator () const'
| |-NoInlineAttr 0x55c810b188f8 <col:20> Inherited
| `-OptimizeNoneAttr 0x55c810b18950 <col:30> Inherited
|-CXXMethodDecl 0x55c810b18998 <line:154:5, col:64> col:55 cbegin 'Vector<Router::element_landmark_t>::const_iterator () const'
| |-NoInlineAttr 0x55c810b18a48 <col:20> Inherited
| `-OptimizeNoneAttr 0x55c810b18aa0 <col:30> Inherited
|-CXXMethodDecl 0x55c810b18ae8 <line:155:5, col:62> col:55 cend 'Vector<Router::element_landmark_t>::const_iterator () const'
| |-NoInlineAttr 0x55c810b18b98 <col:20> Inherited
| `-OptimizeNoneAttr 0x55c810b18bf0 <col:30> Inherited
|-CXXMethodDecl 0x55c810b18c18 <line:157:5, col:29> col:22 size 'Vector::size_type () const' inline
|-CXXMethodDecl 0x55c810b18cc8 <line:158:5, col:33> col:22 capacity 'Vector::size_type () const' inline
|-CXXMethodDecl 0x55c810b18d78 <line:159:5, col:25> col:17 empty 'bool () const' inline
|-CXXMethodDecl 0x55c810b18f38 <line:160:5, col:64> col:17 resize 'void (Vector::size_type, Vector<Router::element_landmark_t>::value_argument_type)' inline
| |-ParmVarDecl 0x55c810b18e28 <col:24, col:34> col:34 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55c810b18ea0 <col:37, col:63> col:57 v 'Vector<Router::element_landmark_t>::value_argument_type':'const Router::element_landmark_t &'
|-CXXMethodDecl 0x55c810b19088 <line:161:5, col:36> col:17 reserve 'bool (Vector::size_type)' inline
| `-ParmVarDecl 0x55c810b18ff8 <col:25, col:35> col:35 n 'Vector::size_type':'int'
|-CXXMethodDecl 0x55c810b19238 <line:163:5, col:65> col:43 operator[] 'Router::element_landmark_t &(Vector::size_type)'
| |-ParmVarDecl 0x55c810b19140 <col:54, col:64> col:64 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x55c810b192f0 <col:20>
| `-OptimizeNoneAttr 0x55c810b19348 <col:30>
|-CXXMethodDecl 0x55c810b19468 <line:164:5, col:73> col:49 operator[] 'const Router::element_landmark_t &(Vector::size_type) const'
| |-ParmVarDecl 0x55c810b19370 <col:60, col:70> col:70 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x55c810b19520 <col:20>
| `-OptimizeNoneAttr 0x55c810b19578 <col:30>
|-CXXMethodDecl 0x55c810b19630 <line:165:5, col:29> col:15 at 'Router::element_landmark_t &(Vector::size_type)' inline
| `-ParmVarDecl 0x55c810b195a0 <col:18, col:28> col:28 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55c810b19778 <line:166:5, col:37> col:21 at 'const Router::element_landmark_t &(Vector::size_type) const' inline
| `-ParmVarDecl 0x55c810b196e8 <col:24, col:34> col:34 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55c810b198a8 <line:167:5, col:21> col:15 front 'Router::element_landmark_t &()' inline
|-CXXMethodDecl 0x55c810b199d8 <line:168:5, col:29> col:21 front 'const Router::element_landmark_t &() const' inline
|-CXXMethodDecl 0x55c810b19aa8 <line:169:5, col:20> col:15 back 'Router::element_landmark_t &()' inline
|-CXXMethodDecl 0x55c810b19b78 <line:170:5, col:28> col:21 back 'const Router::element_landmark_t &() const' inline
|-CXXMethodDecl 0x55c810b19cb8 <line:172:5, col:39> col:15 unchecked_at 'Router::element_landmark_t &(Vector::size_type)' inline
| `-ParmVarDecl 0x55c810b19c28 <col:28, col:38> col:38 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55c810b19e00 <line:173:5, col:47> col:21 unchecked_at 'const Router::element_landmark_t &(Vector::size_type) const' inline
| `-ParmVarDecl 0x55c810b19d70 <col:34, col:44> col:44 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55c810b19f48 <line:174:5, col:59> col:15 at_u 'Router::element_landmark_t &(Vector::size_type)' inline
| |-ParmVarDecl 0x55c810b19eb8 <col:20, col:30> col:30 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x55c810b1a000 <col:48> Inherited "" ""
|-CXXMethodDecl 0x55c810b1a100 <line:175:5, col:71> col:21 at_u 'const Router::element_landmark_t &(Vector::size_type) const' inline
| |-ParmVarDecl 0x55c810b1a070 <col:26, col:36> col:36 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x55c810b1a1b8 <col:60> Inherited "" ""
|-CXXMethodDecl 0x55c810b1a278 <line:177:5, col:20> col:15 data 'Router::element_landmark_t *()' inline
|-CXXMethodDecl 0x55c810b1a378 <line:178:5, col:28> col:21 data 'const Router::element_landmark_t *() const' inline
|-CXXMethodDecl 0x55c810b1a4f8 <line:180:5, col:48> col:17 push_back 'void (Vector<Router::element_landmark_t>::value_argument_type)' inline
| `-ParmVarDecl 0x55c810b1a438 <col:27, col:47> col:47 v 'Vector<Router::element_landmark_t>::value_argument_type':'const Router::element_landmark_t &'
|-FunctionTemplateDecl 0x55c810b1ac88 <line:182:5, line:183:63> col:48 push_back
| |-TemplateTypeParmDecl 0x55c810b1a5b0 <line:182:15, col:43> col:24 typename depth 0 index 0 A
| | `-TemplateArgument type 'fast_argument<Router::element_landmark_t>':'fast_argument<Router::element_landmark_t, true>'
| `-CXXMethodDecl 0x55c810b1abe8 <line:183:5, col:63> col:48 push_back 'typename A::enable_rvalue_reference (Router::element_landmark_t &&)' inline
|   `-ParmVarDecl 0x55c810b1aae8 <col:58, col:62> col:62 v 'Router::element_landmark_t &&'
|-CXXMethodDecl 0x55c810b1ad68 <line:185:5, col:26> col:17 pop_back 'void ()' inline
|-CXXMethodDecl 0x55c810b1aeb8 <line:186:5, col:49> col:17 push_front 'void (Vector<Router::element_landmark_t>::value_argument_type)' inline
| `-ParmVarDecl 0x55c810b1ae28 <col:28, col:48> col:48 v 'Vector<Router::element_landmark_t>::value_argument_type':'const Router::element_landmark_t &'
|-CXXMethodDecl 0x55c810b1af70 <line:187:5, col:27> col:17 pop_front 'void ()' inline
|-CXXMethodDecl 0x55c810b1b1b8 <line:189:5, col:62> col:21 insert 'Vector<Router::element_landmark_t>::iterator (Vector<Router::element_landmark_t>::iterator, Vector<Router::element_landmark_t>::value_argument_type)' inline
| |-ParmVarDecl 0x55c810b1b030 <col:28, col:37> col:37 it 'Vector<Router::element_landmark_t>::iterator':'Router::element_landmark_t *'
| `-ParmVarDecl 0x55c810b1b0a8 <col:41, col:61> col:61 v 'Vector<Router::element_landmark_t>::value_argument_type':'const Router::element_landmark_t &'
|-CXXMethodDecl 0x55c810b1b348 <line:190:5, col:38> col:21 erase 'Vector<Router::element_landmark_t>::iterator (Vector<Router::element_landmark_t>::iterator)' inline
| `-ParmVarDecl 0x55c810b1b288 <col:27, col:36> col:36 it 'Vector<Router::element_landmark_t>::iterator':'Router::element_landmark_t *'
|-CXXMethodDecl 0x55c810b1b558 <line:191:5, col:49> col:21 erase 'Vector<Router::element_landmark_t>::iterator (Vector<Router::element_landmark_t>::iterator, Vector<Router::element_landmark_t>::iterator)' inline
| |-ParmVarDecl 0x55c810b1b410 <col:27, col:36> col:36 a 'Vector<Router::element_landmark_t>::iterator':'Router::element_landmark_t *'
| `-ParmVarDecl 0x55c810b1b488 <col:39, col:48> col:48 b 'Vector<Router::element_landmark_t>::iterator':'Router::element_landmark_t *'
|-CXXMethodDecl 0x55c810b1b618 <line:193:5, col:23> col:17 clear 'void ()' inline
|-CXXMethodDecl 0x55c810b1b878 <line:195:5, col:34> col:17 swap 'void (Vector<Router::element_landmark_t> &)' inline
| `-ParmVarDecl 0x55c810b1b780 <col:22, col:33> col:33 x 'Vector<Router::element_landmark_t> &'
`-CXXDestructorDecl 0x55c810b1b948 <../dummy_inc/click/ipaddress.hh:13:29> col:29 implicit ~Vector 'void ()' inline default noexcept-unevaluated 0x55c810b1b948

Layout: <CGRecordLayout
  LLVMType:%class.Vector.6 = type { %class.vector_memory.7 }
  NonVirtualBaseLLVMType:%class.Vector.6 = type { %class.vector_memory.7 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x55c810a938d0 <../dummy_inc/click/vector.hh:11:1, line:71:1> line:11:30 class vector_memory definition
|-DefinitionData standard_layout has_user_declared_ctor can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor simple trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveConstructor
| |-CopyAssignment trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveAssignment
| `-Destructor non_trivial user_declared
|-TemplateArgument type 'sized_array_memory<16>'
|-CXXRecordDecl 0x55c810a93aa8 prev 0x55c810a938d0 <col:24, col:30> col:30 implicit class vector_memory
|-AccessSpecDecl 0x55c810a93b38 <col:46, col:52> col:46 public
|-TypedefDecl 0x55c810a93b60 <line:12:5, col:17> col:17 size_type 'int'
| `-BuiltinType 0x55c810317580 'int'
|-TypedefDecl 0x55c810a95730 <line:13:5, col:31> col:31 type 'typename sized_array_memory<16>::type':'char_array<16>'
| `-ElaboratedType 0x55c810a956e0 'typename sized_array_memory<16>::type' sugar
|   `-TypedefType 0x55c810a94010 'sized_array_memory<16>::type' sugar
|     |-Typedef 0x55c810a93f10 'type'
|     `-TemplateSpecializationType 0x55c810a93ea0 'char_array<16UL>' sugar char_array
|       |-TemplateArgument expr
|       | `-ConstantExpr 0x55c810a93d80 <../dummy_inc/click/array_memory.hh:11:24> 'unsigned long' Int: 16
|       |   `-SubstNonTypeTemplateParmExpr 0x55c810a93d60 <col:24> 'unsigned long'
|       |     `-IntegerLiteral 0x55c810a93d40 <col:24> 'unsigned long' 16
|       `-RecordType 0x55c810a93e80 'char_array<16>'
|         `-ClassTemplateSpecialization 0x55c810a93da0 'char_array'
|-TypedefDecl 0x55c810a957e8 <../dummy_inc/click/vector.hh:14:5, col:19> col:19 iterator 'vector_memory<sized_array_memory<16> >::type *'
| `-PointerType 0x55c810a957b0 'vector_memory<sized_array_memory<16> >::type *'
|   `-TypedefType 0x55c810a95790 'vector_memory<sized_array_memory<16> >::type' sugar
|     |-Typedef 0x55c810a95730 'type'
|     `-ElaboratedType 0x55c810a956e0 'typename sized_array_memory<16>::type' sugar
|       `-TypedefType 0x55c810a94010 'sized_array_memory<16>::type' sugar
|         |-Typedef 0x55c810a93f10 'type'
|         `-TemplateSpecializationType 0x55c810a93ea0 'char_array<16UL>' sugar char_array
|           |-TemplateArgument expr
|           | `-ConstantExpr 0x55c810a93d80 <../dummy_inc/click/array_memory.hh:11:24> 'unsigned long' Int: 16
|           |   `-SubstNonTypeTemplateParmExpr 0x55c810a93d60 <col:24> 'unsigned long'
|           |     `-IntegerLiteral 0x55c810a93d40 <col:24> 'unsigned long' 16
|           `-RecordType 0x55c810a93e80 'char_array<16>'
|             `-ClassTemplateSpecialization 0x55c810a93da0 'char_array'
|-CXXMethodDecl 0x55c810a95968 <../dummy_inc/click/vector.hh:15:5, line:18:5> line:15:17 need_argument_copy 'bool (const vector_memory<sized_array_memory<16> >::type *) const' inline
| `-ParmVarDecl 0x55c810a95878 <col:36, col:48> col:48 argp 'const vector_memory<sized_array_memory<16> >::type *'
|-CXXConstructorDecl 0x55c810a95a58 <line:20:5, line:22:5> line:20:5 vector_memory 'void ()'
|-CXXDestructorDecl 0x55c810a95b38 <line:23:5, col:20> col:5 ~vector_memory 'void ()' noexcept-unevaluated 0x55c810a95b38
|-CXXMethodDecl 0x55c810a95e08 <line:25:5, col:43> col:10 assign 'void (const vector_memory<sized_array_memory<16> > &)'
| `-ParmVarDecl 0x55c810a95d10 <col:17, col:42> col:42 x 'const vector_memory<sized_array_memory<16> > &'
|-CXXMethodDecl 0x55c810a96048 <line:26:5, col:44> col:10 assign 'void (vector_memory::size_type, const vector_memory<sized_array_memory<16> >::type *)'
| |-ParmVarDecl 0x55c810a95ec0 <col:17, col:27> col:27 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55c810a95f38 <col:30, col:42> col:42 vp 'const vector_memory<sized_array_memory<16> >::type *'
|-CXXMethodDecl 0x55c810a96218 <line:27:5, col:44> col:10 resize 'void (vector_memory::size_type, const vector_memory<sized_array_memory<16> >::type *)'
| |-ParmVarDecl 0x55c810a96108 <col:17, col:27> col:27 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55c810a96180 <col:30, col:42> col:42 vp 'const vector_memory<sized_array_memory<16> >::type *'
|-CXXMethodDecl 0x55c810a96378 <line:28:5, line:30:5> line:28:14 begin 'vector_memory<sized_array_memory<16> >::iterator ()'
|-CXXMethodDecl 0x55c810a96448 <line:31:5, line:33:5> line:31:14 end 'vector_memory<sized_array_memory<16> >::iterator ()'
|-CXXMethodDecl 0x55c810a96698 <line:34:5, col:48> col:14 insert 'vector_memory<sized_array_memory<16> >::iterator (vector_memory<sized_array_memory<16> >::iterator, const vector_memory<sized_array_memory<16> >::type *)'
| |-ParmVarDecl 0x55c810a96508 <col:21, col:30> col:30 it 'vector_memory<sized_array_memory<16> >::iterator':'vector_memory<sized_array_memory<16> >::type *'
| `-ParmVarDecl 0x55c810a96580 <col:34, col:46> col:46 vp 'const vector_memory<sized_array_memory<16> >::type *'
|-CXXMethodDecl 0x55c810a968f8 <line:35:5, col:42> col:14 erase 'vector_memory<sized_array_memory<16> >::iterator (vector_memory<sized_array_memory<16> >::iterator, vector_memory<sized_array_memory<16> >::iterator)'
| |-ParmVarDecl 0x55c810a96768 <col:20, col:29> col:29 a 'vector_memory<sized_array_memory<16> >::iterator':'vector_memory<sized_array_memory<16> >::type *'
| `-ParmVarDecl 0x55c810a967e0 <col:32, col:41> col:41 b 'vector_memory<sized_array_memory<16> >::iterator':'vector_memory<sized_array_memory<16> >::type *'
|-CXXMethodDecl 0x55c810a96ab8 <line:36:5, line:43:5> line:36:17 push_back 'void (const vector_memory<sized_array_memory<16> >::type *)' inline
| `-ParmVarDecl 0x55c810a969c8 <col:27, col:39> col:39 vp 'const vector_memory<sized_array_memory<16> >::type *'
|-CXXMethodDecl 0x55c810a96c78 <line:45:5, line:52:5> line:45:17 move_construct_back 'void (vector_memory<sized_array_memory<16> >::type *)' inline
| `-ParmVarDecl 0x55c810a96b80 <col:37, col:43> col:43 vp 'vector_memory<sized_array_memory<16> >::type *'
|-CXXMethodDecl 0x55c810a96d30 <line:54:5, line:59:5> line:54:17 pop_back 'void ()' inline
|-CXXMethodDecl 0x55c810a96de0 <line:60:5, line:64:5> line:60:17 clear 'void ()' inline
|-CXXMethodDecl 0x55c810a97018 <line:65:5, col:59> col:10 reserve_and_push_back 'bool (vector_memory::size_type, const vector_memory<sized_array_memory<16> >::type *)'
| |-ParmVarDecl 0x55c810a96e90 <col:32, col:42> col:42 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55c810a96f08 <col:45, col:57> col:57 vp 'const vector_memory<sized_array_memory<16> >::type *'
|-CXXMethodDecl 0x55c810a972b8 <line:66:5, col:35> col:10 swap 'void (vector_memory<sized_array_memory<16> > &)'
| `-ParmVarDecl 0x55c810a971c0 <col:15, col:34> col:34 x 'vector_memory<sized_array_memory<16> > &'
|-FieldDecl 0x55c810a97380 <line:68:5, col:11> col:11 l_ 'vector_memory<sized_array_memory<16> >::type *'
|-FieldDecl 0x55c810a973d0 <line:69:5, col:15> col:15 n_ 'vector_memory::size_type':'int'
`-FieldDecl 0x55c810a97420 <line:70:5, col:15> col:15 capacity_ 'vector_memory::size_type':'int'

Layout: <CGRecordLayout
  LLVMType:%class.vector_memory.9 = type { %struct.char_array.10*, i32, i32 }
  NonVirtualBaseLLVMType:%class.vector_memory.9 = type { %struct.char_array.10*, i32, i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x55c810b1c060 <../dummy_inc/click/ipaddress.hh:13:1, col:29> ../dummy_inc/click/vector.hh:111:7 class Vector definition
|-DefinitionData standard_layout has_user_declared_ctor has_mutable_fields can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor non_trivial user_declared has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveConstructor exists non_trivial user_declared needs_overload_resolution
| |-CopyAssignment non_trivial has_const_param user_declared needs_overload_resolution implicit_has_const_param
| |-MoveAssignment exists non_trivial user_declared needs_overload_resolution
| `-Destructor simple non_trivial needs_overload_resolution
|-TemplateArgument type 'Router::Connection'
|-CXXRecordDecl 0x55c810b1c268 prev 0x55c810b1c060 <col:1, col:7> col:7 implicit class Vector
|-TypedefDecl 0x55c810b21440 <line:113:5, col:44> col:44 array_memory_type 'typename array_memory<Connection>::type':'sized_array_memory<16>'
| `-ElaboratedType 0x55c810b213f0 'typename array_memory<Connection>::type' sugar
|   `-TypedefType 0x55c810b213d0 'conditional<true, sized_array_memory<16>, typed_array_memory<Router::Connection> >::type' sugar
|     |-Typedef 0x55c810b21280 'type'
|     `-SubstTemplateTypeParmType 0x55c810a934a0 'sized_array_memory<16>' sugar
|       |-TemplateTypeParmType 0x55c8105fd290 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55c8105fd238 'T'
|       `-RecordType 0x55c810a92ff0 'sized_array_memory<16>'
|         `-ClassTemplateSpecialization 0x55c810a92f08 'sized_array_memory'
|-FieldDecl 0x55c810b21540 <line:114:5, col:46> col:46 vm_ 'vector_memory<Vector<Router::Connection>::array_memory_type>':'vector_memory<sized_array_memory<16> >' mutable
|-AccessSpecDecl 0x55c810b21590 <line:116:3, col:9> col:3 public
|-TypedefDecl 0x55c810b215c8 <line:118:5, col:15> col:15 value_type 'Router::Connection':'Router::Connection'
| `-SubstTemplateTypeParmType 0x55c810b1c300 'Router::Connection' sugar
|   |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x55c8106333f8 'T'
|   `-RecordType 0x55c810af6790 'Router::Connection'
|     `-CXXRecord 0x55c810af6700 'Connection'
|-TypedefDecl 0x55c810b21688 <line:119:5, col:16> col:16 reference 'Router::Connection &'
| `-LValueReferenceType 0x55c810b21650 'Router::Connection &'
|   `-SubstTemplateTypeParmType 0x55c810b1c300 'Router::Connection' sugar
|     |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55c8106333f8 'T'
|     `-RecordType 0x55c810af6790 'Router::Connection'
|       `-CXXRecord 0x55c810af6700 'Connection'
|-TypedefDecl 0x55c810b21718 <line:120:5, col:22> col:22 const_reference 'const Router::Connection &'
| `-LValueReferenceType 0x55c810b216e0 'const Router::Connection &'
|   `-QualType 0x55c810b1c301 'const Router::Connection' const
|     `-SubstTemplateTypeParmType 0x55c810b1c300 'Router::Connection' sugar
|       |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55c8106333f8 'T'
|       `-RecordType 0x55c810af6790 'Router::Connection'
|         `-CXXRecord 0x55c810af6700 'Connection'
|-TypedefDecl 0x55c810b217a8 <line:121:5, col:16> col:16 pointer 'Router::Connection *'
| `-PointerType 0x55c810b21770 'Router::Connection *'
|   `-SubstTemplateTypeParmType 0x55c810b1c300 'Router::Connection' sugar
|     |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55c8106333f8 'T'
|     `-RecordType 0x55c810af6790 'Router::Connection'
|       `-CXXRecord 0x55c810af6700 'Connection'
|-TypedefDecl 0x55c810b21838 <line:122:5, col:22> col:22 const_pointer 'const Router::Connection *'
| `-PointerType 0x55c810b21800 'const Router::Connection *'
|   `-QualType 0x55c810b1c301 'const Router::Connection' const
|     `-SubstTemplateTypeParmType 0x55c810b1c300 'Router::Connection' sugar
|       |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55c8106333f8 'T'
|       `-RecordType 0x55c810af6790 'Router::Connection'
|         `-CXXRecord 0x55c810af6700 'Connection'
|-TypedefDecl 0x55c810b22490 <line:125:5, col:45> col:45 value_argument_type 'typename fast_argument<Connection>::type':'const Router::Connection &'
| `-ElaboratedType 0x55c810b22440 'typename fast_argument<Connection>::type' sugar
|   `-TypedefType 0x55c810b22420 'fast_argument<Router::Connection, true>::type' sugar
|     |-Typedef 0x55c810b22358 'type'
|     `-LValueReferenceType 0x55c810b22320 'const Router::Connection &'
|       `-QualType 0x55c810b220c1 'const Router::Connection' const
|         `-SubstTemplateTypeParmType 0x55c810b220c0 'Router::Connection' sugar
|           |-TemplateTypeParmType 0x55c810604d60 'T' dependent depth 0 index 0
|           | `-TemplateTypeParm 0x55c810604d08 'T'
|           `-RecordType 0x55c810af6790 'Router::Connection'
|             `-CXXRecord 0x55c810af6700 'Connection'
|-TypedefDecl 0x55c810b224f8 <line:126:5, col:22> col:22 const_access_type 'const Router::Connection &'
| `-LValueReferenceType 0x55c810b216e0 'const Router::Connection &'
|   `-QualType 0x55c810b1c301 'const Router::Connection' const
|     `-SubstTemplateTypeParmType 0x55c810b1c300 'Router::Connection' sugar
|       |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55c8106333f8 'T'
|       `-RecordType 0x55c810af6790 'Router::Connection'
|         `-CXXRecord 0x55c810af6700 'Connection'
|-TypedefDecl 0x55c810b22550 <line:128:5, col:17> col:17 size_type 'int'
| `-BuiltinType 0x55c810317580 'int'
|-TypedefDecl 0x55c810b225b8 <line:130:5, col:16> col:16 iterator 'Router::Connection *'
| `-PointerType 0x55c810b21770 'Router::Connection *'
|   `-SubstTemplateTypeParmType 0x55c810b1c300 'Router::Connection' sugar
|     |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55c8106333f8 'T'
|     `-RecordType 0x55c810af6790 'Router::Connection'
|       `-CXXRecord 0x55c810af6700 'Connection'
|-TypedefDecl 0x55c810b22620 <line:131:5, col:22> col:22 const_iterator 'const Router::Connection *'
| `-PointerType 0x55c810b21800 'const Router::Connection *'
|   `-QualType 0x55c810b1c301 'const Router::Connection' const
|     `-SubstTemplateTypeParmType 0x55c810b1c300 'Router::Connection' sugar
|       |-TemplateTypeParmType 0x55c810633450 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55c8106333f8 'T'
|       `-RecordType 0x55c810af6790 'Router::Connection'
|         `-CXXRecord 0x55c810af6700 'Connection'
|-EnumDecl 0x55c810b22678 <line:134:5> col:5
| `-EnumConstantDecl 0x55c810b22770 <col:12, col:40> col:12 RESERVE_GROW 'Vector<Router::Connection>::(anonymous enum at ../dummy_inc/click/vector.hh:134:5)'
|   `-ConstantExpr 0x55c810b22750 <col:27, col:40> 'Vector::size_type':'int' Int: -1
|     `-CStyleCastExpr 0x55c810634618 <col:27, col:40> 'Vector::size_type':'int' <NoOp>
|       `-UnaryOperator 0x55c8106345f0 <col:39, col:40> 'int' prefix '-'
|         `-IntegerLiteral 0x55c8106345d0 <col:40> 'int' 1
|-CXXConstructorDecl 0x55c810b227f8 <line:137:5, col:28> col:21 Vector 'void ()' inline
|-CXXConstructorDecl 0x55c810b22a88 <line:138:5, col:62> col:21 Vector 'void (Vector::size_type, Vector<Router::Connection>::value_argument_type)' inline
| |-ParmVarDecl 0x55c810b228b0 <col:28, col:38> col:38 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55c810b22950 <col:41, col:61> col:61 v 'Vector<Router::Connection>::value_argument_type':'const Router::Connection &'
|-CXXConstructorDecl 0x55c810b22d48 <line:139:5, col:37> col:12 Vector 'void (const Vector<Router::Connection> &)' inline
| `-ParmVarDecl 0x55c810b22c30 <col:19, col:36> col:36 x 'const Vector<Router::Connection> &'
|-CXXConstructorDecl 0x55c810b23008 <line:141:5, col:32> col:12 Vector 'void (Vector<Router::Connection> &&)' inline
| `-ParmVarDecl 0x55c810b22ef0 <col:19, col:31> col:31 x 'Vector<Router::Connection> &&'
|-CXXMethodDecl 0x55c810b23350 <line:144:5, col:51> col:23 operator= 'Vector<Router::Connection> &(const Vector<Router::Connection> &)' inline
| `-ParmVarDecl 0x55c810b23230 <col:33, col:50> col:50 x 'const Vector<Router::Connection> &'
|-CXXMethodDecl 0x55c810b23660 <line:146:5, col:46> col:23 operator= 'Vector<Router::Connection> &(Vector<Router::Connection> &&)' inline
| `-ParmVarDecl 0x55c810b23540 <col:33, col:45> col:45 x 'Vector<Router::Connection> &&'
|-CXXMethodDecl 0x55c810b23950 <line:148:5, col:70> col:23 assign 'Vector<Router::Connection> &(Vector::size_type, Vector<Router::Connection>::value_argument_type)' inline
| |-ParmVarDecl 0x55c810b23798 <col:30, col:40> col:40 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55c810b23810 <col:43, col:69> col:63 v 'Vector<Router::Connection>::value_argument_type':'const Router::Connection &'
|-CXXMethodDecl 0x55c810b23aa8 <line:150:5, col:55> col:49 begin 'Vector<Router::Connection>::iterator ()'
| |-NoInlineAttr 0x55c810b23b88 <col:20> Inherited
| `-OptimizeNoneAttr 0x55c810b23be0 <col:30> Inherited
|-CXXMethodDecl 0x55c810b23c28 <line:151:5, col:53> col:49 end 'Vector<Router::Connection>::iterator ()'
| |-NoInlineAttr 0x55c810b23cd8 <col:20> Inherited
| `-OptimizeNoneAttr 0x55c810b23d30 <col:30> Inherited
|-CXXMethodDecl 0x55c810b23df8 <line:152:5, col:63> col:55 begin 'Vector<Router::Connection>::const_iterator () const'
| |-NoInlineAttr 0x55c810b23ea8 <col:20> Inherited
| `-OptimizeNoneAttr 0x55c810b23f00 <col:30> Inherited
|-CXXMethodDecl 0x55c810b23f48 <line:153:5, col:61> col:55 end 'Vector<Router::Connection>::const_iterator () const'
| |-NoInlineAttr 0x55c810b23ff8 <col:20> Inherited
| `-OptimizeNoneAttr 0x55c810b24050 <col:30> Inherited
|-CXXMethodDecl 0x55c810b24098 <line:154:5, col:64> col:55 cbegin 'Vector<Router::Connection>::const_iterator () const'
| |-NoInlineAttr 0x55c810b24148 <col:20> Inherited
| `-OptimizeNoneAttr 0x55c810b241a0 <col:30> Inherited
|-CXXMethodDecl 0x55c810b241e8 <line:155:5, col:62> col:55 cend 'Vector<Router::Connection>::const_iterator () const'
| |-NoInlineAttr 0x55c810b24298 <col:20> Inherited
| `-OptimizeNoneAttr 0x55c810b242f0 <col:30> Inherited
|-CXXMethodDecl 0x55c810b24318 <line:157:5, col:29> col:22 size 'Vector::size_type () const' inline
|-CXXMethodDecl 0x55c810b243c8 <line:158:5, col:33> col:22 capacity 'Vector::size_type () const' inline
|-CXXMethodDecl 0x55c810b24478 <line:159:5, col:25> col:17 empty 'bool () const' inline
|-CXXMethodDecl 0x55c810b24638 <line:160:5, col:64> col:17 resize 'void (Vector::size_type, Vector<Router::Connection>::value_argument_type)' inline
| |-ParmVarDecl 0x55c810b24528 <col:24, col:34> col:34 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55c810b245a0 <col:37, col:63> col:57 v 'Vector<Router::Connection>::value_argument_type':'const Router::Connection &'
|-CXXMethodDecl 0x55c810b24788 <line:161:5, col:36> col:17 reserve 'bool (Vector::size_type)' inline
| `-ParmVarDecl 0x55c810b246f8 <col:25, col:35> col:35 n 'Vector::size_type':'int'
|-CXXMethodDecl 0x55c810b24938 <line:163:5, col:65> col:43 operator[] 'Router::Connection &(Vector::size_type)'
| |-ParmVarDecl 0x55c810b24840 <col:54, col:64> col:64 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x55c810b249f0 <col:20>
| `-OptimizeNoneAttr 0x55c810b24a48 <col:30>
|-CXXMethodDecl 0x55c810b24b68 <line:164:5, col:73> col:49 operator[] 'const Router::Connection &(Vector::size_type) const'
| |-ParmVarDecl 0x55c810b24a70 <col:60, col:70> col:70 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x55c810b24c20 <col:20>
| `-OptimizeNoneAttr 0x55c810b24c78 <col:30>
|-CXXMethodDecl 0x55c810b24d30 <line:165:5, col:29> col:15 at 'Router::Connection &(Vector::size_type)' inline
| `-ParmVarDecl 0x55c810b24ca0 <col:18, col:28> col:28 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55c810b24e78 <line:166:5, col:37> col:21 at 'const Router::Connection &(Vector::size_type) const' inline
| `-ParmVarDecl 0x55c810b24de8 <col:24, col:34> col:34 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55c810b24fa8 <line:167:5, col:21> col:15 front 'Router::Connection &()' inline
|-CXXMethodDecl 0x55c810b250d8 <line:168:5, col:29> col:21 front 'const Router::Connection &() const' inline
|-CXXMethodDecl 0x55c810b251a8 <line:169:5, col:20> col:15 back 'Router::Connection &()' inline
|-CXXMethodDecl 0x55c810b25278 <line:170:5, col:28> col:21 back 'const Router::Connection &() const' inline
|-CXXMethodDecl 0x55c810b253b8 <line:172:5, col:39> col:15 unchecked_at 'Router::Connection &(Vector::size_type)' inline
| `-ParmVarDecl 0x55c810b25328 <col:28, col:38> col:38 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55c810b25500 <line:173:5, col:47> col:21 unchecked_at 'const Router::Connection &(Vector::size_type) const' inline
| `-ParmVarDecl 0x55c810b25470 <col:34, col:44> col:44 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55c810b25648 <line:174:5, col:59> col:15 at_u 'Router::Connection &(Vector::size_type)' inline
| |-ParmVarDecl 0x55c810b255b8 <col:20, col:30> col:30 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x55c810b25700 <col:48> Inherited "" ""
|-CXXMethodDecl 0x55c810b25800 <line:175:5, col:71> col:21 at_u 'const Router::Connection &(Vector::size_type) const' inline
| |-ParmVarDecl 0x55c810b25770 <col:26, col:36> col:36 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x55c810b258b8 <col:60> Inherited "" ""
|-CXXMethodDecl 0x55c810b25978 <line:177:5, col:20> col:15 data 'Router::Connection *()' inline
|-CXXMethodDecl 0x55c810b25a78 <line:178:5, col:28> col:21 data 'const Router::Connection *() const' inline
|-CXXMethodDecl 0x55c810b25c28 <line:180:5, col:48> col:17 push_back 'void (Vector<Router::Connection>::value_argument_type)' inline
| `-ParmVarDecl 0x55c810b25b38 <col:27, col:47> col:47 v 'Vector<Router::Connection>::value_argument_type':'const Router::Connection &'
|-FunctionTemplateDecl 0x55c810b263e8 <line:182:5, line:183:63> col:48 push_back
| |-TemplateTypeParmDecl 0x55c810b25ce0 <line:182:15, col:43> col:24 typename depth 0 index 0 A
| | `-TemplateArgument type 'fast_argument<Router::Connection>':'fast_argument<Router::Connection, true>'
| `-CXXMethodDecl 0x55c810b26348 <line:183:5, col:63> col:48 push_back 'typename A::enable_rvalue_reference (Router::Connection &&)' inline
|   `-ParmVarDecl 0x55c810b26248 <col:58, col:62> col:62 v 'Router::Connection &&'
|-CXXMethodDecl 0x55c810b264c8 <line:185:5, col:26> col:17 pop_back 'void ()' inline
|-CXXMethodDecl 0x55c810b26618 <line:186:5, col:49> col:17 push_front 'void (Vector<Router::Connection>::value_argument_type)' inline
| `-ParmVarDecl 0x55c810b26588 <col:28, col:48> col:48 v 'Vector<Router::Connection>::value_argument_type':'const Router::Connection &'
|-CXXMethodDecl 0x55c810b266d0 <line:187:5, col:27> col:17 pop_front 'void ()' inline
|-CXXMethodDecl 0x55c810b26918 <line:189:5, col:62> col:21 insert 'Vector<Router::Connection>::iterator (Vector<Router::Connection>::iterator, Vector<Router::Connection>::value_argument_type)' inline
| |-ParmVarDecl 0x55c810b26790 <col:28, col:37> col:37 it 'Vector<Router::Connection>::iterator':'Router::Connection *'
| `-ParmVarDecl 0x55c810b26808 <col:41, col:61> col:61 v 'Vector<Router::Connection>::value_argument_type':'const Router::Connection &'
|-CXXMethodDecl 0x55c810b26ad8 <line:190:5, col:38> col:21 erase 'Vector<Router::Connection>::iterator (Vector<Router::Connection>::iterator)' inline
| `-ParmVarDecl 0x55c810b269e8 <col:27, col:36> col:36 it 'Vector<Router::Connection>::iterator':'Router::Connection *'
|-CXXMethodDecl 0x55c810b26d28 <line:191:5, col:49> col:21 erase 'Vector<Router::Connection>::iterator (Vector<Router::Connection>::iterator, Vector<Router::Connection>::iterator)' inline
| |-ParmVarDecl 0x55c810b26ba0 <col:27, col:36> col:36 a 'Vector<Router::Connection>::iterator':'Router::Connection *'
| `-ParmVarDecl 0x55c810b26c18 <col:39, col:48> col:48 b 'Vector<Router::Connection>::iterator':'Router::Connection *'
|-CXXMethodDecl 0x55c810b26de8 <line:193:5, col:23> col:17 clear 'void ()' inline
|-CXXMethodDecl 0x55c810b27048 <line:195:5, col:34> col:17 swap 'void (Vector<Router::Connection> &)' inline
| `-ParmVarDecl 0x55c810b26f50 <col:22, col:33> col:33 x 'Vector<Router::Connection> &'
`-CXXDestructorDecl 0x55c810b27118 <../dummy_inc/click/ipaddress.hh:13:29> col:29 implicit ~Vector 'void ()' inline default noexcept-unevaluated 0x55c810b27118

Layout: <CGRecordLayout
  LLVMType:%class.Vector.8 = type { %class.vector_memory.9 }
  NonVirtualBaseLLVMType:%class.Vector.8 = type { %class.vector_memory.9 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | union Handler::(anonymous at ../dummy_inc/click/handler.hh:290:5)
         0 |   HandlerCallback h
         0 |   ReadHandlerCallback r
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union Handler::(anonymous at ../dummy_inc/click/handler.hh:294:5)
         0 |   HandlerCallback h
         0 |   WriteHandlerCallback w
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class Handler
         0 |   class String _name
         0 |     struct String::rep_t _r
         0 |       const char * data
         8 |       int length
        16 |       struct String::memo_t * memo
        24 |   union Handler::(anonymous at ../dummy_inc/click/handler.hh:290:5) _read_hook
        24 |     HandlerCallback h
        24 |     ReadHandlerCallback r
        32 |   union Handler::(anonymous at ../dummy_inc/click/handler.hh:294:5) _write_hook
        32 |     HandlerCallback h
        32 |     WriteHandlerCallback w
        40 |   void * _read_user_data
        48 |   void * _write_user_data
        56 |   uint32_t _flags
        60 |   int _use_count
        64 |   int _next_by_name
           | [sizeof=72, dsize=68, align=8,
           |  nvsize=68, nvalign=8]

*** Dumping AST Record Layout
         0 | class ErrorHandler
         0 |   (ErrorHandler vtable pointer)
         8 |   int _nerrors
           | [sizeof=16, dsize=12, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x55c810a779b8 prev 0x55c8109e79e8 <../dummy_inc/click/error.hh:90:1, line:592:1> line:90:7 referenced class ErrorHandler definition
|-DefinitionData polymorphic has_user_declared_ctor can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor simple non_trivial has_const_param implicit_has_const_param
| |-MoveConstructor
| |-CopyAssignment non_trivial has_const_param implicit_has_const_param
| |-MoveAssignment
| `-Destructor non_trivial user_declared
|-CXXRecordDecl 0x55c810a77ab0 <col:1, col:7> col:7 implicit referenced class ErrorHandler
|-AccessSpecDecl 0x55c810a77b40 <col:22, col:28> col:22 public
|-EnumDecl 0x55c810a77b68 <line:98:5, line:111:5> line:98:10 Level
| |-EnumConstantDecl 0x55c810a77c88 <line:99:2, col:14> col:2 el_abort 'ErrorHandler::Level'
| | `-ConstantExpr 0x55c810a77c68 <col:13, col:14> 'int' Int: -999
| |   `-UnaryOperator 0x55c810a77c50 <col:13, col:14> 'int' prefix '-'
| |     `-IntegerLiteral 0x55c810a77c30 <col:14> 'int' 999
| |-EnumConstantDecl 0x55c810a77d30 <line:100:2, col:14> col:2 el_fatal 'ErrorHandler::Level'
| | `-ConstantExpr 0x55c810a77d10 <col:13, col:14> 'int' Int: -1
| |   `-UnaryOperator 0x55c810a77cf8 <col:13, col:14> 'int' prefix '-'
| |     `-IntegerLiteral 0x55c810a77cd8 <col:14> 'int' 1
| |-EnumConstantDecl 0x55c810a77dc0 <line:102:2, col:17> col:2 el_emergency 'ErrorHandler::Level'
| | `-ConstantExpr 0x55c810a77da0 <col:17> 'int' Int: 0
| |   `-IntegerLiteral 0x55c810a77d80 <col:17> 'int' 0
| |-EnumConstantDecl 0x55c810a77e50 <line:103:2, col:13> col:2 el_alert 'ErrorHandler::Level'
| | `-ConstantExpr 0x55c810a77e30 <col:13> 'int' Int: 1
| |   `-IntegerLiteral 0x55c810a77e10 <col:13> 'int' 1
| |-EnumConstantDecl 0x55c810a77ee0 <line:104:2, col:16> col:2 el_critical 'ErrorHandler::Level'
| | `-ConstantExpr 0x55c810a77ec0 <col:16> 'int' Int: 2
| |   `-IntegerLiteral 0x55c810a77ea0 <col:16> 'int' 2
| |-EnumConstantDecl 0x55c810a77f70 <line:105:2, col:13> col:2 referenced el_error 'ErrorHandler::Level'
| | `-ConstantExpr 0x55c810a77f50 <col:13> 'int' Int: 3
| |   `-IntegerLiteral 0x55c810a77f30 <col:13> 'int' 3
| |-EnumConstantDecl 0x55c810a78000 <line:106:2, col:15> col:2 el_warning 'ErrorHandler::Level'
| | `-ConstantExpr 0x55c810a77fe0 <col:15> 'int' Int: 4
| |   `-IntegerLiteral 0x55c810a77fc0 <col:15> 'int' 4
| |-EnumConstantDecl 0x55c810a78090 <line:107:2, col:14> col:2 el_notice 'ErrorHandler::Level'
| | `-ConstantExpr 0x55c810a78070 <col:14> 'int' Int: 5
| |   `-IntegerLiteral 0x55c810a78050 <col:14> 'int' 5
| |-EnumConstantDecl 0x55c810a78120 <line:109:2, col:12> col:2 el_info 'ErrorHandler::Level'
| | `-ConstantExpr 0x55c810a78100 <col:12> 'int' Int: 6
| |   `-IntegerLiteral 0x55c810a780e0 <col:12> 'int' 6
| `-EnumConstantDecl 0x55c810a781d0 <line:110:2, col:13> col:2 el_debug 'ErrorHandler::Level'
|   `-ConstantExpr 0x55c810a78190 <col:13> 'int' Int: 7
|     `-IntegerLiteral 0x55c810a78170 <col:13> 'int' 7
|-VarDecl 0x55c810a78240 <line:114:5, col:31> col:23 e_abort 'const char []' static
|-VarDecl 0x55c810a782c8 <col:5, line:115:10> col:2 e_fatal 'const char []' static
|-VarDecl 0x55c810a78350 <line:114:5, line:116:14> col:2 e_emergency 'const char []' static
|-VarDecl 0x55c810a783d8 <line:114:5, line:117:10> col:2 e_alert 'const char []' static
|-VarDecl 0x55c810a78460 <line:114:5, line:118:13> col:2 e_critical 'const char []' static
|-VarDecl 0x55c810a784e8 <line:114:5, line:119:10> col:2 e_error 'const char []' static
|-VarDecl 0x55c810a78570 <line:114:5, line:120:12> col:2 e_warning 'const char []' static
|-VarDecl 0x55c810a785f8 <line:114:5, line:121:22> col:2 e_warning_annotated 'const char []' static
|-VarDecl 0x55c810a78680 <line:114:5, line:122:11> col:2 e_notice 'const char []' static
|-VarDecl 0x55c810a78708 <line:114:5, line:123:9> col:2 e_info 'const char []' static
|-VarDecl 0x55c810a78790 <line:114:5, line:124:10> col:2 e_debug 'const char []' static
|-CXXConstructorDecl 0x55c810a78890 <line:127:5, line:129:5> line:127:5 used ErrorHandler 'void ()'
| |-CXXCtorInitializer Field 0x55c810a7db78 '_nerrors' 'int'
| | `-IntegerLiteral 0x55c810a7e308 <line:128:13> 'int' 0
| `-CompoundStmt 0x55c810a7e378 <col:16, line:129:5>
|-CXXDestructorDecl 0x55c810a78980 <line:131:5, line:132:5> line:131:13 used ~ErrorHandler 'void () noexcept' virtual
| `-CompoundStmt 0x55c810a7e388 <col:29, line:132:5>
|-CXXMethodDecl 0x55c810a78b38 <line:148:5, col:62> col:26 static_initialize 'ErrorHandler *(ErrorHandler *)' static
| `-ParmVarDecl 0x55c810a78a70 <col:44, col:58> col:58 errh 'ErrorHandler *'
|-CXXMethodDecl 0x55c810a78c00 <line:154:5, col:32> col:17 static_cleanup 'void ()' static
|-CXXMethodDecl 0x55c810a78ce8 <line:159:5, line:161:5> line:159:26 default_handler 'ErrorHandler *()' static
| `-CompoundStmt 0x55c810a7e3e0 <col:44, line:161:5>
|   `-ReturnStmt 0x55c810a7e3d0 <line:160:2, col:9>
|     `-ImplicitCastExpr 0x55c810a7e3b8 <col:9> 'ErrorHandler *' <LValueToRValue>
|       `-DeclRefExpr 0x55c810a7e398 <col:9> 'ErrorHandler *' lvalue Var 0x55c810a7dbd8 'the_default_handler' 'ErrorHandler *'
|-CXXMethodDecl 0x55c810a78e28 <line:168:5, col:55> col:17 set_default_handler 'void (ErrorHandler *)' static
| `-ParmVarDecl 0x55c810a78d98 <col:37, col:51> col:51 errh 'ErrorHandler *'
|-CXXMethodDecl 0x55c810a78ef0 <line:171:5, line:173:5> line:171:26 silent_handler 'ErrorHandler *()' static
| `-CompoundStmt 0x55c810a7e440 <col:43, line:173:5>
|   `-ReturnStmt 0x55c810a7e430 <line:172:2, col:9>
|     `-ImplicitCastExpr 0x55c810a7e418 <col:9> 'ErrorHandler *' <LValueToRValue>
|       `-DeclRefExpr 0x55c810a7e3f8 <col:9> 'ErrorHandler *' lvalue Var 0x55c810a7dc50 'the_silent_handler' 'ErrorHandler *'
|-VarDecl 0x55c810a78fa8 <line:176:5, col:22> col:22 ok_result 'const int' static
|-VarDecl 0x55c810a79028 <line:178:5, col:22> col:22 error_result 'const int' static
|-CXXMethodDecl 0x55c810a79138 <line:186:5, col:36> col:10 debug 'void (const char *, ...)'
| `-ParmVarDecl 0x55c810a790a8 <col:16, col:28> col:28 fmt 'const char *'
|-CXXMethodDecl 0x55c810a79288 <line:188:5, col:38> col:10 message 'void (const char *, ...)'
| `-ParmVarDecl 0x55c810a791f8 <col:18, col:30> col:30 fmt 'const char *'
|-CXXMethodDecl 0x55c810a793e0 <line:193:5, col:37> col:9 warning 'int (const char *, ...)'
| `-ParmVarDecl 0x55c810a79348 <col:17, col:29> col:29 fmt 'const char *'
|-CXXMethodDecl 0x55c810a79538 <line:196:5, col:35> col:9 error 'int (const char *, ...)'
| `-ParmVarDecl 0x55c810a794a0 <col:15, col:27> col:27 fmt 'const char *'
|-CXXMethodDecl 0x55c810a79690 <line:201:5, col:35> col:9 fatal 'int (const char *, ...)'
| `-ParmVarDecl 0x55c810a795f8 <col:15, col:27> col:27 fmt 'const char *'
|-CXXMethodDecl 0x55c810a798a0 <line:204:5, col:61> col:10 ldebug 'void (const String &, const char *, ...)'
| |-ParmVarDecl 0x55c810a79748 <col:17, col:31> col:31 landmark 'const String &'
| `-ParmVarDecl 0x55c810a797c8 <col:41, col:53> col:53 fmt 'const char *'
|-CXXMethodDecl 0x55c810a79a78 <line:206:5, col:63> col:10 lmessage 'void (const String &, const char *, ...)'
| |-ParmVarDecl 0x55c810a79960 <col:19, col:33> col:33 landmark 'const String &'
| `-ParmVarDecl 0x55c810a799e0 <col:43, col:55> col:55 fmt 'const char *'
|-CXXMethodDecl 0x55c810a79c98 <line:208:5, col:62> col:9 lwarning 'int (const String &, const char *, ...)'
| |-ParmVarDecl 0x55c810a79b38 <col:18, col:32> col:32 landmark 'const String &'
| `-ParmVarDecl 0x55c810a79bb8 <col:42, col:54> col:54 fmt 'const char *'
|-CXXMethodDecl 0x55c810a79e78 <line:210:5, col:60> col:9 lerror 'int (const String &, const char *, ...)'
| |-ParmVarDecl 0x55c810a79d58 <col:16, col:30> col:30 landmark 'const String &'
| `-ParmVarDecl 0x55c810a79dd8 <col:40, col:52> col:52 fmt 'const char *'
|-CXXMethodDecl 0x55c810a7a058 <line:212:5, col:60> col:9 lfatal 'int (const String &, const char *, ...)'
| |-ParmVarDecl 0x55c810a79f38 <col:16, col:30> col:30 landmark 'const String &'
| `-ParmVarDecl 0x55c810a79fb8 <col:40, col:52> col:52 fmt 'const char *'
|-CXXMethodDecl 0x55c810a7a1e0 <line:226:5, col:35> col:9 used xmessage 'int (const String &)'
| `-ParmVarDecl 0x55c810a7a118 <col:18, col:32> col:32 str 'const String &'
|-CXXMethodDecl 0x55c810a7a3b0 <line:232:5, line:234:5> line:232:9 used xmessage 'int (const String &, const String &)'
| |-ParmVarDecl 0x55c810a7a298 <col:18, col:32> col:32 used anno 'const String &'
| |-ParmVarDecl 0x55c810a7a310 <col:38, col:52> col:52 used str 'const String &'
| `-CompoundStmt 0x55c810a7e698 <col:57, line:234:5>
|   `-ReturnStmt 0x55c810a7e688 <line:233:2, col:41>
|     `-ExprWithCleanups 0x55c810a7e670 <col:9, col:41> 'int'
|       `-CXXMemberCallExpr 0x55c810a7e618 <col:9, col:41> 'int'
|         |-MemberExpr 0x55c810a7e5e8 <col:9> '<bound member function type>' ->xmessage 0x55c810a7a1e0
|         | `-CXXThisExpr 0x55c810a7e5d8 <col:9> 'ErrorHandler *' implicit this
|         `-MaterializeTemporaryExpr 0x55c810a7e658 <col:18, col:40> 'const String' lvalue
|           `-ImplicitCastExpr 0x55c810a7e640 <col:18, col:40> 'const String' <NoOp>
|             `-CXXBindTemporaryExpr 0x55c810a7e5b8 <col:18, col:40> 'String' (CXXTemporary 0x55c810a7e5b8)
|               `-CallExpr 0x55c810a7e580 <col:18, col:40> 'String'
|                 |-ImplicitCastExpr 0x55c810a7e568 <col:18> 'String (*)(const String &, const String &)' <FunctionToPointerDecay>
|                 | `-DeclRefExpr 0x55c810a7e4e0 <col:18> 'String (const String &, const String &)' lvalue CXXMethod 0x55c810a7c3a8 'combine_anno' 'String (const String &, const String &)'
|                 |-DeclRefExpr 0x55c810a7e500 <col:31> 'const String' lvalue ParmVar 0x55c810a7a310 'str' 'const String &'
|                 `-DeclRefExpr 0x55c810a7e520 <col:36> 'const String' lvalue ParmVar 0x55c810a7a298 'anno' 'const String &'
|-CXXMethodDecl 0x55c810a7a690 <line:241:5, line:243:5> line:241:9 xmessage 'int (const String &, const char *, __va_list_tag *)'
| |-ParmVarDecl 0x55c810a7a470 <col:18, col:32> col:32 used anno 'const String &'
| |-ParmVarDecl 0x55c810a7a4f0 <col:38, col:50> col:50 used fmt 'const char *'
| |-ParmVarDecl 0x55c810a7a568 <col:55, col:63> col:63 used val '__va_list_tag *':'__va_list_tag *'
| `-CompoundStmt 0x55c810a7e928 <col:68, line:243:5>
|   `-ReturnStmt 0x55c810a7e918 <line:242:2, col:41>
|     `-ExprWithCleanups 0x55c810a7e900 <col:9, col:41> 'int'
|       `-CXXMemberCallExpr 0x55c810a7e8a0 <col:9, col:41> 'int'
|         |-MemberExpr 0x55c810a7e870 <col:9> '<bound member function type>' ->xmessage 0x55c810a7a3b0
|         | `-CXXThisExpr 0x55c810a7e860 <col:9> 'ErrorHandler *' implicit this
|         |-DeclRefExpr 0x55c810a7e738 <col:18> 'const String' lvalue ParmVar 0x55c810a7a470 'anno' 'const String &'
|         `-MaterializeTemporaryExpr 0x55c810a7e8e8 <col:24, col:40> 'const String' lvalue
|           `-ImplicitCastExpr 0x55c810a7e8d0 <col:24, col:40> 'const String' <NoOp>
|             `-CXXBindTemporaryExpr 0x55c810a7e840 <col:24, col:40> 'String' (CXXTemporary 0x55c810a7e840)
|               `-CXXMemberCallExpr 0x55c810a7e7d8 <col:24, col:40> 'String'
|                 |-MemberExpr 0x55c810a7e768 <col:24> '<bound member function type>' ->vformat 0x55c810a7b870
|                 | `-CXXThisExpr 0x55c810a7e758 <col:24> 'ErrorHandler *' implicit this
|                 |-ImplicitCastExpr 0x55c810a7e808 <col:32> 'const char *' <LValueToRValue>
|                 | `-DeclRefExpr 0x55c810a7e798 <col:32> 'const char *' lvalue ParmVar 0x55c810a7a4f0 'fmt' 'const char *'
|                 `-ImplicitCastExpr 0x55c810a7e820 <col:37> '__va_list_tag *':'__va_list_tag *' <LValueToRValue>
|                   `-DeclRefExpr 0x55c810a7e7b8 <col:37> '__va_list_tag *':'__va_list_tag *' lvalue ParmVar 0x55c810a7a568 'val' '__va_list_tag *':'__va_list_tag *'
|-CXXMethodDecl 0x55c810a7a930 <line:251:5, line:254:5> line:251:9 used xmessage 'int (const String &, const String &, const String &)'
| |-ParmVarDecl 0x55c810a7a758 <col:18, col:32> col:32 used landmark 'const String &'
| |-ParmVarDecl 0x55c810a7a7d0 <col:42, col:56> col:56 used anno 'const String &'
| |-ParmVarDecl 0x55c810a7a848 <line:252:4, col:18> col:18 used str 'const String &'
| `-CompoundStmt 0x55c810a7ec68 <col:23, line:254:5>
|   `-ReturnStmt 0x55c810a7ec58 <line:253:2, col:71>
|     `-ExprWithCleanups 0x55c810a7ec40 <col:9, col:71> 'int'
|       `-CXXMemberCallExpr 0x55c810a7ebe0 <col:9, col:71> 'int'
|         |-MemberExpr 0x55c810a7ebb0 <col:9> '<bound member function type>' ->xmessage 0x55c810a7a3b0
|         | `-CXXThisExpr 0x55c810a7eba0 <col:9> 'ErrorHandler *' implicit this
|         |-MaterializeTemporaryExpr 0x55c810a7ec28 <col:18, col:65> 'const String' lvalue
|         | `-ImplicitCastExpr 0x55c810a7ec10 <col:18, col:65> 'const String' <NoOp>
|         |   `-CXXBindTemporaryExpr 0x55c810a7eb60 <col:18, col:65> 'String' (CXXTemporary 0x55c810a7eb60)
|         |     `-CallExpr 0x55c810a7eaf8 <col:18, col:65> 'String'
|         |       |-ImplicitCastExpr 0x55c810a7eae0 <col:18> 'String (*)(const String &, const String &)' <FunctionToPointerDecay>
|         |       | `-DeclRefExpr 0x55c810a7e9c8 <col:18> 'String (const String &, const String &)' lvalue CXXMethod 0x55c810a7c3a8 'combine_anno' 'String (const String &, const String &)'
|         |       |-DeclRefExpr 0x55c810a7e9e8 <col:31> 'const String' lvalue ParmVar 0x55c810a7a7d0 'anno' 'const String &'
|         |       `-MaterializeTemporaryExpr 0x55c810a7eb40 <col:37, col:64> 'const String' lvalue
|         |         `-ImplicitCastExpr 0x55c810a7eb28 <col:37, col:64> 'const String' <NoOp>
|         |           `-CXXBindTemporaryExpr 0x55c810a7eac0 <col:37, col:64> 'String' (CXXTemporary 0x55c810a7eac0)
|         |             `-CallExpr 0x55c810a7ea90 <col:37, col:64> 'String'
|         |               |-ImplicitCastExpr 0x55c810a7ea78 <col:37> 'String (*)(const String &)' <FunctionToPointerDecay>
|         |               | `-DeclRefExpr 0x55c810a7ea08 <col:37> 'String (const String &)' lvalue CXXMethod 0x55c810a7c9f8 'make_landmark_anno' 'String (const String &)'
|         |               `-DeclRefExpr 0x55c810a7ea28 <col:56> 'const String' lvalue ParmVar 0x55c810a7a758 'landmark' 'const String &'
|         `-DeclRefExpr 0x55c810a7eb80 <col:68> 'const String' lvalue ParmVar 0x55c810a7a848 'str' 'const String &'
|-CXXMethodDecl 0x55c810a7acb0 <line:264:5, line:267:5> line:264:9 xmessage 'int (const String &, const String &, const char *, __va_list_tag *)'
| |-ParmVarDecl 0x55c810a7a9f8 <col:18, col:32> col:32 used landmark 'const String &'
| |-ParmVarDecl 0x55c810a7aa70 <col:42, col:56> col:56 used anno 'const String &'
| |-ParmVarDecl 0x55c810a7aaf0 <line:265:4, col:16> col:16 used fmt 'const char *'
| |-ParmVarDecl 0x55c810a7ab68 <col:21, col:29> col:29 used val '__va_list_tag *':'__va_list_tag *'
| `-CompoundStmt 0x55c810a7ef20 <col:34, line:267:5>
|   `-ReturnStmt 0x55c810a7ef10 <line:266:2, col:51>
|     `-ExprWithCleanups 0x55c810a7eef8 <col:9, col:51> 'int'
|       `-CXXMemberCallExpr 0x55c810a7ee90 <col:9, col:51> 'int'
|         |-MemberExpr 0x55c810a7ee60 <col:9> '<bound member function type>' ->xmessage 0x55c810a7a930
|         | `-CXXThisExpr 0x55c810a7ee50 <col:9> 'ErrorHandler *' implicit this
|         |-DeclRefExpr 0x55c810a7ed08 <col:18> 'const String' lvalue ParmVar 0x55c810a7a9f8 'landmark' 'const String &'
|         |-DeclRefExpr 0x55c810a7ed28 <col:28> 'const String' lvalue ParmVar 0x55c810a7aa70 'anno' 'const String &'
|         `-MaterializeTemporaryExpr 0x55c810a7eee0 <col:34, col:50> 'const String' lvalue
|           `-ImplicitCastExpr 0x55c810a7eec8 <col:34, col:50> 'const String' <NoOp>
|             `-CXXBindTemporaryExpr 0x55c810a7ee30 <col:34, col:50> 'String' (CXXTemporary 0x55c810a7ee30)
|               `-CXXMemberCallExpr 0x55c810a7edc8 <col:34, col:50> 'String'
|                 |-MemberExpr 0x55c810a7ed58 <col:34> '<bound member function type>' ->vformat 0x55c810a7b870
|                 | `-CXXThisExpr 0x55c810a7ed48 <col:34> 'ErrorHandler *' implicit this
|                 |-ImplicitCastExpr 0x55c810a7edf8 <col:42> 'const char *' <LValueToRValue>
|                 | `-DeclRefExpr 0x55c810a7ed88 <col:42> 'const char *' lvalue ParmVar 0x55c810a7aaf0 'fmt' 'const char *'
|                 `-ImplicitCastExpr 0x55c810a7ee10 <col:47> '__va_list_tag *':'__va_list_tag *' <LValueToRValue>
|                   `-DeclRefExpr 0x55c810a7eda8 <col:47> '__va_list_tag *':'__va_list_tag *' lvalue ParmVar 0x55c810a7ab68 'val' '__va_list_tag *':'__va_list_tag *'
|-CXXMethodDecl 0x55c810a7adc0 <line:286:5, line:288:5> line:286:9 nerrors 'int () const'
| `-CompoundStmt 0x55c810a7efa0 <col:25, line:288:5>
|   `-ReturnStmt 0x55c810a7ef90 <line:287:2, col:9>
|     `-ImplicitCastExpr 0x55c810a7ef78 <col:9> 'int' <LValueToRValue>
|       `-MemberExpr 0x55c810a7ef48 <col:9> 'const int' lvalue ->_nerrors 0x55c810a7db78
|         `-CXXThisExpr 0x55c810a7ef38 <col:9> 'const ErrorHandler *' implicit this
|-CXXMethodDecl 0x55c810a7afd0 <line:349:5, col:66> col:19 xformat 'String (int, const char *, ...)' static
| |-ParmVarDecl 0x55c810a7ae78 <col:27, col:31> col:31 default_flags 'int'
| `-ParmVarDecl 0x55c810a7aef8 <col:46, col:58> col:58 fmt 'const char *'
|-CXXMethodDecl 0x55c810a7b2b8 <line:351:5, col:75> col:19 used vxformat 'String (int, const char *, __va_list_tag *)' static
| |-ParmVarDecl 0x55c810a7b098 <col:28, col:32> col:32 default_flags 'int'
| |-ParmVarDecl 0x55c810a7b118 <col:47, col:59> col:59 fmt 'const char *'
| `-ParmVarDecl 0x55c810a7b190 <col:64, col:72> col:72 val '__va_list_tag *':'__va_list_tag *'
|-CXXMethodDecl 0x55c810a7b450 <line:353:5, col:47> col:19 xformat 'String (const char *, ...)' static
| `-ParmVarDecl 0x55c810a7b388 <col:27, col:39> col:39 fmt 'const char *'
|-CXXMethodDecl 0x55c810a7b698 <line:355:5, line:357:5> line:355:19 vxformat 'String (const char *, __va_list_tag *)' static
| |-ParmVarDecl 0x55c810a7b510 <col:28, col:40> col:40 used fmt 'const char *'
| |-ParmVarDecl 0x55c810a7b588 <col:45, col:53> col:53 used val '__va_list_tag *':'__va_list_tag *'
| `-CompoundStmt 0x55c810a7f200 <col:58, line:357:5>
|   `-ReturnStmt 0x55c810a7f1f0 <line:356:2, col:29>
|     `-ExprWithCleanups 0x55c810a7f1d8 <col:9, col:29> 'String'
|       `-CXXConstructExpr 0x55c810a7f1a8 <col:9, col:29> 'String' 'void (String &&)' elidable
|         `-MaterializeTemporaryExpr 0x55c810a7f190 <col:9, col:29> 'String' xvalue
|           `-CXXBindTemporaryExpr 0x55c810a7f170 <col:9, col:29> 'String' (CXXTemporary 0x55c810a7f170)
|             `-CallExpr 0x55c810a7f100 <col:9, col:29> 'String'
|               |-ImplicitCastExpr 0x55c810a7f0e8 <col:9> 'String (*)(int, const char *, __va_list_tag *)' <FunctionToPointerDecay>
|               | `-DeclRefExpr 0x55c810a7f068 <col:9> 'String (int, const char *, __va_list_tag *)' lvalue CXXMethod 0x55c810a7b2b8 'vxformat' 'String (int, const char *, __va_list_tag *)'
|               |-IntegerLiteral 0x55c810a7f008 <col:18> 'int' 0
|               |-ImplicitCastExpr 0x55c810a7f138 <col:21> 'const char *' <LValueToRValue>
|               | `-DeclRefExpr 0x55c810a7f028 <col:21> 'const char *' lvalue ParmVar 0x55c810a7b510 'fmt' 'const char *'
|               `-ImplicitCastExpr 0x55c810a7f150 <col:26> '__va_list_tag *':'__va_list_tag *' <LValueToRValue>
|                 `-DeclRefExpr 0x55c810a7f048 <col:26> '__va_list_tag *':'__va_list_tag *' lvalue ParmVar 0x55c810a7b588 'val' '__va_list_tag *':'__va_list_tag *'
|-CXXMethodDecl 0x55c810a7b870 <line:369:5, col:56> col:20 used vformat 'String (const char *, __va_list_tag *)' virtual
| |-ParmVarDecl 0x55c810a7b760 <col:28, col:40> col:40 fmt 'const char *'
| `-ParmVarDecl 0x55c810a7b7d8 <col:45, col:53> col:53 val '__va_list_tag *':'__va_list_tag *'
|-CXXMethodDecl 0x55c810a7b9c8 <line:379:5, col:39> col:12 format 'String (const char *, ...)'
| `-ParmVarDecl 0x55c810a7b938 <col:19, col:31> col:31 fmt 'const char *'
|-CXXMethodDecl 0x55c810a7bb10 <line:393:5, col:46> col:20 decorate 'String (const String &)' virtual
| `-ParmVarDecl 0x55c810a7ba80 <col:29, col:43> col:43 str 'const String &'
|-CXXMethodDecl 0x55c810a7bdb0 <line:424:5, col:69> col:19 emit 'void *(const String &, void *, bool)' virtual
| |-ParmVarDecl 0x55c810a7bbc8 <col:24, col:38> col:38 str 'const String &'
| |-ParmVarDecl 0x55c810a7bc48 <col:43, col:49> col:49 user_data 'void *'
| `-ParmVarDecl 0x55c810a7bcc0 <col:60, col:65> col:65 more 'bool'
|-CXXMethodDecl 0x55c810a7bf10 <line:438:5, line:441:5> line:438:18 account 'void (int)' virtual
| |-ParmVarDecl 0x55c810a7be80 <col:26, col:30> col:30 used level 'int'
| `-CompoundStmt 0x55c810a7f318 <col:37, line:441:5>
|   `-IfStmt 0x55c810a7f300 <line:439:2, line:440:8>
|     |-BinaryOperator 0x55c810a7f288 <line:439:6, col:15> 'bool' '<='
|     | |-ImplicitCastExpr 0x55c810a7f258 <col:6> 'int' <LValueToRValue>
|     | | `-DeclRefExpr 0x55c810a7f218 <col:6> 'int' lvalue ParmVar 0x55c810a7be80 'level' 'int'
|     | `-ImplicitCastExpr 0x55c810a7f270 <col:15> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x55c810a7f238 <col:15> 'ErrorHandler::Level' EnumConstant 0x55c810a77f70 'el_error' 'ErrorHandler::Level'
|     `-UnaryOperator 0x55c810a7f2e8 <line:440:6, col:8> 'int' lvalue prefix '++'
|       `-MemberExpr 0x55c810a7f2b8 <col:8> 'int' lvalue ->_nerrors 0x55c810a7db78
|         `-CXXThisExpr 0x55c810a7f2a8 <col:8> 'ErrorHandler *' implicit this
|-CXXMethodDecl 0x55c810a7bfd8 <line:446:5, line:448:5> line:446:18 clear 'void ()' virtual
| `-CompoundStmt 0x55c810a7f3b0 <col:26, line:448:5>
|   `-BinaryOperator 0x55c810a7f390 <line:447:2, col:13> 'int' lvalue '='
|     |-MemberExpr 0x55c810a7f340 <col:2> 'int' lvalue ->_nerrors 0x55c810a7db78
|     | `-CXXThisExpr 0x55c810a7f330 <col:2> 'ErrorHandler *' implicit this
|     `-IntegerLiteral 0x55c810a7f370 <col:13> 'int' 0
|-CXXMethodDecl 0x55c810a7c1a0 <line:466:5, col:66> col:19 used make_anno 'String (const char *, const String &)' static
| |-ParmVarDecl 0x55c810a7c090 <col:29, col:41> col:41 name 'const char *'
| `-ParmVarDecl 0x55c810a7c108 <col:47, col:61> col:61 value 'const String &'
|-CXXMethodDecl 0x55c810a7c3a8 <line:482:5, col:69> col:19 used combine_anno 'String (const String &, const String &)' static
| |-ParmVarDecl 0x55c810a7c260 <col:32, col:46> col:46 str 'const String &'
| `-ParmVarDecl 0x55c810a7c2d8 <col:51, col:65> col:65 anno 'const String &'
|-CXXMethodDecl 0x55c810a7c658 <line:516:5, line:517:68> line:516:24 parse_anno 'const char *(const String &, const char *, const char *, ...)' static
| |-ParmVarDecl 0x55c810a7c468 <col:35, col:49> col:49 str 'const String &'
| |-ParmVarDecl 0x55c810a7c4e8 <line:517:3, col:15> col:15 begin 'const char *'
| |-ParmVarDecl 0x55c810a7c568 <col:22, col:34> col:34 end 'const char *'
| `-SentinelAttr 0x55c810a7c710 <col:59> 0 0
|-CXXMethodDecl 0x55c810a7c8a8 <line:527:5, line:534:5> line:527:24 skip_anno 'const char *(const char *, const char *)' static
| |-ParmVarDecl 0x55c810a7c788 <col:34, col:46> col:46 used begin 'const char *'
| |-ParmVarDecl 0x55c810a7c808 <col:53, col:65> col:65 used end 'const char *'
| `-CompoundStmt 0x55c810a7fa20 <col:70, line:534:5>
|   |-DeclStmt 0x55c810a7f520 <line:528:2, col:20>
|   | |-VarDecl 0x55c810a7f3d8 <col:2, col:9> col:9 used name 'String' callinit destroyed
|   | | `-CXXConstructExpr 0x55c810a7f440 <col:9> 'String' 'void ()'
|   | `-VarDecl 0x55c810a7f478 <col:2, col:15> col:15 used value 'String' callinit destroyed
|   |   `-CXXConstructExpr 0x55c810a7f4e0 <col:15> 'String' 'void ()'
|   |-DeclStmt 0x55c810a7f5f0 <line:529:2, col:23>
|   | `-VarDecl 0x55c810a7f550 <col:2, col:18> col:14 used x 'const char *' cinit
|   |   `-ImplicitCastExpr 0x55c810a7f5d8 <col:18> 'const char *' <LValueToRValue>
|   |     `-DeclRefExpr 0x55c810a7f5b8 <col:18> 'const char *' lvalue ParmVar 0x55c810a7c788 'begin' 'const char *'
|   |-DoStmt 0x55c810a7f9b8 <line:530:2, line:532:15>
|   | |-CompoundStmt 0x55c810a7f8e8 <line:530:5, line:532:2>
|   | | `-ExprWithCleanups 0x55c810a7f8d0 <line:531:6, col:58> 'const char *' lvalue
|   | |   `-BinaryOperator 0x55c810a7f8b0 <col:6, col:58> 'const char *' lvalue '='
|   | |     |-DeclRefExpr 0x55c810a7f608 <col:6> 'const char *' lvalue Var 0x55c810a7f550 'x' 'const char *'
|   | |     `-CallExpr 0x55c810a7f800 <col:10, col:58> 'const char *'
|   | |       |-ImplicitCastExpr 0x55c810a7f7e8 <col:10> 'const char *(*)(const String &, const char *, const char *, String *, String *, bool)' <FunctionToPointerDecay>
|   | |       | `-DeclRefExpr 0x55c810a7f7a0 <col:10> 'const char *(const String &, const char *, const char *, String *, String *, bool)' lvalue CXXMethod 0x55c810a7e050 'skip_anno' 'const char *(const String &, const char *, const char *, String *, String *, bool)'
|   | |       |-MaterializeTemporaryExpr 0x55c810a7f868 <col:20, col:27> 'const String' lvalue
|   | |       | `-ImplicitCastExpr 0x55c810a7f850 <col:20, col:27> 'const String' <NoOp>
|   | |       |   `-CXXBindTemporaryExpr 0x55c810a7f6c0 <col:20, col:27> 'String' (CXXTemporary 0x55c810a7f6c0)
|   | |       |     `-CXXTemporaryObjectExpr 0x55c810a7f688 <col:20, col:27> 'String' 'void ()'
|   | |       |-ImplicitCastExpr 0x55c810a7f880 <col:30> 'const char *' <LValueToRValue>
|   | |       | `-DeclRefExpr 0x55c810a7f6e0 <col:30> 'const char *' lvalue Var 0x55c810a7f550 'x' 'const char *'
|   | |       |-ImplicitCastExpr 0x55c810a7f898 <col:33> 'const char *' <LValueToRValue>
|   | |       | `-DeclRefExpr 0x55c810a7f700 <col:33> 'const char *' lvalue ParmVar 0x55c810a7c808 'end' 'const char *'
|   | |       |-UnaryOperator 0x55c810a7f740 <col:38, col:39> 'String *' prefix '&' cannot overflow
|   | |       | `-DeclRefExpr 0x55c810a7f720 <col:39> 'String' lvalue Var 0x55c810a7f3d8 'name' 'String'
|   | |       |-UnaryOperator 0x55c810a7f778 <col:45, col:46> 'String *' prefix '&' cannot overflow
|   | |       | `-DeclRefExpr 0x55c810a7f758 <col:46> 'String' lvalue Var 0x55c810a7f478 'value' 'String'
|   | |       `-CXXBoolLiteralExpr 0x55c810a7f790 <col:53> 'bool' false
|   | `-ImplicitCastExpr 0x55c810a7f9a0 <line:532:11> 'bool' <MemberPointerToBoolean>
|   |   `-ImplicitCastExpr 0x55c810a7f988 <col:11> 'String::unspecified_bool_type':'int (String::*)() const' <UserDefinedConversion>
|   |     `-CXXMemberCallExpr 0x55c810a7f968 <col:11> 'String::unspecified_bool_type':'int (String::*)() const'
|   |       `-MemberExpr 0x55c810a7f938 <col:11> '<bound member function type>' .operator int (String::*)() const 0x55c810657048
|   |         `-ImplicitCastExpr 0x55c810a7f920 <col:11> 'const String' lvalue <NoOp>
|   |           `-DeclRefExpr 0x55c810a7f900 <col:11> 'String' lvalue Var 0x55c810a7f3d8 'name' 'String'
|   `-ReturnStmt 0x55c810a7fa10 <line:533:2, col:9>
|     `-ImplicitCastExpr 0x55c810a7f9f8 <col:9> 'const char *' <LValueToRValue>
|       `-DeclRefExpr 0x55c810a7f9d8 <col:9> 'const char *' lvalue Var 0x55c810a7f550 'x' 'const char *'
|-CXXMethodDecl 0x55c810a7c9f8 <line:543:5, line:550:5> line:543:19 used make_landmark_anno 'String (const String &)' static
| |-ParmVarDecl 0x55c810a7c968 <col:38, col:52> col:52 used x 'const String &'
| `-CompoundStmt 0x55c810a80028 <col:55, line:550:5>
|   `-IfStmt 0x55c810a80000 <line:544:2, line:549:20> has_else
|     |-BinaryOperator 0x55c810a7fc60 <line:544:6, col:19> 'bool' '&&'
|     | |-ImplicitCastExpr 0x55c810a7fc48 <col:6> 'bool' <MemberPointerToBoolean>
|     | | `-ImplicitCastExpr 0x55c810a7fc30 <col:6> 'String::unspecified_bool_type':'int (String::*)() const' <UserDefinedConversion>
|     | |   `-CXXMemberCallExpr 0x55c810a7fc10 <col:6> 'String::unspecified_bool_type':'int (String::*)() const'
|     | |     `-MemberExpr 0x55c810a7fbe0 <col:6> '<bound member function type>' .operator int (String::*)() const 0x55c810657048
|     | |       `-DeclRefExpr 0x55c810a7fa80 <col:6> 'const String' lvalue ParmVar 0x55c810a7c968 'x' 'const String &'
|     | `-BinaryOperator 0x55c810a7fbc0 <col:11, col:19> 'bool' '=='
|     |   |-ImplicitCastExpr 0x55c810a7fb90 <col:11, col:14> 'int' <IntegralCast>
|     |   | `-CXXOperatorCallExpr 0x55c810a7fb40 <col:11, col:14> 'char'
|     |   |   |-ImplicitCastExpr 0x55c810a7fb28 <col:12, col:14> 'char (*)(int) const' <FunctionToPointerDecay>
|     |   |   | `-DeclRefExpr 0x55c810a7fae0 <col:12, col:14> 'char (int) const' lvalue CXXMethod 0x55c81066e8a0 'operator[]' 'char (int) const'
|     |   |   |-DeclRefExpr 0x55c810a7faa0 <col:11> 'const String' lvalue ParmVar 0x55c810a7c968 'x' 'const String &'
|     |   |   `-IntegerLiteral 0x55c810a7fac0 <col:13> 'int' 0
|     |   `-ImplicitCastExpr 0x55c810a7fba8 <col:19> 'int' <IntegralCast>
|     |     `-CharacterLiteral 0x55c810a7fb78 <col:19> 'char' 123
|     |-ReturnStmt 0x55c810a7fcd0 <line:545:6, col:13>
|     | `-CXXConstructExpr 0x55c810a7fca0 <col:13> 'String' 'void (const String &)'
|     |   `-DeclRefExpr 0x55c810a7fc80 <col:13> 'const String' lvalue ParmVar 0x55c810a7c968 'x' 'const String &'
|     `-IfStmt 0x55c810a7ffd8 <line:546:7, line:549:20> has_else
|       |-ImplicitCastExpr 0x55c810a7fd68 <line:546:11> 'bool' <MemberPointerToBoolean>
|       | `-ImplicitCastExpr 0x55c810a7fd50 <col:11> 'String::unspecified_bool_type':'int (String::*)() const' <UserDefinedConversion>
|       |   `-CXXMemberCallExpr 0x55c810a7fd30 <col:11> 'String::unspecified_bool_type':'int (String::*)() const'
|       |     `-MemberExpr 0x55c810a7fd00 <col:11> '<bound member function type>' .operator int (String::*)() const 0x55c810657048
|       |       `-DeclRefExpr 0x55c810a7fce0 <col:11> 'const String' lvalue ParmVar 0x55c810a7c968 'x' 'const String &'
|       |-ReturnStmt 0x55c810a7fef0 <line:547:6, col:29>
|       | `-ExprWithCleanups 0x55c810a7fed8 <col:13, col:29> 'String'
|       |   `-CXXConstructExpr 0x55c810a7fea8 <col:13, col:29> 'String' 'void (String &&)' elidable
|       |     `-MaterializeTemporaryExpr 0x55c810a7fe90 <col:13, col:29> 'String' xvalue
|       |       `-CXXBindTemporaryExpr 0x55c810a7fe70 <col:13, col:29> 'String' (CXXTemporary 0x55c810a7fe70)
|       |         `-CallExpr 0x55c810a7fe20 <col:13, col:29> 'String'
|       |           |-ImplicitCastExpr 0x55c810a7fe08 <col:13> 'String (*)(const char *, const String &)' <FunctionToPointerDecay>
|       |           | `-DeclRefExpr 0x55c810a7fd80 <col:13> 'String (const char *, const String &)' lvalue CXXMethod 0x55c810a7c1a0 'make_anno' 'String (const char *, const String &)'
|       |           |-ImplicitCastExpr 0x55c810a7fe50 <col:23> 'const char *' <ArrayToPointerDecay>
|       |           | `-StringLiteral 0x55c810a7fda0 <col:23> 'const char [2]' lvalue "l"
|       |           `-DeclRefExpr 0x55c810a7fdc0 <col:28> 'const String' lvalue ParmVar 0x55c810a7c968 'x' 'const String &'
|       `-ReturnStmt 0x55c810a7ffc8 <line:549:6, col:20>
|         `-ExprWithCleanups 0x55c810a7ffb0 <col:13, col:20> 'String'
|           `-CXXConstructExpr 0x55c810a7ff80 <col:13, col:20> 'String' 'void (String &&)' elidable
|             `-MaterializeTemporaryExpr 0x55c810a7ff68 <col:13, col:20> 'String' xvalue
|               `-CXXBindTemporaryExpr 0x55c810a7ff48 <col:13, col:20> 'String' (CXXTemporary 0x55c810a7ff48)
|                 `-CXXTemporaryObjectExpr 0x55c810a7ff10 <col:13, col:20> 'String' 'void ()'
|-CXXMethodDecl 0x55c810a7cbc0 <line:559:5, col:76> col:19 clean_landmark 'String (const String &, bool)' static
| |-ParmVarDecl 0x55c810a7cab0 <col:34, col:48> col:48 landmark 'const String &'
| `-ParmVarDecl 0x55c810a7cb28 <col:58, col:71> col:63 colon 'bool' cinit
|   `-CXXBoolLiteralExpr 0x55c810a7e2f8 <col:71> 'bool' false
|-CXXRecordDecl 0x55c810a7cc70 <line:563:5, col:12> col:12 referenced struct Conversion
|-TypedefDecl 0x55c810a7cf68 <line:564:5, col:60> col:22 referenced ConversionFunction 'String (*)(int, __va_list_tag *)'
| `-PointerType 0x55c810a7cf00 'String (*)(int, __va_list_tag *)'
|   `-ParenType 0x55c810a7cea0 'String (int, __va_list_tag *)' sugar
|     `-FunctionProtoType 0x55c810a7ce60 'String (int, __va_list_tag *)' cdecl
|       |-RecordType 0x55c8106538c0 'String'
|       | `-CXXRecord 0x55c810653830 'String'
|       |-BuiltinType 0x55c810317580 'int'
|       `-DecayedType 0x55c8109e8a30 '__va_list_tag *' sugar
|         |-TypedefType 0x55c8109e8a00 'va_list' sugar
|         | |-Typedef 0x55c81053d450 'va_list'
|         | `-TypedefType 0x55c81053d400 '__gnuc_va_list' sugar
|         |   |-Typedef 0x55c810474c28 '__gnuc_va_list'
|         |   `-TypedefType 0x55c810474b90 '__builtin_va_list' sugar
|         |     |-Typedef 0x55c810358d38 '__builtin_va_list'
|         |     `-ConstantArrayType 0x55c810358ce0 '__va_list_tag [1]' 1 
|         |       `-RecordType 0x55c8103182d0 '__va_list_tag'
|         |         `-CXXRecord 0x55c810318238 '__va_list_tag'
|         `-PointerType 0x55c810543550 '__va_list_tag *'
|           `-RecordType 0x55c8103182d0 '__va_list_tag'
|             `-CXXRecord 0x55c810318238 '__va_list_tag'
|-EnumDecl 0x55c810a7cfc0 <line:565:5, line:576:5> line:565:10 ConversionFlags
| |-EnumConstantDecl 0x55c810a7d0c0 <line:566:2, col:16> col:2 cf_zero_pad 'ErrorHandler::ConversionFlags'
| | `-ImplicitCastExpr 0x55c810a7d620 <col:16> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c810a7d0a0 <col:16> 'int' Int: 1
| |     `-IntegerLiteral 0x55c810a7d080 <col:16> 'int' 1
| |-EnumConstantDecl 0x55c810a7d150 <line:567:2, col:21> col:2 cf_plus_positive 'ErrorHandler::ConversionFlags'
| | `-ImplicitCastExpr 0x55c810a7d638 <col:21> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c810a7d130 <col:21> 'int' Int: 2
| |     `-IntegerLiteral 0x55c810a7d110 <col:21> 'int' 2
| |-EnumConstantDecl 0x55c810a7d1e0 <line:568:2, col:22> col:2 cf_space_positive 'ErrorHandler::ConversionFlags'
| | `-ImplicitCastExpr 0x55c810a7d650 <col:22> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c810a7d1c0 <col:22> 'int' Int: 4
| |     `-IntegerLiteral 0x55c810a7d1a0 <col:22> 'int' 4
| |-EnumConstantDecl 0x55c810a7d270 <line:569:2, col:17> col:2 cf_left_just 'ErrorHandler::ConversionFlags'
| | `-ImplicitCastExpr 0x55c810a7d668 <col:17> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c810a7d250 <col:17> 'int' Int: 8
| |     `-IntegerLiteral 0x55c810a7d230 <col:17> 'int' 8
| |-EnumConstantDecl 0x55c810a7d300 <line:570:2, col:22> col:2 cf_alternate_form 'ErrorHandler::ConversionFlags'
| | `-ImplicitCastExpr 0x55c810a7d680 <col:22> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c810a7d2e0 <col:22> 'int' Int: 16
| |     `-IntegerLiteral 0x55c810a7d2c0 <col:22> 'int' 16
| |-EnumConstantDecl 0x55c810a7d390 <line:571:2, col:19> col:2 cf_singlequote 'ErrorHandler::ConversionFlags'
| | `-ImplicitCastExpr 0x55c810a7d698 <col:19> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c810a7d370 <col:19> 'int' Int: 32
| |     `-IntegerLiteral 0x55c810a7d350 <col:19> 'int' 32
| |-EnumConstantDecl 0x55c810a7d420 <line:572:2, col:17> col:2 cf_uppercase 'ErrorHandler::ConversionFlags'
| | `-ImplicitCastExpr 0x55c810a7d6b0 <col:17> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c810a7d400 <col:17> 'int' Int: 64
| |     `-IntegerLiteral 0x55c810a7d3e0 <col:17> 'int' 64
| |-EnumConstantDecl 0x55c810a7d4b0 <line:573:2, col:14> col:2 cf_signed 'ErrorHandler::ConversionFlags'
| | `-ImplicitCastExpr 0x55c810a7d6c8 <col:14> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c810a7d490 <col:14> 'int' Int: 128
| |     `-IntegerLiteral 0x55c810a7d470 <col:14> 'int' 128
| |-EnumConstantDecl 0x55c810a7d540 <line:574:2, col:16> col:2 cf_negative 'ErrorHandler::ConversionFlags'
| | `-ImplicitCastExpr 0x55c810a7d6e0 <col:16> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c810a7d520 <col:16> 'int' Int: 256
| |     `-IntegerLiteral 0x55c810a7d500 <col:16> 'int' 256
| `-EnumConstantDecl 0x55c810a7d5d0 <line:575:2, col:12> col:2 cf_utf8 'ErrorHandler::ConversionFlags'
|   `-ImplicitCastExpr 0x55c810a7d6f8 <col:12> 'unsigned int' <IntegralCast>
|     `-ConstantExpr 0x55c810a7d5b0 <col:12> 'int' Int: 1024
|       `-IntegerLiteral 0x55c810a7d590 <col:12> 'int' 1024
|-CXXMethodDecl 0x55c810a7d908 <line:577:5, col:82> col:24 add_conversion 'ErrorHandler::Conversion *(const String &, ErrorHandler::ConversionFunction)' static
| |-ParmVarDecl 0x55c810a7d720 <col:39, col:53> col:53 name 'const String &'
| `-ParmVarDecl 0x55c810a7d7c0 <col:59, col:78> col:78 func 'ErrorHandler::ConversionFunction':'String (*)(int, __va_list_tag *)'
|-CXXMethodDecl 0x55c810a7da90 <line:578:5, col:56> col:16 remove_conversion 'int (ErrorHandler::Conversion *)' static
| `-ParmVarDecl 0x55c810a7d9c8 <col:34, col:46> col:46 conversion 'ErrorHandler::Conversion *'
|-AccessSpecDecl 0x55c810a7db38 <line:580:3, col:10> col:3 private
|-FieldDecl 0x55c810a7db78 <line:582:5, col:9> col:9 referenced _nerrors 'int'
|-VarDecl 0x55c810a7dbd8 <line:584:5, col:26> col:26 used the_default_handler 'ErrorHandler *' static
|-VarDecl 0x55c810a7dc50 <line:585:5, col:26> col:26 used the_silent_handler 'ErrorHandler *' static
|-CXXMethodDecl 0x55c810a7e050 <line:587:5, line:590:14> line:587:24 used skip_anno 'const char *(const String &, const char *, const char *, String *, String *, bool)' static
| |-ParmVarDecl 0x55c810a7dcc8 <col:34, col:48> col:48 str 'const String &'
| |-ParmVarDecl 0x55c810a7dd48 <line:588:6, col:18> col:18 begin 'const char *'
| |-ParmVarDecl 0x55c810a7ddc8 <col:25, col:37> col:37 end 'const char *'
| |-ParmVarDecl 0x55c810a7de40 <line:589:6, col:14> col:14 name_result 'String *'
| |-ParmVarDecl 0x55c810a7deb8 <col:27, col:35> col:35 value_result 'String *'
| `-ParmVarDecl 0x55c810a7df30 <line:590:6, col:11> col:11 raw 'bool'
|-CXXMethodDecl 0x55c810a7e178 <line:90:7> col:7 implicit operator= 'ErrorHandler &(const ErrorHandler &)' inline default noexcept-unevaluated 0x55c810a7e178
| `-ParmVarDecl 0x55c810a7e288 <col:7> col:7 'const ErrorHandler &'
`-CXXConstructorDecl 0x55c810a803d8 <col:7> col:7 implicit constexpr ErrorHandler 'void (const ErrorHandler &)' inline default noexcept-unevaluated 0x55c810a803d8
  `-ParmVarDecl 0x55c810a804e8 <col:7> col:7 'const ErrorHandler &'

Layout: <CGRecordLayout
  LLVMType:%class.ErrorHandler = type <{ i32 (...)**, i32, [4 x i8] }>
  NonVirtualBaseLLVMType:%class.ErrorHandler.base = type <{ i32 (...)**, i32 }>
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x55c8108840f0 <../dummy_inc/click/handler.hh:290:5, line:293:5> line:290:5 union definition
|-DefinitionData pass_in_registers aggregate standard_layout trivially_copyable pod trivial literal has_variant_members
| |-DefaultConstructor exists trivial
| |-CopyConstructor simple trivial has_const_param implicit_has_const_param
| |-MoveConstructor exists simple trivial
| |-CopyAssignment trivial has_const_param implicit_has_const_param
| |-MoveAssignment exists simple trivial
| `-Destructor simple irrelevant trivial
|-FieldDecl 0x55c810884240 <line:291:2, col:18> col:18 h 'HandlerCallback':'int (*)(int, String &, Element *, const Handler *, ErrorHandler *)'
|-FieldDecl 0x55c8108842c0 <line:292:2, col:22> col:22 referenced r 'ReadHandlerCallback':'String (*)(Element *, void *)'
|-CXXConstructorDecl 0x55c8108850b8 <line:290:5> col:5 implicit constexpr  'void (const Handler::(anonymous union at ../dummy_inc/click/handler.hh:290:5) &)' inline default trivial noexcept-unevaluated 0x55c8108850b8
| `-ParmVarDecl 0x55c8108851c8 <col:5> col:5 'const Handler::(anonymous union at ../dummy_inc/click/handler.hh:290:5) &'
|-CXXConstructorDecl 0x55c810885268 <col:5> col:5 implicit constexpr  'void (Handler::(anonymous union at ../dummy_inc/click/handler.hh:290:5) &&)' inline default trivial noexcept-unevaluated 0x55c810885268
| `-ParmVarDecl 0x55c810885378 <col:5> col:5 'Handler::(anonymous union at ../dummy_inc/click/handler.hh:290:5) &&'
|-CXXDestructorDecl 0x55c8108853e8 <col:5> col:5 implicit ~ 'void ()' inline default trivial noexcept-unevaluated 0x55c8108853e8
|-CXXMethodDecl 0x55c810885cb8 <col:5> col:5 implicit constexpr operator= 'Handler::(anonymous union at ../dummy_inc/click/handler.hh:290:5) &(const Handler::(anonymous union at ../dummy_inc/click/handler.hh:290:5) &)' inline default trivial noexcept-unevaluated 0x55c810885cb8
| `-ParmVarDecl 0x55c810885dc8 <col:5> col:5 'const Handler::(anonymous union at ../dummy_inc/click/handler.hh:290:5) &'
|-CXXMethodDecl 0x55c810885e38 <col:5> col:5 implicit constexpr operator= 'Handler::(anonymous union at ../dummy_inc/click/handler.hh:290:5) &(Handler::(anonymous union at ../dummy_inc/click/handler.hh:290:5) &&)' inline default trivial noexcept-unevaluated 0x55c810885e38
| `-ParmVarDecl 0x55c810885f48 <col:5> col:5 'Handler::(anonymous union at ../dummy_inc/click/handler.hh:290:5) &&'
`-CXXConstructorDecl 0x55c810b40808 <col:5> col:5 implicit used  'void () noexcept' inline default trivial
  `-CompoundStmt 0x55c810b408e0 <col:5>

Layout: <CGRecordLayout
  LLVMType:%union.anon = type { i32 (i32, %class.String*, %class.Element*, %class.Handler*, %class.ErrorHandler*)* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x55c8108843f0 <../dummy_inc/click/handler.hh:294:5, line:297:5> line:294:5 union definition
|-DefinitionData pass_in_registers aggregate standard_layout trivially_copyable pod trivial literal has_variant_members
| |-DefaultConstructor exists trivial
| |-CopyConstructor simple trivial has_const_param implicit_has_const_param
| |-MoveConstructor exists simple trivial
| |-CopyAssignment trivial has_const_param implicit_has_const_param
| |-MoveAssignment exists simple trivial
| `-Destructor simple irrelevant trivial
|-FieldDecl 0x55c810884518 <line:295:2, col:18> col:18 h 'HandlerCallback':'int (*)(int, String &, Element *, const Handler *, ErrorHandler *)'
|-FieldDecl 0x55c8108845a0 <line:296:2, col:23> col:23 referenced w 'WriteHandlerCallback':'int (*)(const String &, Element *, void *, ErrorHandler *)'
|-CXXConstructorDecl 0x55c810885518 <line:294:5> col:5 implicit constexpr  'void (const Handler::(anonymous union at ../dummy_inc/click/handler.hh:294:5) &)' inline default trivial noexcept-unevaluated 0x55c810885518
| `-ParmVarDecl 0x55c810885628 <col:5> col:5 'const Handler::(anonymous union at ../dummy_inc/click/handler.hh:294:5) &'
|-CXXConstructorDecl 0x55c8108856c8 <col:5> col:5 implicit constexpr  'void (Handler::(anonymous union at ../dummy_inc/click/handler.hh:294:5) &&)' inline default trivial noexcept-unevaluated 0x55c8108856c8
| `-ParmVarDecl 0x55c8108857d8 <col:5> col:5 'Handler::(anonymous union at ../dummy_inc/click/handler.hh:294:5) &&'
|-CXXDestructorDecl 0x55c810885848 <col:5> col:5 implicit ~ 'void ()' inline default trivial noexcept-unevaluated 0x55c810885848
|-CXXMethodDecl 0x55c810885fe8 <col:5> col:5 implicit constexpr operator= 'Handler::(anonymous union at ../dummy_inc/click/handler.hh:294:5) &(const Handler::(anonymous union at ../dummy_inc/click/handler.hh:294:5) &)' inline default trivial noexcept-unevaluated 0x55c810885fe8
| `-ParmVarDecl 0x55c8108860f8 <col:5> col:5 'const Handler::(anonymous union at ../dummy_inc/click/handler.hh:294:5) &'
|-CXXMethodDecl 0x55c810886168 <col:5> col:5 implicit constexpr operator= 'Handler::(anonymous union at ../dummy_inc/click/handler.hh:294:5) &(Handler::(anonymous union at ../dummy_inc/click/handler.hh:294:5) &&)' inline default trivial noexcept-unevaluated 0x55c810886168
| `-ParmVarDecl 0x55c810886278 <col:5> col:5 'Handler::(anonymous union at ../dummy_inc/click/handler.hh:294:5) &&'
`-CXXConstructorDecl 0x55c810b40940 <col:5> col:5 implicit used  'void () noexcept' inline default trivial
  `-CompoundStmt 0x55c810b40a20 <col:5>

Layout: <CGRecordLayout
  LLVMType:%union.anon.11 = type { i32 (i32, %class.String*, %class.Element*, %class.Handler*, %class.ErrorHandler*)* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x55c81087fa78 prev 0x55c81087ef80 <../dummy_inc/click/handler.hh:19:1, line:313:1> line:19:7 referenced class Handler definition
|-DefinitionData standard_layout has_user_declared_ctor has_mutable_fields can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor simple non_trivial has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveConstructor exists simple non_trivial needs_overload_resolution
| |-CopyAssignment non_trivial has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveAssignment exists simple non_trivial needs_overload_resolution
| `-Destructor simple non_trivial needs_overload_resolution
|-CXXRecordDecl 0x55c81087fb70 <col:1, col:7> col:7 implicit referenced class Handler
|-AccessSpecDecl 0x55c81087fc00 <col:17, col:23> col:17 public
|-EnumDecl 0x55c81087fc28 <line:21:5, line:59:5> line:21:10 Flags
| |-EnumConstantDecl 0x55c81087fd30 <line:22:2, col:11> col:2 referenced f_read 'Handler::Flags'
| | `-ImplicitCastExpr 0x55c810880a80 <col:11> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c81087fd10 <col:11> 'int' Int: 1
| |     `-IntegerLiteral 0x55c81087fcf0 <col:11> 'int' 1
| |-EnumConstantDecl 0x55c81087fdc0 <line:23:2, col:12> col:2 referenced f_write 'Handler::Flags'
| | `-ImplicitCastExpr 0x55c810880a98 <col:12> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c81087fda0 <col:12> 'int' Int: 2
| |     `-IntegerLiteral 0x55c81087fd80 <col:12> 'int' 2
| |-EnumConstantDecl 0x55c81087fe50 <line:24:2, col:17> col:2 referenced f_read_param 'Handler::Flags'
| | `-ImplicitCastExpr 0x55c810880ab0 <col:17> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c81087fe30 <col:17> 'int' Int: 4
| |     `-IntegerLiteral 0x55c81087fe10 <col:17> 'int' 4
| |-EnumConstantDecl 0x55c81087fee0 <line:25:2, col:16> col:2 referenced f_exclusive 'Handler::Flags'
| | `-ImplicitCastExpr 0x55c810880ac8 <col:16> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c81087fec0 <col:16> 'int' Int: 0
| |     `-IntegerLiteral 0x55c81087fea0 <col:16> 'int' 0
| |-EnumConstantDecl 0x55c81087ff70 <line:28:2, col:19> col:2 referenced f_nonexclusive 'Handler::Flags'
| | `-ImplicitCastExpr 0x55c810880ae0 <col:19> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c81087ff50 <col:19> 'int' Int: 32
| |     `-IntegerLiteral 0x55c81087ff30 <col:19> 'int' 32
| |-EnumConstantDecl 0x55c810880000 <line:31:2, col:10> col:2 referenced f_raw 'Handler::Flags'
| | `-ImplicitCastExpr 0x55c810880af8 <col:10> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c81087ffe0 <col:10> 'int' Int: 64
| |     `-IntegerLiteral 0x55c81087ffc0 <col:10> 'int' 64
| |-EnumConstantDecl 0x55c810880090 <line:32:2, col:19> col:2 referenced f_read_private 'Handler::Flags'
| | `-ImplicitCastExpr 0x55c810880b10 <col:19> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c810880070 <col:19> 'int' Int: 128
| |     `-IntegerLiteral 0x55c810880050 <col:19> 'int' 128
| |-EnumConstantDecl 0x55c810880120 <line:34:2, col:20> col:2 referenced f_write_private 'Handler::Flags'
| | `-ImplicitCastExpr 0x55c810880b28 <col:20> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c810880100 <col:20> 'int' Int: 256
| |     `-IntegerLiteral 0x55c8108800e0 <col:20> 'int' 256
| |-EnumConstantDecl 0x55c8108801b0 <line:36:2, col:17> col:2 referenced f_deprecated 'Handler::Flags'
| | `-ImplicitCastExpr 0x55c810880b40 <col:17> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c810880190 <col:17> 'int' Int: 512
| |     `-IntegerLiteral 0x55c810880170 <col:17> 'int' 512
| |-EnumConstantDecl 0x55c810880240 <line:38:2, col:15> col:2 referenced f_uncommon 'Handler::Flags'
| | `-ImplicitCastExpr 0x55c810880b58 <col:15> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c810880220 <col:15> 'int' Int: 1024
| |     `-IntegerLiteral 0x55c810880200 <col:15> 'int' 1024
| |-EnumConstantDecl 0x55c8108802d0 <line:40:2, col:11> col:2 referenced f_calm 'Handler::Flags'
| | `-ImplicitCastExpr 0x55c810880b70 <col:11> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c8108802b0 <col:11> 'int' Int: 2048
| |     `-IntegerLiteral 0x55c810880290 <col:11> 'int' 2048
| |-EnumConstantDecl 0x55c810880360 <line:41:2, col:16> col:2 referenced f_expensive 'Handler::Flags'
| | `-ImplicitCastExpr 0x55c810880b88 <col:16> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c810880340 <col:16> 'int' Int: 4096
| |     `-IntegerLiteral 0x55c810880320 <col:16> 'int' 4096
| |-EnumConstantDecl 0x55c8108803f0 <line:42:2, col:13> col:2 referenced f_button 'Handler::Flags'
| | `-ImplicitCastExpr 0x55c810880ba0 <col:13> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c8108803d0 <col:13> 'int' Int: 8192
| |     `-IntegerLiteral 0x55c8108803b0 <col:13> 'int' 8192
| |-EnumConstantDecl 0x55c810880480 <line:43:2, col:15> col:2 referenced f_checkbox 'Handler::Flags'
| | `-ImplicitCastExpr 0x55c810880bb8 <col:15> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c810880460 <col:15> 'int' Int: 16384
| |     `-IntegerLiteral 0x55c810880440 <col:15> 'int' 16384
| |-EnumConstantDecl 0x55c810880550 <line:45:2, col:20> col:2 referenced f_driver0 'Handler::Flags'
| | `-ConstantExpr 0x55c810880530 <col:14, col:20> 'unsigned int' Int: 67108864
| |   `-BinaryOperator 0x55c810880510 <col:14, col:20> 'unsigned int' '<<'
| |     |-IntegerLiteral 0x55c8108804d0 <col:14> 'unsigned int' 1
| |     `-IntegerLiteral 0x55c8108804f0 <col:20> 'int' 26
| |-EnumConstantDecl 0x55c810880620 <line:46:9, col:27> col:9 referenced f_driver1 'Handler::Flags'
| | `-ConstantExpr 0x55c810880600 <col:21, col:27> 'unsigned int' Int: 134217728
| |   `-BinaryOperator 0x55c8108805e0 <col:21, col:27> 'unsigned int' '<<'
| |     |-IntegerLiteral 0x55c8108805a0 <col:21> 'unsigned int' 1
| |     `-IntegerLiteral 0x55c8108805c0 <col:27> 'int' 27
| |-EnumConstantDecl 0x55c8108806b0 <line:48:2, col:17> col:2 referenced f_user_shift 'Handler::Flags'
| | `-ImplicitCastExpr 0x55c810880bd0 <col:17> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c810880690 <col:17> 'int' Int: 28
| |     `-IntegerLiteral 0x55c810880670 <col:17> 'int' 28
| |-EnumConstantDecl 0x55c810880780 <line:49:2, col:18> col:2 referenced f_user0 'Handler::Flags'
| | `-ConstantExpr 0x55c810880760 <col:12, col:18> 'unsigned int' Int: 268435456
| |   `-BinaryOperator 0x55c810880740 <col:12, col:18> 'unsigned int' '<<'
| |     |-IntegerLiteral 0x55c810880700 <col:12> 'unsigned int' 1
| |     `-DeclRefExpr 0x55c810880720 <col:18> 'int' EnumConstant 0x55c8108806b0 'f_user_shift' 'Handler::Flags'
| |-EnumConstantDecl 0x55c810880810 <line:54:2, col:25> col:2 referenced f_read_comprehensive 'Handler::Flags'
| | `-ImplicitCastExpr 0x55c810880be8 <col:25> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c8108807f0 <col:25> 'int' Int: 8
| |     `-IntegerLiteral 0x55c8108807d0 <col:25> 'int' 8
| |-EnumConstantDecl 0x55c8108808a0 <line:55:2, col:26> col:2 referenced f_write_comprehensive 'Handler::Flags'
| | `-ImplicitCastExpr 0x55c810880c00 <col:26> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c810880880 <col:26> 'int' Int: 16
| |     `-IntegerLiteral 0x55c810880860 <col:26> 'int' 16
| `-EnumConstantDecl 0x55c810880a30 <line:56:2, col:71> col:2 referenced f_special 'Handler::Flags'
|   `-ImplicitCastExpr 0x55c810880c18 <col:14, col:71> 'unsigned int' <IntegralCast>
|     `-ConstantExpr 0x55c810880a10 <col:14, col:71> 'int' Int: 31
|       `-BinaryOperator 0x55c8108809f0 <col:14, col:71> 'int' '|'
|         |-BinaryOperator 0x55c8108809b0 <col:14, col:48> 'int' '|'
|         | |-BinaryOperator 0x55c810880970 <col:14, col:33> 'int' '|'
|         | | |-BinaryOperator 0x55c810880930 <col:14, col:23> 'int' '|'
|         | | | |-DeclRefExpr 0x55c8108808f0 <col:14> 'int' EnumConstant 0x55c81087fd30 'f_read' 'Handler::Flags'
|         | | | `-DeclRefExpr 0x55c810880910 <col:23> 'int' EnumConstant 0x55c81087fdc0 'f_write' 'Handler::Flags'
|         | | `-DeclRefExpr 0x55c810880950 <col:33> 'int' EnumConstant 0x55c81087fe50 'f_read_param' 'Handler::Flags'
|         | `-DeclRefExpr 0x55c810880990 <col:48> 'int' EnumConstant 0x55c810880810 'f_read_comprehensive' 'Handler::Flags'
|         `-DeclRefExpr 0x55c8108809d0 <col:71> 'int' EnumConstant 0x55c8108808a0 'f_write_comprehensive' 'Handler::Flags'
|-CXXMethodDecl 0x55c810880c78 <line:62:5, line:64:5> line:62:26 name 'const String &() const' inline
| `-CompoundStmt 0x55c8108866a8 <col:39, line:64:5>
|   `-ReturnStmt 0x55c810886698 <line:63:2, col:9>
|     `-MemberExpr 0x55c810886668 <col:9> 'const String' lvalue ->_name 0x55c8108840a0
|       `-CXXThisExpr 0x55c810886658 <col:9> 'const Handler *' implicit this
|-CXXMethodDecl 0x55c810880d38 <line:69:5, line:71:5> line:69:21 flags 'uint32_t () const' inline
| `-CompoundStmt 0x55c810886728 <col:35, line:71:5>
|   `-ReturnStmt 0x55c810886718 <line:70:2, col:9>
|     `-ImplicitCastExpr 0x55c810886700 <col:9> 'uint32_t':'unsigned int' <LValueToRValue>
|       `-MemberExpr 0x55c8108866d0 <col:9> 'const uint32_t':'const unsigned int' lvalue ->_flags 0x55c8108847b0
|         `-CXXThisExpr 0x55c8108866c0 <col:9> 'const Handler *' implicit this
|-CXXMethodDecl 0x55c810880e88 <line:75:5, line:77:5> line:75:18 user_data 'void *(int) const' inline
| |-ParmVarDecl 0x55c810880df0 <col:28, col:32> col:32 used op 'int'
| `-CompoundStmt 0x55c8108868a8 <col:42, line:77:5>
|   `-ReturnStmt 0x55c810886898 <line:76:2, col:44>
|     `-ImplicitCastExpr 0x55c810886880 <col:9, col:44> 'void *' <LValueToRValue>
|       `-ConditionalOperator 0x55c810886850 <col:9, col:44> 'void *const' lvalue
|         |-BinaryOperator 0x55c8108867b0 <col:9, col:15> 'bool' '=='
|         | |-ImplicitCastExpr 0x55c810886780 <col:9> 'int' <LValueToRValue>
|         | | `-DeclRefExpr 0x55c810886740 <col:9> 'int' lvalue ParmVar 0x55c810880df0 'op' 'int'
|         | `-ImplicitCastExpr 0x55c810886798 <col:15> 'int' <IntegralCast>
|         |   `-DeclRefExpr 0x55c810886760 <col:15> 'Handler::Flags' EnumConstant 0x55c81087fdc0 'f_write' 'Handler::Flags'
|         |-MemberExpr 0x55c8108867e0 <col:25> 'void *const' lvalue ->_write_user_data 0x55c810884750
|         | `-CXXThisExpr 0x55c8108867d0 <col:25> 'const Handler *' implicit this
|         `-MemberExpr 0x55c810886820 <col:44> 'void *const' lvalue ->_read_user_data 0x55c8108846e8
|           `-CXXThisExpr 0x55c810886810 <col:44> 'const Handler *' implicit this
|-CXXMethodDecl 0x55c810880f58 <line:80:5, line:82:5> line:80:18 read_user_data 'void *() const' inline
| `-CompoundStmt 0x55c810886928 <col:41, line:82:5>
|   `-ReturnStmt 0x55c810886918 <line:81:2, col:9>
|     `-ImplicitCastExpr 0x55c810886900 <col:9> 'void *' <LValueToRValue>
|       `-MemberExpr 0x55c8108868d0 <col:9> 'void *const' lvalue ->_read_user_data 0x55c8108846e8
|         `-CXXThisExpr 0x55c8108868c0 <col:9> 'const Handler *' implicit this
|-CXXMethodDecl 0x55c810881020 <line:85:5, line:87:5> line:85:18 write_user_data 'void *() const' inline
| `-CompoundStmt 0x55c8108869a8 <col:42, line:87:5>
|   `-ReturnStmt 0x55c810886998 <line:86:2, col:9>
|     `-ImplicitCastExpr 0x55c810886980 <col:9> 'void *' <LValueToRValue>
|       `-MemberExpr 0x55c810886950 <col:9> 'void *const' lvalue ->_write_user_data 0x55c810884750
|         `-CXXThisExpr 0x55c810886940 <col:9> 'const Handler *' implicit this
|-CXXMethodDecl 0x55c8108810e8 <line:90:5, col:63> col:18 user_data1 'void *() const' inline
| `-DeprecatedAttr 0x55c810881188 <col:52> "" ""
|-CXXMethodDecl 0x55c810881220 <line:91:5, col:63> col:18 user_data2 'void *() const' inline
| `-DeprecatedAttr 0x55c8108812c0 <col:52> "" ""
|-CXXMethodDecl 0x55c810881350 <line:96:5, line:98:5> line:96:17 readable 'bool () const' inline
| `-CompoundStmt 0x55c810886a98 <col:34, line:98:5>
|   `-ReturnStmt 0x55c810886a88 <line:97:2, col:18>
|     `-ImplicitCastExpr 0x55c810886a70 <col:9, col:18> 'bool' <IntegralToBoolean>
|       `-BinaryOperator 0x55c810886a50 <col:9, col:18> 'unsigned int' '&'
|         |-ImplicitCastExpr 0x55c810886a20 <col:9> 'uint32_t':'unsigned int' <LValueToRValue>
|         | `-MemberExpr 0x55c8108869d0 <col:9> 'const uint32_t':'const unsigned int' lvalue ->_flags 0x55c8108847b0
|         |   `-CXXThisExpr 0x55c8108869c0 <col:9> 'const Handler *' implicit this
|         `-ImplicitCastExpr 0x55c810886a38 <col:18> 'unsigned int' <IntegralCast>
|           `-DeclRefExpr 0x55c810886a00 <col:18> 'Handler::Flags' EnumConstant 0x55c81087fd30 'f_read' 'Handler::Flags'
|-CXXMethodDecl 0x55c810881410 <line:102:5, line:104:5> line:102:17 read_param 'bool () const' inline
| `-CompoundStmt 0x55c810886b88 <col:36, line:104:5>
|   `-ReturnStmt 0x55c810886b78 <line:103:2, col:18>
|     `-ImplicitCastExpr 0x55c810886b60 <col:9, col:18> 'bool' <IntegralToBoolean>
|       `-BinaryOperator 0x55c810886b40 <col:9, col:18> 'unsigned int' '&'
|         |-ImplicitCastExpr 0x55c810886b10 <col:9> 'uint32_t':'unsigned int' <LValueToRValue>
|         | `-MemberExpr 0x55c810886ac0 <col:9> 'const uint32_t':'const unsigned int' lvalue ->_flags 0x55c8108847b0
|         |   `-CXXThisExpr 0x55c810886ab0 <col:9> 'const Handler *' implicit this
|         `-ImplicitCastExpr 0x55c810886b28 <col:18> 'unsigned int' <IntegralCast>
|           `-DeclRefExpr 0x55c810886af0 <col:18> 'Handler::Flags' EnumConstant 0x55c81087fe50 'f_read_param' 'Handler::Flags'
|-CXXMethodDecl 0x55c8108814d0 <line:111:5, line:113:5> line:111:17 used read_visible 'bool () const' inline
| `-CompoundStmt 0x55c810886d68 <col:38, line:113:5>
|   `-ReturnStmt 0x55c810886d58 <line:112:2, col:49>
|     `-BinaryOperator 0x55c810886d38 <col:9, col:49> 'bool' '=='
|       |-ParenExpr 0x55c810886ce0 <col:9, col:44> 'unsigned int'
|       | `-BinaryOperator 0x55c810886cc0 <col:10, col:43> 'unsigned int' '&'
|       |   |-ImplicitCastExpr 0x55c810886c90 <col:10> 'uint32_t':'unsigned int' <LValueToRValue>
|       |   | `-MemberExpr 0x55c810886bb0 <col:10> 'const uint32_t':'const unsigned int' lvalue ->_flags 0x55c8108847b0
|       |   |   `-CXXThisExpr 0x55c810886ba0 <col:10> 'const Handler *' implicit this
|       |   `-ImplicitCastExpr 0x55c810886ca8 <col:19, col:43> 'unsigned int' <IntegralCast>
|       |     `-ParenExpr 0x55c810886c70 <col:19, col:43> 'int'
|       |       `-BinaryOperator 0x55c810886c50 <col:20, col:29> 'int' '|'
|       |         |-ImplicitCastExpr 0x55c810886c20 <col:20> 'int' <IntegralCast>
|       |         | `-DeclRefExpr 0x55c810886be0 <col:20> 'Handler::Flags' EnumConstant 0x55c81087fd30 'f_read' 'Handler::Flags'
|       |         `-ImplicitCastExpr 0x55c810886c38 <col:29> 'int' <IntegralCast>
|       |           `-DeclRefExpr 0x55c810886c00 <col:29> 'Handler::Flags' EnumConstant 0x55c810880090 'f_read_private' 'Handler::Flags'
|       `-ImplicitCastExpr 0x55c810886d20 <col:49> 'unsigned int' <IntegralCast>
|         `-DeclRefExpr 0x55c810886d00 <col:49> 'Handler::Flags' EnumConstant 0x55c81087fd30 'f_read' 'Handler::Flags'
|-CXXMethodDecl 0x55c810881590 <line:116:5, line:118:5> line:116:17 writable 'bool () const' inline
| `-CompoundStmt 0x55c810886e58 <col:34, line:118:5>
|   `-ReturnStmt 0x55c810886e48 <line:117:2, col:18>
|     `-ImplicitCastExpr 0x55c810886e30 <col:9, col:18> 'bool' <IntegralToBoolean>
|       `-BinaryOperator 0x55c810886e10 <col:9, col:18> 'unsigned int' '&'
|         |-ImplicitCastExpr 0x55c810886de0 <col:9> 'uint32_t':'unsigned int' <LValueToRValue>
|         | `-MemberExpr 0x55c810886d90 <col:9> 'const uint32_t':'const unsigned int' lvalue ->_flags 0x55c8108847b0
|         |   `-CXXThisExpr 0x55c810886d80 <col:9> 'const Handler *' implicit this
|         `-ImplicitCastExpr 0x55c810886df8 <col:18> 'unsigned int' <IntegralCast>
|           `-DeclRefExpr 0x55c810886dc0 <col:18> 'Handler::Flags' EnumConstant 0x55c81087fdc0 'f_write' 'Handler::Flags'
|-CXXMethodDecl 0x55c810881650 <line:125:5, line:127:5> line:125:17 used write_visible 'bool () const' inline
| `-CompoundStmt 0x55c810887038 <col:39, line:127:5>
|   `-ReturnStmt 0x55c810887028 <line:126:2, col:51>
|     `-BinaryOperator 0x55c810887008 <col:9, col:51> 'bool' '=='
|       |-ParenExpr 0x55c810886fb0 <col:9, col:46> 'unsigned int'
|       | `-BinaryOperator 0x55c810886f90 <col:10, col:45> 'unsigned int' '&'
|       |   |-ImplicitCastExpr 0x55c810886f60 <col:10> 'uint32_t':'unsigned int' <LValueToRValue>
|       |   | `-MemberExpr 0x55c810886e80 <col:10> 'const uint32_t':'const unsigned int' lvalue ->_flags 0x55c8108847b0
|       |   |   `-CXXThisExpr 0x55c810886e70 <col:10> 'const Handler *' implicit this
|       |   `-ImplicitCastExpr 0x55c810886f78 <col:19, col:45> 'unsigned int' <IntegralCast>
|       |     `-ParenExpr 0x55c810886f40 <col:19, col:45> 'int'
|       |       `-BinaryOperator 0x55c810886f20 <col:20, col:30> 'int' '|'
|       |         |-ImplicitCastExpr 0x55c810886ef0 <col:20> 'int' <IntegralCast>
|       |         | `-DeclRefExpr 0x55c810886eb0 <col:20> 'Handler::Flags' EnumConstant 0x55c81087fdc0 'f_write' 'Handler::Flags'
|       |         `-ImplicitCastExpr 0x55c810886f08 <col:30> 'int' <IntegralCast>
|       |           `-DeclRefExpr 0x55c810886ed0 <col:30> 'Handler::Flags' EnumConstant 0x55c810880120 'f_write_private' 'Handler::Flags'
|       `-ImplicitCastExpr 0x55c810886ff0 <col:51> 'unsigned int' <IntegralCast>
|         `-DeclRefExpr 0x55c810886fd0 <col:51> 'Handler::Flags' EnumConstant 0x55c81087fdc0 'f_write' 'Handler::Flags'
|-CXXMethodDecl 0x55c810881710 <line:130:5, line:132:5> line:130:17 visible 'bool () const' inline
| `-CompoundStmt 0x55c810887140 <col:33, line:132:5>
|   `-ReturnStmt 0x55c810887130 <line:131:2, col:41>
|     `-BinaryOperator 0x55c810887110 <col:9, col:41> 'bool' '||'
|       |-CXXMemberCallExpr 0x55c810887090 <col:9, col:22> 'bool'
|       | `-MemberExpr 0x55c810887060 <col:9> '<bound member function type>' ->read_visible 0x55c8108814d0
|       |   `-CXXThisExpr 0x55c810887050 <col:9> 'const Handler *' implicit this
|       `-CXXMemberCallExpr 0x55c8108870f0 <col:27, col:41> 'bool'
|         `-MemberExpr 0x55c8108870c0 <col:27> '<bound member function type>' ->write_visible 0x55c810881650
|           `-CXXThisExpr 0x55c8108870b0 <col:27> 'const Handler *' implicit this
|-CXXMethodDecl 0x55c8108817d0 <line:136:5, line:138:5> line:136:17 allow_concurrent_handlers 'bool () const' inline
| `-CompoundStmt 0x55c810887250 <col:51, line:138:5>
|   `-ReturnStmt 0x55c810887240 <line:137:9, col:40>
|     `-ImplicitCastExpr 0x55c810887228 <col:16, col:40> 'bool' <IntegralToBoolean>
|       `-ParenExpr 0x55c810887208 <col:16, col:40> 'unsigned int'
|         `-BinaryOperator 0x55c8108871e8 <col:17, col:26> 'unsigned int' '&'
|           |-ImplicitCastExpr 0x55c8108871b8 <col:17> 'uint32_t':'unsigned int' <LValueToRValue>
|           | `-MemberExpr 0x55c810887168 <col:17> 'const uint32_t':'const unsigned int' lvalue ->_flags 0x55c8108847b0
|           |   `-CXXThisExpr 0x55c810887158 <col:17> 'const Handler *' implicit this
|           `-ImplicitCastExpr 0x55c8108871d0 <col:26> 'unsigned int' <IntegralCast>
|             `-DeclRefExpr 0x55c810887198 <col:26> 'Handler::Flags' EnumConstant 0x55c81087ff70 'f_nonexclusive' 'Handler::Flags'
|-CXXMethodDecl 0x55c810881890 <line:142:5, line:144:5> line:142:17 allow_concurrent_threads 'bool () const' inline
| `-CompoundStmt 0x55c810887360 <col:50, line:144:5>
|   `-ReturnStmt 0x55c810887350 <line:143:9, col:40>
|     `-ImplicitCastExpr 0x55c810887338 <col:16, col:40> 'bool' <IntegralToBoolean>
|       `-ParenExpr 0x55c810887318 <col:16, col:40> 'unsigned int'
|         `-BinaryOperator 0x55c8108872f8 <col:17, col:26> 'unsigned int' '&'
|           |-ImplicitCastExpr 0x55c8108872c8 <col:17> 'uint32_t':'unsigned int' <LValueToRValue>
|           | `-MemberExpr 0x55c810887278 <col:17> 'const uint32_t':'const unsigned int' lvalue ->_flags 0x55c8108847b0
|           |   `-CXXThisExpr 0x55c810887268 <col:17> 'const Handler *' implicit this
|           `-ImplicitCastExpr 0x55c8108872e0 <col:26> 'unsigned int' <IntegralCast>
|             `-DeclRefExpr 0x55c8108872a8 <col:26> 'Handler::Flags' EnumConstant 0x55c81087ff70 'f_nonexclusive' 'Handler::Flags'
|-CXXMethodDecl 0x55c810881950 <line:164:5, line:166:5> line:164:17 raw 'bool () const' inline
| `-CompoundStmt 0x55c810887450 <col:29, line:166:5>
|   `-ReturnStmt 0x55c810887440 <line:165:2, col:18>
|     `-ImplicitCastExpr 0x55c810887428 <col:9, col:18> 'bool' <IntegralToBoolean>
|       `-BinaryOperator 0x55c810887408 <col:9, col:18> 'unsigned int' '&'
|         |-ImplicitCastExpr 0x55c8108873d8 <col:9> 'uint32_t':'unsigned int' <LValueToRValue>
|         | `-MemberExpr 0x55c810887388 <col:9> 'const uint32_t':'const unsigned int' lvalue ->_flags 0x55c8108847b0
|         |   `-CXXThisExpr 0x55c810887378 <col:9> 'const Handler *' implicit this
|         `-ImplicitCastExpr 0x55c8108873f0 <col:18> 'unsigned int' <IntegralCast>
|           `-DeclRefExpr 0x55c8108873b8 <col:18> 'Handler::Flags' EnumConstant 0x55c810880000 'f_raw' 'Handler::Flags'
|-CXXMethodDecl 0x55c810881bd8 <line:177:5, col:75> col:12 used call_read 'String (Element *, const String &, ErrorHandler *) const'
| |-ParmVarDecl 0x55c810881a00 <col:22, col:31> col:31 e 'Element *'
| |-ParmVarDecl 0x55c810881a78 <col:34, col:48> col:48 param 'const String &'
| `-ParmVarDecl 0x55c810881af0 <col:55, col:69> col:69 errh 'ErrorHandler *'
|-CXXMethodDecl 0x55c810881de8 <line:186:5, line:188:5> line:186:19 call_read 'String (Element *, ErrorHandler *) const' inline
| |-ParmVarDecl 0x55c810881ca0 <col:29, col:38> col:38 used e 'Element *'
| |-ParmVarDecl 0x55c810881d18 <col:41, col:62> col:55 used errh 'ErrorHandler *' cinit
| | `-ImplicitCastExpr 0x55c810886590 <col:62> 'ErrorHandler *' <NullToPointer>
| |   `-IntegerLiteral 0x55c810886570 <col:62> 'int' 0
| `-CompoundStmt 0x55c8108876f0 <col:71, line:188:5>
|   `-ReturnStmt 0x55c8108876e0 <line:187:2, col:36>
|     `-ExprWithCleanups 0x55c8108876c8 <col:9, col:36> 'String'
|       `-CXXConstructExpr 0x55c810887698 <col:9, col:36> 'String' 'void (String &&)' elidable
|         `-MaterializeTemporaryExpr 0x55c810887680 <col:9, col:36> 'String' xvalue
|           `-CXXBindTemporaryExpr 0x55c810887660 <col:9, col:36> 'String' (CXXTemporary 0x55c810887660)
|             `-CXXMemberCallExpr 0x55c8108875c0 <col:9, col:36> 'String'
|               |-MemberExpr 0x55c810887590 <col:9> '<bound member function type>' ->call_read 0x55c810881bd8
|               | `-CXXThisExpr 0x55c810887580 <col:9> 'const Handler *' implicit this
|               |-ImplicitCastExpr 0x55c8108875f8 <col:19> 'Element *' <LValueToRValue>
|               | `-DeclRefExpr 0x55c8108874d8 <col:19> 'Element *' lvalue ParmVar 0x55c810881ca0 'e' 'Element *'
|               |-MaterializeTemporaryExpr 0x55c810887628 <col:22, col:29> 'const String' lvalue
|               | `-ImplicitCastExpr 0x55c810887610 <col:22, col:29> 'const String' <NoOp>
|               |   `-CXXBindTemporaryExpr 0x55c810887540 <col:22, col:29> 'String' (CXXTemporary 0x55c810887540)
|               |     `-CXXTemporaryObjectExpr 0x55c810887508 <col:22, col:29> 'String' 'void ()'
|               `-ImplicitCastExpr 0x55c810887640 <col:32> 'ErrorHandler *' <LValueToRValue>
|                 `-DeclRefExpr 0x55c810887560 <col:32> 'ErrorHandler *' lvalue ParmVar 0x55c810881d18 'errh' 'ErrorHandler *'
|-CXXMethodDecl 0x55c810882080 <line:198:5, col:73> col:9 call_write 'int (const String &, Element *, ErrorHandler *) const'
| |-ParmVarDecl 0x55c810881ea8 <col:20, col:34> col:34 value 'const String &'
| |-ParmVarDecl 0x55c810881f20 <col:41, col:50> col:50 e 'Element *'
| `-ParmVarDecl 0x55c810881f98 <col:53, col:67> col:67 errh 'ErrorHandler *'
|-CXXMethodDecl 0x55c810882208 <line:207:5, col:37> col:12 unparse_name 'String (Element *) const'
| `-ParmVarDecl 0x55c810882148 <col:25, col:34> col:34 e 'Element *'
|-CXXMethodDecl 0x55c810882438 <line:216:5, col:63> col:19 unparse_name 'String (Element *, const String &)' static
| |-ParmVarDecl 0x55c8108822c0 <col:32, col:41> col:41 e 'Element *'
| `-ParmVarDecl 0x55c810882338 <col:44, col:58> col:58 hname 'const String &'
|-CXXMethodDecl 0x55c810882550 <line:223:5, line:225:5> line:223:34 blank_handler 'const Handler *()' static inline
| `-CompoundStmt 0x55c810887750 <col:50, line:225:5>
|   `-ReturnStmt 0x55c810887740 <line:224:2, col:9>
|     `-ImplicitCastExpr 0x55c810887728 <col:9> 'const Handler *' <LValueToRValue>
|       `-DeclRefExpr 0x55c810887708 <col:9> 'const Handler *' lvalue Var 0x55c8108848e0 'the_blank_handler' 'const Handler *'
|-EnumDecl 0x55c8108825f0 <line:229:5, line:251:5> line:229:5
| |-EnumConstantDecl 0x55c8108826f0 <line:230:2, col:11> col:2 h_read 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55c810883280 <col:11> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c8108826d0 <col:11> 'Handler::Flags' Int: 1
| |     `-DeclRefExpr 0x55c8108826b0 <col:11> 'Handler::Flags' EnumConstant 0x55c81087fd30 'f_read' 'Handler::Flags'
| |-EnumConstantDecl 0x55c810882780 <line:231:2, col:12> col:2 h_write 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55c810883298 <col:12> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c810882760 <col:12> 'Handler::Flags' Int: 2
| |     `-DeclRefExpr 0x55c810882740 <col:12> 'Handler::Flags' EnumConstant 0x55c81087fdc0 'f_write' 'Handler::Flags'
| |-EnumConstantDecl 0x55c810882810 <line:232:2, col:17> col:2 h_read_param 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55c8108832b0 <col:17> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c8108827f0 <col:17> 'Handler::Flags' Int: 4
| |     `-DeclRefExpr 0x55c8108827d0 <col:17> 'Handler::Flags' EnumConstant 0x55c81087fe50 'f_read_param' 'Handler::Flags'
| |-EnumConstantDecl 0x55c8108828a0 <line:233:2, col:16> col:2 h_exclusive 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55c8108832c8 <col:16> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c810882880 <col:16> 'Handler::Flags' Int: 0
| |     `-DeclRefExpr 0x55c810882860 <col:16> 'Handler::Flags' EnumConstant 0x55c81087fee0 'f_exclusive' 'Handler::Flags'
| |-EnumConstantDecl 0x55c810882930 <line:234:2, col:19> col:2 h_nonexclusive 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55c8108832e0 <col:19> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c810882910 <col:19> 'Handler::Flags' Int: 32
| |     `-DeclRefExpr 0x55c8108828f0 <col:19> 'Handler::Flags' EnumConstant 0x55c81087ff70 'f_nonexclusive' 'Handler::Flags'
| |-EnumConstantDecl 0x55c8108829c0 <line:235:2, col:10> col:2 h_raw 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55c8108832f8 <col:10> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c8108829a0 <col:10> 'Handler::Flags' Int: 64
| |     `-DeclRefExpr 0x55c810882980 <col:10> 'Handler::Flags' EnumConstant 0x55c810880000 'f_raw' 'Handler::Flags'
| |-EnumConstantDecl 0x55c810882a50 <line:236:2, col:19> col:2 h_read_private 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55c810883310 <col:19> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c810882a30 <col:19> 'Handler::Flags' Int: 128
| |     `-DeclRefExpr 0x55c810882a10 <col:19> 'Handler::Flags' EnumConstant 0x55c810880090 'f_read_private' 'Handler::Flags'
| |-EnumConstantDecl 0x55c810882ae0 <line:237:2, col:20> col:2 h_write_private 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55c810883328 <col:20> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c810882ac0 <col:20> 'Handler::Flags' Int: 256
| |     `-DeclRefExpr 0x55c810882aa0 <col:20> 'Handler::Flags' EnumConstant 0x55c810880120 'f_write_private' 'Handler::Flags'
| |-EnumConstantDecl 0x55c810882b70 <line:238:2, col:17> col:2 h_deprecated 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55c810883340 <col:17> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c810882b50 <col:17> 'Handler::Flags' Int: 512
| |     `-DeclRefExpr 0x55c810882b30 <col:17> 'Handler::Flags' EnumConstant 0x55c8108801b0 'f_deprecated' 'Handler::Flags'
| |-EnumConstantDecl 0x55c810882c00 <line:239:2, col:15> col:2 h_uncommon 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55c810883358 <col:15> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c810882be0 <col:15> 'Handler::Flags' Int: 1024
| |     `-DeclRefExpr 0x55c810882bc0 <col:15> 'Handler::Flags' EnumConstant 0x55c810880240 'f_uncommon' 'Handler::Flags'
| |-EnumConstantDecl 0x55c810882c90 <line:240:2, col:11> col:2 h_calm 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55c810883370 <col:11> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c810882c70 <col:11> 'Handler::Flags' Int: 2048
| |     `-DeclRefExpr 0x55c810882c50 <col:11> 'Handler::Flags' EnumConstant 0x55c8108802d0 'f_calm' 'Handler::Flags'
| |-EnumConstantDecl 0x55c810882d20 <line:241:2, col:16> col:2 h_expensive 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55c810883388 <col:16> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c810882d00 <col:16> 'Handler::Flags' Int: 4096
| |     `-DeclRefExpr 0x55c810882ce0 <col:16> 'Handler::Flags' EnumConstant 0x55c810880360 'f_expensive' 'Handler::Flags'
| |-EnumConstantDecl 0x55c810882db0 <line:242:2, col:13> col:2 h_button 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55c8108833a0 <col:13> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c810882d90 <col:13> 'Handler::Flags' Int: 8192
| |     `-DeclRefExpr 0x55c810882d70 <col:13> 'Handler::Flags' EnumConstant 0x55c8108803f0 'f_button' 'Handler::Flags'
| |-EnumConstantDecl 0x55c810882e40 <line:243:2, col:15> col:2 h_checkbox 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55c8108833b8 <col:15> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c810882e20 <col:15> 'Handler::Flags' Int: 16384
| |     `-DeclRefExpr 0x55c810882e00 <col:15> 'Handler::Flags' EnumConstant 0x55c810880480 'f_checkbox' 'Handler::Flags'
| |-EnumConstantDecl 0x55c810882ed0 <line:244:2, col:20> col:2 h_driver_flag_0 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55c8108833d0 <col:20> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c810882eb0 <col:20> 'Handler::Flags' Int: 67108864
| |     `-DeclRefExpr 0x55c810882e90 <col:20> 'Handler::Flags' EnumConstant 0x55c810880550 'f_driver0' 'Handler::Flags'
| |-EnumConstantDecl 0x55c810882f60 <line:245:9, col:27> col:9 h_driver_flag_1 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55c8108833e8 <col:27> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c810882f40 <col:27> 'Handler::Flags' Int: 134217728
| |     `-DeclRefExpr 0x55c810882f20 <col:27> 'Handler::Flags' EnumConstant 0x55c810880620 'f_driver1' 'Handler::Flags'
| |-EnumConstantDecl 0x55c810882ff0 <line:246:2, col:22> col:2 h_user_flag_shift 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55c810883400 <col:22> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c810882fd0 <col:22> 'Handler::Flags' Int: 28
| |     `-DeclRefExpr 0x55c810882fb0 <col:22> 'Handler::Flags' EnumConstant 0x55c8108806b0 'f_user_shift' 'Handler::Flags'
| |-EnumConstantDecl 0x55c810883080 <line:247:2, col:18> col:2 h_user_flag_0 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55c810883418 <col:18> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c810883060 <col:18> 'Handler::Flags' Int: 268435456
| |     `-DeclRefExpr 0x55c810883040 <col:18> 'Handler::Flags' EnumConstant 0x55c810880780 'f_user0' 'Handler::Flags'
| |-EnumConstantDecl 0x55c810883110 <line:248:2, col:25> col:2 h_read_comprehensive 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55c810883430 <col:25> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c8108830f0 <col:25> 'Handler::Flags' Int: 8
| |     `-DeclRefExpr 0x55c8108830d0 <col:25> 'Handler::Flags' EnumConstant 0x55c810880810 'f_read_comprehensive' 'Handler::Flags'
| |-EnumConstantDecl 0x55c8108831a0 <line:249:2, col:26> col:2 h_write_comprehensive 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55c810883448 <col:26> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c810883180 <col:26> 'Handler::Flags' Int: 16
| |     `-DeclRefExpr 0x55c810883160 <col:26> 'Handler::Flags' EnumConstant 0x55c8108808a0 'f_write_comprehensive' 'Handler::Flags'
| `-EnumConstantDecl 0x55c810883230 <line:250:2, col:20> col:2 h_special_flags 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
|   `-ImplicitCastExpr 0x55c810883460 <col:20> 'unsigned int' <IntegralCast>
|     `-ConstantExpr 0x55c810883210 <col:20> 'Handler::Flags' Int: 31
|       `-DeclRefExpr 0x55c8108831f0 <col:20> 'Handler::Flags' EnumConstant 0x55c810880a30 'f_special' 'Handler::Flags'
|-EnumDecl 0x55c810883478 <line:252:5, line:267:5> line:252:10 DeprecatedFlags
| |-EnumConstantDecl 0x55c810883580 <line:253:2, col:12> col:2 OP_READ 'Handler::DeprecatedFlags'
| | `-ImplicitCastExpr 0x55c810883ae0 <col:12> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55c810883560 <col:12> 'Handler::Flags' Int: 1
| |     `-DeclRefExpr 0x55c810883540 <col:12> 'Handler::Flags' EnumConstant 0x55c81087fd30 'f_read' 'Handler::Flags'
| |-EnumConstantDecl 0x55c810883610 <line:254:2, col:13> col:2 OP_WRITE 'Handler::DeprecatedFlags'
