
*** Dumping AST Record Layout
         0 | struct __pthread_cond_s::(anonymous at /usr/include/bits/thread-shared-types.h:97:5)
         0 |   unsigned int __low
         4 |   unsigned int __high
           | [sizeof=8, dsize=8, align=4,
           |  nvsize=8, nvalign=4]

*** Dumping AST Record Layout
         0 | union __pthread_cond_s::(anonymous at /usr/include/bits/thread-shared-types.h:94:17)
         0 |   unsigned long long __wseq
         0 |   struct __pthread_cond_s::(anonymous at /usr/include/bits/thread-shared-types.h:97:5) __wseq32
         0 |     unsigned int __low
         4 |     unsigned int __high
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __pthread_internal_list
         0 |   struct __pthread_internal_list * __prev
         8 |   struct __pthread_internal_list * __next
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __pthread_mutex_s
         0 |   int __lock
         4 |   unsigned int __count
         8 |   int __owner
        12 |   unsigned int __nusers
        16 |   int __kind
        20 |   short __spins
        22 |   short __elision
        24 |   struct __pthread_internal_list __list
        24 |     struct __pthread_internal_list * __prev
        32 |     struct __pthread_internal_list * __next
           | [sizeof=40, dsize=40, align=8,
           |  nvsize=40, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __pthread_cond_s::(anonymous at /usr/include/bits/thread-shared-types.h:106:5)
         0 |   unsigned int __low
         4 |   unsigned int __high
           | [sizeof=8, dsize=8, align=4,
           |  nvsize=8, nvalign=4]

*** Dumping AST Record Layout
         0 | union __pthread_cond_s::(anonymous at /usr/include/bits/thread-shared-types.h:103:17)
         0 |   unsigned long long __g1_start
         0 |   struct __pthread_cond_s::(anonymous at /usr/include/bits/thread-shared-types.h:106:5) __g1_start32
         0 |     unsigned int __low
         4 |     unsigned int __high
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __pthread_cond_s
         0 |   union __pthread_cond_s::(anonymous at /usr/include/bits/thread-shared-types.h:94:17) 
         0 |     unsigned long long __wseq
         0 |     struct __pthread_cond_s::(anonymous at /usr/include/bits/thread-shared-types.h:97:5) __wseq32
         0 |       unsigned int __low
         4 |       unsigned int __high
         8 |   union __pthread_cond_s::(anonymous at /usr/include/bits/thread-shared-types.h:103:17) 
         8 |     unsigned long long __g1_start
         8 |     struct __pthread_cond_s::(anonymous at /usr/include/bits/thread-shared-types.h:106:5) __g1_start32
         8 |       unsigned int __low
        12 |       unsigned int __high
        16 |   unsigned int [2] __g_refs
        24 |   unsigned int [2] __g_size
        32 |   unsigned int __g1_orig_size
        36 |   unsigned int __wrefs
        40 |   unsigned int [2] __g_signals
           | [sizeof=48, dsize=48, align=8,
           |  nvsize=48, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __pthread_rwlock_arch_t
         0 |   unsigned int __readers
         4 |   unsigned int __writers
         8 |   unsigned int __wrphase_futex
        12 |   unsigned int __writers_futex
        16 |   unsigned int __pad3
        20 |   unsigned int __pad4
        24 |   int __cur_writer
        28 |   int __shared
        32 |   signed char __rwelision
        33 |   unsigned char [7] __pad1
        40 |   unsigned long __pad2
        48 |   unsigned int __flags
           | [sizeof=56, dsize=56, align=8,
           |  nvsize=56, nvalign=8]

*** Dumping AST Record Layout
         0 | lldiv_t
         0 |   long long quot
         8 |   long long rem
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct msghdr
         0 |   void * msg_name
         8 |   socklen_t msg_namelen
        16 |   struct iovec * msg_iov
        24 |   size_t msg_iovlen
        32 |   void * msg_control
        40 |   size_t msg_controllen
        48 |   int msg_flags
           | [sizeof=56, dsize=56, align=8,
           |  nvsize=56, nvalign=8]

*** Dumping AST Record Layout
         0 | struct in_addr
         0 |   in_addr_t s_addr
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | union in6_addr::(anonymous at /usr/include/netinet/in.h:214:5)
         0 |   uint8_t [16] __u6_addr8
         0 |   uint16_t [8] __u6_addr16
         0 |   uint32_t [4] __u6_addr32
           | [sizeof=16, dsize=16, align=4,
           |  nvsize=16, nvalign=4]

*** Dumping AST Record Layout
         0 | struct sockaddr
         0 |   sa_family_t sa_family
         2 |   char [14] sa_data
           | [sizeof=16, dsize=16, align=2,
           |  nvsize=16, nvalign=2]

*** Dumping AST Record Layout
         0 | struct in6_addr
         0 |   union in6_addr::(anonymous at /usr/include/netinet/in.h:214:5) __in6_u
         0 |     uint8_t [16] __u6_addr8
         0 |     uint16_t [8] __u6_addr16
         0 |     uint32_t [4] __u6_addr32
           | [sizeof=16, dsize=16, align=4,
           |  nvsize=16, nvalign=4]

*** Dumping AST Record Layout
         0 | struct sockaddr_storage
         0 |   sa_family_t ss_family
         2 |   char [118] __ss_padding
       120 |   unsigned long __ss_align
           | [sizeof=128, dsize=128, align=8,
           |  nvsize=128, nvalign=8]

*** Dumping AST Record Layout
         0 | struct sockaddr_in6
         0 |   sa_family_t sin6_family
         2 |   in_port_t sin6_port
         4 |   uint32_t sin6_flowinfo
         8 |   struct in6_addr sin6_addr
         8 |     union in6_addr::(anonymous at /usr/include/netinet/in.h:214:5) __in6_u
         8 |       uint8_t [16] __u6_addr8
         8 |       uint16_t [8] __u6_addr16
         8 |       uint32_t [4] __u6_addr32
        24 |   uint32_t sin6_scope_id
           | [sizeof=28, dsize=28, align=4,
           |  nvsize=28, nvalign=4]

*** Dumping AST Record Layout
         0 | struct timeval
         0 |   __time_t tv_sec
         8 |   __suseconds_t tv_usec
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct String::memo_t
         0 |   volatile uint32_t refcount
         4 |   uint32_t capacity
         8 |   volatile uint32_t dirty
        12 |   char [8] real_data
           | [sizeof=20, dsize=20, align=4,
           |  nvsize=20, nvalign=4]

*** Dumping AST Record Layout
         0 | class IPAddress
         0 |   uint32_t _addr
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | union Timestamp::rep_t
         0 |   int64_t x
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class Timestamp
         0 |   union Timestamp::rep_t _t
         0 |     int64_t x
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct timespec
         0 |   __time_t tv_sec
         8 |   __syscall_slong_t tv_nsec
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class Element::Port
         0 |   class Element * _e
         8 |   int _port
           | [sizeof=16, dsize=12, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | struct libdivide_u32_t
         0 |   uint32_t magic
         4 |   uint8_t more
           | [sizeof=8, dsize=8, align=4,
           |  nvsize=8, nvalign=4]

*** Dumping AST Record Layout
         0 | class IPFlowID
         0 |   class IPAddress _saddr
         0 |     uint32_t _addr
         4 |   class IPAddress _daddr
         4 |     uint32_t _addr
         8 |   uint16_t _sport
        10 |   uint16_t _dport
           | [sizeof=12, dsize=12, align=4,
           |  nvsize=12, nvalign=4]

*** Dumping AST Record Layout
         0 | class IPRewriterEntry
         0 |   class IPFlowID _flowid
         0 |     class IPAddress _saddr
         0 |       uint32_t _addr
         4 |     class IPAddress _daddr
         4 |       uint32_t _addr
         8 |     uint16_t _sport
        10 |     uint16_t _dport
   12:0-23 |   uint32_t _output
        15 |   uint8_t _direction
        16 |   class IPRewriterEntry * _hashnext
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class vector_memory<class sized_array_memory<8> >
         0 |   vector_memory<class sized_array_memory<8> >::type * l_
         8 |   vector_memory::size_type n_
        12 |   vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class Vector<class IPRewriterFlow *>
         0 |   class vector_memory<class sized_array_memory<8> > vm_
         0 |     vector_memory<class sized_array_memory<8> >::type * l_
         8 |     vector_memory::size_type n_
        12 |     vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union IPRewriterInput::(anonymous at ../elements/ip/iprewriterbase.hh:23:5)
         0 |   class IPRewriterPattern * pattern
         0 |   class IPMapper * mapper
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class IPRewriterInput
         0 |   class IPRewriterBase * owner
         8 |   int owner_input
        12 |   int kind
        16 |   int foutput
        24 |   class IPRewriterBase * reply_element
        32 |   int routput
        36 |   uint32_t count
        40 |   uint32_t failures
        48 |   union IPRewriterInput::(anonymous at ../elements/ip/iprewriterbase.hh:23:5) u
        48 |     class IPRewriterPattern * pattern
        48 |     class IPMapper * mapper
           | [sizeof=56, dsize=56, align=8,
           |  nvsize=56, nvalign=8]

*** Dumping AST Record Layout
         0 | class HashContainer_const_iterator<class IPRewriterEntry, class HashContainer_adapter<class IPRewriterEntry> >
         0 |   class IPRewriterEntry * _element
         8 |   class IPRewriterEntry ** _pprev
        16 |   HashContainer_const_iterator<class IPRewriterEntry, class HashContainer_adapter<class IPRewriterEntry> >::bucket_count_type _bucket
        24 |   const HashContainer<class IPRewriterEntry, class HashContainer_adapter<class IPRewriterEntry> > * _hc
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | class HashContainer_iterator<class IPRewriterEntry, class HashContainer_adapter<class IPRewriterEntry> >
         0 |   class HashContainer_const_iterator<class IPRewriterEntry, class HashContainer_adapter<class IPRewriterEntry> > (base)
         0 |     class IPRewriterEntry * _element
         8 |     class IPRewriterEntry ** _pprev
        16 |     HashContainer_const_iterator<class IPRewriterEntry, class HashContainer_adapter<class IPRewriterEntry> >::bucket_count_type _bucket
        24 |     const HashContainer<class IPRewriterEntry, class HashContainer_adapter<class IPRewriterEntry> > * _hc
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | class IPRewriterFlow
         0 |   class IPRewriterEntry [2] _e
        48 |   uint16_t _ip_csum_delta
        50 |   uint16_t _udp_csum_delta
        52 |   click_jiffies_t _expiry_j
   56:0-31 |   size_t _place
        60 |   uint8_t _ip_p
        61 |   uint8_t _tflags
        62 |   _Bool _guaranteed
        63 |   uint8_t _reply_anno
        64 |   class IPRewriterInput * _owner
           | [sizeof=72, dsize=72, align=8,
           |  nvsize=72, nvalign=8]

*** Dumping AST Record Layout
         0 | class TCPRewriter::TCPFlow
         0 |   class IPRewriterFlow (base)
         0 |     class IPRewriterEntry [2] _e
        48 |     uint16_t _ip_csum_delta
        50 |     uint16_t _udp_csum_delta
        52 |     click_jiffies_t _expiry_j
   56:0-31 |     size_t _place
        60 |     uint8_t _ip_p
        61 |     uint8_t _tflags
        62 |     _Bool _guaranteed
        63 |     uint8_t _reply_anno
        64 |     class IPRewriterInput * _owner
        72 |   struct TCPRewriter::TCPFlow::delta_transition * _dt
           | [sizeof=80, dsize=80, align=8,
           |  nvsize=80, nvalign=8]

*** Dumping AST Record Layout
         0 | class UDPRewriter::UDPFlow
         0 |   class IPRewriterFlow (base)
         0 |     class IPRewriterEntry [2] _e
        48 |     uint16_t _ip_csum_delta
        50 |     uint16_t _udp_csum_delta
        52 |     click_jiffies_t _expiry_j
   56:0-31 |     size_t _place
        60 |     uint8_t _ip_p
        61 |     uint8_t _tflags
        62 |     _Bool _guaranteed
        63 |     uint8_t _reply_anno
        64 |     class IPRewriterInput * _owner
           | [sizeof=72, dsize=72, align=8,
           |  nvsize=72, nvalign=8]

*** Dumping AST Record Layout
         0 | class MyRewriterPattern
         0 |   class IPAddress _saddr
         0 |     uint32_t _addr
         4 |   int _sport
         8 |   class IPAddress _daddr
         8 |     uint32_t _addr
        12 |   int _dport
        16 |   uint32_t _variation_top
        20 |   _Bool _sequential
           | [sizeof=24, dsize=21, align=4,
           |  nvsize=21, nvalign=4]

*** Dumping AST Record Layout
         0 | class MyInputSpec
         0 |   int kind
         4 |   int foutput
         8 |   int doutput
        12 |   class MyRewriterPattern pattern
        12 |     class IPAddress _saddr
        12 |       uint32_t _addr
        16 |     int _sport
        20 |     class IPAddress _daddr
        20 |       uint32_t _addr
        24 |     int _dport
        28 |     uint32_t _variation_top
        32 |     _Bool _sequential
        36 |   int __placeholder
           | [sizeof=40, dsize=40, align=4,
           |  nvsize=40, nvalign=4]

*** Dumping AST Record Layout
         0 | struct String::rep_t
         0 |   const char * data
         8 |   int length
        16 |   struct String::memo_t * memo
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class String
         0 |   struct String::rep_t _r
         0 |     const char * data
         8 |     int length
        16 |     struct String::memo_t * memo
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct StringAccum::rep_t
         0 |   unsigned char * s
         8 |   int len
        12 |   int cap
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct TimerSet::heap_element
         0 |   class Timestamp expiry_s
         0 |     union Timestamp::rep_t _t
         0 |       int64_t x
         8 |   class Timer * t
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct pollfd
         0 |   int fd
         4 |   short events
         6 |   short revents
           | [sizeof=8, dsize=8, align=4,
           |  nvsize=8, nvalign=4]

*** Dumping AST Record Layout
         0 | struct SelectSet::SelectorInfo
         0 |   class Element * read
         8 |   class Element * write
        16 |   int pollfd
           | [sizeof=24, dsize=20, align=8,
           |  nvsize=20, nvalign=8]

*** Dumping AST Record Layout
         0 | struct Router::Port
         0 |   int idx
         4 |   int port
           | [sizeof=8, dsize=8, align=4,
           |  nvsize=8, nvalign=4]

*** Dumping AST Record Layout
         0 | struct Router::element_landmark_t
         0 |   uint32_t first_landmarkid
         8 |   class String filename
         8 |     struct String::rep_t _r
         8 |       const char * data
        16 |       int length
        24 |       struct String::memo_t * memo
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | class vector_memory<class sized_array_memory<4> >
         0 |   vector_memory<class sized_array_memory<4> >::type * l_
         8 |   vector_memory::size_type n_
        12 |   vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class Vector<int>
         0 |   class vector_memory<class sized_array_memory<4> > vm_
         0 |     vector_memory<class sized_array_memory<4> >::type * l_
         8 |     vector_memory::size_type n_
        12 |     vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct Router::Connection
         0 |   struct Router::Port [2] p
           | [sizeof=16, dsize=16, align=4,
           |  nvsize=16, nvalign=4]

*** Dumping AST Record Layout
         0 | class atomic_uint32_t
         0 |   uint32_t _val
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | class Element
         0 |   (Element vtable pointer)
         8 |   class Element::Port *[2] _ports
        24 |   class Element::Port [4] _inline_ports
        88 |   int [2] _nports
        96 |   class Router * _router
       104 |   int _eindex
           | [sizeof=112, dsize=108, align=8,
           |  nvsize=108, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x55b71deb1598 prev 0x55b71dea8d08 <../dummy_inc/click/element.hh:214:5, line:252:5> line:214:11 referenced class Port definition
|-DefinitionData pass_in_registers standard_layout trivially_copyable has_user_declared_ctor can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor simple trivial has_const_param implicit_has_const_param
| |-MoveConstructor exists simple trivial
| |-CopyAssignment trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveAssignment exists simple trivial needs_implicit
| `-Destructor simple irrelevant trivial
|-CXXRecordDecl 0x55b71deb1690 <col:5, col:11> col:11 implicit referenced class Port
|-AccessSpecDecl 0x55b71deb1720 <col:18, col:24> col:18 public
|-CXXMethodDecl 0x55b71deb1798 <line:216:9, col:30> col:21 used active 'bool () const' inline
|-CXXMethodDecl 0x55b71deb1858 <line:217:9, col:35> col:25 element 'Element *() const' inline
|-CXXMethodDecl 0x55b71deb1920 <line:218:9, col:27> col:20 port 'int () const' inline
|-CXXMethodDecl 0x55b71deb1a98 <line:220:9, col:65> col:49 used push 'void (Packet *) const'
| |-ParmVarDecl 0x55b71deb19d0 <col:54, col:62> col:62 p 'Packet *'
| |-NoInlineAttr 0x55b71deb1b40 <col:24>
| `-OptimizeNoneAttr 0x55b71deb1b98 <col:34>
|-CXXMethodDecl 0x55b71deb1be0 <line:221:9, col:31> col:24 used pull 'Packet *() const' inline
|-CXXMethodDecl 0x55b71deb1e98 <line:227:9, col:63> col:21 used assign 'void (bool, Element *, int)' inline
| |-ParmVarDecl 0x55b71deb1c90 <col:28, col:33> col:33 isoutput 'bool'
| |-ParmVarDecl 0x55b71deb1d08 <col:43, col:52> col:52 e 'Element *'
| `-ParmVarDecl 0x55b71deb1d88 <col:55, col:59> col:59 port 'int'
|-AccessSpecDecl 0x55b71deb1f60 <line:229:7, col:14> col:7 private
|-FieldDecl 0x55b71deb1f98 <line:231:9, col:18> col:18 referenced _e 'Element *'
|-FieldDecl 0x55b71deb2000 <line:232:9, col:13> col:13 referenced _port 'int'
|-CXXConstructorDecl 0x55b71deb2088 <line:247:9, col:21> col:16 Port 'void ()' inline
|-CXXMethodDecl 0x55b71deb23a8 <line:248:9, col:79> col:21 assign 'void (bool, Element *, Element *, int)' inline
| |-ParmVarDecl 0x55b71deb2140 <col:28, col:33> col:33 isoutput 'bool'
| |-ParmVarDecl 0x55b71deb21b8 <col:43, col:52> col:52 owner 'Element *'
| |-ParmVarDecl 0x55b71deb2230 <col:59, col:68> col:68 e 'Element *'
| `-ParmVarDecl 0x55b71deb22b0 <col:71, col:75> col:75 port 'int'
|-FriendDecl 0x55b71deb24c0 <line:250:9, col:22> col:16 'class Element':'Element'
|-CXXConstructorDecl 0x55b71de20a68 <line:214:11> col:11 implicit constexpr Port 'void (const Element::Port &)' inline default trivial noexcept-unevaluated 0x55b71de20a68
| `-ParmVarDecl 0x55b71de20b78 <col:11> col:11 'const Element::Port &'
|-CXXConstructorDecl 0x55b71de20c18 <col:11> col:11 implicit constexpr Port 'void (Element::Port &&)' inline default trivial noexcept-unevaluated 0x55b71de20c18
| `-ParmVarDecl 0x55b71de20d28 <col:11> col:11 'Element::Port &&'
`-CXXDestructorDecl 0x55b71e1eeaf0 <col:11> col:11 implicit ~Port 'void () noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.Element::Port" = type <{ %class.Element*, i32, [4 x i8] }>
  NonVirtualBaseLLVMType:%"class.Element::Port.base" = type <{ %class.Element*, i32 }>
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class Vector<class Element *>
         0 |   class vector_memory<class sized_array_memory<8> > vm_
         0 |     vector_memory<class sized_array_memory<8> >::type * l_
         8 |     vector_memory::size_type n_
        12 |     vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class vector_memory<class typed_array_memory<class String> >
         0 |   vector_memory<class typed_array_memory<class String> >::type * l_
         8 |   vector_memory::size_type n_
        12 |   vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class Vector<class String>
         0 |   class vector_memory<class typed_array_memory<class String> > vm_
         0 |     vector_memory<class typed_array_memory<class String> >::type * l_
         8 |     vector_memory::size_type n_
        12 |     vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class Vector<unsigned int>
         0 |   class vector_memory<class sized_array_memory<4> > vm_
         0 |     vector_memory<class sized_array_memory<4> >::type * l_
         8 |     vector_memory::size_type n_
        12 |     vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class vector_memory<class typed_array_memory<struct Router::element_landmark_t> >
         0 |   vector_memory<class typed_array_memory<struct Router::element_landmark_t> >::type * l_
         8 |   vector_memory::size_type n_
        12 |   vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class Vector<struct Router::element_landmark_t>
         0 |   class vector_memory<class typed_array_memory<struct Router::element_landmark_t> > vm_
         0 |     vector_memory<class typed_array_memory<struct Router::element_landmark_t> >::type * l_
         8 |     vector_memory::size_type n_
        12 |     vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class vector_memory<class sized_array_memory<16> >
         0 |   vector_memory<class sized_array_memory<16> >::type * l_
         8 |   vector_memory::size_type n_
        12 |   vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class Vector<struct Router::Connection>
         0 |   class vector_memory<class sized_array_memory<16> > vm_
         0 |     vector_memory<class sized_array_memory<16> >::type * l_
         8 |     vector_memory::size_type n_
        12 |     vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class Vector<void *>
         0 |   class vector_memory<class sized_array_memory<8> > vm_
         0 |     vector_memory<class sized_array_memory<8> >::type * l_
         8 |     vector_memory::size_type n_
        12 |     vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class Router
         0 |   class Master * _master
         8 |   class atomic_uint32_t _runcount
         8 |     uint32_t _val
        12 |   volatile int _state
    16:0-0 |   _Bool _have_connections
    16:1-1 |   _Bool _conn_sorted
    16:2-2 |   _Bool _have_configuration
        20 |   volatile int _running
        24 |   class atomic_uint32_t _refcount
        24 |     uint32_t _val
        32 |   class Vector<class Element *> _elements
        32 |     class vector_memory<class sized_array_memory<8> > vm_
        32 |       vector_memory<class sized_array_memory<8> >::type * l_
        40 |       vector_memory::size_type n_
        44 |       vector_memory::size_type capacity_
        48 |   class Vector<class String> _element_names
        48 |     class vector_memory<class typed_array_memory<class String> > vm_
        48 |       vector_memory<class typed_array_memory<class String> >::type * l_
        56 |       vector_memory::size_type n_
        60 |       vector_memory::size_type capacity_
        64 |   class Vector<class String> _element_configurations
        64 |     class vector_memory<class typed_array_memory<class String> > vm_
        64 |       vector_memory<class typed_array_memory<class String> >::type * l_
        72 |       vector_memory::size_type n_
        76 |       vector_memory::size_type capacity_
        80 |   class Vector<unsigned int> _element_landmarkids
        80 |     class vector_memory<class sized_array_memory<4> > vm_
        80 |       vector_memory<class sized_array_memory<4> >::type * l_
        88 |       vector_memory::size_type n_
        92 |       vector_memory::size_type capacity_
        96 |   class Vector<int> _element_home_thread_ids
        96 |     class vector_memory<class sized_array_memory<4> > vm_
        96 |       vector_memory<class sized_array_memory<4> >::type * l_
       104 |       vector_memory::size_type n_
       108 |       vector_memory::size_type capacity_
       112 |   class Vector<struct Router::element_landmark_t> _element_landmarks
       112 |     class vector_memory<class typed_array_memory<struct Router::element_landmark_t> > vm_
       112 |       vector_memory<class typed_array_memory<struct Router::element_landmark_t> >::type * l_
       120 |       vector_memory::size_type n_
       124 |       vector_memory::size_type capacity_
       128 |   uint32_t _last_landmarkid
       136 |   class Vector<int> _element_name_sorter
       136 |     class vector_memory<class sized_array_memory<4> > vm_
       136 |       vector_memory<class sized_array_memory<4> >::type * l_
       144 |       vector_memory::size_type n_
       148 |       vector_memory::size_type capacity_
       152 |   Vector<int> [2] _element_gport_offset
       184 |   class Vector<int> _element_configure_order
       184 |     class vector_memory<class sized_array_memory<4> > vm_
       184 |       vector_memory<class sized_array_memory<4> >::type * l_
       192 |       vector_memory::size_type n_
       196 |       vector_memory::size_type capacity_
       200 |   class Vector<struct Router::Connection> _conn
       200 |     class vector_memory<class sized_array_memory<16> > vm_
       200 |       vector_memory<class sized_array_memory<16> >::type * l_
       208 |       vector_memory::size_type n_
       212 |       vector_memory::size_type capacity_
       216 |   class Vector<int> _conn_output_sorter
       216 |     class vector_memory<class sized_array_memory<4> > vm_
       216 |       vector_memory<class sized_array_memory<4> >::type * l_
       224 |       vector_memory::size_type n_
       228 |       vector_memory::size_type capacity_
       232 |   class Vector<class String> _requirements
       232 |     class vector_memory<class typed_array_memory<class String> > vm_
       232 |       vector_memory<class typed_array_memory<class String> >::type * l_
       240 |       vector_memory::size_type n_
       244 |       vector_memory::size_type capacity_
       248 |   class Vector<int> _ehandler_first_by_element
       248 |     class vector_memory<class sized_array_memory<4> > vm_
       248 |       vector_memory<class sized_array_memory<4> >::type * l_
       256 |       vector_memory::size_type n_
       260 |       vector_memory::size_type capacity_
       264 |   class Vector<int> _ehandler_to_handler
       264 |     class vector_memory<class sized_array_memory<4> > vm_
       264 |       vector_memory<class sized_array_memory<4> >::type * l_
       272 |       vector_memory::size_type n_
       276 |       vector_memory::size_type capacity_
       280 |   class Vector<int> _ehandler_next
       280 |     class vector_memory<class sized_array_memory<4> > vm_
       280 |       vector_memory<class sized_array_memory<4> >::type * l_
       288 |       vector_memory::size_type n_
       292 |       vector_memory::size_type capacity_
       296 |   class Vector<int> _handler_first_by_name
       296 |     class vector_memory<class sized_array_memory<4> > vm_
       296 |       vector_memory<class sized_array_memory<4> >::type * l_
       304 |       vector_memory::size_type n_
       308 |       vector_memory::size_type capacity_
       312 |   class Handler ** _handler_bufs
       320 |   int _nhandlers_bufs
       324 |   int _free_handler
       328 |   class Vector<class String> _attachment_names
       328 |     class vector_memory<class typed_array_memory<class String> > vm_
       328 |       vector_memory<class typed_array_memory<class String> >::type * l_
       336 |       vector_memory::size_type n_
       340 |       vector_memory::size_type capacity_
       344 |   class Vector<void *> _attachments
       344 |     class vector_memory<class sized_array_memory<8> > vm_
       344 |       vector_memory<class sized_array_memory<8> >::type * l_
       352 |       vector_memory::size_type n_
       356 |       vector_memory::size_type capacity_
       360 |   class Element * _root_element
       368 |   class String _configuration
       368 |     struct String::rep_t _r
       368 |       const char * data
       376 |       int length
       384 |       struct String::memo_t * memo
       392 |   struct Router::notifier_signals_t * _notifier_signals
       400 |   class HashMap_ArenaFactory * _arena_factory
       408 |   class Router * _hotswap_router
       416 |   class ThreadSched * _thread_sched
       424 |   class NameInfo * _name_info
       432 |   class Vector<int> _flow_code_override_eindex
       432 |     class vector_memory<class sized_array_memory<4> > vm_
       432 |       vector_memory<class sized_array_memory<4> >::type * l_
       440 |       vector_memory::size_type n_
       444 |       vector_memory::size_type capacity_
       448 |   class Vector<class String> _flow_code_override
       448 |     class vector_memory<class typed_array_memory<class String> > vm_
       448 |       vector_memory<class typed_array_memory<class String> >::type * l_
       456 |       vector_memory::size_type n_
       460 |       vector_memory::size_type capacity_
       464 |   class Router * _next_router
           | [sizeof=472, dsize=472, align=8,
           |  nvsize=472, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x55b71dbf63a0 <../dummy_inc/click/atomic.hh:52:1, line:94:1> line:52:7 referenced class atomic_uint32_t definition
|-DefinitionData pass_in_registers standard_layout trivially_copyable trivial literal
| |-DefaultConstructor exists trivial
| |-CopyConstructor simple trivial has_const_param implicit_has_const_param
| |-MoveConstructor exists simple trivial
| |-CopyAssignment trivial has_const_param implicit_has_const_param
| |-MoveAssignment exists simple trivial
| `-Destructor simple irrelevant trivial
|-CXXRecordDecl 0x55b71dbf64b8 <col:1, col:7> col:7 implicit referenced class atomic_uint32_t
|-AccessSpecDecl 0x55b71dbf6548 <col:25, col:31> col:25 public
|-CXXMethodDecl 0x55b71dbf6618 <line:57:5, col:29> col:21 used value 'uint32_t () const' inline
|-CXXConversionDecl 0x55b71dbf6700 <line:58:5, col:32> col:12 operator unsigned int 'uint32_t () const' inline
|-CXXMethodDecl 0x55b71dbf6918 <line:60:5, col:49> col:29 used operator= 'atomic_uint32_t &(uint32_t)' inline
| `-ParmVarDecl 0x55b71dbf67c0 <col:39, col:48> col:48 x 'uint32_t':'unsigned int'
|-CXXMethodDecl 0x55b71dbf6ac8 <line:62:5, col:53> col:29 operator+= 'atomic_uint32_t &(int32_t)' inline
| `-ParmVarDecl 0x55b71dbf69d0 <col:40, col:48> col:48 delta 'int32_t':'int'
|-CXXMethodDecl 0x55b71dbf6c10 <line:63:5, col:53> col:29 operator-= 'atomic_uint32_t &(int32_t)' inline
| `-ParmVarDecl 0x55b71dbf6b80 <col:40, col:48> col:48 delta 'int32_t':'int'
|-CXXMethodDecl 0x55b71dbf76f0 <line:64:5, col:53> col:29 operator|= 'atomic_uint32_t &(uint32_t)' inline
| `-ParmVarDecl 0x55b71dbf7660 <col:40, col:49> col:49 mask 'uint32_t':'unsigned int'
|-CXXMethodDecl 0x55b71dbf7838 <line:65:5, col:53> col:29 operator&= 'atomic_uint32_t &(uint32_t)' inline
| `-ParmVarDecl 0x55b71dbf77a8 <col:40, col:49> col:49 mask 'uint32_t':'unsigned int'
|-CXXMethodDecl 0x55b71dbf7900 <line:67:5, col:28> col:17 used operator++ 'void ()' inline
|-CXXMethodDecl 0x55b71dbf7a48 <line:68:5, col:31> col:17 used operator++ 'void (int)' inline
| `-ParmVarDecl 0x55b71dbf79b8 <col:28> col:31 'int'
|-CXXMethodDecl 0x55b71dbf7b10 <line:69:5, col:28> col:17 used operator-- 'void ()' inline
|-CXXMethodDecl 0x55b71dbf7c58 <line:70:5, col:31> col:17 operator-- 'void (int)' inline
| `-ParmVarDecl 0x55b71dbf7bc8 <col:28> col:31 'int'
|-CXXMethodDecl 0x55b71dbf7dd8 <line:72:5, col:42> col:21 swap 'uint32_t (uint32_t)' inline
| `-ParmVarDecl 0x55b71dbf7d10 <col:26, col:35> col:35 desired 'uint32_t':'unsigned int'
|-CXXMethodDecl 0x55b71dbf7f20 <line:73:5, col:49> col:21 fetch_and_add 'uint32_t (uint32_t)' inline
| `-ParmVarDecl 0x55b71dbf7e90 <col:35, col:44> col:44 delta 'uint32_t':'unsigned int'
|-CXXMethodDecl 0x55b71dbf7fe8 <line:74:5, col:30> col:17 dec_and_test 'bool ()' inline
|-CXXMethodDecl 0x55b71dbf81a8 <line:75:5, col:69> col:21 used compare_swap 'uint32_t (uint32_t, uint32_t)' inline
| |-ParmVarDecl 0x55b71dbf8098 <col:34, col:43> col:43 expected 'uint32_t':'unsigned int'
| `-ParmVarDecl 0x55b71dbf8110 <col:53, col:62> col:62 desired 'uint32_t':'unsigned int'
|-CXXMethodDecl 0x55b71dbf83f8 <line:76:5, col:97> col:17 compare_and_swap 'bool (uint32_t, uint32_t)' inline
| |-ParmVarDecl 0x55b71dbf8268 <col:34, col:43> col:43 expected 'uint32_t':'unsigned int'
| |-ParmVarDecl 0x55b71dbf82e0 <col:53, col:62> col:62 desired 'uint32_t':'unsigned int'
| `-DeprecatedAttr 0x55b71dbf84a8 <col:86> "" ""
|-CXXMethodDecl 0x55b71dbf8718 <line:78:5, col:71> col:28 used swap 'uint32_t (volatile uint32_t &, uint32_t)' static inline
| |-ParmVarDecl 0x55b71dbf8588 <col:33, col:52> col:52 x 'volatile uint32_t &'
| `-ParmVarDecl 0x55b71dbf8600 <col:55, col:64> col:64 desired 'uint32_t':'unsigned int'
|-CXXMethodDecl 0x55b71dbf88c8 <line:79:5, col:48> col:24 used inc 'void (volatile uint32_t &)' static inline
| `-ParmVarDecl 0x55b71dbf87d8 <col:28, col:47> col:47 x 'volatile uint32_t &'
|-CXXMethodDecl 0x55b71dbf8a78 <line:80:5, col:57> col:24 used dec_and_test 'bool (volatile uint32_t &)' static inline
| `-ParmVarDecl 0x55b71dbf8980 <col:37, col:56> col:56 x 'volatile uint32_t &'
|-CXXMethodDecl 0x55b71dbf8d48 <line:81:5, col:98> col:28 compare_swap 'uint32_t (volatile uint32_t &, uint32_t, uint32_t)' static inline
| |-ParmVarDecl 0x55b71dbf8b30 <col:41, col:60> col:60 x 'volatile uint32_t &'
| |-ParmVarDecl 0x55b71dbf8ba8 <col:63, col:72> col:72 expected 'uint32_t':'unsigned int'
| `-ParmVarDecl 0x55b71dbf8c20 <col:82, col:91> col:91 desired 'uint32_t':'unsigned int'
|-CXXMethodDecl 0x55b71dbf9028 <line:82:5, col:126> col:24 compare_and_swap 'bool (volatile uint32_t &, uint32_t, uint32_t)' static inline
| |-ParmVarDecl 0x55b71dbf8e10 <col:41, col:60> col:60 x 'volatile uint32_t &'
| |-ParmVarDecl 0x55b71dbf8e88 <col:63, col:72> col:72 expected 'uint32_t':'unsigned int'
| |-ParmVarDecl 0x55b71dbf8f00 <col:82, col:91> col:91 desired 'uint32_t':'unsigned int'
| `-DeprecatedAttr 0x55b71dbf90e0 <col:115> "" ""
|-AccessSpecDecl 0x55b71dbf9150 <line:84:3, col:10> col:3 private
|-FieldDecl 0x55b71dbf9188 <line:91:5, col:14> col:14 referenced _val 'uint32_t':'unsigned int'
|-CXXMethodDecl 0x55b71dbf9890 <line:52:7> col:7 implicit constexpr operator= 'atomic_uint32_t &(const atomic_uint32_t &)' inline default trivial noexcept-unevaluated 0x55b71dbf9890
| `-ParmVarDecl 0x55b71dbf9998 <col:7> col:7 'const atomic_uint32_t &'
|-CXXMethodDecl 0x55b71dbf9a38 <col:7> col:7 implicit constexpr operator= 'atomic_uint32_t &(atomic_uint32_t &&)' inline default trivial noexcept-unevaluated 0x55b71dbf9a38
| `-ParmVarDecl 0x55b71dbf9b48 <col:7> col:7 'atomic_uint32_t &&'
|-CXXConstructorDecl 0x55b71dc98558 <col:7> col:7 implicit used atomic_uint32_t 'void () noexcept' inline default trivial
| `-CompoundStmt 0x55b71de8e150 <col:7>
|-CXXConstructorDecl 0x55b71dc98630 <col:7> col:7 implicit constexpr atomic_uint32_t 'void (const atomic_uint32_t &)' inline default trivial noexcept-unevaluated 0x55b71dc98630
| `-ParmVarDecl 0x55b71dc98748 <col:7> col:7 'const atomic_uint32_t &'
|-CXXConstructorDecl 0x55b71dc987b8 <col:7> col:7 implicit constexpr atomic_uint32_t 'void (atomic_uint32_t &&)' inline default trivial noexcept-unevaluated 0x55b71dc987b8
| `-ParmVarDecl 0x55b71dc988c8 <col:7> col:7 'atomic_uint32_t &&'
`-CXXDestructorDecl 0x55b71de90ac0 <col:7> col:7 implicit referenced ~atomic_uint32_t 'void () noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%class.atomic_uint32_t = type { i32 }
  NonVirtualBaseLLVMType:%class.atomic_uint32_t = type { i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x55b71df6d610 <../dummy_inc/click/vector.hh:11:1, line:71:1> line:11:30 class vector_memory definition
|-DefinitionData standard_layout has_user_declared_ctor can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor simple trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveConstructor
| |-CopyAssignment trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveAssignment
| `-Destructor non_trivial user_declared
|-TemplateArgument type 'sized_array_memory<8>'
|-CXXRecordDecl 0x55b71df6d7e8 prev 0x55b71df6d610 <col:24, col:30> col:30 implicit class vector_memory
|-AccessSpecDecl 0x55b71df6d878 <col:46, col:52> col:46 public
|-TypedefDecl 0x55b71df6d8a0 <line:12:5, col:17> col:17 size_type 'int'
| `-BuiltinType 0x55b71d92f580 'int'
|-TypedefDecl 0x55b71df6f470 <line:13:5, col:31> col:31 type 'typename sized_array_memory<8>::type':'char_array<8>'
| `-ElaboratedType 0x55b71df6f420 'typename sized_array_memory<8>::type' sugar
|   `-TypedefType 0x55b71df6dd50 'sized_array_memory<8>::type' sugar
|     |-Typedef 0x55b71df6dc50 'type'
|     `-TemplateSpecializationType 0x55b71df6dbe0 'char_array<8UL>' sugar char_array
|       |-TemplateArgument expr
|       | `-ConstantExpr 0x55b71df6dac0 <../dummy_inc/click/array_memory.hh:11:24> 'unsigned long' Int: 8
|       |   `-SubstNonTypeTemplateParmExpr 0x55b71df6daa0 <col:24> 'unsigned long'
|       |     `-IntegerLiteral 0x55b71df6da80 <col:24> 'unsigned long' 8
|       `-RecordType 0x55b71df6dbc0 'char_array<8>'
|         `-ClassTemplateSpecialization 0x55b71df6dae0 'char_array'
|-TypedefDecl 0x55b71df6f528 <../dummy_inc/click/vector.hh:14:5, col:19> col:19 iterator 'vector_memory<sized_array_memory<8> >::type *'
| `-PointerType 0x55b71df6f4f0 'vector_memory<sized_array_memory<8> >::type *'
|   `-TypedefType 0x55b71df6f4d0 'vector_memory<sized_array_memory<8> >::type' sugar
|     |-Typedef 0x55b71df6f470 'type'
|     `-ElaboratedType 0x55b71df6f420 'typename sized_array_memory<8>::type' sugar
|       `-TypedefType 0x55b71df6dd50 'sized_array_memory<8>::type' sugar
|         |-Typedef 0x55b71df6dc50 'type'
|         `-TemplateSpecializationType 0x55b71df6dbe0 'char_array<8UL>' sugar char_array
|           |-TemplateArgument expr
|           | `-ConstantExpr 0x55b71df6dac0 <../dummy_inc/click/array_memory.hh:11:24> 'unsigned long' Int: 8
|           |   `-SubstNonTypeTemplateParmExpr 0x55b71df6daa0 <col:24> 'unsigned long'
|           |     `-IntegerLiteral 0x55b71df6da80 <col:24> 'unsigned long' 8
|           `-RecordType 0x55b71df6dbc0 'char_array<8>'
|             `-ClassTemplateSpecialization 0x55b71df6dae0 'char_array'
|-CXXMethodDecl 0x55b71df6f6a8 <../dummy_inc/click/vector.hh:15:5, line:18:5> line:15:17 need_argument_copy 'bool (const vector_memory<sized_array_memory<8> >::type *) const' inline
| `-ParmVarDecl 0x55b71df6f5b8 <col:36, col:48> col:48 argp 'const vector_memory<sized_array_memory<8> >::type *'
|-CXXConstructorDecl 0x55b71df6f798 <line:20:5, line:22:5> line:20:5 vector_memory 'void ()'
|-CXXDestructorDecl 0x55b71df6f878 <line:23:5, col:20> col:5 used ~vector_memory 'void () noexcept'
|-CXXMethodDecl 0x55b71df6fb48 <line:25:5, col:43> col:10 assign 'void (const vector_memory<sized_array_memory<8> > &)'
| `-ParmVarDecl 0x55b71df6fa50 <col:17, col:42> col:42 x 'const vector_memory<sized_array_memory<8> > &'
|-CXXMethodDecl 0x55b71df6fd88 <line:26:5, col:44> col:10 assign 'void (vector_memory::size_type, const vector_memory<sized_array_memory<8> >::type *)'
| |-ParmVarDecl 0x55b71df6fc00 <col:17, col:27> col:27 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55b71df6fc78 <col:30, col:42> col:42 vp 'const vector_memory<sized_array_memory<8> >::type *'
|-CXXMethodDecl 0x55b71df6ff58 <line:27:5, col:44> col:10 resize 'void (vector_memory::size_type, const vector_memory<sized_array_memory<8> >::type *)'
| |-ParmVarDecl 0x55b71df6fe48 <col:17, col:27> col:27 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55b71df6fec0 <col:30, col:42> col:42 vp 'const vector_memory<sized_array_memory<8> >::type *'
|-CXXMethodDecl 0x55b71df700b8 <line:28:5, line:30:5> line:28:14 begin 'vector_memory<sized_array_memory<8> >::iterator ()'
|-CXXMethodDecl 0x55b71df70188 <line:31:5, line:33:5> line:31:14 end 'vector_memory<sized_array_memory<8> >::iterator ()'
|-CXXMethodDecl 0x55b71df703d8 <line:34:5, col:48> col:14 insert 'vector_memory<sized_array_memory<8> >::iterator (vector_memory<sized_array_memory<8> >::iterator, const vector_memory<sized_array_memory<8> >::type *)'
| |-ParmVarDecl 0x55b71df70248 <col:21, col:30> col:30 it 'vector_memory<sized_array_memory<8> >::iterator':'vector_memory<sized_array_memory<8> >::type *'
| `-ParmVarDecl 0x55b71df702c0 <col:34, col:46> col:46 vp 'const vector_memory<sized_array_memory<8> >::type *'
|-CXXMethodDecl 0x55b71df70638 <line:35:5, col:42> col:14 erase 'vector_memory<sized_array_memory<8> >::iterator (vector_memory<sized_array_memory<8> >::iterator, vector_memory<sized_array_memory<8> >::iterator)'
| |-ParmVarDecl 0x55b71df704a8 <col:20, col:29> col:29 a 'vector_memory<sized_array_memory<8> >::iterator':'vector_memory<sized_array_memory<8> >::type *'
| `-ParmVarDecl 0x55b71df70520 <col:32, col:41> col:41 b 'vector_memory<sized_array_memory<8> >::iterator':'vector_memory<sized_array_memory<8> >::type *'
|-CXXMethodDecl 0x55b71df707f8 <line:36:5, line:43:5> line:36:17 push_back 'void (const vector_memory<sized_array_memory<8> >::type *)' inline
| `-ParmVarDecl 0x55b71df70708 <col:27, col:39> col:39 vp 'const vector_memory<sized_array_memory<8> >::type *'
|-CXXMethodDecl 0x55b71df709b8 <line:45:5, line:52:5> line:45:17 move_construct_back 'void (vector_memory<sized_array_memory<8> >::type *)' inline
| `-ParmVarDecl 0x55b71df708c0 <col:37, col:43> col:43 vp 'vector_memory<sized_array_memory<8> >::type *'
|-CXXMethodDecl 0x55b71df70a70 <line:54:5, line:59:5> line:54:17 pop_back 'void ()' inline
|-CXXMethodDecl 0x55b71df74440 <line:60:5, line:64:5> line:60:17 clear 'void ()' inline
|-CXXMethodDecl 0x55b71df74678 <line:65:5, col:59> col:10 reserve_and_push_back 'bool (vector_memory::size_type, const vector_memory<sized_array_memory<8> >::type *)'
| |-ParmVarDecl 0x55b71df744f0 <col:32, col:42> col:42 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55b71df74568 <col:45, col:57> col:57 vp 'const vector_memory<sized_array_memory<8> >::type *'
|-CXXMethodDecl 0x55b71df74918 <line:66:5, col:35> col:10 swap 'void (vector_memory<sized_array_memory<8> > &)'
| `-ParmVarDecl 0x55b71df74820 <col:15, col:34> col:34 x 'vector_memory<sized_array_memory<8> > &'
|-FieldDecl 0x55b71df749e0 <line:68:5, col:11> col:11 l_ 'vector_memory<sized_array_memory<8> >::type *'
|-FieldDecl 0x55b71df74a30 <line:69:5, col:15> col:15 n_ 'vector_memory::size_type':'int'
`-FieldDecl 0x55b71df74a80 <line:70:5, col:15> col:15 capacity_ 'vector_memory::size_type':'int'

Layout: <CGRecordLayout
  LLVMType:%class.vector_memory = type { %struct.char_array*, i32, i32 }
  NonVirtualBaseLLVMType:%class.vector_memory = type { %struct.char_array*, i32, i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x55b71e198288 <../dummy_inc/click/ipaddress.hh:13:1, col:29> ../dummy_inc/click/vector.hh:111:7 class Vector definition
|-DefinitionData standard_layout has_user_declared_ctor has_mutable_fields can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor non_trivial user_declared has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveConstructor exists non_trivial user_declared needs_overload_resolution
| |-CopyAssignment non_trivial has_const_param user_declared needs_overload_resolution implicit_has_const_param
| |-MoveAssignment exists non_trivial user_declared needs_overload_resolution
| `-Destructor simple non_trivial needs_overload_resolution
|-TemplateArgument type 'Element *'
|-CXXRecordDecl 0x55b71e1a2bc8 prev 0x55b71e198288 <col:1, col:7> col:7 implicit class Vector
|-TypedefDecl 0x55b71e1a3be0 <line:113:5, col:44> col:44 array_memory_type 'typename array_memory<Element *>::type':'sized_array_memory<8>'
| `-ElaboratedType 0x55b71e1a3b90 'typename array_memory<Element *>::type' sugar
|   `-TypedefType 0x55b71e1a3b70 'conditional<true, sized_array_memory<8>, typed_array_memory<Element *> >::type' sugar
|     |-Typedef 0x55b71e1a3a20 'type'
|     `-SubstTemplateTypeParmType 0x55b71df6d1e0 'sized_array_memory<8>' sugar
|       |-TemplateTypeParmType 0x55b71dc16000 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55b71dc15fa8 'T'
|       `-RecordType 0x55b71df6cd30 'sized_array_memory<8>'
|         `-ClassTemplateSpecialization 0x55b71df6cc48 'sized_array_memory'
|-FieldDecl 0x55b71e1a3ce0 <line:114:5, col:46> col:46 vm_ 'vector_memory<Vector<Element *>::array_memory_type>':'vector_memory<sized_array_memory<8> >' mutable
|-AccessSpecDecl 0x55b71e1a3d30 <line:116:3, col:9> col:3 public
|-TypedefDecl 0x55b71e1a3d68 <line:118:5, col:15> col:15 value_type 'Element *':'Element *'
| `-SubstTemplateTypeParmType 0x55b71e1a2c60 'Element *' sugar
|   |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x55b71dc4c168 'T'
|   `-PointerType 0x55b71de9ab10 'Element *'
|     `-RecordType 0x55b71de9a890 'Element'
|       `-CXXRecord 0x55b71dea4550 'Element'
|-TypedefDecl 0x55b71e1a3df8 <line:119:5, col:16> col:16 reference 'Element *&'
| `-LValueReferenceType 0x55b71e1a3dc0 'Element *&'
|   `-SubstTemplateTypeParmType 0x55b71e1a2c60 'Element *' sugar
|     |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55b71dc4c168 'T'
|     `-PointerType 0x55b71de9ab10 'Element *'
|       `-RecordType 0x55b71de9a890 'Element'
|         `-CXXRecord 0x55b71dea4550 'Element'
|-TypedefDecl 0x55b71e1a3eb8 <line:120:5, col:22> col:22 const_reference 'Element *const &'
| `-LValueReferenceType 0x55b71e1a3e80 'Element *const &'
|   `-QualType 0x55b71e1a2c61 'Element *const' const
|     `-SubstTemplateTypeParmType 0x55b71e1a2c60 'Element *' sugar
|       |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55b71dc4c168 'T'
|       `-PointerType 0x55b71de9ab10 'Element *'
|         `-RecordType 0x55b71de9a890 'Element'
|           `-CXXRecord 0x55b71dea4550 'Element'
|-TypedefDecl 0x55b71e1a3f48 <line:121:5, col:16> col:16 pointer 'Element **'
| `-PointerType 0x55b71e1a3f10 'Element **'
|   `-SubstTemplateTypeParmType 0x55b71e1a2c60 'Element *' sugar
|     |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55b71dc4c168 'T'
|     `-PointerType 0x55b71de9ab10 'Element *'
|       `-RecordType 0x55b71de9a890 'Element'
|         `-CXXRecord 0x55b71dea4550 'Element'
|-TypedefDecl 0x55b71e1a4008 <line:122:5, col:22> col:22 const_pointer 'Element *const *'
| `-PointerType 0x55b71e1a3fd0 'Element *const *'
|   `-QualType 0x55b71e1a2c61 'Element *const' const
|     `-SubstTemplateTypeParmType 0x55b71e1a2c60 'Element *' sugar
|       |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55b71dc4c168 'T'
|       `-PointerType 0x55b71de9ab10 'Element *'
|         `-RecordType 0x55b71de9a890 'Element'
|           `-CXXRecord 0x55b71dea4550 'Element'
|-TypedefDecl 0x55b71e1a4be0 <line:125:5, col:45> col:45 value_argument_type 'typename fast_argument<Element *>::type':'Element *'
| `-ElaboratedType 0x55b71e1a4b90 'typename fast_argument<Element *>::type' sugar
|   `-TypedefType 0x55b71e1a4b70 'fast_argument<Element *, false>::type' sugar
|     |-Typedef 0x55b71e1a4b00 'type'
|     `-SubstTemplateTypeParmType 0x55b71e1a48c0 'Element *' sugar
|       |-TemplateTypeParmType 0x55b71dc1e200 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55b71dc1e1b0 'T'
|       `-PointerType 0x55b71de9ab10 'Element *'
|         `-RecordType 0x55b71de9a890 'Element'
|           `-CXXRecord 0x55b71dea4550 'Element'
|-TypedefDecl 0x55b71e1a4c48 <line:126:5, col:22> col:22 const_access_type 'Element *const &'
| `-LValueReferenceType 0x55b71e1a3e80 'Element *const &'
|   `-QualType 0x55b71e1a2c61 'Element *const' const
|     `-SubstTemplateTypeParmType 0x55b71e1a2c60 'Element *' sugar
|       |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55b71dc4c168 'T'
|       `-PointerType 0x55b71de9ab10 'Element *'
|         `-RecordType 0x55b71de9a890 'Element'
|           `-CXXRecord 0x55b71dea4550 'Element'
|-TypedefDecl 0x55b71e1a4ca0 <line:128:5, col:17> col:17 size_type 'int'
| `-BuiltinType 0x55b71d92f580 'int'
|-TypedefDecl 0x55b71e1aa9e0 <line:130:5, col:16> col:16 iterator 'Element **'
| `-PointerType 0x55b71e1a3f10 'Element **'
|   `-SubstTemplateTypeParmType 0x55b71e1a2c60 'Element *' sugar
|     |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55b71dc4c168 'T'
|     `-PointerType 0x55b71de9ab10 'Element *'
|       `-RecordType 0x55b71de9a890 'Element'
|         `-CXXRecord 0x55b71dea4550 'Element'
|-TypedefDecl 0x55b71e1aaa48 <line:131:5, col:22> col:22 const_iterator 'Element *const *'
| `-PointerType 0x55b71e1a3fd0 'Element *const *'
|   `-QualType 0x55b71e1a2c61 'Element *const' const
|     `-SubstTemplateTypeParmType 0x55b71e1a2c60 'Element *' sugar
|       |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55b71dc4c168 'T'
|       `-PointerType 0x55b71de9ab10 'Element *'
|         `-RecordType 0x55b71de9a890 'Element'
|           `-CXXRecord 0x55b71dea4550 'Element'
|-EnumDecl 0x55b71e1aaaa0 <line:134:5> col:5
| `-EnumConstantDecl 0x55b71e1aab90 <col:12, col:40> col:12 RESERVE_GROW 'Vector<Element *>::(anonymous enum at ../dummy_inc/click/vector.hh:134:5)'
|   `-ConstantExpr 0x55b71e1aab70 <col:27, col:40> 'Vector::size_type':'int' Int: -1
|     `-CStyleCastExpr 0x55b71dc4d388 <col:27, col:40> 'Vector::size_type':'int' <NoOp>
|       `-UnaryOperator 0x55b71dc4d360 <col:39, col:40> 'int' prefix '-'
|         `-IntegerLiteral 0x55b71dc4d340 <col:40> 'int' 1
|-CXXConstructorDecl 0x55b71e1aac18 <line:137:5, col:28> col:21 Vector 'void ()' inline
|-CXXConstructorDecl 0x55b71e1aaea8 <line:138:5, col:62> col:21 Vector 'void (Vector::size_type, Vector<Element *>::value_argument_type)' inline
| |-ParmVarDecl 0x55b71e1aacd0 <col:28, col:38> col:38 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55b71e1aad70 <col:41, col:61> col:61 v 'Vector<Element *>::value_argument_type':'Element *'
|-CXXConstructorDecl 0x55b71e1ab138 <line:139:5, col:37> col:12 Vector 'void (const Vector<Element *> &)' inline
| `-ParmVarDecl 0x55b71e1ab020 <col:19, col:36> col:36 x 'const Vector<Element *> &'
|-CXXConstructorDecl 0x55b71e1ab3f8 <line:141:5, col:32> col:12 Vector 'void (Vector<Element *> &&)' inline
| `-ParmVarDecl 0x55b71e1ab2e0 <col:19, col:31> col:31 x 'Vector<Element *> &&'
|-CXXMethodDecl 0x55b71e1ab710 <line:144:5, col:51> col:23 operator= 'Vector<Element *> &(const Vector<Element *> &)' inline
| `-ParmVarDecl 0x55b71e1ab5f0 <col:33, col:50> col:50 x 'const Vector<Element *> &'
|-CXXMethodDecl 0x55b71e1aba20 <line:146:5, col:46> col:23 operator= 'Vector<Element *> &(Vector<Element *> &&)' inline
| `-ParmVarDecl 0x55b71e1ab900 <col:33, col:45> col:45 x 'Vector<Element *> &&'
|-CXXMethodDecl 0x55b71e1abd10 <line:148:5, col:70> col:23 assign 'Vector<Element *> &(Vector::size_type, Vector<Element *>::value_argument_type)' inline
| |-ParmVarDecl 0x55b71e1abb58 <col:30, col:40> col:40 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55b71e1abbd0 <col:43, col:69> col:63 v 'Vector<Element *>::value_argument_type':'Element *'
|-CXXMethodDecl 0x55b71e1abe68 <line:150:5, col:55> col:49 begin 'Vector<Element *>::iterator ()'
| |-NoInlineAttr 0x55b71e1abf48 <col:20> Inherited
| `-OptimizeNoneAttr 0x55b71e1abfa0 <col:30> Inherited
|-CXXMethodDecl 0x55b71e1abfe8 <line:151:5, col:53> col:49 end 'Vector<Element *>::iterator ()'
| |-NoInlineAttr 0x55b71e1ac098 <col:20> Inherited
| `-OptimizeNoneAttr 0x55b71e1ac0f0 <col:30> Inherited
|-CXXMethodDecl 0x55b71e1ac1b8 <line:152:5, col:63> col:55 begin 'Vector<Element *>::const_iterator () const'
| |-NoInlineAttr 0x55b71e1ac268 <col:20> Inherited
| `-OptimizeNoneAttr 0x55b71e1ac2c0 <col:30> Inherited
|-CXXMethodDecl 0x55b71e1ac308 <line:153:5, col:61> col:55 end 'Vector<Element *>::const_iterator () const'
| |-NoInlineAttr 0x55b71e1ac3b8 <col:20> Inherited
| `-OptimizeNoneAttr 0x55b71e1ac410 <col:30> Inherited
|-CXXMethodDecl 0x55b71e1ac458 <line:154:5, col:64> col:55 cbegin 'Vector<Element *>::const_iterator () const'
| |-NoInlineAttr 0x55b71e1ac508 <col:20> Inherited
| `-OptimizeNoneAttr 0x55b71e1ac560 <col:30> Inherited
|-CXXMethodDecl 0x55b71e1ac5a8 <line:155:5, col:62> col:55 cend 'Vector<Element *>::const_iterator () const'
| |-NoInlineAttr 0x55b71e1ac658 <col:20> Inherited
| `-OptimizeNoneAttr 0x55b71e1ac6b0 <col:30> Inherited
|-CXXMethodDecl 0x55b71e1ac6d8 <line:157:5, col:29> col:22 used size 'Vector::size_type () const' inline
|-CXXMethodDecl 0x55b71e1ac788 <line:158:5, col:33> col:22 capacity 'Vector::size_type () const' inline
|-CXXMethodDecl 0x55b71e1ac838 <line:159:5, col:25> col:17 empty 'bool () const' inline
|-CXXMethodDecl 0x55b71e1ac9f8 <line:160:5, col:64> col:17 resize 'void (Vector::size_type, Vector<Element *>::value_argument_type)' inline
| |-ParmVarDecl 0x55b71e1ac8e8 <col:24, col:34> col:34 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55b71e1ac960 <col:37, col:63> col:57 v 'Vector<Element *>::value_argument_type':'Element *'
|-CXXMethodDecl 0x55b71e1acb48 <line:161:5, col:36> col:17 reserve 'bool (Vector::size_type)' inline
| `-ParmVarDecl 0x55b71e1acab8 <col:25, col:35> col:35 n 'Vector::size_type':'int'
|-CXXMethodDecl 0x55b71e1accf8 <line:163:5, col:65> col:43 operator[] 'Element *&(Vector::size_type)'
| |-ParmVarDecl 0x55b71e1acc00 <col:54, col:64> col:64 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x55b71e1acdb0 <col:20>
| `-OptimizeNoneAttr 0x55b71e1ace08 <col:30>
|-CXXMethodDecl 0x55b71e1acf28 <line:164:5, col:73> col:49 operator[] 'Element *const &(Vector::size_type) const'
| |-ParmVarDecl 0x55b71e1ace30 <col:60, col:70> col:70 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x55b71e1acfe0 <col:20>
| `-OptimizeNoneAttr 0x55b71e1ad038 <col:30>
|-CXXMethodDecl 0x55b71e1ad0f0 <line:165:5, col:29> col:15 at 'Element *&(Vector::size_type)' inline
| `-ParmVarDecl 0x55b71e1ad060 <col:18, col:28> col:28 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55b71e1ad238 <line:166:5, col:37> col:21 at 'Element *const &(Vector::size_type) const' inline
| `-ParmVarDecl 0x55b71e1ad1a8 <col:24, col:34> col:34 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55b71e1ad368 <line:167:5, col:21> col:15 front 'Element *&()' inline
|-CXXMethodDecl 0x55b71e1ad498 <line:168:5, col:29> col:21 front 'Element *const &() const' inline
|-CXXMethodDecl 0x55b71e1ad568 <line:169:5, col:20> col:15 back 'Element *&()' inline
|-CXXMethodDecl 0x55b71e1ad638 <line:170:5, col:28> col:21 back 'Element *const &() const' inline
|-CXXMethodDecl 0x55b71e1ad778 <line:172:5, col:39> col:15 unchecked_at 'Element *&(Vector::size_type)' inline
| `-ParmVarDecl 0x55b71e1ad6e8 <col:28, col:38> col:38 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55b71e1ad8c0 <line:173:5, col:47> col:21 unchecked_at 'Element *const &(Vector::size_type) const' inline
| `-ParmVarDecl 0x55b71e1ad830 <col:34, col:44> col:44 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55b71e1ada08 <line:174:5, col:59> col:15 at_u 'Element *&(Vector::size_type)' inline
| |-ParmVarDecl 0x55b71e1ad978 <col:20, col:30> col:30 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x55b71e1adac0 <col:48> Inherited "" ""
|-CXXMethodDecl 0x55b71e1adbc0 <line:175:5, col:71> col:21 at_u 'Element *const &(Vector::size_type) const' inline
| |-ParmVarDecl 0x55b71e1adb30 <col:26, col:36> col:36 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x55b71e1adc78 <col:60> Inherited "" ""
|-CXXMethodDecl 0x55b71e1add38 <line:177:5, col:20> col:15 data 'Element **()' inline
|-CXXMethodDecl 0x55b71e1ade38 <line:178:5, col:28> col:21 data 'Element *const *() const' inline
|-CXXMethodDecl 0x55b71e1adfb8 <line:180:5, col:48> col:17 push_back 'void (Vector<Element *>::value_argument_type)' inline
| `-ParmVarDecl 0x55b71e1adef8 <col:27, col:47> col:47 v 'Vector<Element *>::value_argument_type':'Element *'
|-FunctionTemplateDecl 0x55b71e1ae778 <line:182:5, line:183:63> col:48 push_back
| |-TemplateTypeParmDecl 0x55b71e1ae070 <line:182:15, col:43> col:24 typename depth 0 index 0 A
| | `-TemplateArgument type 'fast_argument<Element *>':'fast_argument<Element *, false>'
| `-CXXMethodDecl 0x55b71e1ae6d8 <line:183:5, col:63> col:48 push_back 'typename A::enable_rvalue_reference (Element *&&)' inline
|   `-ParmVarDecl 0x55b71e1ae5d8 <col:58, col:62> col:62 v 'Element *&&'
|-CXXMethodDecl 0x55b71e1ae858 <line:185:5, col:26> col:17 pop_back 'void ()' inline
|-CXXMethodDecl 0x55b71e1ae9a8 <line:186:5, col:49> col:17 push_front 'void (Vector<Element *>::value_argument_type)' inline
| `-ParmVarDecl 0x55b71e1ae918 <col:28, col:48> col:48 v 'Vector<Element *>::value_argument_type':'Element *'
|-CXXMethodDecl 0x55b71e1aea60 <line:187:5, col:27> col:17 pop_front 'void ()' inline
|-CXXMethodDecl 0x55b71e1aeca8 <line:189:5, col:62> col:21 insert 'Vector<Element *>::iterator (Vector<Element *>::iterator, Vector<Element *>::value_argument_type)' inline
| |-ParmVarDecl 0x55b71e1aeb20 <col:28, col:37> col:37 it 'Vector<Element *>::iterator':'Element **'
| `-ParmVarDecl 0x55b71e1aeb98 <col:41, col:61> col:61 v 'Vector<Element *>::value_argument_type':'Element *'
|-CXXMethodDecl 0x55b71e1aee68 <line:190:5, col:38> col:21 erase 'Vector<Element *>::iterator (Vector<Element *>::iterator)' inline
| `-ParmVarDecl 0x55b71e1aed78 <col:27, col:36> col:36 it 'Vector<Element *>::iterator':'Element **'
|-CXXMethodDecl 0x55b71e1af0b8 <line:191:5, col:49> col:21 erase 'Vector<Element *>::iterator (Vector<Element *>::iterator, Vector<Element *>::iterator)' inline
| |-ParmVarDecl 0x55b71e1aef30 <col:27, col:36> col:36 a 'Vector<Element *>::iterator':'Element **'
| `-ParmVarDecl 0x55b71e1aefa8 <col:39, col:48> col:48 b 'Vector<Element *>::iterator':'Element **'
|-CXXMethodDecl 0x55b71e1af178 <line:193:5, col:23> col:17 clear 'void ()' inline
|-CXXMethodDecl 0x55b71e1af3d8 <line:195:5, col:34> col:17 swap 'void (Vector<Element *> &)' inline
| `-ParmVarDecl 0x55b71e1af2e0 <col:22, col:33> col:33 x 'Vector<Element *> &'
`-CXXDestructorDecl 0x55b71e1af4a8 <../dummy_inc/click/ipaddress.hh:13:29> col:29 implicit ~Vector 'void ()' inline default noexcept-unevaluated 0x55b71e1af4a8

Layout: <CGRecordLayout
  LLVMType:%class.Vector = type { %class.vector_memory }
  NonVirtualBaseLLVMType:%class.Vector = type { %class.vector_memory }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x55b71dc76030 <../dummy_inc/click/string.hh:189:5, line:198:5> line:189:12 referenced struct memo_t definition
|-DefinitionData pass_in_registers aggregate standard_layout trivially_copyable pod trivial
| |-DefaultConstructor exists trivial needs_implicit
| |-CopyConstructor simple trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveConstructor exists simple trivial needs_implicit
| |-CopyAssignment trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveAssignment exists simple trivial needs_implicit
| `-Destructor simple irrelevant trivial needs_implicit
|-CXXRecordDecl 0x55b71dc76148 <col:5, col:12> col:12 implicit struct memo_t
|-FieldDecl 0x55b71dc761e8 <line:190:2, col:20> col:20 referenced refcount 'volatile uint32_t':'volatile unsigned int'
|-FieldDecl 0x55b71dc76248 <line:191:2, col:11> col:11 referenced capacity 'uint32_t':'unsigned int'
|-FieldDecl 0x55b71dc762a8 <line:192:2, col:20> col:20 dirty 'volatile uint32_t':'volatile unsigned int'
`-FieldDecl 0x55b71dc76358 <line:197:2, col:18> col:7 real_data 'char [8]'

Layout: <CGRecordLayout
  LLVMType:%"struct.String::memo_t" = type { i32, i32, i32, [8 x i8] }
  NonVirtualBaseLLVMType:%"struct.String::memo_t" = type { i32, i32, i32, [8 x i8] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x55b71dc76660 <../dummy_inc/click/string.hh:204:5, line:208:5> line:204:12 referenced struct rep_t definition
|-DefinitionData pass_in_registers aggregate standard_layout trivially_copyable pod trivial literal
| |-DefaultConstructor exists trivial
| |-CopyConstructor simple trivial has_const_param implicit_has_const_param
| |-MoveConstructor exists simple trivial
| |-CopyAssignment trivial has_const_param implicit_has_const_param
| |-MoveAssignment exists simple trivial
| `-Destructor simple irrelevant trivial
|-CXXRecordDecl 0x55b71dc76778 <col:5, col:12> col:12 implicit struct rep_t
|-FieldDecl 0x55b71dc76820 <line:205:2, col:14> col:14 referenced data 'const char *'
|-FieldDecl 0x55b71dc76888 <line:206:2, col:6> col:6 referenced length 'int'
|-FieldDecl 0x55b71dc76918 <line:207:2, col:10> col:10 referenced memo 'String::memo_t *'
|-CXXConstructorDecl 0x55b71dc7b100 <line:204:12> col:12 implicit used rep_t 'void () noexcept' inline default trivial
| `-CompoundStmt 0x55b71dc7b538 <col:12>
|-CXXConstructorDecl 0x55b71dc7b208 <col:12> col:12 implicit used constexpr rep_t 'void (const String::rep_t &) noexcept' inline default trivial
| |-ParmVarDecl 0x55b71dc7b318 <col:12> col:12 used 'const String::rep_t &'
| |-CXXCtorInitializer Field 0x55b71dc76820 'data' 'const char *'
| | `-ImplicitCastExpr 0x55b71dc7e980 <col:12> 'const char *' <LValueToRValue>
| |   `-MemberExpr 0x55b71dc7e950 <col:12> 'const char *const' lvalue .data 0x55b71dc76820
| |     `-DeclRefExpr 0x55b71dc7e930 <col:12> 'const String::rep_t' lvalue ParmVar 0x55b71dc7b318 '' 'const String::rep_t &'
| |-CXXCtorInitializer Field 0x55b71dc76888 'length' 'int'
| | `-ImplicitCastExpr 0x55b71dc7ea10 <col:12> 'int' <LValueToRValue>
| |   `-MemberExpr 0x55b71dc7e9e0 <col:12> 'const int' lvalue .length 0x55b71dc76888
| |     `-DeclRefExpr 0x55b71dc7e9c0 <col:12> 'const String::rep_t' lvalue ParmVar 0x55b71dc7b318 '' 'const String::rep_t &'
| |-CXXCtorInitializer Field 0x55b71dc76918 'memo' 'String::memo_t *'
| | `-ImplicitCastExpr 0x55b71dc7eaa0 <col:12> 'String::memo_t *' <LValueToRValue>
| |   `-MemberExpr 0x55b71dc7ea70 <col:12> 'String::memo_t *const' lvalue .memo 0x55b71dc76918
| |     `-DeclRefExpr 0x55b71dc7ea50 <col:12> 'const String::rep_t' lvalue ParmVar 0x55b71dc7b318 '' 'const String::rep_t &'
| `-CompoundStmt 0x55b71dc7eaf8 <col:12>
|-CXXConstructorDecl 0x55b71dc7b3b8 <col:12> col:12 implicit constexpr rep_t 'void (String::rep_t &&)' inline default trivial noexcept-unevaluated 0x55b71dc7b3b8
| `-ParmVarDecl 0x55b71dc7b4c8 <col:12> col:12 'String::rep_t &&'
|-CXXDestructorDecl 0x55b71dc81820 <col:12> col:12 implicit ~rep_t 'void () noexcept' inline default trivial
|-CXXMethodDecl 0x55b71dc8aea8 <col:12> col:12 implicit used constexpr operator= 'String::rep_t &(const String::rep_t &) noexcept' inline default trivial
| |-ParmVarDecl 0x55b71dc8afb8 <col:12> col:12 used 'const String::rep_t &'
| `-CompoundStmt 0x55b71dc8b4d0 <col:12>
|   |-BinaryOperator 0x55b71dc8b2e8 <col:12> 'const char *' lvalue '='
|   | |-MemberExpr 0x55b71dc8b2a0 <col:12> 'const char *' lvalue ->data 0x55b71dc76820
|   | | `-CXXThisExpr 0x55b71dc8b290 <col:12> 'String::rep_t *' this
|   | `-ImplicitCastExpr 0x55b71dc8b2d0 <col:12> 'const char *' <LValueToRValue>
|   |   `-MemberExpr 0x55b71dc8b260 <col:12> 'const char *const' lvalue .data 0x55b71dc76820
|   |     `-DeclRefExpr 0x55b71dc8b240 <col:12> 'const String::rep_t' lvalue ParmVar 0x55b71dc8afb8 '' 'const String::rep_t &'
|   |-BinaryOperator 0x55b71dc8b3b0 <col:12> 'int' lvalue '='
|   | |-MemberExpr 0x55b71dc8b368 <col:12> 'int' lvalue ->length 0x55b71dc76888
|   | | `-CXXThisExpr 0x55b71dc8b358 <col:12> 'String::rep_t *' this
|   | `-ImplicitCastExpr 0x55b71dc8b398 <col:12> 'int' <LValueToRValue>
|   |   `-MemberExpr 0x55b71dc8b328 <col:12> 'const int' lvalue .length 0x55b71dc76888
|   |     `-DeclRefExpr 0x55b71dc8b308 <col:12> 'const String::rep_t' lvalue ParmVar 0x55b71dc8afb8 '' 'const String::rep_t &'
|   |-BinaryOperator 0x55b71dc8b478 <col:12> 'String::memo_t *' lvalue '='
|   | |-MemberExpr 0x55b71dc8b430 <col:12> 'String::memo_t *' lvalue ->memo 0x55b71dc76918
|   | | `-CXXThisExpr 0x55b71dc8b420 <col:12> 'String::rep_t *' this
|   | `-ImplicitCastExpr 0x55b71dc8b460 <col:12> 'String::memo_t *' <LValueToRValue>
|   |   `-MemberExpr 0x55b71dc8b3f0 <col:12> 'String::memo_t *const' lvalue .memo 0x55b71dc76918
|   |     `-DeclRefExpr 0x55b71dc8b3d0 <col:12> 'const String::rep_t' lvalue ParmVar 0x55b71dc8afb8 '' 'const String::rep_t &'
|   `-ReturnStmt 0x55b71dc8b4c0 <col:12>
|     `-UnaryOperator 0x55b71dc8b4a8 <col:12> 'String::rep_t' lvalue prefix '*' cannot overflow
|       `-CXXThisExpr 0x55b71dc8b498 <col:12> 'String::rep_t *' this
`-CXXMethodDecl 0x55b71dc8b028 <col:12> col:12 implicit constexpr operator= 'String::rep_t &(String::rep_t &&)' inline default trivial noexcept-unevaluated 0x55b71dc8b028
  `-ParmVarDecl 0x55b71dc8b138 <col:12> col:12 'String::rep_t &&'

Layout: <CGRecordLayout
  LLVMType:%"struct.String::rep_t" = type { i8*, i32, %"struct.String::memo_t"* }
  NonVirtualBaseLLVMType:%"struct.String::rep_t" = type { i8*, i32, %"struct.String::memo_t"* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x55b71dc6c5a0 <../dummy_inc/click/string.hh:19:1, line:304:1> line:19:7 referenced class String definition
|-DefinitionData standard_layout has_user_declared_ctor has_mutable_fields can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor non_trivial user_declared has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveConstructor exists non_trivial user_declared
| |-CopyAssignment non_trivial has_const_param user_declared needs_overload_resolution implicit_has_const_param
| |-MoveAssignment exists non_trivial user_declared
| `-Destructor non_trivial user_declared
|-CXXRecordDecl 0x55b71dc6c6b8 <col:1, col:7> col:7 implicit referenced class String
|-AccessSpecDecl 0x55b71dc6c748 <col:16, col:22> col:16 public
|-TypedefDecl 0x55b71dc6c788 <line:21:5, col:25> col:25 referenced const_iterator 'const char *'
| `-PointerType 0x55b71d92ffd0 'const char *'
|   `-QualType 0x55b71d92f521 'const char' const
|     `-BuiltinType 0x55b71d92f520 'char'
|-TypedefDecl 0x55b71dc6c810 <line:22:5, col:28> col:28 iterator 'String::const_iterator':'const char *'
| `-TypedefType 0x55b71dc6c7e0 'String::const_iterator' sugar
|   |-Typedef 0x55b71dc6c788 'const_iterator'
|   `-PointerType 0x55b71d92ffd0 'const char *'
|     `-QualType 0x55b71d92f521 'const char' const
|       `-BuiltinType 0x55b71d92f520 'char'
|-TypedefDecl 0x55b71dc6c980 <line:24:5, col:52> col:27 referenced unspecified_bool_type 'int (String::*)() const'
| `-MemberPointerType 0x55b71dc6c8f0 'int (String::*)() const'
|   |-RecordType 0x55b71dc6c630 'String'
|   | `-CXXRecord 0x55b71dc6c5a0 'String'
|   `-ParenType 0x55b71dc6c890 'int () const' sugar
|     `-FunctionProtoType 0x55b71dc4efc0 'int () const' const cdecl
|       `-BuiltinType 0x55b71d92f580 'int'
|-TypedefDecl 0x55b71dc6c9e8 <line:27:5, col:21> col:21 referenced intmax_t 'int64_t':'long'
| `-TypedefType 0x55b71da8d500 'int64_t' sugar
|   |-Typedef 0x55b71d998390 'int64_t'
|   `-TypedefType 0x55b71d971630 '__int64_t' sugar
|     |-Typedef 0x55b71d971208 '__int64_t'
|     `-BuiltinType 0x55b71d92f5a0 'long'
|-TypedefDecl 0x55b71dc6ca50 <line:28:5, col:22> col:22 referenced uintmax_t 'uint64_t':'unsigned long'
| `-TypedefType 0x55b71da8d420 'uint64_t' sugar
|   |-Typedef 0x55b71d998530 'uint64_t'
|   `-TypedefType 0x55b71d9716c0 '__uint64_t' sugar
|     |-Typedef 0x55b71d971278 '__uint64_t'
|     `-BuiltinType 0x55b71d92f640 'unsigned long'
|-TypedefDecl 0x55b71dc6cae0 <line:36:5, col:22> col:22 int_large_t 'String::intmax_t':'long'
| `-TypedefType 0x55b71dc6cab0 'String::intmax_t' sugar
|   |-Typedef 0x55b71dc6c9e8 'intmax_t'
|   `-TypedefType 0x55b71da8d500 'int64_t' sugar
|     |-Typedef 0x55b71d998390 'int64_t'
|     `-TypedefType 0x55b71d971630 '__int64_t' sugar
|       |-Typedef 0x55b71d971208 '__int64_t'
|       `-BuiltinType 0x55b71d92f5a0 'long'
|-TypedefDecl 0x55b71dc6cb70 <line:37:5, col:23> col:23 uint_large_t 'String::uintmax_t':'unsigned long'
| `-TypedefType 0x55b71dc6cb40 'String::uintmax_t' sugar
|   |-Typedef 0x55b71dc6ca50 'uintmax_t'
|   `-TypedefType 0x55b71da8d420 'uint64_t' sugar
|     |-Typedef 0x55b71d998530 'uint64_t'
|     `-TypedefType 0x55b71d9716c0 '__uint64_t' sugar
|       |-Typedef 0x55b71d971278 '__uint64_t'
|       `-BuiltinType 0x55b71d92f640 'unsigned long'
|-CXXConstructorDecl 0x55b71dc6cc30 <line:39:5, col:19> col:12 used String 'void ()' inline
|-CXXConstructorDecl 0x55b71dc6cdd8 <line:40:5, col:34> col:12 used String 'void (const String &)' inline
| `-ParmVarDecl 0x55b71dc6cd18 <col:19, col:33> col:33 x 'const String &'
|-CXXConstructorDecl 0x55b71dc6cf88 <line:42:5, col:29> col:12 used String 'void (String &&)' inline
| `-ParmVarDecl 0x55b71dc6cec8 <col:19, col:28> col:28 x 'String &&'
|-CXXConstructorDecl 0x55b71dc6d0e0 <line:44:5, col:35> col:12 used String 'void (const char *)' inline
| `-ParmVarDecl 0x55b71dc6d050 <col:19, col:31> col:31 cstr 'const char *'
|-CXXConstructorDecl 0x55b71dc6d2f8 <line:45:5, col:41> col:12 String 'void (const char *, int)' inline
| |-ParmVarDecl 0x55b71dc6d1a8 <col:19, col:31> col:31 s 'const char *'
| `-ParmVarDecl 0x55b71dc6d228 <col:34, col:38> col:38 len 'int'
|-CXXConstructorDecl 0x55b71dc6d518 <line:46:5, col:50> col:12 String 'void (const unsigned char *, int)' inline
| |-ParmVarDecl 0x55b71dc6d3c8 <col:19, col:40> col:40 s 'const unsigned char *'
| `-ParmVarDecl 0x55b71dc6d448 <col:43, col:47> col:47 len 'int'
|-CXXConstructorDecl 0x55b71dc6d738 <line:47:5, col:54> col:12 used String 'void (const char *, const char *)' inline
| |-ParmVarDecl 0x55b71dc6d5e8 <col:19, col:31> col:31 first 'const char *'
| `-ParmVarDecl 0x55b71dc6d668 <col:38, col:50> col:50 last 'const char *'
|-CXXConstructorDecl 0x55b71dc6d958 <line:48:5, col:72> col:12 String 'void (const unsigned char *, const unsigned char *)' inline
| |-ParmVarDecl 0x55b71dc6d808 <col:19, col:40> col:40 first 'const unsigned char *'
| `-ParmVarDecl 0x55b71dc6d888 <col:47, col:68> col:68 last 'const unsigned char *'
|-CXXConstructorDecl 0x55b71dc6dae8 <line:49:5, col:34> col:21 used String 'void (bool)' inline
| `-ParmVarDecl 0x55b71dc6da20 <col:28, col:33> col:33 x 'bool'
|-CXXConstructorDecl 0x55b71dc6dc68 <line:50:5, col:34> col:21 String 'void (char)' inline
| `-ParmVarDecl 0x55b71dc6dba8 <col:28, col:33> col:33 c 'char'
|-CXXConstructorDecl 0x55b71dc6ddf8 <line:51:5, col:43> col:21 String 'void (unsigned char)' inline
| `-ParmVarDecl 0x55b71dc6dd30 <col:28, col:42> col:42 c 'unsigned char'
|-CXXConstructorDecl 0x55b71dc6df50 <line:52:5, col:26> col:14 String 'void (int)'
| `-ParmVarDecl 0x55b71dc6dec0 <col:21, col:25> col:25 x 'int'
|-CXXConstructorDecl 0x55b71dc6e0d8 <line:53:5, col:31> col:14 String 'void (unsigned int)'
| `-ParmVarDecl 0x55b71dc6e018 <col:21, col:30> col:30 x 'unsigned int'
|-CXXConstructorDecl 0x55b71dc6e230 <line:54:5, col:27> col:14 String 'void (long)'
| `-ParmVarDecl 0x55b71dc6e1a0 <col:21, col:26> col:26 x 'long'
|-CXXConstructorDecl 0x55b71dc6e3b8 <line:55:5, col:36> col:14 String 'void (unsigned long)'
| `-ParmVarDecl 0x55b71dc6e2f8 <col:21, col:35> col:35 x 'unsigned long'
|-CXXConstructorDecl 0x55b71dc6e548 <line:57:5, col:32> col:14 String 'void (long long)'
| `-ParmVarDecl 0x55b71dc6e480 <col:21, col:31> col:31 x 'long long'
|-CXXConstructorDecl 0x55b71dc6e6d8 <line:58:5, col:41> col:14 String 'void (unsigned long long)'
| `-ParmVarDecl 0x55b71dc6e610 <col:21, col:40> col:40 x 'unsigned long long'
|-CXXConstructorDecl 0x55b71dc6e868 <line:65:5, col:29> col:14 String 'void (double)'
| `-ParmVarDecl 0x55b71dc6e7a0 <col:21, col:28> col:28 x 'double'
|-CXXDestructorDecl 0x55b71dc6e960 <line:67:5, col:20> col:12 used ~String 'void () noexcept' inline
|-CXXMethodDecl 0x55b71dc6ea88 <line:69:5, col:44> col:33 make_empty 'const String &()' static inline
|-CXXMethodDecl 0x55b71dc6ec08 <line:70:5, col:52> col:26 used make_uninitialized 'String (int)' static inline
| `-ParmVarDecl 0x55b71dc6eb40 <col:45, col:49> col:49 len 'int'
|-CXXMethodDecl 0x55b71dc6ed58 <line:71:5, col:74> col:26 make_garbage 'String (int)' static inline
| |-ParmVarDecl 0x55b71dc6ecc8 <col:39, col:43> col:43 len 'int'
| `-DeprecatedAttr 0x55b71dc6ee00 <col:63> "" ""
|-CXXMethodDecl 0x55b71dc6ef48 <line:72:5, col:54> col:26 make_stable 'String (const char *)' static inline
| `-ParmVarDecl 0x55b71dc6ee88 <col:38, col:50> col:50 cstr 'const char *'
|-CXXMethodDecl 0x55b71dc6f158 <line:73:5, col:60> col:26 make_stable 'String (const char *, int)' static inline
| |-ParmVarDecl 0x55b71dc6f008 <col:38, col:50> col:50 s 'const char *'
| `-ParmVarDecl 0x55b71dc6f088 <col:53, col:57> col:57 len 'int'
|-CXXMethodDecl 0x55b71dc6f378 <line:74:5, col:73> col:26 make_stable 'String (const char *, const char *)' static inline
| |-ParmVarDecl 0x55b71dc6f220 <col:38, col:50> col:50 first 'const char *'
| `-ParmVarDecl 0x55b71dc6f2a0 <col:57, col:69> col:69 last 'const char *'
|-CXXMethodDecl 0x55b71dc6f658 <line:75:5, col:80> col:19 make_numeric 'String (String::intmax_t, int, bool)' static
| |-ParmVarDecl 0x55b71dc6f438 <col:32, col:41> col:41 x 'String::intmax_t':'long'
| |-ParmVarDecl 0x55b71dc6f4b8 <col:44, col:55> col:48 base 'int' cinit
| | `-IntegerLiteral 0x55b71dc7abd0 <col:55> 'int' 10
| `-ParmVarDecl 0x55b71dc6f530 <col:59, col:76> col:64 uppercase 'bool' cinit
|   `-CXXBoolLiteralExpr 0x55b71dc7abf0 <col:76> 'bool' true
|-CXXMethodDecl 0x55b71dc6f938 <line:76:5, col:81> col:19 make_numeric 'String (String::uintmax_t, int, bool)' static
| |-ParmVarDecl 0x55b71dc6f720 <col:32, col:42> col:42 x 'String::uintmax_t':'unsigned long'
| |-ParmVarDecl 0x55b71dc6f7a0 <col:45, col:56> col:49 base 'int' cinit
| | `-IntegerLiteral 0x55b71dc7ac00 <col:56> 'int' 10
| `-ParmVarDecl 0x55b71dc6f818 <col:60, col:77> col:65 uppercase 'bool' cinit
|   `-CXXBoolLiteralExpr 0x55b71dc7ac20 <col:77> 'bool' true
|-CXXMethodDecl 0x55b71dc6fa40 <line:78:5, col:31> col:24 used data 'const char *() const' inline
|-CXXMethodDecl 0x55b71dc6fb08 <line:79:5, col:25> col:16 used length 'int () const' inline
|-CXXMethodDecl 0x55b71dc6fbd0 <line:81:5, col:60> col:52 c_str 'const char *() const'
| |-NoInlineAttr 0x55b71dc6fc70 <col:20>
| `-OptimizeNoneAttr 0x55b71dc6fcc8 <col:30>
|-CXXConversionDecl 0x55b71dc6fdb8 <line:83:5, col:45> col:12 used operator int (String::*)() const 'String::unspecified_bool_type () const' inline
|-CXXMethodDecl 0x55b71dc6fe88 <line:84:5, col:25> col:17 used empty 'bool () const' inline
|-CXXMethodDecl 0x55b71dc6ff48 <line:85:5, col:29> col:17 operator! 'bool () const' inline
|-CXXMethodDecl 0x55b71dc70038 <line:87:5, col:35> col:27 used begin 'String::const_iterator () const' inline
|-CXXMethodDecl 0x55b71dc700f8 <line:88:5, col:33> col:27 used end 'String::const_iterator () const' inline
|-CXXMethodDecl 0x55b71dc70278 <line:90:5, col:35> col:17 used operator[] 'char (int) const' inline
| `-ParmVarDecl 0x55b71dc701b0 <col:28, col:32> col:32 i 'int'
|-CXXMethodDecl 0x55b71dc703c8 <line:91:5, col:27> col:17 at 'char (int) const' inline
| `-ParmVarDecl 0x55b71dc70338 <col:20, col:24> col:24 i 'int'
|-CXXMethodDecl 0x55b71dc704b8 <line:92:5, col:25> col:17 front 'char () const' inline
|-CXXMethodDecl 0x55b71dc70578 <line:93:5, col:24> col:17 back 'char () const' inline
|-CXXMethodDecl 0x55b71dc707c8 <line:95:5, col:64> col:21 used hashcode 'uint32_t (const char *, const char *)' static
| |-ParmVarDecl 0x55b71dc70630 <col:30, col:42> col:42 begin 'const char *'
| `-ParmVarDecl 0x55b71dc706b0 <col:49, col:61> col:61 end 'const char *'
|-CXXMethodDecl 0x55b71dc70a28 <line:96:5, line:97:33> line:96:28 hashcode 'uint32_t (const unsigned char *, const unsigned char *)' static inline
| |-ParmVarDecl 0x55b71dc70890 <col:37, col:58> col:58 begin 'const unsigned char *'
| `-ParmVarDecl 0x55b71dc70910 <line:97:9, col:30> col:30 end 'const unsigned char *'
|-CXXMethodDecl 0x55b71dc70af8 <line:98:5, col:32> col:21 hashcode 'uint32_t () const' inline
|-CXXMethodDecl 0x55b71dc70d08 <line:100:5, col:65> col:19 substring 'String (const char *, const char *) const' inline
| |-ParmVarDecl 0x55b71dc70bb0 <col:29, col:41> col:41 begin 'const char *'
| `-ParmVarDecl 0x55b71dc70c30 <col:48, col:60> col:60 end 'const char *'
|-CXXMethodDecl 0x55b71dc70f28 <line:101:5, col:40> col:12 used substring 'String (int, int) const'
| |-ParmVarDecl 0x55b71dc70dd0 <col:22, col:26> col:26 pos 'int'
| `-ParmVarDecl 0x55b71dc70e50 <col:31, col:35> col:35 len 'int'
|-CXXMethodDecl 0x55b71dc710b8 <line:102:5, col:38> col:19 substring 'String (int) const' inline
| `-ParmVarDecl 0x55b71dc70ff0 <col:29, col:33> col:33 pos 'int'
|-CXXMethodDecl 0x55b71dc711a8 <line:103:5, col:25> col:12 trim_space 'String () const'
|-CXXMethodDecl 0x55b71dc71318 <line:105:5, col:41> col:17 equals 'bool (const String &) const' inline
| `-ParmVarDecl 0x55b71dc71258 <col:24, col:38> col:38 x 'const String &'
|-CXXMethodDecl 0x55b71dc71528 <line:106:5, col:48> col:17 used equals 'bool (const char *, int) const' inline
| |-ParmVarDecl 0x55b71dc713d8 <col:24, col:36> col:36 s 'const char *'
| `-ParmVarDecl 0x55b71dc71458 <col:39, col:43> col:43 len 'int'
|-CXXMethodDecl 0x55b71dc71740 <line:107:5, col:63> col:23 used compare 'int (const String &, const String &)' static inline
| |-ParmVarDecl 0x55b71dc715e8 <col:31, col:45> col:45 a 'const String &'
| `-ParmVarDecl 0x55b71dc71660 <col:48, col:62> col:62 b 'const String &'
|-CXXMethodDecl 0x55b71dc718d0 <line:108:5, col:41> col:16 used compare 'int (const String &) const' inline
| `-ParmVarDecl 0x55b71dc71800 <col:24, col:38> col:38 x 'const String &'
|-CXXMethodDecl 0x55b71dc71af0 <line:109:5, col:41> col:9 used compare 'int (const char *, int) const'
| |-ParmVarDecl 0x55b71dc71990 <col:17, col:29> col:29 s 'const char *'
| `-ParmVarDecl 0x55b71dc71a10 <col:32, col:36> col:36 len 'int'
|-CXXMethodDecl 0x55b71dc71c40 <line:110:5, col:46> col:17 starts_with 'bool (const String &) const' inline
| `-ParmVarDecl 0x55b71dc71bb0 <col:29, col:43> col:43 x 'const String &'
|-CXXMethodDecl 0x55b71dc71e18 <line:111:5, col:46> col:10 used starts_with 'bool (const char *, int) const'
| |-ParmVarDecl 0x55b71dc71d00 <col:22, col:34> col:34 s 'const char *'
| `-ParmVarDecl 0x55b71dc71d80 <col:37, col:41> col:41 len 'int'
|-CXXMethodDecl 0x55b71dc71f68 <line:112:5, col:44> col:10 glob_match 'bool (const String &) const'
| `-ParmVarDecl 0x55b71dc71ed8 <col:21, col:35> col:35 pattern 'const String &'
|-CXXMethodDecl 0x55b71dc731b0 <line:125:5, col:42> col:9 find_left 'int (char, int) const'
| |-ParmVarDecl 0x55b71dc72020 <col:19, col:24> col:24 c 'char'
| `-ParmVarDecl 0x55b71dc730d0 <col:27, col:39> col:31 start 'int' cinit
|   `-IntegerLiteral 0x55b71dc7ac30 <col:39> 'int' 0
|-CXXMethodDecl 0x55b71dc733d0 <line:126:5, col:51> col:9 find_left 'int (const String &, int) const'
| |-ParmVarDecl 0x55b71dc73270 <col:19, col:33> col:33 x 'const String &'
| `-ParmVarDecl 0x55b71dc732f0 <col:36, col:48> col:40 start 'int' cinit
|   `-IntegerLiteral 0x55b71dc7ac50 <col:48> 'int' 0
|-CXXMethodDecl 0x55b71dc735b0 <line:127:5, col:52> col:9 find_right 'int (char, int) const'
| |-ParmVarDecl 0x55b71dc73490 <col:20, col:25> col:25 c 'char'
| `-ParmVarDecl 0x55b71dc73510 <col:28, col:40> col:32 start 'int' cinit
|   `-IntegerLiteral 0x55b71dc7ac70 <col:40> 'int' 2147483647
|-CXXMethodDecl 0x55b71dc73680 <line:129:5, col:20> col:12 lower 'String () const'
|-CXXMethodDecl 0x55b71dc73740 <line:130:5, col:20> col:12 upper 'String () const'
|-CXXMethodDecl 0x55b71dc73800 <line:131:5, col:24> col:12 printable 'String () const'
|-CXXMethodDecl 0x55b71dc738c0 <line:132:5, col:25> col:12 quoted_hex 'String () const'
|-CXXMethodDecl 0x55b71dc73980 <line:133:5, col:26> col:12 encode_json 'String () const'
|-CXXMethodDecl 0x55b71dc73b28 <line:135:5, col:45> col:20 used operator= 'String &(const String &)' inline
| `-ParmVarDecl 0x55b71dc73a30 <col:30, col:44> col:44 x 'const String &'
|-CXXMethodDecl 0x55b71dc73ca8 <line:137:5, col:40> col:20 used operator= 'String &(String &&)' inline
| `-ParmVarDecl 0x55b71dc73be0 <col:30, col:39> col:39 x 'String &&'
|-CXXMethodDecl 0x55b71dc73e28 <line:139:5, col:46> col:20 operator= 'String &(const char *)' inline
| `-ParmVarDecl 0x55b71dc73d68 <col:30, col:42> col:42 cstr 'const char *'
|-CXXMethodDecl 0x55b71dc73fa8 <line:141:5, col:31> col:17 swap 'void (String &)' inline
| `-ParmVarDecl 0x55b71dc73ee0 <col:22, col:30> col:30 x 'String &'
|-CXXMethodDecl 0x55b71dc740f0 <line:143:5, col:39> col:17 append 'void (const String &)' inline
| `-ParmVarDecl 0x55b71dc74060 <col:24, col:38> col:38 x 'const String &'
|-CXXMethodDecl 0x55b71dc74240 <line:144:5, col:40> col:17 used append 'void (const char *)' inline
| `-ParmVarDecl 0x55b71dc741b0 <col:24, col:36> col:36 cstr 'const char *'
|-CXXMethodDecl 0x55b71dc74418 <line:145:5, col:46> col:17 used append 'void (const char *, int)' inline
| |-ParmVarDecl 0x55b71dc74300 <col:24, col:36> col:36 s 'const char *'
| `-ParmVarDecl 0x55b71dc74380 <col:39, col:43> col:43 len 'int'
|-CXXMethodDecl 0x55b71dc745f8 <line:146:5, col:59> col:17 append 'void (const char *, const char *)' inline
| |-ParmVarDecl 0x55b71dc744e0 <col:24, col:36> col:36 first 'const char *'
| `-ParmVarDecl 0x55b71dc74560 <col:43, col:55> col:55 last 'const char *'
|-CXXMethodDecl 0x55b71dc74748 <line:147:5, col:30> col:17 append 'void (char)' inline
| `-ParmVarDecl 0x55b71dc746b8 <col:24, col:29> col:29 c 'char'
|-CXXMethodDecl 0x55b71dc74958 <line:148:5, col:36> col:10 append_fill 'void (int, int)'
| |-ParmVarDecl 0x55b71dc74808 <col:22, col:26> col:26 c 'int'
| `-ParmVarDecl 0x55b71dc74888 <col:29, col:33> col:33 len 'int'
|-CXXMethodDecl 0x55b71dc74ab8 <line:149:5, col:39> col:11 used append_uninitialized 'char *(int)'
| `-ParmVarDecl 0x55b71dc74a20 <col:32, col:36> col:36 len 'int'
|-CXXMethodDecl 0x55b71dc74c10 <line:150:5, col:68> col:18 append_garbage 'char *(int)' inline
| |-ParmVarDecl 0x55b71dc74b78 <col:33, col:37> col:37 len 'int'
| `-DeprecatedAttr 0x55b71dc74cb8 <col:57> "" ""
|-CXXMethodDecl 0x55b71dc74dc8 <line:152:5, col:46> col:20 used operator+= 'String &(const String &)' inline
| `-ParmVarDecl 0x55b71dc74d38 <col:31, col:45> col:45 x 'const String &'
|-CXXMethodDecl 0x55b71dc74f18 <line:153:5, col:47> col:20 operator+= 'String &(const char *)' inline
| `-ParmVarDecl 0x55b71dc74e88 <col:31, col:43> col:43 cstr 'const char *'
|-CXXMethodDecl 0x55b71dc75098 <line:154:5, col:37> col:20 operator+= 'String &(char)' inline
| `-ParmVarDecl 0x55b71dc74fd0 <col:31, col:36> col:36 c 'char'
|-CXXMethodDecl 0x55b71dc75160 <line:160:5, col:29> col:17 is_shared 'bool () const' inline
|-CXXMethodDecl 0x55b71dc75220 <line:161:5, col:29> col:17 is_stable 'bool () const' inline
|-CXXMethodDecl 0x55b71dc752e0 <line:163:5, col:60> col:19 unique 'String () const' inline
| `-DeprecatedAttr 0x55b71dc75380 <col:49> "" ""
|-CXXMethodDecl 0x55b71dc75410 <line:164:5, col:30> col:19 used unshared 'String () const' inline
|-CXXMethodDecl 0x55b71dc754d0 <line:165:5, col:29> col:19 compact 'String () const' inline
|-CXXMethodDecl 0x55b71dc755c0 <line:167:5, col:24> col:11 mutable_data 'char *()'
|-CXXMethodDecl 0x55b71dc75688 <line:168:5, col:25> col:11 mutable_c_str 'char *()'
|-CXXMethodDecl 0x55b71dc75748 <line:170:5, col:52> col:33 make_out_of_memory 'const String &()' static inline
|-CXXMethodDecl 0x55b71dc75808 <line:171:5, col:33> col:17 out_of_memory 'bool () const' inline
|-CXXMethodDecl 0x55b71dc75900 <line:172:5, col:50> col:31 out_of_memory_data 'const char *()' static inline
|-CXXMethodDecl 0x55b71dc759c8 <line:173:5, col:44> col:23 out_of_memory_length 'int ()' static inline
|-CXXMethodDecl 0x55b71dc75a90 <line:174:5, col:42> col:31 used empty_data 'const char *()' static inline
|-CXXMethodDecl 0x55b71dc75c68 <line:180:5, col:81> col:31 skip_utf8_char 'const char *(const char *, const char *)' static inline
| |-ParmVarDecl 0x55b71dc75b48 <col:46, col:58> col:58 first 'const char *'
| `-ParmVarDecl 0x55b71dc75bc8 <col:65, col:77> col:77 last 'const char *'
|-CXXMethodDecl 0x55b71dc75e90 <line:181:5, line:182:38> line:181:33 used skip_utf8_char 'const unsigned char *(const unsigned char *, const unsigned char *)' static
| |-ParmVarDecl 0x55b71dc75d30 <col:48, col:69> col:69 first 'const unsigned char *'
| `-ParmVarDecl 0x55b71dc75db0 <line:182:13, col:34> col:34 last 'const unsigned char *'
|-VarDecl 0x55b71dc75fa0 <line:184:5, col:35> col:23 used bool_data 'const char [11]' static
|-AccessSpecDecl 0x55b71dc76008 <line:186:3, col:10> col:3 private
|-CXXRecordDecl 0x55b71dc76030 <line:189:5, line:198:5> line:189:12 referenced struct memo_t definition
| |-DefinitionData pass_in_registers aggregate standard_layout trivially_copyable pod trivial
| | |-DefaultConstructor exists trivial needs_implicit
| | |-CopyConstructor simple trivial has_const_param needs_implicit implicit_has_const_param
| | |-MoveConstructor exists simple trivial needs_implicit
| | |-CopyAssignment trivial has_const_param needs_implicit implicit_has_const_param
| | |-MoveAssignment exists simple trivial needs_implicit
| | `-Destructor simple irrelevant trivial needs_implicit
| |-CXXRecordDecl 0x55b71dc76148 <col:5, col:12> col:12 implicit struct memo_t
| |-FieldDecl 0x55b71dc761e8 <line:190:2, col:20> col:20 referenced refcount 'volatile uint32_t':'volatile unsigned int'
| |-FieldDecl 0x55b71dc76248 <line:191:2, col:11> col:11 referenced capacity 'uint32_t':'unsigned int'
| |-FieldDecl 0x55b71dc762a8 <line:192:2, col:20> col:20 dirty 'volatile uint32_t':'volatile unsigned int'
| `-FieldDecl 0x55b71dc76358 <line:197:2, col:18> col:7 real_data 'char [8]'
|-EnumDecl 0x55b71dc763c0 <line:200:5, line:202:5> line:200:5
| `-EnumConstantDecl 0x55b71dc765f8 <line:201:2, col:32> col:2 referenced MEMO_SPACE 'String::(anonymous enum at ../dummy_inc/click/string.hh:200:5)'
|   `-ImplicitCastExpr 0x55b71dc76648 <col:15, col:32> 'unsigned int' <IntegralCast>
|     `-ConstantExpr 0x55b71dc765d8 <col:15, col:32> 'unsigned long' Int: 12
|       `-BinaryOperator 0x55b71dc764e8 <col:15, col:32> 'unsigned long' '-'
|         |-UnaryExprOrTypeTraitExpr 0x55b71dc76490 <col:15, col:28> 'unsigned long' sizeof 'String::memo_t'
|         `-ImplicitCastExpr 0x55b71dc764d0 <col:32> 'unsigned long' <IntegralCast>
|           `-IntegerLiteral 0x55b71dc764b0 <col:32> 'int' 8
|-CXXRecordDecl 0x55b71dc76660 <line:204:5, line:208:5> line:204:12 referenced struct rep_t definition
| |-DefinitionData pass_in_registers aggregate standard_layout trivially_copyable pod trivial literal
| | |-DefaultConstructor exists trivial
| | |-CopyConstructor simple trivial has_const_param implicit_has_const_param
| | |-MoveConstructor exists simple trivial
| | |-CopyAssignment trivial has_const_param implicit_has_const_param
| | |-MoveAssignment exists simple trivial
| | `-Destructor simple irrelevant trivial
| |-CXXRecordDecl 0x55b71dc76778 <col:5, col:12> col:12 implicit struct rep_t
| |-FieldDecl 0x55b71dc76820 <line:205:2, col:14> col:14 referenced data 'const char *'
| |-FieldDecl 0x55b71dc76888 <line:206:2, col:6> col:6 referenced length 'int'
| |-FieldDecl 0x55b71dc76918 <line:207:2, col:10> col:10 referenced memo 'String::memo_t *'
| |-CXXConstructorDecl 0x55b71dc7b100 <line:204:12> col:12 implicit used rep_t 'void () noexcept' inline default trivial
| | `-CompoundStmt 0x55b71dc7b538 <col:12>
| |-CXXConstructorDecl 0x55b71dc7b208 <col:12> col:12 implicit used constexpr rep_t 'void (const String::rep_t &) noexcept' inline default trivial
| | |-ParmVarDecl 0x55b71dc7b318 <col:12> col:12 used 'const String::rep_t &'
| | |-CXXCtorInitializer Field 0x55b71dc76820 'data' 'const char *'
| | | `-ImplicitCastExpr 0x55b71dc7e980 <col:12> 'const char *' <LValueToRValue>
| | |   `-MemberExpr 0x55b71dc7e950 <col:12> 'const char *const' lvalue .data 0x55b71dc76820
| | |     `-DeclRefExpr 0x55b71dc7e930 <col:12> 'const String::rep_t' lvalue ParmVar 0x55b71dc7b318 '' 'const String::rep_t &'
| | |-CXXCtorInitializer Field 0x55b71dc76888 'length' 'int'
| | | `-ImplicitCastExpr 0x55b71dc7ea10 <col:12> 'int' <LValueToRValue>
| | |   `-MemberExpr 0x55b71dc7e9e0 <col:12> 'const int' lvalue .length 0x55b71dc76888
| | |     `-DeclRefExpr 0x55b71dc7e9c0 <col:12> 'const String::rep_t' lvalue ParmVar 0x55b71dc7b318 '' 'const String::rep_t &'
| | |-CXXCtorInitializer Field 0x55b71dc76918 'memo' 'String::memo_t *'
| | | `-ImplicitCastExpr 0x55b71dc7eaa0 <col:12> 'String::memo_t *' <LValueToRValue>
| | |   `-MemberExpr 0x55b71dc7ea70 <col:12> 'String::memo_t *const' lvalue .memo 0x55b71dc76918
| | |     `-DeclRefExpr 0x55b71dc7ea50 <col:12> 'const String::rep_t' lvalue ParmVar 0x55b71dc7b318 '' 'const String::rep_t &'
| | `-CompoundStmt 0x55b71dc7eaf8 <col:12>
| |-CXXConstructorDecl 0x55b71dc7b3b8 <col:12> col:12 implicit constexpr rep_t 'void (String::rep_t &&)' inline default trivial noexcept-unevaluated 0x55b71dc7b3b8
| | `-ParmVarDecl 0x55b71dc7b4c8 <col:12> col:12 'String::rep_t &&'
| |-CXXDestructorDecl 0x55b71dc81820 <col:12> col:12 implicit ~rep_t 'void () noexcept' inline default trivial
| |-CXXMethodDecl 0x55b71dc8aea8 <col:12> col:12 implicit used constexpr operator= 'String::rep_t &(const String::rep_t &) noexcept' inline default trivial
| | |-ParmVarDecl 0x55b71dc8afb8 <col:12> col:12 used 'const String::rep_t &'
| | `-CompoundStmt 0x55b71dc8b4d0 <col:12>
| |   |-BinaryOperator 0x55b71dc8b2e8 <col:12> 'const char *' lvalue '='
| |   | |-MemberExpr 0x55b71dc8b2a0 <col:12> 'const char *' lvalue ->data 0x55b71dc76820
| |   | | `-CXXThisExpr 0x55b71dc8b290 <col:12> 'String::rep_t *' this
| |   | `-ImplicitCastExpr 0x55b71dc8b2d0 <col:12> 'const char *' <LValueToRValue>
| |   |   `-MemberExpr 0x55b71dc8b260 <col:12> 'const char *const' lvalue .data 0x55b71dc76820
| |   |     `-DeclRefExpr 0x55b71dc8b240 <col:12> 'const String::rep_t' lvalue ParmVar 0x55b71dc8afb8 '' 'const String::rep_t &'
| |   |-BinaryOperator 0x55b71dc8b3b0 <col:12> 'int' lvalue '='
| |   | |-MemberExpr 0x55b71dc8b368 <col:12> 'int' lvalue ->length 0x55b71dc76888
| |   | | `-CXXThisExpr 0x55b71dc8b358 <col:12> 'String::rep_t *' this
| |   | `-ImplicitCastExpr 0x55b71dc8b398 <col:12> 'int' <LValueToRValue>
| |   |   `-MemberExpr 0x55b71dc8b328 <col:12> 'const int' lvalue .length 0x55b71dc76888
| |   |     `-DeclRefExpr 0x55b71dc8b308 <col:12> 'const String::rep_t' lvalue ParmVar 0x55b71dc8afb8 '' 'const String::rep_t &'
| |   |-BinaryOperator 0x55b71dc8b478 <col:12> 'String::memo_t *' lvalue '='
| |   | |-MemberExpr 0x55b71dc8b430 <col:12> 'String::memo_t *' lvalue ->memo 0x55b71dc76918
| |   | | `-CXXThisExpr 0x55b71dc8b420 <col:12> 'String::rep_t *' this
| |   | `-ImplicitCastExpr 0x55b71dc8b460 <col:12> 'String::memo_t *' <LValueToRValue>
| |   |   `-MemberExpr 0x55b71dc8b3f0 <col:12> 'String::memo_t *const' lvalue .memo 0x55b71dc76918
| |   |     `-DeclRefExpr 0x55b71dc8b3d0 <col:12> 'const String::rep_t' lvalue ParmVar 0x55b71dc8afb8 '' 'const String::rep_t &'
| |   `-ReturnStmt 0x55b71dc8b4c0 <col:12>
| |     `-UnaryOperator 0x55b71dc8b4a8 <col:12> 'String::rep_t' lvalue prefix '*' cannot overflow
| |       `-CXXThisExpr 0x55b71dc8b498 <col:12> 'String::rep_t *' this
| `-CXXMethodDecl 0x55b71dc8b028 <col:12> col:12 implicit constexpr operator= 'String::rep_t &(String::rep_t &&)' inline default trivial noexcept-unevaluated 0x55b71dc8b028
|   `-ParmVarDecl 0x55b71dc8b138 <col:12> col:12 'String::rep_t &&'
|-FieldDecl 0x55b71dc76990 <line:211:5, col:19> col:19 referenced _r 'String::rep_t' mutable
|-CXXMethodDecl 0x55b71dc76bd8 <line:256:5, line:261:5> line:256:17 used assign_memo 'void (const char *, int, String::memo_t *) const' inline
| |-ParmVarDecl 0x55b71dc769f8 <col:29, col:41> col:41 used data 'const char *'
| |-ParmVarDecl 0x55b71dc76a78 <col:47, col:51> col:51 used length 'int'
| |-ParmVarDecl 0x55b71dc76af0 <col:59, col:67> col:67 used memo 'String::memo_t *'
| `-CompoundStmt 0x55b71dc7b0c0 <col:79, line:261:5>
|   |-BinaryOperator 0x55b71dc7ad38 <line:257:2, col:12> 'const char *' lvalue '='
|   | |-MemberExpr 0x55b71dc7acd0 <col:2, col:5> 'const char *' lvalue .data 0x55b71dc76820
|   | | `-MemberExpr 0x55b71dc7aca0 <col:2> 'String::rep_t' lvalue ->_r 0x55b71dc76990
|   | |   `-CXXThisExpr 0x55b71dc7ac90 <col:2> 'const String *' implicit this
|   | `-ImplicitCastExpr 0x55b71dc7ad20 <col:12> 'const char *' <LValueToRValue>
|   |   `-DeclRefExpr 0x55b71dc7ad00 <col:12> 'const char *' lvalue ParmVar 0x55b71dc769f8 'data' 'const char *'
|   |-BinaryOperator 0x55b71dc7ae00 <line:258:2, col:14> 'int' lvalue '='
|   | |-MemberExpr 0x55b71dc7ad98 <col:2, col:5> 'int' lvalue .length 0x55b71dc76888
|   | | `-MemberExpr 0x55b71dc7ad68 <col:2> 'String::rep_t' lvalue ->_r 0x55b71dc76990
|   | |   `-CXXThisExpr 0x55b71dc7ad58 <col:2> 'const String *' implicit this
|   | `-ImplicitCastExpr 0x55b71dc7ade8 <col:14> 'int' <LValueToRValue>
|   |   `-DeclRefExpr 0x55b71dc7adc8 <col:14> 'int' lvalue ParmVar 0x55b71dc76a78 'length' 'int'
|   `-IfStmt 0x55b71dc7b0a8 <line:259:2, line:260:41>
|     |-ImplicitCastExpr 0x55b71dc7af20 <line:259:6, col:21> 'bool' <PointerToBoolean>
|     | `-ImplicitCastExpr 0x55b71dc7af08 <col:6, col:21> 'String::memo_t *' <LValueToRValue>
|     |   `-ParenExpr 0x55b71dc7aee8 <col:6, col:21> 'String::memo_t *' lvalue
|     |     `-BinaryOperator 0x55b71dc7aec8 <col:7, col:17> 'String::memo_t *' lvalue '='
|     |       |-MemberExpr 0x55b71dc7ae60 <col:7, col:10> 'String::memo_t *' lvalue .memo 0x55b71dc76918
|     |       | `-MemberExpr 0x55b71dc7ae30 <col:7> 'String::rep_t' lvalue ->_r 0x55b71dc76990
|     |       |   `-CXXThisExpr 0x55b71dc7ae20 <col:7> 'const String *' implicit this
|     |       `-ImplicitCastExpr 0x55b71dc7aeb0 <col:17> 'String::memo_t *' <LValueToRValue>
|     |         `-DeclRefExpr 0x55b71dc7ae90 <col:17> 'String::memo_t *' lvalue ParmVar 0x55b71dc76af0 'memo' 'String::memo_t *'
|     `-CallExpr 0x55b71dc7b080 <line:260:6, col:41> 'void'
|       |-ImplicitCastExpr 0x55b71dc7b068 <col:6, col:23> 'void (*)(volatile uint32_t &)' <FunctionToPointerDecay>
|       | `-DeclRefExpr 0x55b71dc7af70 <col:6, col:23> 'void (volatile uint32_t &)' lvalue CXXMethod 0x55b71dbfa8f8 'inc' 'void (volatile uint32_t &)'
|       `-MemberExpr 0x55b71dc7afd8 <col:27, col:33> 'volatile uint32_t':'volatile unsigned int' lvalue ->refcount 0x55b71dc761e8
|         `-ImplicitCastExpr 0x55b71dc7afc0 <col:27> 'String::memo_t *' <LValueToRValue>
|           `-DeclRefExpr 0x55b71dc7afa0 <col:27> 'String::memo_t *' lvalue ParmVar 0x55b71dc76af0 'memo' 'String::memo_t *'
|-CXXConstructorDecl 0x55b71dc76e88 <line:263:5, line:265:5> line:263:12 used String 'void (const char *, int, String::memo_t *)' inline
| |-ParmVarDecl 0x55b71dc76ca8 <col:19, col:31> col:31 used data 'const char *'
| |-ParmVarDecl 0x55b71dc76d28 <col:37, col:41> col:41 used length 'int'
| |-ParmVarDecl 0x55b71dc76da0 <col:49, col:57> col:57 used memo 'String::memo_t *'
| |-CXXCtorInitializer Field 0x55b71dc76990 '_r' 'String::rep_t'
| | `-CXXConstructExpr 0x55b71dc7b548 <col:12> 'String::rep_t' 'void () noexcept'
| `-CompoundStmt 0x55b71dc7b6d8 <col:63, line:265:5>
|   `-CXXMemberCallExpr 0x55b71dc7b640 <line:264:2, col:32> 'void'
|     |-MemberExpr 0x55b71dc7b5b0 <col:2> '<bound member function type>' ->assign_memo 0x55b71dc76bd8
|     | `-ImplicitCastExpr 0x55b71dc7b678 <col:2> 'const String *' <NoOp>
|     |   `-CXXThisExpr 0x55b71dc7b5a0 <col:2> 'String *' implicit this
|     |-ImplicitCastExpr 0x55b71dc7b690 <col:14> 'const char *' <LValueToRValue>
|     | `-DeclRefExpr 0x55b71dc7b5e0 <col:14> 'const char *' lvalue ParmVar 0x55b71dc76ca8 'data' 'const char *'
|     |-ImplicitCastExpr 0x55b71dc7b6a8 <col:20> 'int' <LValueToRValue>
|     | `-DeclRefExpr 0x55b71dc7b600 <col:20> 'int' lvalue ParmVar 0x55b71dc76d28 'length' 'int'
|     `-ImplicitCastExpr 0x55b71dc7b6c0 <col:28> 'String::memo_t *' <LValueToRValue>
|       `-DeclRefExpr 0x55b71dc7b620 <col:28> 'String::memo_t *' lvalue ParmVar 0x55b71dc76da0 'memo' 'String::memo_t *'
|-CXXMethodDecl 0x55b71dc77018 <line:267:5, line:269:5> line:267:17 used assign 'void (const String &) const' inline
| |-ParmVarDecl 0x55b71dc76f58 <col:24, col:38> col:38 used x 'const String &'
| `-CompoundStmt 0x55b71dc7b930 <col:47, line:269:5>
|   `-CXXMemberCallExpr 0x55b71dc7b8b0 <line:268:2, col:47> 'void'
|     |-MemberExpr 0x55b71dc7b700 <col:2> '<bound member function type>' ->assign_memo 0x55b71dc76bd8
|     | `-CXXThisExpr 0x55b71dc7b6f0 <col:2> 'const String *' implicit this
|     |-ImplicitCastExpr 0x55b71dc7b8e8 <col:14, col:19> 'const char *' <LValueToRValue>
|     | `-MemberExpr 0x55b71dc7b780 <col:14, col:19> 'const char *' lvalue .data 0x55b71dc76820
|     |   `-MemberExpr 0x55b71dc7b750 <col:14, col:16> 'String::rep_t' lvalue ._r 0x55b71dc76990
|     |     `-DeclRefExpr 0x55b71dc7b730 <col:14> 'const String' lvalue ParmVar 0x55b71dc76f58 'x' 'const String &'
|     |-ImplicitCastExpr 0x55b71dc7b900 <col:25, col:30> 'int' <LValueToRValue>
|     | `-MemberExpr 0x55b71dc7b800 <col:25, col:30> 'int' lvalue .length 0x55b71dc76888
|     |   `-MemberExpr 0x55b71dc7b7d0 <col:25, col:27> 'String::rep_t' lvalue ._r 0x55b71dc76990
|     |     `-DeclRefExpr 0x55b71dc7b7b0 <col:25> 'const String' lvalue ParmVar 0x55b71dc76f58 'x' 'const String &'
|     `-ImplicitCastExpr 0x55b71dc7b918 <col:38, col:43> 'String::memo_t *' <LValueToRValue>
|       `-MemberExpr 0x55b71dc7b880 <col:38, col:43> 'String::memo_t *' lvalue .memo 0x55b71dc76918
|         `-MemberExpr 0x55b71dc7b850 <col:38, col:40> 'String::rep_t' lvalue ._r 0x55b71dc76990
|           `-DeclRefExpr 0x55b71dc7b830 <col:38> 'const String' lvalue ParmVar 0x55b71dc76f58 'x' 'const String &'
|-CXXMethodDecl 0x55b71dc79330 <line:271:5, line:278:5> line:271:17 used deref 'void () const' inline
| `-CompoundStmt 0x55b71dc7c2f0 <col:31, line:278:5>
|   `-IfStmt 0x55b71dc7c2d8 <line:272:2, line:277:2>
|     |-ImplicitCastExpr 0x55b71dc7b9d0 <line:272:6, col:9> 'bool' <PointerToBoolean>
|     | `-ImplicitCastExpr 0x55b71dc7b9b8 <col:6, col:9> 'String::memo_t *' <LValueToRValue>
|     |   `-MemberExpr 0x55b71dc7b988 <col:6, col:9> 'String::memo_t *' lvalue .memo 0x55b71dc76918
|     |     `-MemberExpr 0x55b71dc7b958 <col:6> 'String::rep_t' lvalue ->_r 0x55b71dc76990
|     |       `-CXXThisExpr 0x55b71dc7b948 <col:6> 'const String *' implicit this
|     `-CompoundStmt 0x55b71dc7c2b0 <col:15, line:277:2>
|       |-ParenExpr 0x55b71dc7be80 <line:273:6, col:166> 'void'
|       | `-ConditionalOperator 0x55b71dc7be50 <col:7, col:165> 'void'
|       |   |-CXXStaticCastExpr 0x55b71dc7bae0 <col:7, col:44> 'bool' static_cast<_Bool> <NoOp>
|       |   | `-ImplicitCastExpr 0x55b71dc7bac8 <col:27, col:36> 'bool' <IntegralToBoolean> part_of_explicit_cast
|       |   |   `-ImplicitCastExpr 0x55b71dc7bab0 <col:27, col:36> 'uint32_t':'unsigned int' <LValueToRValue> part_of_explicit_cast
|       |   |     `-MemberExpr 0x55b71dc7ba70 <col:27, col:36> 'volatile uint32_t':'volatile unsigned int' lvalue ->refcount 0x55b71dc761e8
|       |   |       `-ImplicitCastExpr 0x55b71dc7ba58 <col:27, col:30> 'String::memo_t *' <LValueToRValue>
|       |   |         `-MemberExpr 0x55b71dc7ba28 <col:27, col:30> 'String::memo_t *' lvalue .memo 0x55b71dc76918
|       |   |           `-MemberExpr 0x55b71dc7b9f8 <col:27> 'String::rep_t' lvalue ->_r 0x55b71dc76990
|       |   |             `-CXXThisExpr 0x55b71dc7b9e8 <col:27> 'const String *' implicit this
|       |   |-CXXFunctionalCastExpr 0x55b71dc7bb40 <col:48, col:55> 'void' functional cast to void <ToVoid>
|       |   | `-IntegerLiteral 0x55b71dc7bb20 <col:54> 'int' 0
|       |   `-CallExpr 0x55b71dc7bdb0 <col:59, col:165> 'void'
|       |     |-ImplicitCastExpr 0x55b71dc7bd98 <col:59> 'void (*)(const char *, const char *, unsigned int, const char *) __attribute__((noreturn)) throw()' <FunctionToPointerDecay>
|       |     | `-DeclRefExpr 0x55b71dc7bd18 <col:59> 'void (const char *, const char *, unsigned int, const char *) __attribute__((noreturn)) throw()' lvalue Function 0x55b71d9d3d10 '__assert_fail' 'void (const char *, const char *, unsigned int, const char *) __attribute__((noreturn)) throw()'
|       |     |-ImplicitCastExpr 0x55b71dc7bdf0 <col:74> 'const char *' <ArrayToPointerDecay>
|       |     | `-StringLiteral 0x55b71dc7bc28 <col:74> 'const char [18]' lvalue "_r.memo->refcount"
|       |     |-ImplicitCastExpr 0x55b71dc7be08 <col:95> 'const char *' <ArrayToPointerDecay>
|       |     | `-StringLiteral 0x55b71dc7bc58 <col:95> 'const char [29]' lvalue "../dummy_inc/click/string.hh"
|       |     |-ImplicitCastExpr 0x55b71dc7be20 <col:127> 'unsigned int' <IntegralCast>
|       |     | `-IntegerLiteral 0x55b71dc7bc90 <col:127> 'int' 273
|       |     `-ImplicitCastExpr 0x55b71dc7be38 <col:132, col:146> 'const char *' <ArrayToPointerDecay>
|       |       `-UnaryOperator 0x55b71dc7bd00 <col:132, col:146> 'const char [27]' lvalue prefix '__extension__' cannot overflow
|       |         `-PredefinedExpr 0x55b71dc7bce8 <col:146> 'const char [27]' lvalue __PRETTY_FUNCTION__
|       |           `-StringLiteral 0x55b71dc7bcb0 <col:146> 'const char [27]' lvalue "void String::deref() const"
|       |-IfStmt 0x55b71dc7c1d0 <line:274:6, line:275:22>
|       | |-CallExpr 0x55b71dc7c090 <line:274:10, col:57> 'bool'
|       | | |-ImplicitCastExpr 0x55b71dc7c078 <col:10, col:27> 'bool (*)(volatile uint32_t &)' <FunctionToPointerDecay>
|       | | | `-DeclRefExpr 0x55b71dc7bff0 <col:10, col:27> 'bool (volatile uint32_t &)' lvalue CXXMethod 0x55b71dbfd0e0 'dec_and_test' 'bool (volatile uint32_t &)'
|       | | `-MemberExpr 0x55b71dc7bfc0 <col:40, col:49> 'volatile uint32_t':'volatile unsigned int' lvalue ->refcount 0x55b71dc761e8
|       | |   `-ImplicitCastExpr 0x55b71dc7bfa8 <col:40, col:43> 'String::memo_t *' <LValueToRValue>
|       | |     `-MemberExpr 0x55b71dc7bf78 <col:40, col:43> 'String::memo_t *' lvalue .memo 0x55b71dc76918
|       | |       `-MemberExpr 0x55b71dc7bf48 <col:40> 'String::rep_t' lvalue ->_r 0x55b71dc76990
|       | |         `-CXXThisExpr 0x55b71dc7bf38 <col:40> 'const String *' implicit this
|       | `-CallExpr 0x55b71dc7c190 <line:275:3, col:22> 'void'
|       |   |-ImplicitCastExpr 0x55b71dc7c178 <col:3> 'void (*)(String::memo_t *)' <FunctionToPointerDecay>
|       |   | `-DeclRefExpr 0x55b71dc7c0b8 <col:3> 'void (String::memo_t *)' lvalue CXXMethod 0x55b71dc7a008 'delete_memo' 'void (String::memo_t *)'
|       |   `-ImplicitCastExpr 0x55b71dc7c1b8 <col:15, col:18> 'String::memo_t *' <LValueToRValue>
|       |     `-MemberExpr 0x55b71dc7c118 <col:15, col:18> 'String::memo_t *' lvalue .memo 0x55b71dc76918
|       |       `-MemberExpr 0x55b71dc7c0e8 <col:15> 'String::rep_t' lvalue ->_r 0x55b71dc76990
|       |         `-CXXThisExpr 0x55b71dc7c0d8 <col:15> 'const String *' implicit this
|       `-BinaryOperator 0x55b71dc7c290 <line:276:6, col:16> 'String::memo_t *' lvalue '='
|         |-MemberExpr 0x55b71dc7c228 <col:6, col:9> 'String::memo_t *' lvalue .memo 0x55b71dc76918
|         | `-MemberExpr 0x55b71dc7c1f8 <col:6> 'String::rep_t' lvalue ->_r 0x55b71dc76990
|         |   `-CXXThisExpr 0x55b71dc7c1e8 <col:6> 'const String *' implicit this
|         `-ImplicitCastExpr 0x55b71dc7c278 <col:16> 'String::memo_t *' <NullToPointer>
|           `-IntegerLiteral 0x55b71dc7c258 <col:16> 'int' 0
|-CXXMethodDecl 0x55b71dc795c8 <line:280:5, col:56> col:10 used assign 'void (const char *, int, bool)'
| |-ParmVarDecl 0x55b71dc793e8 <col:17, col:29> col:29 s 'const char *'
| |-ParmVarDecl 0x55b71dc79468 <col:32, col:36> col:36 len 'int'
| `-ParmVarDecl 0x55b71dc794e0 <col:41, col:46> col:46 need_deref 'bool'
|-CXXMethodDecl 0x55b71dc796a0 <line:281:5, col:31> col:10 assign_out_of_memory 'void ()'
|-CXXMethodDecl 0x55b71dc798f0 <line:282:5, col:53> col:10 used append 'void (const char *, int, String::memo_t *)'
| |-ParmVarDecl 0x55b71dc79758 <col:17, col:29> col:29 s 'const char *'
| |-ParmVarDecl 0x55b71dc797d8 <col:32, col:36> col:36 len 'int'
| `-ParmVarDecl 0x55b71dc79850 <col:41, col:49> col:49 memo 'String::memo_t *'
|-CXXMethodDecl 0x55b71dc79ad8 <line:283:5, col:58> col:19 used hard_make_stable 'String (const char *, int)' static
| |-ParmVarDecl 0x55b71dc799c0 <col:36, col:48> col:48 s 'const char *'
| `-ParmVarDecl 0x55b71dc79a40 <col:51, col:55> col:55 len 'int'
|-CXXMethodDecl 0x55b71dc79bd8 <line:284:5, line:286:5> line:284:27 used absent_memo 'String::memo_t *()' static inline
| `-CompoundStmt 0x55b71dc7c3c8 <col:41, line:286:5>
|   `-ReturnStmt 0x55b71dc7c3b8 <line:285:2, col:48>
|     `-CXXReinterpretCastExpr 0x55b71dc7c388 <col:9, col:48> 'String::memo_t *' reinterpret_cast<struct String::memo_t *> <IntegralToPointer>
|       `-CXXFunctionalCastExpr 0x55b71dc7c350 <col:36, col:47> 'uintptr_t':'unsigned long' functional cast to uintptr_t <NoOp>
|         `-ImplicitCastExpr 0x55b71dc7c338 <col:46> 'uintptr_t':'unsigned long' <IntegralCast> part_of_explicit_cast
|           `-IntegerLiteral 0x55b71dc7c318 <col:46> 'int' 1
|-CXXMethodDecl 0x55b71dc79e78 <line:287:5, col:68> col:20 create_memo 'String::memo_t *(char *, int, int)' static
| |-ParmVarDecl 0x55b71dc79c90 <col:32, col:38> col:38 space 'char *'
| |-ParmVarDecl 0x55b71dc79d10 <col:45, col:49> col:49 dirty 'int'
| `-ParmVarDecl 0x55b71dc79d90 <col:56, col:60> col:60 capacity 'int'
|-CXXMethodDecl 0x55b71dc7a008 <line:288:5, col:41> col:17 used delete_memo 'void (String::memo_t *)' static
| `-ParmVarDecl 0x55b71dc79f40 <col:29, col:37> col:37 memo 'String::memo_t *'
|-CXXMethodDecl 0x55b71dc7a0d8 <line:289:5, col:30> col:17 hard_c_str 'const char *() const'
|-CXXMethodDecl 0x55b71dc7a2a8 <line:290:5, col:46> col:10 used hard_equals 'bool (const char *, int) const'
| |-ParmVarDecl 0x55b71dc7a190 <col:22, col:34> col:34 s 'const char *'
| `-ParmVarDecl 0x55b71dc7a210 <col:37, col:41> col:41 len 'int'
|-VarDecl 0x55b71dc7a368 <line:292:5, col:23> col:23 used null_data 'const char' static
|-VarDecl 0x55b71dc7a430 <line:293:5, col:34> col:23 used oom_data 'const char [15]' static
|-VarDecl 0x55b71dc7a538 <line:294:5, col:34> col:23 int_data 'const char [20]' static
|-VarDecl 0x55b71dc7a5b0 <line:295:5, col:24> col:24 used null_string_rep 'const String::rep_t' static
|-VarDecl 0x55b71dc7a628 <line:296:5, col:24> col:24 used oom_string_rep 'const String::rep_t' static
|-EnumDecl 0x55b71dc7a690 <line:297:5, col:25> col:5
| `-EnumConstantDecl 0x55b71dc7a790 <col:12, col:22> col:12 referenced oom_len 'String::(anonymous enum at ../dummy_inc/click/string.hh:297:5)'
|   `-ImplicitCastExpr 0x55b71dc7a7e0 <col:22> 'unsigned int' <IntegralCast>
|     `-ConstantExpr 0x55b71dc7a770 <col:22> 'int' Int: 14
|       `-IntegerLiteral 0x55b71dc7a750 <col:22> 'int' 14
|-CXXMethodDecl 0x55b71dc7a9f8 <line:299:5, col:46> col:19 make_claim 'String (char *, int, int)' static
| |-ParmVarDecl 0x55b71dc7a810 <col:30, col:35> col:36 'char *'
| |-ParmVarDecl 0x55b71dc7a890 <col:38> col:41 'int'
| `-ParmVarDecl 0x55b71dc7a910 <col:43> col:46 'int'
|-FriendDecl 0x55b71dc7ab00 <line:301:5, col:19> col:12 'struct rep_t':'String::rep_t'
`-FriendDecl 0x55b71dc7ab90 <line:302:5, col:18> col:12 'class StringAccum':'StringAccum'

Layout: <CGRecordLayout
  LLVMType:%class.String = type { %"struct.String::rep_t" }
  NonVirtualBaseLLVMType:%class.String = type { %"struct.String::rep_t" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x55b71e05d550 <../dummy_inc/click/vector.hh:11:1, line:71:1> line:11:30 class vector_memory definition
|-DefinitionData standard_layout has_user_declared_ctor can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor simple trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveConstructor
| |-CopyAssignment trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveAssignment
| `-Destructor non_trivial user_declared
|-TemplateArgument type 'typed_array_memory<String>'
|-CXXRecordDecl 0x55b71e05d728 prev 0x55b71e05d550 <col:24, col:30> col:30 implicit class vector_memory
|-AccessSpecDecl 0x55b71e05d7b8 <col:46, col:52> col:46 public
|-TypedefDecl 0x55b71e05d7e0 <line:12:5, col:17> col:17 size_type 'int'
| `-BuiltinType 0x55b71d92f580 'int'
|-TypedefDecl 0x55b71e05f140 <line:13:5, col:31> col:31 type 'typename typed_array_memory<String>::type':'String'
| `-ElaboratedType 0x55b71e05f0f0 'typename typed_array_memory<String>::type' sugar
|   `-TypedefType 0x55b71e05f0d0 'typed_array_memory<String>::type' sugar
|     |-Typedef 0x55b71e05d9f8 'type'
|     `-SubstTemplateTypeParmType 0x55b71e05d9c0 'String' sugar
|       |-TemplateTypeParmType 0x55b71dc3c9f0 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55b71dc3c9a0 'T'
|       `-RecordType 0x55b71dc6c630 'String'
|         `-CXXRecord 0x55b71dc6c5a0 'String'
|-TypedefDecl 0x55b71e05f1f8 <line:14:5, col:19> col:19 iterator 'vector_memory<typed_array_memory<String> >::type *'
| `-PointerType 0x55b71e05f1c0 'vector_memory<typed_array_memory<String> >::type *'
|   `-TypedefType 0x55b71e05f1a0 'vector_memory<typed_array_memory<String> >::type' sugar
|     |-Typedef 0x55b71e05f140 'type'
|     `-ElaboratedType 0x55b71e05f0f0 'typename typed_array_memory<String>::type' sugar
|       `-TypedefType 0x55b71e05f0d0 'typed_array_memory<String>::type' sugar
|         |-Typedef 0x55b71e05d9f8 'type'
|         `-SubstTemplateTypeParmType 0x55b71e05d9c0 'String' sugar
|           |-TemplateTypeParmType 0x55b71dc3c9f0 'T' dependent depth 0 index 0
|           | `-TemplateTypeParm 0x55b71dc3c9a0 'T'
|           `-RecordType 0x55b71dc6c630 'String'
|             `-CXXRecord 0x55b71dc6c5a0 'String'
|-CXXMethodDecl 0x55b71e05f378 <line:15:5, line:18:5> line:15:17 need_argument_copy 'bool (const vector_memory<typed_array_memory<String> >::type *) const' inline
| `-ParmVarDecl 0x55b71e05f288 <col:36, col:48> col:48 argp 'const vector_memory<typed_array_memory<String> >::type *'
|-CXXConstructorDecl 0x55b71e05f468 <line:20:5, line:22:5> line:20:5 vector_memory 'void ()'
|-CXXDestructorDecl 0x55b71e05f548 <line:23:5, col:20> col:5 ~vector_memory 'void ()' noexcept-unevaluated 0x55b71e05f548
|-CXXMethodDecl 0x55b71e05f818 <line:25:5, col:43> col:10 assign 'void (const vector_memory<typed_array_memory<String> > &)'
| `-ParmVarDecl 0x55b71e05f720 <col:17, col:42> col:42 x 'const vector_memory<typed_array_memory<String> > &'
|-CXXMethodDecl 0x55b71e05fa58 <line:26:5, col:44> col:10 assign 'void (vector_memory::size_type, const vector_memory<typed_array_memory<String> >::type *)'
| |-ParmVarDecl 0x55b71e05f8d0 <col:17, col:27> col:27 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55b71e05f948 <col:30, col:42> col:42 vp 'const vector_memory<typed_array_memory<String> >::type *'
|-CXXMethodDecl 0x55b71e05fc28 <line:27:5, col:44> col:10 resize 'void (vector_memory::size_type, const vector_memory<typed_array_memory<String> >::type *)'
| |-ParmVarDecl 0x55b71e05fb18 <col:17, col:27> col:27 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55b71e05fb90 <col:30, col:42> col:42 vp 'const vector_memory<typed_array_memory<String> >::type *'
|-CXXMethodDecl 0x55b71e05fd88 <line:28:5, line:30:5> line:28:14 begin 'vector_memory<typed_array_memory<String> >::iterator ()'
|-CXXMethodDecl 0x55b71e05fe58 <line:31:5, line:33:5> line:31:14 end 'vector_memory<typed_array_memory<String> >::iterator ()'
|-CXXMethodDecl 0x55b71e0600a8 <line:34:5, col:48> col:14 insert 'vector_memory<typed_array_memory<String> >::iterator (vector_memory<typed_array_memory<String> >::iterator, const vector_memory<typed_array_memory<String> >::type *)'
| |-ParmVarDecl 0x55b71e05ff18 <col:21, col:30> col:30 it 'vector_memory<typed_array_memory<String> >::iterator':'vector_memory<typed_array_memory<String> >::type *'
| `-ParmVarDecl 0x55b71e05ff90 <col:34, col:46> col:46 vp 'const vector_memory<typed_array_memory<String> >::type *'
|-CXXMethodDecl 0x55b71e060308 <line:35:5, col:42> col:14 erase 'vector_memory<typed_array_memory<String> >::iterator (vector_memory<typed_array_memory<String> >::iterator, vector_memory<typed_array_memory<String> >::iterator)'
| |-ParmVarDecl 0x55b71e060178 <col:20, col:29> col:29 a 'vector_memory<typed_array_memory<String> >::iterator':'vector_memory<typed_array_memory<String> >::type *'
| `-ParmVarDecl 0x55b71e0601f0 <col:32, col:41> col:41 b 'vector_memory<typed_array_memory<String> >::iterator':'vector_memory<typed_array_memory<String> >::type *'
|-CXXMethodDecl 0x55b71e0604c8 <line:36:5, line:43:5> line:36:17 push_back 'void (const vector_memory<typed_array_memory<String> >::type *)' inline
| `-ParmVarDecl 0x55b71e0603d8 <col:27, col:39> col:39 vp 'const vector_memory<typed_array_memory<String> >::type *'
|-CXXMethodDecl 0x55b71e060688 <line:45:5, line:52:5> line:45:17 move_construct_back 'void (vector_memory<typed_array_memory<String> >::type *)' inline
| `-ParmVarDecl 0x55b71e060590 <col:37, col:43> col:43 vp 'vector_memory<typed_array_memory<String> >::type *'
|-CXXMethodDecl 0x55b71e060740 <line:54:5, line:59:5> line:54:17 pop_back 'void ()' inline
|-CXXMethodDecl 0x55b71e0607f0 <line:60:5, line:64:5> line:60:17 clear 'void ()' inline
|-CXXMethodDecl 0x55b71e060a28 <line:65:5, col:59> col:10 reserve_and_push_back 'bool (vector_memory::size_type, const vector_memory<typed_array_memory<String> >::type *)'
| |-ParmVarDecl 0x55b71e0608a0 <col:32, col:42> col:42 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55b71e060918 <col:45, col:57> col:57 vp 'const vector_memory<typed_array_memory<String> >::type *'
|-CXXMethodDecl 0x55b71e060cc8 <line:66:5, col:35> col:10 swap 'void (vector_memory<typed_array_memory<String> > &)'
| `-ParmVarDecl 0x55b71e060bd0 <col:15, col:34> col:34 x 'vector_memory<typed_array_memory<String> > &'
|-FieldDecl 0x55b71e060d90 <line:68:5, col:11> col:11 l_ 'vector_memory<typed_array_memory<String> >::type *'
|-FieldDecl 0x55b71e060de0 <line:69:5, col:15> col:15 n_ 'vector_memory::size_type':'int'
`-FieldDecl 0x55b71e060e30 <line:70:5, col:15> col:15 capacity_ 'vector_memory::size_type':'int'

Layout: <CGRecordLayout
  LLVMType:%class.vector_memory.1 = type { %class.String*, i32, i32 }
  NonVirtualBaseLLVMType:%class.vector_memory.1 = type { %class.String*, i32, i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x55b71dea71c0 <../dummy_inc/click/ipaddress.hh:13:1, col:29> ../dummy_inc/click/vector.hh:111:7 class Vector definition
|-DefinitionData standard_layout has_user_declared_ctor has_mutable_fields can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor non_trivial user_declared has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveConstructor exists non_trivial user_declared needs_overload_resolution
| |-CopyAssignment non_trivial has_const_param user_declared needs_overload_resolution implicit_has_const_param
| |-MoveAssignment exists non_trivial user_declared needs_overload_resolution
| `-Destructor simple non_trivial needs_overload_resolution
|-TemplateArgument type 'String'
|-CXXRecordDecl 0x55b71e05c1f8 prev 0x55b71dea71c0 <col:1, col:7> col:7 implicit class Vector
|-TypedefDecl 0x55b71e05d4c0 <line:113:5, col:44> col:44 array_memory_type 'typename array_memory<String>::type':'typed_array_memory<String>'
| `-ElaboratedType 0x55b71e05d470 'typename array_memory<String>::type' sugar
|   `-TypedefType 0x55b71e05d450 'conditional<false, sized_array_memory<24>, typed_array_memory<String> >::type' sugar
|     |-Typedef 0x55b71e05d300 'type'
|     `-SubstTemplateTypeParmType 0x55b71e05d190 'typed_array_memory<String>' sugar
|       |-TemplateTypeParmType 0x55b71dc167f0 'F' dependent depth 0 index 1
|       | `-TemplateTypeParm 0x55b71dc16798 'F'
|       `-RecordType 0x55b71e05cdf0 'typed_array_memory<String>'
|         `-ClassTemplateSpecialization 0x55b71e05cd10 'typed_array_memory'
|-FieldDecl 0x55b71e060e80 <line:114:5, col:46> col:46 vm_ 'vector_memory<Vector<String>::array_memory_type>':'vector_memory<typed_array_memory<String> >' mutable
|-AccessSpecDecl 0x55b71e060ed0 <line:116:3, col:9> col:3 public
|-TypedefDecl 0x55b71e060f08 <line:118:5, col:15> col:15 value_type 'String':'String'
| `-SubstTemplateTypeParmType 0x55b71e05c290 'String' sugar
|   |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x55b71dc4c168 'T'
|   `-RecordType 0x55b71dc6c630 'String'
|     `-CXXRecord 0x55b71dc6c5a0 'String'
|-TypedefDecl 0x55b71e060f98 <line:119:5, col:16> col:16 reference 'String &'
| `-LValueReferenceType 0x55b71e060f60 'String &'
|   `-SubstTemplateTypeParmType 0x55b71e05c290 'String' sugar
|     |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55b71dc4c168 'T'
|     `-RecordType 0x55b71dc6c630 'String'
|       `-CXXRecord 0x55b71dc6c5a0 'String'
|-TypedefDecl 0x55b71e061028 <line:120:5, col:22> col:22 const_reference 'const String &'
| `-LValueReferenceType 0x55b71e060ff0 'const String &'
|   `-QualType 0x55b71e05c291 'const String' const
|     `-SubstTemplateTypeParmType 0x55b71e05c290 'String' sugar
|       |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55b71dc4c168 'T'
|       `-RecordType 0x55b71dc6c630 'String'
|         `-CXXRecord 0x55b71dc6c5a0 'String'
|-TypedefDecl 0x55b71e0610b8 <line:121:5, col:16> col:16 pointer 'String *'
| `-PointerType 0x55b71e061080 'String *'
|   `-SubstTemplateTypeParmType 0x55b71e05c290 'String' sugar
|     |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55b71dc4c168 'T'
|     `-RecordType 0x55b71dc6c630 'String'
|       `-CXXRecord 0x55b71dc6c5a0 'String'
|-TypedefDecl 0x55b71e061148 <line:122:5, col:22> col:22 const_pointer 'const String *'
| `-PointerType 0x55b71e061110 'const String *'
|   `-QualType 0x55b71e05c291 'const String' const
|     `-SubstTemplateTypeParmType 0x55b71e05c290 'String' sugar
|       |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55b71dc4c168 'T'
|       `-RecordType 0x55b71dc6c630 'String'
|         `-CXXRecord 0x55b71dc6c5a0 'String'
|-TypedefDecl 0x55b71e061da0 <line:125:5, col:45> col:45 value_argument_type 'typename fast_argument<String>::type':'const String &'
| `-ElaboratedType 0x55b71e061d50 'typename fast_argument<String>::type' sugar
|   `-TypedefType 0x55b71e061d30 'fast_argument<String, true>::type' sugar
|     |-Typedef 0x55b71e061c68 'type'
|     `-LValueReferenceType 0x55b71e061c30 'const String &'
|       `-QualType 0x55b71e0619d1 'const String' const
|         `-SubstTemplateTypeParmType 0x55b71e0619d0 'String' sugar
|           |-TemplateTypeParmType 0x55b71dc1dad0 'T' dependent depth 0 index 0
|           | `-TemplateTypeParm 0x55b71dc1da78 'T'
|           `-RecordType 0x55b71dc6c630 'String'
|             `-CXXRecord 0x55b71dc6c5a0 'String'
|-TypedefDecl 0x55b71e061e08 <line:126:5, col:22> col:22 const_access_type 'const String &'
| `-LValueReferenceType 0x55b71e060ff0 'const String &'
|   `-QualType 0x55b71e05c291 'const String' const
|     `-SubstTemplateTypeParmType 0x55b71e05c290 'String' sugar
|       |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55b71dc4c168 'T'
|       `-RecordType 0x55b71dc6c630 'String'
|         `-CXXRecord 0x55b71dc6c5a0 'String'
|-TypedefDecl 0x55b71e061e60 <line:128:5, col:17> col:17 size_type 'int'
| `-BuiltinType 0x55b71d92f580 'int'
|-TypedefDecl 0x55b71e061ec8 <line:130:5, col:16> col:16 iterator 'String *'
| `-PointerType 0x55b71e061080 'String *'
|   `-SubstTemplateTypeParmType 0x55b71e05c290 'String' sugar
|     |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55b71dc4c168 'T'
|     `-RecordType 0x55b71dc6c630 'String'
|       `-CXXRecord 0x55b71dc6c5a0 'String'
|-TypedefDecl 0x55b71e061f30 <line:131:5, col:22> col:22 const_iterator 'const String *'
| `-PointerType 0x55b71e061110 'const String *'
|   `-QualType 0x55b71e05c291 'const String' const
|     `-SubstTemplateTypeParmType 0x55b71e05c290 'String' sugar
|       |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55b71dc4c168 'T'
|       `-RecordType 0x55b71dc6c630 'String'
|         `-CXXRecord 0x55b71dc6c5a0 'String'
|-EnumDecl 0x55b71e061f88 <line:134:5> col:5
| `-EnumConstantDecl 0x55b71e062080 <col:12, col:40> col:12 RESERVE_GROW 'Vector<String>::(anonymous enum at ../dummy_inc/click/vector.hh:134:5)'
|   `-ConstantExpr 0x55b71e062060 <col:27, col:40> 'Vector::size_type':'int' Int: -1
|     `-CStyleCastExpr 0x55b71dc4d388 <col:27, col:40> 'Vector::size_type':'int' <NoOp>
|       `-UnaryOperator 0x55b71dc4d360 <col:39, col:40> 'int' prefix '-'
|         `-IntegerLiteral 0x55b71dc4d340 <col:40> 'int' 1
|-CXXConstructorDecl 0x55b71e062108 <line:137:5, col:28> col:21 Vector 'void ()' inline
|-CXXConstructorDecl 0x55b71e062398 <line:138:5, col:62> col:21 Vector 'void (Vector::size_type, Vector<String>::value_argument_type)' inline
| |-ParmVarDecl 0x55b71e0621c0 <col:28, col:38> col:38 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55b71e062260 <col:41, col:61> col:61 v 'Vector<String>::value_argument_type':'const String &'
|-CXXConstructorDecl 0x55b71e062628 <line:139:5, col:37> col:12 Vector 'void (const Vector<String> &)' inline
| `-ParmVarDecl 0x55b71e062510 <col:19, col:36> col:36 x 'const Vector<String> &'
|-CXXConstructorDecl 0x55b71e0628e8 <line:141:5, col:32> col:12 Vector 'void (Vector<String> &&)' inline
| `-ParmVarDecl 0x55b71e0627d0 <col:19, col:31> col:31 x 'Vector<String> &&'
|-CXXMethodDecl 0x55b71e062c00 <line:144:5, col:51> col:23 operator= 'Vector<String> &(const Vector<String> &)' inline
| `-ParmVarDecl 0x55b71e062ae0 <col:33, col:50> col:50 x 'const Vector<String> &'
|-CXXMethodDecl 0x55b71e062f10 <line:146:5, col:46> col:23 operator= 'Vector<String> &(Vector<String> &&)' inline
| `-ParmVarDecl 0x55b71e062df0 <col:33, col:45> col:45 x 'Vector<String> &&'
|-CXXMethodDecl 0x55b71e063210 <line:148:5, col:70> col:23 assign 'Vector<String> &(Vector::size_type, Vector<String>::value_argument_type)' inline
| |-ParmVarDecl 0x55b71e063048 <col:30, col:40> col:40 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55b71e0630c0 <col:43, col:69> col:63 v 'Vector<String>::value_argument_type':'const String &'
|-CXXMethodDecl 0x55b71e063338 <line:150:5, col:55> col:49 begin 'Vector<String>::iterator ()'
| |-NoInlineAttr 0x55b71e0633e8 <col:20> Inherited
| `-OptimizeNoneAttr 0x55b71e063440 <col:30> Inherited
|-CXXMethodDecl 0x55b71e063488 <line:151:5, col:53> col:49 end 'Vector<String>::iterator ()'
| |-NoInlineAttr 0x55b71e063538 <col:20> Inherited
| `-OptimizeNoneAttr 0x55b71e063590 <col:30> Inherited
|-CXXMethodDecl 0x55b71e063658 <line:152:5, col:63> col:55 used begin 'Vector<String>::const_iterator () const'
| |-NoInlineAttr 0x55b71e063708 <col:20> Inherited
| `-OptimizeNoneAttr 0x55b71e063760 <col:30> Inherited
|-CXXMethodDecl 0x55b71e0637a8 <line:153:5, col:61> col:55 used end 'Vector<String>::const_iterator () const'
| |-NoInlineAttr 0x55b71e063858 <col:20> Inherited
| `-OptimizeNoneAttr 0x55b71e0638b0 <col:30> Inherited
|-CXXMethodDecl 0x55b71e0638f8 <line:154:5, col:64> col:55 cbegin 'Vector<String>::const_iterator () const'
| |-NoInlineAttr 0x55b71e0639a8 <col:20> Inherited
| `-OptimizeNoneAttr 0x55b71e063a00 <col:30> Inherited
|-CXXMethodDecl 0x55b71e063a48 <line:155:5, col:62> col:55 cend 'Vector<String>::const_iterator () const'
| |-NoInlineAttr 0x55b71e063af8 <col:20> Inherited
| `-OptimizeNoneAttr 0x55b71e063b50 <col:30> Inherited
|-CXXMethodDecl 0x55b71e063b78 <line:157:5, col:29> col:22 used size 'Vector::size_type () const' inline
|-CXXMethodDecl 0x55b71e063c28 <line:158:5, col:33> col:22 capacity 'Vector::size_type () const' inline
|-CXXMethodDecl 0x55b71e063cd8 <line:159:5, col:25> col:17 empty 'bool () const' inline
|-CXXMethodDecl 0x55b71e063e98 <line:160:5, col:64> col:17 resize 'void (Vector::size_type, Vector<String>::value_argument_type)' inline
| |-ParmVarDecl 0x55b71e063d88 <col:24, col:34> col:34 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55b71e063e00 <col:37, col:63> col:57 v 'Vector<String>::value_argument_type':'const String &'
|-CXXMethodDecl 0x55b71e063fe8 <line:161:5, col:36> col:17 reserve 'bool (Vector::size_type)' inline
| `-ParmVarDecl 0x55b71e063f58 <col:25, col:35> col:35 n 'Vector::size_type':'int'
|-CXXMethodDecl 0x55b71e064198 <line:163:5, col:65> col:43 operator[] 'String &(Vector::size_type)'
| |-ParmVarDecl 0x55b71e0640a0 <col:54, col:64> col:64 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x55b71e064250 <col:20>
| `-OptimizeNoneAttr 0x55b71e0642a8 <col:30>
|-CXXMethodDecl 0x55b71e0643c8 <line:164:5, col:73> col:49 operator[] 'const String &(Vector::size_type) const'
| |-ParmVarDecl 0x55b71e0642d0 <col:60, col:70> col:70 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x55b71e064480 <col:20>
| `-OptimizeNoneAttr 0x55b71e0644d8 <col:30>
|-CXXMethodDecl 0x55b71e064590 <line:165:5, col:29> col:15 at 'String &(Vector::size_type)' inline
| `-ParmVarDecl 0x55b71e064500 <col:18, col:28> col:28 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55b71e0646d8 <line:166:5, col:37> col:21 at 'const String &(Vector::size_type) const' inline
| `-ParmVarDecl 0x55b71e064648 <col:24, col:34> col:34 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55b71e064808 <line:167:5, col:21> col:15 front 'String &()' inline
|-CXXMethodDecl 0x55b71e064908 <line:168:5, col:29> col:21 front 'const String &() const' inline
|-CXXMethodDecl 0x55b71e0649d8 <line:169:5, col:20> col:15 back 'String &()' inline
|-CXXMethodDecl 0x55b71e064aa8 <line:170:5, col:28> col:21 back 'const String &() const' inline
|-CXXMethodDecl 0x55b71e064be8 <line:172:5, col:39> col:15 unchecked_at 'String &(Vector::size_type)' inline
| `-ParmVarDecl 0x55b71e064b58 <col:28, col:38> col:38 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55b71e064d30 <line:173:5, col:47> col:21 unchecked_at 'const String &(Vector::size_type) const' inline
| `-ParmVarDecl 0x55b71e064ca0 <col:34, col:44> col:44 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55b71e064e78 <line:174:5, col:59> col:15 at_u 'String &(Vector::size_type)' inline
| |-ParmVarDecl 0x55b71e064de8 <col:20, col:30> col:30 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x55b71e064f30 <col:48> Inherited "" ""
|-CXXMethodDecl 0x55b71e065030 <line:175:5, col:71> col:21 at_u 'const String &(Vector::size_type) const' inline
| |-ParmVarDecl 0x55b71e064fa0 <col:26, col:36> col:36 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x55b71e0650e8 <col:60> Inherited "" ""
|-CXXMethodDecl 0x55b71e0651a8 <line:177:5, col:20> col:15 data 'String *()' inline
|-CXXMethodDecl 0x55b71e0652a8 <line:178:5, col:28> col:21 data 'const String *() const' inline
|-CXXMethodDecl 0x55b71e065428 <line:180:5, col:48> col:17 used push_back 'void (Vector<String>::value_argument_type)' inline
| `-ParmVarDecl 0x55b71e065368 <col:27, col:47> col:47 v 'Vector<String>::value_argument_type':'const String &'
|-FunctionTemplateDecl 0x55b71e065bb8 <line:182:5, line:183:63> col:48 push_back
| |-TemplateTypeParmDecl 0x55b71e0654e0 <line:182:15, col:43> col:24 typename depth 0 index 0 A
| | `-TemplateArgument type 'fast_argument<String>':'fast_argument<String, true>'
| `-CXXMethodDecl 0x55b71e065b18 <line:183:5, col:63> col:48 push_back 'typename A::enable_rvalue_reference (String &&)' inline
|   `-ParmVarDecl 0x55b71e065a18 <col:58, col:62> col:62 v 'String &&'
|-CXXMethodDecl 0x55b71e065c98 <line:185:5, col:26> col:17 pop_back 'void ()' inline
|-CXXMethodDecl 0x55b71e065de8 <line:186:5, col:49> col:17 push_front 'void (Vector<String>::value_argument_type)' inline
| `-ParmVarDecl 0x55b71e065d58 <col:28, col:48> col:48 v 'Vector<String>::value_argument_type':'const String &'
|-CXXMethodDecl 0x55b71e065ea0 <line:187:5, col:27> col:17 pop_front 'void ()' inline
|-CXXMethodDecl 0x55b71e0660e8 <line:189:5, col:62> col:21 insert 'Vector<String>::iterator (Vector<String>::iterator, Vector<String>::value_argument_type)' inline
| |-ParmVarDecl 0x55b71e065f60 <col:28, col:37> col:37 it 'Vector<String>::iterator':'String *'
| `-ParmVarDecl 0x55b71e065fd8 <col:41, col:61> col:61 v 'Vector<String>::value_argument_type':'const String &'
|-CXXMethodDecl 0x55b71e066278 <line:190:5, col:38> col:21 erase 'Vector<String>::iterator (Vector<String>::iterator)' inline
| `-ParmVarDecl 0x55b71e0661b8 <col:27, col:36> col:36 it 'Vector<String>::iterator':'String *'
|-CXXMethodDecl 0x55b71e066488 <line:191:5, col:49> col:21 erase 'Vector<String>::iterator (Vector<String>::iterator, Vector<String>::iterator)' inline
| |-ParmVarDecl 0x55b71e066340 <col:27, col:36> col:36 a 'Vector<String>::iterator':'String *'
| `-ParmVarDecl 0x55b71e0663b8 <col:39, col:48> col:48 b 'Vector<String>::iterator':'String *'
|-CXXMethodDecl 0x55b71e066548 <line:193:5, col:23> col:17 used clear 'void ()' inline
|-CXXMethodDecl 0x55b71e0667a8 <line:195:5, col:34> col:17 swap 'void (Vector<String> &)' inline
| `-ParmVarDecl 0x55b71e0666b0 <col:22, col:33> col:33 x 'Vector<String> &'
`-CXXDestructorDecl 0x55b71e066878 <../dummy_inc/click/ipaddress.hh:13:29> col:29 implicit ~Vector 'void ()' inline default noexcept-unevaluated 0x55b71e066878

Layout: <CGRecordLayout
  LLVMType:%class.Vector.0 = type { %class.vector_memory.1 }
  NonVirtualBaseLLVMType:%class.Vector.0 = type { %class.vector_memory.1 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x55b71e0aafd0 <../dummy_inc/click/vector.hh:11:1, line:71:1> line:11:30 class vector_memory definition
|-DefinitionData standard_layout has_user_declared_ctor can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor simple trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveConstructor
| |-CopyAssignment trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveAssignment
| `-Destructor non_trivial user_declared
|-TemplateArgument type 'sized_array_memory<4>'
|-CXXRecordDecl 0x55b71e0ab1a8 prev 0x55b71e0aafd0 <col:24, col:30> col:30 implicit class vector_memory
|-AccessSpecDecl 0x55b71e0ab238 <col:46, col:52> col:46 public
|-TypedefDecl 0x55b71e0ab260 <line:12:5, col:17> col:17 size_type 'int'
| `-BuiltinType 0x55b71d92f580 'int'
|-TypedefDecl 0x55b71e0ace30 <line:13:5, col:31> col:31 type 'typename sized_array_memory<4>::type':'char_array<4>'
| `-ElaboratedType 0x55b71e0acde0 'typename sized_array_memory<4>::type' sugar
|   `-TypedefType 0x55b71e0ab710 'sized_array_memory<4>::type' sugar
|     |-Typedef 0x55b71e0ab610 'type'
|     `-TemplateSpecializationType 0x55b71e0ab5a0 'char_array<4UL>' sugar char_array
|       |-TemplateArgument expr
|       | `-ConstantExpr 0x55b71e0ab480 <../dummy_inc/click/array_memory.hh:11:24> 'unsigned long' Int: 4
|       |   `-SubstNonTypeTemplateParmExpr 0x55b71e0ab460 <col:24> 'unsigned long'
|       |     `-IntegerLiteral 0x55b71e0ab440 <col:24> 'unsigned long' 4
|       `-RecordType 0x55b71e0ab580 'char_array<4>'
|         `-ClassTemplateSpecialization 0x55b71e0ab4a0 'char_array'
|-TypedefDecl 0x55b71e0acee8 <../dummy_inc/click/vector.hh:14:5, col:19> col:19 iterator 'vector_memory<sized_array_memory<4> >::type *'
| `-PointerType 0x55b71e0aceb0 'vector_memory<sized_array_memory<4> >::type *'
|   `-TypedefType 0x55b71e0ace90 'vector_memory<sized_array_memory<4> >::type' sugar
|     |-Typedef 0x55b71e0ace30 'type'
|     `-ElaboratedType 0x55b71e0acde0 'typename sized_array_memory<4>::type' sugar
|       `-TypedefType 0x55b71e0ab710 'sized_array_memory<4>::type' sugar
|         |-Typedef 0x55b71e0ab610 'type'
|         `-TemplateSpecializationType 0x55b71e0ab5a0 'char_array<4UL>' sugar char_array
|           |-TemplateArgument expr
|           | `-ConstantExpr 0x55b71e0ab480 <../dummy_inc/click/array_memory.hh:11:24> 'unsigned long' Int: 4
|           |   `-SubstNonTypeTemplateParmExpr 0x55b71e0ab460 <col:24> 'unsigned long'
|           |     `-IntegerLiteral 0x55b71e0ab440 <col:24> 'unsigned long' 4
|           `-RecordType 0x55b71e0ab580 'char_array<4>'
|             `-ClassTemplateSpecialization 0x55b71e0ab4a0 'char_array'
|-CXXMethodDecl 0x55b71e0ad068 <../dummy_inc/click/vector.hh:15:5, line:18:5> line:15:17 need_argument_copy 'bool (const vector_memory<sized_array_memory<4> >::type *) const' inline
| `-ParmVarDecl 0x55b71e0acf78 <col:36, col:48> col:48 argp 'const vector_memory<sized_array_memory<4> >::type *'
|-CXXConstructorDecl 0x55b71e0ad158 <line:20:5, line:22:5> line:20:5 vector_memory 'void ()'
|-CXXDestructorDecl 0x55b71e0ad238 <line:23:5, col:20> col:5 ~vector_memory 'void ()' noexcept-unevaluated 0x55b71e0ad238
|-CXXMethodDecl 0x55b71e0ad508 <line:25:5, col:43> col:10 assign 'void (const vector_memory<sized_array_memory<4> > &)'
| `-ParmVarDecl 0x55b71e0ad410 <col:17, col:42> col:42 x 'const vector_memory<sized_array_memory<4> > &'
|-CXXMethodDecl 0x55b71e0ad748 <line:26:5, col:44> col:10 assign 'void (vector_memory::size_type, const vector_memory<sized_array_memory<4> >::type *)'
| |-ParmVarDecl 0x55b71e0ad5c0 <col:17, col:27> col:27 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55b71e0ad638 <col:30, col:42> col:42 vp 'const vector_memory<sized_array_memory<4> >::type *'
|-CXXMethodDecl 0x55b71e0ad918 <line:27:5, col:44> col:10 resize 'void (vector_memory::size_type, const vector_memory<sized_array_memory<4> >::type *)'
| |-ParmVarDecl 0x55b71e0ad808 <col:17, col:27> col:27 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55b71e0ad880 <col:30, col:42> col:42 vp 'const vector_memory<sized_array_memory<4> >::type *'
|-CXXMethodDecl 0x55b71e0ada78 <line:28:5, line:30:5> line:28:14 begin 'vector_memory<sized_array_memory<4> >::iterator ()'
|-CXXMethodDecl 0x55b71e0adb48 <line:31:5, line:33:5> line:31:14 end 'vector_memory<sized_array_memory<4> >::iterator ()'
|-CXXMethodDecl 0x55b71e0add98 <line:34:5, col:48> col:14 insert 'vector_memory<sized_array_memory<4> >::iterator (vector_memory<sized_array_memory<4> >::iterator, const vector_memory<sized_array_memory<4> >::type *)'
| |-ParmVarDecl 0x55b71e0adc08 <col:21, col:30> col:30 it 'vector_memory<sized_array_memory<4> >::iterator':'vector_memory<sized_array_memory<4> >::type *'
| `-ParmVarDecl 0x55b71e0adc80 <col:34, col:46> col:46 vp 'const vector_memory<sized_array_memory<4> >::type *'
|-CXXMethodDecl 0x55b71e0adff8 <line:35:5, col:42> col:14 erase 'vector_memory<sized_array_memory<4> >::iterator (vector_memory<sized_array_memory<4> >::iterator, vector_memory<sized_array_memory<4> >::iterator)'
| |-ParmVarDecl 0x55b71e0ade68 <col:20, col:29> col:29 a 'vector_memory<sized_array_memory<4> >::iterator':'vector_memory<sized_array_memory<4> >::type *'
| `-ParmVarDecl 0x55b71e0adee0 <col:32, col:41> col:41 b 'vector_memory<sized_array_memory<4> >::iterator':'vector_memory<sized_array_memory<4> >::type *'
|-CXXMethodDecl 0x55b71e0ae1b8 <line:36:5, line:43:5> line:36:17 push_back 'void (const vector_memory<sized_array_memory<4> >::type *)' inline
| `-ParmVarDecl 0x55b71e0ae0c8 <col:27, col:39> col:39 vp 'const vector_memory<sized_array_memory<4> >::type *'
|-CXXMethodDecl 0x55b71e0ae378 <line:45:5, line:52:5> line:45:17 move_construct_back 'void (vector_memory<sized_array_memory<4> >::type *)' inline
| `-ParmVarDecl 0x55b71e0ae280 <col:37, col:43> col:43 vp 'vector_memory<sized_array_memory<4> >::type *'
|-CXXMethodDecl 0x55b71e0ae430 <line:54:5, line:59:5> line:54:17 pop_back 'void ()' inline
|-CXXMethodDecl 0x55b71e0ae4e0 <line:60:5, line:64:5> line:60:17 clear 'void ()' inline
|-CXXMethodDecl 0x55b71e0ae718 <line:65:5, col:59> col:10 reserve_and_push_back 'bool (vector_memory::size_type, const vector_memory<sized_array_memory<4> >::type *)'
| |-ParmVarDecl 0x55b71e0ae590 <col:32, col:42> col:42 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55b71e0ae608 <col:45, col:57> col:57 vp 'const vector_memory<sized_array_memory<4> >::type *'
|-CXXMethodDecl 0x55b71e0ae9b8 <line:66:5, col:35> col:10 swap 'void (vector_memory<sized_array_memory<4> > &)'
| `-ParmVarDecl 0x55b71e0ae8c0 <col:15, col:34> col:34 x 'vector_memory<sized_array_memory<4> > &'
|-FieldDecl 0x55b71e0aea80 <line:68:5, col:11> col:11 l_ 'vector_memory<sized_array_memory<4> >::type *'
|-FieldDecl 0x55b71e0aead0 <line:69:5, col:15> col:15 n_ 'vector_memory::size_type':'int'
`-FieldDecl 0x55b71e0aeb20 <line:70:5, col:15> col:15 capacity_ 'vector_memory::size_type':'int'

Layout: <CGRecordLayout
  LLVMType:%class.vector_memory.3 = type { %struct.char_array.4*, i32, i32 }
  NonVirtualBaseLLVMType:%class.vector_memory.3 = type { %struct.char_array.4*, i32, i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x55b71e1af7f0 <../dummy_inc/click/ipaddress.hh:13:1, col:29> ../dummy_inc/click/vector.hh:111:7 class Vector definition
|-DefinitionData standard_layout has_user_declared_ctor has_mutable_fields can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor non_trivial user_declared has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveConstructor exists non_trivial user_declared needs_overload_resolution
| |-CopyAssignment non_trivial has_const_param user_declared needs_overload_resolution implicit_has_const_param
| |-MoveAssignment exists non_trivial user_declared needs_overload_resolution
| `-Destructor simple non_trivial needs_overload_resolution
|-TemplateArgument type 'unsigned int'
|-CXXRecordDecl 0x55b71e1af9f8 prev 0x55b71e1af7f0 <col:1, col:7> col:7 implicit class Vector
|-TypedefDecl 0x55b71e1b0a10 <line:113:5, col:44> col:44 array_memory_type 'typename array_memory<unsigned int>::type':'sized_array_memory<4>'
| `-ElaboratedType 0x55b71e1b09c0 'typename array_memory<unsigned int>::type' sugar
|   `-TypedefType 0x55b71e1b09a0 'conditional<true, sized_array_memory<4>, typed_array_memory<unsigned int> >::type' sugar
|     |-Typedef 0x55b71e1b0850 'type'
|     `-SubstTemplateTypeParmType 0x55b71e0aaba0 'sized_array_memory<4>' sugar
|       |-TemplateTypeParmType 0x55b71dc16000 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55b71dc15fa8 'T'
|       `-RecordType 0x55b71e0aa6f0 'sized_array_memory<4>'
|         `-ClassTemplateSpecialization 0x55b71e0aa608 'sized_array_memory'
|-FieldDecl 0x55b71e1b0b10 <line:114:5, col:46> col:46 vm_ 'vector_memory<Vector<unsigned int>::array_memory_type>':'vector_memory<sized_array_memory<4> >' mutable
|-AccessSpecDecl 0x55b71e1b0b60 <line:116:3, col:9> col:3 public
|-TypedefDecl 0x55b71e1b0b98 <line:118:5, col:15> col:15 value_type 'unsigned int':'unsigned int'
| `-SubstTemplateTypeParmType 0x55b71e1afa90 'unsigned int' sugar
|   |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x55b71dc4c168 'T'
|   `-BuiltinType 0x55b71d92f620 'unsigned int'
|-TypedefDecl 0x55b71e1b0c28 <line:119:5, col:16> col:16 reference 'unsigned int &'
| `-LValueReferenceType 0x55b71e1b0bf0 'unsigned int &'
|   `-SubstTemplateTypeParmType 0x55b71e1afa90 'unsigned int' sugar
|     |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55b71dc4c168 'T'
|     `-BuiltinType 0x55b71d92f620 'unsigned int'
|-TypedefDecl 0x55b71e1b0cb8 <line:120:5, col:22> col:22 const_reference 'const unsigned int &'
| `-LValueReferenceType 0x55b71e1b0c80 'const unsigned int &'
|   `-QualType 0x55b71e1afa91 'const unsigned int' const
|     `-SubstTemplateTypeParmType 0x55b71e1afa90 'unsigned int' sugar
|       |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55b71dc4c168 'T'
|       `-BuiltinType 0x55b71d92f620 'unsigned int'
|-TypedefDecl 0x55b71e1b0d48 <line:121:5, col:16> col:16 pointer 'unsigned int *'
| `-PointerType 0x55b71e1b0d10 'unsigned int *'
|   `-SubstTemplateTypeParmType 0x55b71e1afa90 'unsigned int' sugar
|     |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55b71dc4c168 'T'
|     `-BuiltinType 0x55b71d92f620 'unsigned int'
|-TypedefDecl 0x55b71e1b0dd8 <line:122:5, col:22> col:22 const_pointer 'const unsigned int *'
| `-PointerType 0x55b71e1b0da0 'const unsigned int *'
|   `-QualType 0x55b71e1afa91 'const unsigned int' const
|     `-SubstTemplateTypeParmType 0x55b71e1afa90 'unsigned int' sugar
|       |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55b71dc4c168 'T'
|       `-BuiltinType 0x55b71d92f620 'unsigned int'
|-TypedefDecl 0x55b71e1b19c0 <line:125:5, col:45> col:45 value_argument_type 'typename fast_argument<unsigned int>::type':'unsigned int'
| `-ElaboratedType 0x55b71e1b1970 'typename fast_argument<unsigned int>::type' sugar
|   `-TypedefType 0x55b71e1b1950 'fast_argument<unsigned int, false>::type' sugar
|     |-Typedef 0x55b71e1b18e0 'type'
|     `-SubstTemplateTypeParmType 0x55b71e1b16a0 'unsigned int' sugar
|       |-TemplateTypeParmType 0x55b71dc1e200 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55b71dc1e1b0 'T'
|       `-BuiltinType 0x55b71d92f620 'unsigned int'
|-TypedefDecl 0x55b71e1b1a28 <line:126:5, col:22> col:22 const_access_type 'const unsigned int &'
| `-LValueReferenceType 0x55b71e1b0c80 'const unsigned int &'
|   `-QualType 0x55b71e1afa91 'const unsigned int' const
|     `-SubstTemplateTypeParmType 0x55b71e1afa90 'unsigned int' sugar
|       |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55b71dc4c168 'T'
|       `-BuiltinType 0x55b71d92f620 'unsigned int'
|-TypedefDecl 0x55b71e1b1a80 <line:128:5, col:17> col:17 size_type 'int'
| `-BuiltinType 0x55b71d92f580 'int'
|-TypedefDecl 0x55b71e1b1ae8 <line:130:5, col:16> col:16 iterator 'unsigned int *'
| `-PointerType 0x55b71e1b0d10 'unsigned int *'
|   `-SubstTemplateTypeParmType 0x55b71e1afa90 'unsigned int' sugar
|     |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55b71dc4c168 'T'
|     `-BuiltinType 0x55b71d92f620 'unsigned int'
|-TypedefDecl 0x55b71e1b1b50 <line:131:5, col:22> col:22 const_iterator 'const unsigned int *'
| `-PointerType 0x55b71e1b0da0 'const unsigned int *'
|   `-QualType 0x55b71e1afa91 'const unsigned int' const
|     `-SubstTemplateTypeParmType 0x55b71e1afa90 'unsigned int' sugar
|       |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55b71dc4c168 'T'
|       `-BuiltinType 0x55b71d92f620 'unsigned int'
|-EnumDecl 0x55b71e1b1ba8 <line:134:5> col:5
| `-EnumConstantDecl 0x55b71e1b1ca0 <col:12, col:40> col:12 RESERVE_GROW 'Vector<unsigned int>::(anonymous enum at ../dummy_inc/click/vector.hh:134:5)'
|   `-ConstantExpr 0x55b71e1b1c80 <col:27, col:40> 'Vector::size_type':'int' Int: -1
|     `-CStyleCastExpr 0x55b71dc4d388 <col:27, col:40> 'Vector::size_type':'int' <NoOp>
|       `-UnaryOperator 0x55b71dc4d360 <col:39, col:40> 'int' prefix '-'
|         `-IntegerLiteral 0x55b71dc4d340 <col:40> 'int' 1
|-CXXConstructorDecl 0x55b71e1b1d28 <line:137:5, col:28> col:21 Vector 'void ()' inline
|-CXXConstructorDecl 0x55b71e1b1f78 <line:138:5, col:62> col:21 Vector 'void (Vector::size_type, Vector<unsigned int>::value_argument_type)' inline
| |-ParmVarDecl 0x55b71e1b1de0 <col:28, col:38> col:38 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55b71e1b1e80 <col:41, col:61> col:61 v 'Vector<unsigned int>::value_argument_type':'unsigned int'
|-CXXConstructorDecl 0x55b71e1b2238 <line:139:5, col:37> col:12 Vector 'void (const Vector<unsigned int> &)' inline
| `-ParmVarDecl 0x55b71e1b2120 <col:19, col:36> col:36 x 'const Vector<unsigned int> &'
|-CXXConstructorDecl 0x55b71e1b24f8 <line:141:5, col:32> col:12 Vector 'void (Vector<unsigned int> &&)' inline
| `-ParmVarDecl 0x55b71e1b23e0 <col:19, col:31> col:31 x 'Vector<unsigned int> &&'
|-CXXMethodDecl 0x55b71e1b2840 <line:144:5, col:51> col:23 operator= 'Vector<unsigned int> &(const Vector<unsigned int> &)' inline
| `-ParmVarDecl 0x55b71e1b2720 <col:33, col:50> col:50 x 'const Vector<unsigned int> &'
|-CXXMethodDecl 0x55b71e1bac20 <line:146:5, col:46> col:23 operator= 'Vector<unsigned int> &(Vector<unsigned int> &&)' inline
| `-ParmVarDecl 0x55b71e1bab00 <col:33, col:45> col:45 x 'Vector<unsigned int> &&'
|-CXXMethodDecl 0x55b71e1baf10 <line:148:5, col:70> col:23 assign 'Vector<unsigned int> &(Vector::size_type, Vector<unsigned int>::value_argument_type)' inline
| |-ParmVarDecl 0x55b71e1bad58 <col:30, col:40> col:40 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55b71e1badd0 <col:43, col:69> col:63 v 'Vector<unsigned int>::value_argument_type':'unsigned int'
|-CXXMethodDecl 0x55b71e1bb038 <line:150:5, col:55> col:49 begin 'Vector<unsigned int>::iterator ()'
| |-NoInlineAttr 0x55b71e1bb118 <col:20> Inherited
| `-OptimizeNoneAttr 0x55b71e1bb170 <col:30> Inherited
|-CXXMethodDecl 0x55b71e1bb1b8 <line:151:5, col:53> col:49 end 'Vector<unsigned int>::iterator ()'
| |-NoInlineAttr 0x55b71e1bb268 <col:20> Inherited
| `-OptimizeNoneAttr 0x55b71e1bb2c0 <col:30> Inherited
|-CXXMethodDecl 0x55b71e1bb358 <line:152:5, col:63> col:55 begin 'Vector<unsigned int>::const_iterator () const'
| |-NoInlineAttr 0x55b71e1bb408 <col:20> Inherited
| `-OptimizeNoneAttr 0x55b71e1bb460 <col:30> Inherited
|-CXXMethodDecl 0x55b71e1bb4a8 <line:153:5, col:61> col:55 end 'Vector<unsigned int>::const_iterator () const'
| |-NoInlineAttr 0x55b71e1bb558 <col:20> Inherited
| `-OptimizeNoneAttr 0x55b71e1bb5b0 <col:30> Inherited
|-CXXMethodDecl 0x55b71e1bb5f8 <line:154:5, col:64> col:55 cbegin 'Vector<unsigned int>::const_iterator () const'
| |-NoInlineAttr 0x55b71e1bb6a8 <col:20> Inherited
| `-OptimizeNoneAttr 0x55b71e1bb700 <col:30> Inherited
|-CXXMethodDecl 0x55b71e1bb748 <line:155:5, col:62> col:55 cend 'Vector<unsigned int>::const_iterator () const'
| |-NoInlineAttr 0x55b71e1bb7f8 <col:20> Inherited
| `-OptimizeNoneAttr 0x55b71e1bb850 <col:30> Inherited
|-CXXMethodDecl 0x55b71e1bb878 <line:157:5, col:29> col:22 size 'Vector::size_type () const' inline
|-CXXMethodDecl 0x55b71e1bb928 <line:158:5, col:33> col:22 capacity 'Vector::size_type () const' inline
|-CXXMethodDecl 0x55b71e1bb9d8 <line:159:5, col:25> col:17 empty 'bool () const' inline
|-CXXMethodDecl 0x55b71e1bbb98 <line:160:5, col:64> col:17 resize 'void (Vector::size_type, Vector<unsigned int>::value_argument_type)' inline
| |-ParmVarDecl 0x55b71e1bba88 <col:24, col:34> col:34 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55b71e1bbb00 <col:37, col:63> col:57 v 'Vector<unsigned int>::value_argument_type':'unsigned int'
|-CXXMethodDecl 0x55b71e1bbce8 <line:161:5, col:36> col:17 reserve 'bool (Vector::size_type)' inline
| `-ParmVarDecl 0x55b71e1bbc58 <col:25, col:35> col:35 n 'Vector::size_type':'int'
|-CXXMethodDecl 0x55b71e1bbe98 <line:163:5, col:65> col:43 operator[] 'unsigned int &(Vector::size_type)'
| |-ParmVarDecl 0x55b71e1bbda0 <col:54, col:64> col:64 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x55b71e1bbf50 <col:20>
| `-OptimizeNoneAttr 0x55b71e1bbfa8 <col:30>
|-CXXMethodDecl 0x55b71e1bc0c8 <line:164:5, col:73> col:49 operator[] 'const unsigned int &(Vector::size_type) const'
| |-ParmVarDecl 0x55b71e1bbfd0 <col:60, col:70> col:70 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x55b71e1bc180 <col:20>
| `-OptimizeNoneAttr 0x55b71e1bc1d8 <col:30>
|-CXXMethodDecl 0x55b71e1bc290 <line:165:5, col:29> col:15 at 'unsigned int &(Vector::size_type)' inline
| `-ParmVarDecl 0x55b71e1bc200 <col:18, col:28> col:28 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55b71e1bc3d8 <line:166:5, col:37> col:21 at 'const unsigned int &(Vector::size_type) const' inline
| `-ParmVarDecl 0x55b71e1bc348 <col:24, col:34> col:34 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55b71e1bc508 <line:167:5, col:21> col:15 front 'unsigned int &()' inline
|-CXXMethodDecl 0x55b71e1bc638 <line:168:5, col:29> col:21 front 'const unsigned int &() const' inline
|-CXXMethodDecl 0x55b71e1bc708 <line:169:5, col:20> col:15 back 'unsigned int &()' inline
|-CXXMethodDecl 0x55b71e1bc7d8 <line:170:5, col:28> col:21 back 'const unsigned int &() const' inline
|-CXXMethodDecl 0x55b71e1bc918 <line:172:5, col:39> col:15 unchecked_at 'unsigned int &(Vector::size_type)' inline
| `-ParmVarDecl 0x55b71e1bc888 <col:28, col:38> col:38 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55b71e1bca60 <line:173:5, col:47> col:21 unchecked_at 'const unsigned int &(Vector::size_type) const' inline
| `-ParmVarDecl 0x55b71e1bc9d0 <col:34, col:44> col:44 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55b71e1bcba8 <line:174:5, col:59> col:15 at_u 'unsigned int &(Vector::size_type)' inline
| |-ParmVarDecl 0x55b71e1bcb18 <col:20, col:30> col:30 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x55b71e1bcc60 <col:48> Inherited "" ""
|-CXXMethodDecl 0x55b71e1bcd60 <line:175:5, col:71> col:21 at_u 'const unsigned int &(Vector::size_type) const' inline
| |-ParmVarDecl 0x55b71e1bccd0 <col:26, col:36> col:36 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x55b71e1bce18 <col:60> Inherited "" ""
|-CXXMethodDecl 0x55b71e1bced8 <line:177:5, col:20> col:15 data 'unsigned int *()' inline
|-CXXMethodDecl 0x55b71e1bcfd8 <line:178:5, col:28> col:21 data 'const unsigned int *() const' inline
|-CXXMethodDecl 0x55b71e1bd158 <line:180:5, col:48> col:17 push_back 'void (Vector<unsigned int>::value_argument_type)' inline
| `-ParmVarDecl 0x55b71e1bd098 <col:27, col:47> col:47 v 'Vector<unsigned int>::value_argument_type':'unsigned int'
|-FunctionTemplateDecl 0x55b71e1bd918 <line:182:5, line:183:63> col:48 push_back
| |-TemplateTypeParmDecl 0x55b71e1bd210 <line:182:15, col:43> col:24 typename depth 0 index 0 A
| | `-TemplateArgument type 'fast_argument<unsigned int>':'fast_argument<unsigned int, false>'
| `-CXXMethodDecl 0x55b71e1bd878 <line:183:5, col:63> col:48 push_back 'typename A::enable_rvalue_reference (unsigned int &&)' inline
|   `-ParmVarDecl 0x55b71e1bd778 <col:58, col:62> col:62 v 'unsigned int &&'
|-CXXMethodDecl 0x55b71e1bd9f8 <line:185:5, col:26> col:17 pop_back 'void ()' inline
|-CXXMethodDecl 0x55b71e1bdb48 <line:186:5, col:49> col:17 push_front 'void (Vector<unsigned int>::value_argument_type)' inline
| `-ParmVarDecl 0x55b71e1bdab8 <col:28, col:48> col:48 v 'Vector<unsigned int>::value_argument_type':'unsigned int'
|-CXXMethodDecl 0x55b71e1bdc00 <line:187:5, col:27> col:17 pop_front 'void ()' inline
|-CXXMethodDecl 0x55b71e1bde48 <line:189:5, col:62> col:21 insert 'Vector<unsigned int>::iterator (Vector<unsigned int>::iterator, Vector<unsigned int>::value_argument_type)' inline
| |-ParmVarDecl 0x55b71e1bdcc0 <col:28, col:37> col:37 it 'Vector<unsigned int>::iterator':'unsigned int *'
| `-ParmVarDecl 0x55b71e1bdd38 <col:41, col:61> col:61 v 'Vector<unsigned int>::value_argument_type':'unsigned int'
|-CXXMethodDecl 0x55b71e1be008 <line:190:5, col:38> col:21 erase 'Vector<unsigned int>::iterator (Vector<unsigned int>::iterator)' inline
| `-ParmVarDecl 0x55b71e1bdf18 <col:27, col:36> col:36 it 'Vector<unsigned int>::iterator':'unsigned int *'
|-CXXMethodDecl 0x55b71e1be258 <line:191:5, col:49> col:21 erase 'Vector<unsigned int>::iterator (Vector<unsigned int>::iterator, Vector<unsigned int>::iterator)' inline
| |-ParmVarDecl 0x55b71e1be0d0 <col:27, col:36> col:36 a 'Vector<unsigned int>::iterator':'unsigned int *'
| `-ParmVarDecl 0x55b71e1be148 <col:39, col:48> col:48 b 'Vector<unsigned int>::iterator':'unsigned int *'
|-CXXMethodDecl 0x55b71e1be318 <line:193:5, col:23> col:17 clear 'void ()' inline
|-CXXMethodDecl 0x55b71e1be578 <line:195:5, col:34> col:17 swap 'void (Vector<unsigned int> &)' inline
| `-ParmVarDecl 0x55b71e1be480 <col:22, col:33> col:33 x 'Vector<unsigned int> &'
`-CXXDestructorDecl 0x55b71e1be648 <../dummy_inc/click/ipaddress.hh:13:29> col:29 implicit ~Vector 'void ()' inline default noexcept-unevaluated 0x55b71e1be648

Layout: <CGRecordLayout
  LLVMType:%class.Vector.2 = type { %class.vector_memory.3 }
  NonVirtualBaseLLVMType:%class.Vector.2 = type { %class.vector_memory.3 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x55b71e0a9bf0 <../dummy_inc/click/ipaddress.hh:13:1, col:29> ../dummy_inc/click/vector.hh:111:7 class Vector definition
|-DefinitionData standard_layout has_user_declared_ctor has_mutable_fields can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor non_trivial user_declared has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveConstructor exists non_trivial user_declared needs_overload_resolution
| |-CopyAssignment non_trivial has_const_param user_declared needs_overload_resolution implicit_has_const_param
| |-MoveAssignment exists non_trivial user_declared needs_overload_resolution
| `-Destructor simple non_trivial needs_overload_resolution
|-TemplateArgument type 'int'
|-CXXRecordDecl 0x55b71e0a9df8 prev 0x55b71e0a9bf0 <col:1, col:7> col:7 implicit class Vector
|-TypedefDecl 0x55b71e0aaf40 <line:113:5, col:44> col:44 array_memory_type 'typename array_memory<int>::type':'sized_array_memory<4>'
| `-ElaboratedType 0x55b71e0aaef0 'typename array_memory<int>::type' sugar
|   `-TypedefType 0x55b71e0aaed0 'conditional<true, sized_array_memory<4>, typed_array_memory<int> >::type' sugar
|     |-Typedef 0x55b71e0aad80 'type'
|     `-SubstTemplateTypeParmType 0x55b71e0aaba0 'sized_array_memory<4>' sugar
|       |-TemplateTypeParmType 0x55b71dc16000 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55b71dc15fa8 'T'
|       `-RecordType 0x55b71e0aa6f0 'sized_array_memory<4>'
|         `-ClassTemplateSpecialization 0x55b71e0aa608 'sized_array_memory'
|-FieldDecl 0x55b71e0aeb70 <line:114:5, col:46> col:46 vm_ 'vector_memory<Vector<int>::array_memory_type>':'vector_memory<sized_array_memory<4> >' mutable
|-AccessSpecDecl 0x55b71e0aebc0 <line:116:3, col:9> col:3 public
|-TypedefDecl 0x55b71e0aebf8 <line:118:5, col:15> col:15 value_type 'int':'int'
| `-SubstTemplateTypeParmType 0x55b71e0a9e90 'int' sugar
|   |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x55b71dc4c168 'T'
|   `-BuiltinType 0x55b71d92f580 'int'
|-TypedefDecl 0x55b71e0aec88 <line:119:5, col:16> col:16 reference 'int &'
| `-LValueReferenceType 0x55b71e0aec50 'int &'
|   `-SubstTemplateTypeParmType 0x55b71e0a9e90 'int' sugar
|     |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55b71dc4c168 'T'
|     `-BuiltinType 0x55b71d92f580 'int'
|-TypedefDecl 0x55b71e0aed18 <line:120:5, col:22> col:22 const_reference 'const int &'
| `-LValueReferenceType 0x55b71e0aece0 'const int &'
|   `-QualType 0x55b71e0a9e91 'const int' const
|     `-SubstTemplateTypeParmType 0x55b71e0a9e90 'int' sugar
|       |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55b71dc4c168 'T'
|       `-BuiltinType 0x55b71d92f580 'int'
|-TypedefDecl 0x55b71e0aeda8 <line:121:5, col:16> col:16 pointer 'int *'
| `-PointerType 0x55b71e0aed70 'int *'
|   `-SubstTemplateTypeParmType 0x55b71e0a9e90 'int' sugar
|     |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55b71dc4c168 'T'
|     `-BuiltinType 0x55b71d92f580 'int'
|-TypedefDecl 0x55b71e0aee38 <line:122:5, col:22> col:22 const_pointer 'const int *'
| `-PointerType 0x55b71e0aee00 'const int *'
|   `-QualType 0x55b71e0a9e91 'const int' const
|     `-SubstTemplateTypeParmType 0x55b71e0a9e90 'int' sugar
|       |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55b71dc4c168 'T'
|       `-BuiltinType 0x55b71d92f580 'int'
|-TypedefDecl 0x55b71e0afa20 <line:125:5, col:45> col:45 value_argument_type 'typename fast_argument<int>::type':'int'
| `-ElaboratedType 0x55b71e0af9d0 'typename fast_argument<int>::type' sugar
|   `-TypedefType 0x55b71e0af9b0 'fast_argument<int, false>::type' sugar
|     |-Typedef 0x55b71e0af940 'type'
|     `-SubstTemplateTypeParmType 0x55b71e0af700 'int' sugar
|       |-TemplateTypeParmType 0x55b71dc1e200 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55b71dc1e1b0 'T'
|       `-BuiltinType 0x55b71d92f580 'int'
|-TypedefDecl 0x55b71e0afa88 <line:126:5, col:22> col:22 const_access_type 'const int &'
| `-LValueReferenceType 0x55b71e0aece0 'const int &'
|   `-QualType 0x55b71e0a9e91 'const int' const
|     `-SubstTemplateTypeParmType 0x55b71e0a9e90 'int' sugar
|       |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55b71dc4c168 'T'
|       `-BuiltinType 0x55b71d92f580 'int'
|-TypedefDecl 0x55b71e0afae0 <line:128:5, col:17> col:17 size_type 'int'
| `-BuiltinType 0x55b71d92f580 'int'
|-TypedefDecl 0x55b71e0afb48 <line:130:5, col:16> col:16 iterator 'int *'
| `-PointerType 0x55b71e0aed70 'int *'
|   `-SubstTemplateTypeParmType 0x55b71e0a9e90 'int' sugar
|     |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55b71dc4c168 'T'
|     `-BuiltinType 0x55b71d92f580 'int'
|-TypedefDecl 0x55b71e0afbb0 <line:131:5, col:22> col:22 const_iterator 'const int *'
| `-PointerType 0x55b71e0aee00 'const int *'
|   `-QualType 0x55b71e0a9e91 'const int' const
|     `-SubstTemplateTypeParmType 0x55b71e0a9e90 'int' sugar
|       |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55b71dc4c168 'T'
|       `-BuiltinType 0x55b71d92f580 'int'
|-EnumDecl 0x55b71e0afc08 <line:134:5> col:5
| `-EnumConstantDecl 0x55b71e0afd00 <col:12, col:40> col:12 RESERVE_GROW 'Vector<int>::(anonymous enum at ../dummy_inc/click/vector.hh:134:5)'
|   `-ConstantExpr 0x55b71e0afce0 <col:27, col:40> 'Vector::size_type':'int' Int: -1
|     `-CStyleCastExpr 0x55b71dc4d388 <col:27, col:40> 'Vector::size_type':'int' <NoOp>
|       `-UnaryOperator 0x55b71dc4d360 <col:39, col:40> 'int' prefix '-'
|         `-IntegerLiteral 0x55b71dc4d340 <col:40> 'int' 1
|-CXXConstructorDecl 0x55b71e0afd88 <line:137:5, col:28> col:21 Vector 'void ()' inline
|-CXXConstructorDecl 0x55b71e0affd8 <line:138:5, col:62> col:21 Vector 'void (Vector::size_type, Vector<int>::value_argument_type)' inline
| |-ParmVarDecl 0x55b71e0afe40 <col:28, col:38> col:38 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55b71e0afee0 <col:41, col:61> col:61 v 'Vector<int>::value_argument_type':'int'
|-CXXConstructorDecl 0x55b71e0b0298 <line:139:5, col:37> col:12 Vector 'void (const Vector<int> &)' inline
| `-ParmVarDecl 0x55b71e0b0180 <col:19, col:36> col:36 x 'const Vector<int> &'
|-CXXConstructorDecl 0x55b71e0b0558 <line:141:5, col:32> col:12 Vector 'void (Vector<int> &&)' inline
| `-ParmVarDecl 0x55b71e0b0440 <col:19, col:31> col:31 x 'Vector<int> &&'
|-CXXMethodDecl 0x55b71e0b08a0 <line:144:5, col:51> col:23 operator= 'Vector<int> &(const Vector<int> &)' inline
| `-ParmVarDecl 0x55b71e0b0780 <col:33, col:50> col:50 x 'const Vector<int> &'
|-CXXMethodDecl 0x55b71e0b0bb0 <line:146:5, col:46> col:23 operator= 'Vector<int> &(Vector<int> &&)' inline
| `-ParmVarDecl 0x55b71e0b0a90 <col:33, col:45> col:45 x 'Vector<int> &&'
|-CXXMethodDecl 0x55b71e0b0ea0 <line:148:5, col:70> col:23 assign 'Vector<int> &(Vector::size_type, Vector<int>::value_argument_type)' inline
| |-ParmVarDecl 0x55b71e0b0ce8 <col:30, col:40> col:40 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55b71e0b0d60 <col:43, col:69> col:63 v 'Vector<int>::value_argument_type':'int'
|-CXXMethodDecl 0x55b71e0b0fc8 <line:150:5, col:55> col:49 begin 'Vector<int>::iterator ()'
| |-NoInlineAttr 0x55b71e0b10a8 <col:20> Inherited
| `-OptimizeNoneAttr 0x55b71e0b1100 <col:30> Inherited
|-CXXMethodDecl 0x55b71e0b1148 <line:151:5, col:53> col:49 end 'Vector<int>::iterator ()'
| |-NoInlineAttr 0x55b71e0b11f8 <col:20> Inherited
| `-OptimizeNoneAttr 0x55b71e0b1250 <col:30> Inherited
|-CXXMethodDecl 0x55b71e0b1318 <line:152:5, col:63> col:55 begin 'Vector<int>::const_iterator () const'
| |-NoInlineAttr 0x55b71e0b13c8 <col:20> Inherited
| `-OptimizeNoneAttr 0x55b71e0b1420 <col:30> Inherited
|-CXXMethodDecl 0x55b71e0b1468 <line:153:5, col:61> col:55 end 'Vector<int>::const_iterator () const'
| |-NoInlineAttr 0x55b71e0b1518 <col:20> Inherited
| `-OptimizeNoneAttr 0x55b71e0b1570 <col:30> Inherited
|-CXXMethodDecl 0x55b71e0b15b8 <line:154:5, col:64> col:55 cbegin 'Vector<int>::const_iterator () const'
| |-NoInlineAttr 0x55b71e0b1668 <col:20> Inherited
| `-OptimizeNoneAttr 0x55b71e0b16c0 <col:30> Inherited
|-CXXMethodDecl 0x55b71e0b1708 <line:155:5, col:62> col:55 cend 'Vector<int>::const_iterator () const'
| |-NoInlineAttr 0x55b71e0b17b8 <col:20> Inherited
| `-OptimizeNoneAttr 0x55b71e0b1810 <col:30> Inherited
|-CXXMethodDecl 0x55b71e0b1838 <line:157:5, col:29> col:22 size 'Vector::size_type () const' inline
|-CXXMethodDecl 0x55b71e0b18e8 <line:158:5, col:33> col:22 capacity 'Vector::size_type () const' inline
|-CXXMethodDecl 0x55b71e0b1998 <line:159:5, col:25> col:17 empty 'bool () const' inline
|-CXXMethodDecl 0x55b71e0b3190 <line:160:5, col:64> col:17 resize 'void (Vector::size_type, Vector<int>::value_argument_type)' inline
| |-ParmVarDecl 0x55b71e0b1a48 <col:24, col:34> col:34 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55b71e0b1ac0 <col:37, col:63> col:57 v 'Vector<int>::value_argument_type':'int'
|-CXXMethodDecl 0x55b71e0b32e0 <line:161:5, col:36> col:17 reserve 'bool (Vector::size_type)' inline
| `-ParmVarDecl 0x55b71e0b3250 <col:25, col:35> col:35 n 'Vector::size_type':'int'
|-CXXMethodDecl 0x55b71e0b3488 <line:163:5, col:65> col:43 used operator[] 'int &(Vector::size_type)'
| |-ParmVarDecl 0x55b71e0b3398 <col:54, col:64> col:64 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x55b71e0b3540 <col:20>
| `-OptimizeNoneAttr 0x55b71e0b3598 <col:30>
|-CXXMethodDecl 0x55b71e0b36b8 <line:164:5, col:73> col:49 operator[] 'const int &(Vector::size_type) const'
| |-ParmVarDecl 0x55b71e0b35c0 <col:60, col:70> col:70 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x55b71e0b3770 <col:20>
| `-OptimizeNoneAttr 0x55b71e0b37c8 <col:30>
|-CXXMethodDecl 0x55b71e0b3880 <line:165:5, col:29> col:15 at 'int &(Vector::size_type)' inline
| `-ParmVarDecl 0x55b71e0b37f0 <col:18, col:28> col:28 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55b71e0b39c8 <line:166:5, col:37> col:21 at 'const int &(Vector::size_type) const' inline
| `-ParmVarDecl 0x55b71e0b3938 <col:24, col:34> col:34 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55b71e0b3af8 <line:167:5, col:21> col:15 front 'int &()' inline
|-CXXMethodDecl 0x55b71e0b3c28 <line:168:5, col:29> col:21 front 'const int &() const' inline
|-CXXMethodDecl 0x55b71e0b3cf8 <line:169:5, col:20> col:15 back 'int &()' inline
|-CXXMethodDecl 0x55b71e0b3dc8 <line:170:5, col:28> col:21 used back 'const int &() const' inline
|-CXXMethodDecl 0x55b71e0b3f08 <line:172:5, col:39> col:15 unchecked_at 'int &(Vector::size_type)' inline
| `-ParmVarDecl 0x55b71e0b3e78 <col:28, col:38> col:38 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55b71e0b4050 <line:173:5, col:47> col:21 unchecked_at 'const int &(Vector::size_type) const' inline
| `-ParmVarDecl 0x55b71e0b3fc0 <col:34, col:44> col:44 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55b71e0b4198 <line:174:5, col:59> col:15 at_u 'int &(Vector::size_type)' inline
| |-ParmVarDecl 0x55b71e0b4108 <col:20, col:30> col:30 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x55b71e0b4250 <col:48> Inherited "" ""
|-CXXMethodDecl 0x55b71e0b4350 <line:175:5, col:71> col:21 at_u 'const int &(Vector::size_type) const' inline
| |-ParmVarDecl 0x55b71e0b42c0 <col:26, col:36> col:36 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x55b71e0b4408 <col:60> Inherited "" ""
|-CXXMethodDecl 0x55b71e0b44c8 <line:177:5, col:20> col:15 data 'int *()' inline
|-CXXMethodDecl 0x55b71e0b45c8 <line:178:5, col:28> col:21 data 'const int *() const' inline
|-CXXMethodDecl 0x55b71e0b4748 <line:180:5, col:48> col:17 push_back 'void (Vector<int>::value_argument_type)' inline
| `-ParmVarDecl 0x55b71e0b4688 <col:27, col:47> col:47 v 'Vector<int>::value_argument_type':'int'
|-FunctionTemplateDecl 0x55b71e0b4f08 <line:182:5, line:183:63> col:48 push_back
| |-TemplateTypeParmDecl 0x55b71e0b4800 <line:182:15, col:43> col:24 typename depth 0 index 0 A
| | `-TemplateArgument type 'fast_argument<int>':'fast_argument<int, false>'
| `-CXXMethodDecl 0x55b71e0b4e68 <line:183:5, col:63> col:48 push_back 'typename A::enable_rvalue_reference (int &&)' inline
|   `-ParmVarDecl 0x55b71e0b4d68 <col:58, col:62> col:62 v 'int &&'
|-CXXMethodDecl 0x55b71e0b4fe8 <line:185:5, col:26> col:17 pop_back 'void ()' inline
|-CXXMethodDecl 0x55b71e0b5138 <line:186:5, col:49> col:17 push_front 'void (Vector<int>::value_argument_type)' inline
| `-ParmVarDecl 0x55b71e0b50a8 <col:28, col:48> col:48 v 'Vector<int>::value_argument_type':'int'
|-CXXMethodDecl 0x55b71e0b51f0 <line:187:5, col:27> col:17 pop_front 'void ()' inline
|-CXXMethodDecl 0x55b71e0b5438 <line:189:5, col:62> col:21 insert 'Vector<int>::iterator (Vector<int>::iterator, Vector<int>::value_argument_type)' inline
| |-ParmVarDecl 0x55b71e0b52b0 <col:28, col:37> col:37 it 'Vector<int>::iterator':'int *'
| `-ParmVarDecl 0x55b71e0b5328 <col:41, col:61> col:61 v 'Vector<int>::value_argument_type':'int'
|-CXXMethodDecl 0x55b71e0b55f8 <line:190:5, col:38> col:21 erase 'Vector<int>::iterator (Vector<int>::iterator)' inline
| `-ParmVarDecl 0x55b71e0b5508 <col:27, col:36> col:36 it 'Vector<int>::iterator':'int *'
|-CXXMethodDecl 0x55b71e0b5848 <line:191:5, col:49> col:21 erase 'Vector<int>::iterator (Vector<int>::iterator, Vector<int>::iterator)' inline
| |-ParmVarDecl 0x55b71e0b56c0 <col:27, col:36> col:36 a 'Vector<int>::iterator':'int *'
| `-ParmVarDecl 0x55b71e0b5738 <col:39, col:48> col:48 b 'Vector<int>::iterator':'int *'
|-CXXMethodDecl 0x55b71e0b5908 <line:193:5, col:23> col:17 used clear 'void ()' inline
|-CXXMethodDecl 0x55b71e0b5b68 <line:195:5, col:34> col:17 swap 'void (Vector<int> &)' inline
| `-ParmVarDecl 0x55b71e0b5a70 <col:22, col:33> col:33 x 'Vector<int> &'
`-CXXDestructorDecl 0x55b71e0b5c38 <../dummy_inc/click/ipaddress.hh:13:29> col:29 implicit ~Vector 'void ()' inline default noexcept-unevaluated 0x55b71e0b5c38

Layout: <CGRecordLayout
  LLVMType:%class.Vector.5 = type { %class.vector_memory.3 }
  NonVirtualBaseLLVMType:%class.Vector.5 = type { %class.vector_memory.3 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x55b71e1be890 <../dummy_inc/click/router.hh:247:5, line:250:5> line:247:12 referenced struct element_landmark_t definition
|-DefinitionData aggregate standard_layout has_mutable_fields
| |-DefaultConstructor exists non_trivial needs_implicit
| |-CopyConstructor simple non_trivial has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveConstructor exists simple non_trivial needs_overload_resolution
| |-CopyAssignment non_trivial has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveAssignment exists simple non_trivial needs_overload_resolution
| `-Destructor simple non_trivial needs_overload_resolution
|-CXXRecordDecl 0x55b71e1be9a8 <col:5, col:12> col:12 implicit struct element_landmark_t
|-FieldDecl 0x55b71e1bea48 <line:248:9, col:18> col:18 first_landmarkid 'uint32_t':'unsigned int'
|-FieldDecl 0x55b71e1beaa8 <line:249:9, col:16> col:16 filename 'String'
|-CXXConstructorDecl 0x55b71e1beb40 <line:247:12> col:12 implicit element_landmark_t 'void (const Router::element_landmark_t &)' inline default noexcept-unevaluated 0x55b71e1beb40
| `-ParmVarDecl 0x55b71e1bec58 <col:12> col:12 'const Router::element_landmark_t &'
|-CXXConstructorDecl 0x55b71e1becf8 <col:12> col:12 implicit element_landmark_t 'void (Router::element_landmark_t &&)' inline default noexcept-unevaluated 0x55b71e1becf8
| `-ParmVarDecl 0x55b71e1bee08 <col:12> col:12 'Router::element_landmark_t &&'
|-CXXMethodDecl 0x55b71e1beea8 <col:12> col:12 implicit operator= 'Router::element_landmark_t &(const Router::element_landmark_t &)' inline default noexcept-unevaluated 0x55b71e1beea8
| `-ParmVarDecl 0x55b71e1befb8 <col:12> col:12 'const Router::element_landmark_t &'
|-CXXMethodDecl 0x55b71e1bf028 <col:12> col:12 implicit operator= 'Router::element_landmark_t &(Router::element_landmark_t &&)' inline default noexcept-unevaluated 0x55b71e1bf028
| `-ParmVarDecl 0x55b71e1bf138 <col:12> col:12 'Router::element_landmark_t &&'
`-CXXDestructorDecl 0x55b71e1bf1c0 <col:12> col:12 implicit ~element_landmark_t 'void ()' inline default noexcept-unevaluated 0x55b71e1bf1c0

Layout: <CGRecordLayout
  LLVMType:%"struct.Router::element_landmark_t" = type { i32, %class.String }
  NonVirtualBaseLLVMType:%"struct.Router::element_landmark_t" = type { i32, %class.String }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x55b71e1c0750 <../dummy_inc/click/vector.hh:11:1, line:71:1> line:11:30 class vector_memory definition
|-DefinitionData standard_layout has_user_declared_ctor can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor simple trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveConstructor
| |-CopyAssignment trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveAssignment
| `-Destructor non_trivial user_declared
|-TemplateArgument type 'typed_array_memory<Router::element_landmark_t>'
|-CXXRecordDecl 0x55b71e1c0928 prev 0x55b71e1c0750 <col:24, col:30> col:30 implicit class vector_memory
|-AccessSpecDecl 0x55b71e1c09b8 <col:46, col:52> col:46 public
|-TypedefDecl 0x55b71e1c09e0 <line:12:5, col:17> col:17 size_type 'int'
| `-BuiltinType 0x55b71d92f580 'int'
|-TypedefDecl 0x55b71e1c23a0 <line:13:5, col:31> col:31 type 'typename typed_array_memory<element_landmark_t>::type':'Router::element_landmark_t'
| `-ElaboratedType 0x55b71e1c2350 'typename typed_array_memory<element_landmark_t>::type' sugar
|   `-TypedefType 0x55b71e1c2330 'typed_array_memory<Router::element_landmark_t>::type' sugar
|     |-Typedef 0x55b71e1c0bf8 'type'
|     `-SubstTemplateTypeParmType 0x55b71e1c0bc0 'Router::element_landmark_t' sugar
|       |-TemplateTypeParmType 0x55b71dc3c9f0 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55b71dc3c9a0 'T'
|       `-RecordType 0x55b71e1be920 'Router::element_landmark_t'
|         `-CXXRecord 0x55b71e1be890 'element_landmark_t'
|-TypedefDecl 0x55b71e1c2458 <line:14:5, col:19> col:19 iterator 'vector_memory<typed_array_memory<Router::element_landmark_t> >::type *'
| `-PointerType 0x55b71e1c2420 'vector_memory<typed_array_memory<Router::element_landmark_t> >::type *'
|   `-TypedefType 0x55b71e1c2400 'vector_memory<typed_array_memory<Router::element_landmark_t> >::type' sugar
|     |-Typedef 0x55b71e1c23a0 'type'
|     `-ElaboratedType 0x55b71e1c2350 'typename typed_array_memory<element_landmark_t>::type' sugar
|       `-TypedefType 0x55b71e1c2330 'typed_array_memory<Router::element_landmark_t>::type' sugar
|         |-Typedef 0x55b71e1c0bf8 'type'
|         `-SubstTemplateTypeParmType 0x55b71e1c0bc0 'Router::element_landmark_t' sugar
|           |-TemplateTypeParmType 0x55b71dc3c9f0 'T' dependent depth 0 index 0
|           | `-TemplateTypeParm 0x55b71dc3c9a0 'T'
|           `-RecordType 0x55b71e1be920 'Router::element_landmark_t'
|             `-CXXRecord 0x55b71e1be890 'element_landmark_t'
|-CXXMethodDecl 0x55b71e1c25d8 <line:15:5, line:18:5> line:15:17 need_argument_copy 'bool (const vector_memory<typed_array_memory<Router::element_landmark_t> >::type *) const' inline
| `-ParmVarDecl 0x55b71e1c24e8 <col:36, col:48> col:48 argp 'const vector_memory<typed_array_memory<Router::element_landmark_t> >::type *'
|-CXXConstructorDecl 0x55b71e1c26c8 <line:20:5, line:22:5> line:20:5 vector_memory 'void ()'
|-CXXDestructorDecl 0x55b71e1c27a8 <line:23:5, col:20> col:5 ~vector_memory 'void ()' noexcept-unevaluated 0x55b71e1c27a8
|-CXXMethodDecl 0x55b71e1c2ab0 <line:25:5, col:43> col:10 assign 'void (const vector_memory<typed_array_memory<Router::element_landmark_t> > &)'
| `-ParmVarDecl 0x55b71e1c2980 <col:17, col:42> col:42 x 'const vector_memory<typed_array_memory<Router::element_landmark_t> > &'
|-CXXMethodDecl 0x55b71e1c2cf8 <line:26:5, col:44> col:10 assign 'void (vector_memory::size_type, const vector_memory<typed_array_memory<Router::element_landmark_t> >::type *)'
| |-ParmVarDecl 0x55b71e1c2b68 <col:17, col:27> col:27 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55b71e1c2be0 <col:30, col:42> col:42 vp 'const vector_memory<typed_array_memory<Router::element_landmark_t> >::type *'
|-CXXMethodDecl 0x55b71e1c2ec8 <line:27:5, col:44> col:10 resize 'void (vector_memory::size_type, const vector_memory<typed_array_memory<Router::element_landmark_t> >::type *)'
| |-ParmVarDecl 0x55b71e1c2db8 <col:17, col:27> col:27 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55b71e1c2e30 <col:30, col:42> col:42 vp 'const vector_memory<typed_array_memory<Router::element_landmark_t> >::type *'
|-CXXMethodDecl 0x55b71e1c3028 <line:28:5, line:30:5> line:28:14 begin 'vector_memory<typed_array_memory<Router::element_landmark_t> >::iterator ()'
|-CXXMethodDecl 0x55b71e1c30f8 <line:31:5, line:33:5> line:31:14 end 'vector_memory<typed_array_memory<Router::element_landmark_t> >::iterator ()'
|-CXXMethodDecl 0x55b71e1c3348 <line:34:5, col:48> col:14 insert 'vector_memory<typed_array_memory<Router::element_landmark_t> >::iterator (vector_memory<typed_array_memory<Router::element_landmark_t> >::iterator, const vector_memory<typed_array_memory<Router::element_landmark_t> >::type *)'
| |-ParmVarDecl 0x55b71e1c31b8 <col:21, col:30> col:30 it 'vector_memory<typed_array_memory<Router::element_landmark_t> >::iterator':'vector_memory<typed_array_memory<Router::element_landmark_t> >::type *'
| `-ParmVarDecl 0x55b71e1c3230 <col:34, col:46> col:46 vp 'const vector_memory<typed_array_memory<Router::element_landmark_t> >::type *'
|-CXXMethodDecl 0x55b71e1c35a8 <line:35:5, col:42> col:14 erase 'vector_memory<typed_array_memory<Router::element_landmark_t> >::iterator (vector_memory<typed_array_memory<Router::element_landmark_t> >::iterator, vector_memory<typed_array_memory<Router::element_landmark_t> >::iterator)'
| |-ParmVarDecl 0x55b71e1c3418 <col:20, col:29> col:29 a 'vector_memory<typed_array_memory<Router::element_landmark_t> >::iterator':'vector_memory<typed_array_memory<Router::element_landmark_t> >::type *'
| `-ParmVarDecl 0x55b71e1c3490 <col:32, col:41> col:41 b 'vector_memory<typed_array_memory<Router::element_landmark_t> >::iterator':'vector_memory<typed_array_memory<Router::element_landmark_t> >::type *'
|-CXXMethodDecl 0x55b71e1c3768 <line:36:5, line:43:5> line:36:17 push_back 'void (const vector_memory<typed_array_memory<Router::element_landmark_t> >::type *)' inline
| `-ParmVarDecl 0x55b71e1c3678 <col:27, col:39> col:39 vp 'const vector_memory<typed_array_memory<Router::element_landmark_t> >::type *'
|-CXXMethodDecl 0x55b71e1c3928 <line:45:5, line:52:5> line:45:17 move_construct_back 'void (vector_memory<typed_array_memory<Router::element_landmark_t> >::type *)' inline
| `-ParmVarDecl 0x55b71e1c3830 <col:37, col:43> col:43 vp 'vector_memory<typed_array_memory<Router::element_landmark_t> >::type *'
|-CXXMethodDecl 0x55b71e1c39e0 <line:54:5, line:59:5> line:54:17 pop_back 'void ()' inline
|-CXXMethodDecl 0x55b71e1c3a90 <line:60:5, line:64:5> line:60:17 clear 'void ()' inline
|-CXXMethodDecl 0x55b71e1c3cc8 <line:65:5, col:59> col:10 reserve_and_push_back 'bool (vector_memory::size_type, const vector_memory<typed_array_memory<Router::element_landmark_t> >::type *)'
| |-ParmVarDecl 0x55b71e1c3b40 <col:32, col:42> col:42 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55b71e1c3bb8 <col:45, col:57> col:57 vp 'const vector_memory<typed_array_memory<Router::element_landmark_t> >::type *'
|-CXXMethodDecl 0x55b71e1c3f68 <line:66:5, col:35> col:10 swap 'void (vector_memory<typed_array_memory<Router::element_landmark_t> > &)'
| `-ParmVarDecl 0x55b71e1c3e70 <col:15, col:34> col:34 x 'vector_memory<typed_array_memory<Router::element_landmark_t> > &'
|-FieldDecl 0x55b71e1c4030 <line:68:5, col:11> col:11 l_ 'vector_memory<typed_array_memory<Router::element_landmark_t> >::type *'
|-FieldDecl 0x55b71e1c4080 <line:69:5, col:15> col:15 n_ 'vector_memory::size_type':'int'
`-FieldDecl 0x55b71e1c40d0 <line:70:5, col:15> col:15 capacity_ 'vector_memory::size_type':'int'

Layout: <CGRecordLayout
  LLVMType:%class.vector_memory.7 = type { %"struct.Router::element_landmark_t"*, i32, i32 }
  NonVirtualBaseLLVMType:%class.vector_memory.7 = type { %"struct.Router::element_landmark_t"*, i32, i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x55b71e1bf2b0 <../dummy_inc/click/ipaddress.hh:13:1, col:29> ../dummy_inc/click/vector.hh:111:7 class Vector definition
|-DefinitionData standard_layout has_user_declared_ctor has_mutable_fields can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor non_trivial user_declared has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveConstructor exists non_trivial user_declared needs_overload_resolution
| |-CopyAssignment non_trivial has_const_param user_declared needs_overload_resolution implicit_has_const_param
| |-MoveAssignment exists non_trivial user_declared needs_overload_resolution
| `-Destructor simple non_trivial needs_overload_resolution
|-TemplateArgument type 'Router::element_landmark_t'
|-CXXRecordDecl 0x55b71e1bf4b8 prev 0x55b71e1bf2b0 <col:1, col:7> col:7 implicit class Vector
|-TypedefDecl 0x55b71e1c06c0 <line:113:5, col:44> col:44 array_memory_type 'typename array_memory<element_landmark_t>::type':'typed_array_memory<Router::element_landmark_t>'
| `-ElaboratedType 0x55b71e1c0670 'typename array_memory<element_landmark_t>::type' sugar
|   `-TypedefType 0x55b71e1c0650 'conditional<false, sized_array_memory<32>, typed_array_memory<Router::element_landmark_t> >::type' sugar
|     |-Typedef 0x55b71e1c0500 'type'
|     `-SubstTemplateTypeParmType 0x55b71e1c0390 'typed_array_memory<Router::element_landmark_t>' sugar
|       |-TemplateTypeParmType 0x55b71dc167f0 'F' dependent depth 0 index 1
|       | `-TemplateTypeParm 0x55b71dc16798 'F'
|       `-RecordType 0x55b71e1bfff0 'typed_array_memory<Router::element_landmark_t>'
|         `-ClassTemplateSpecialization 0x55b71e1bff10 'typed_array_memory'
|-FieldDecl 0x55b71e1c4120 <line:114:5, col:46> col:46 vm_ 'vector_memory<Vector<Router::element_landmark_t>::array_memory_type>':'vector_memory<typed_array_memory<Router::element_landmark_t> >' mutable
|-AccessSpecDecl 0x55b71e1c4170 <line:116:3, col:9> col:3 public
|-TypedefDecl 0x55b71e1c41a8 <line:118:5, col:15> col:15 value_type 'Router::element_landmark_t':'Router::element_landmark_t'
| `-SubstTemplateTypeParmType 0x55b71e1bf550 'Router::element_landmark_t' sugar
|   |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x55b71dc4c168 'T'
|   `-RecordType 0x55b71e1be920 'Router::element_landmark_t'
|     `-CXXRecord 0x55b71e1be890 'element_landmark_t'
|-TypedefDecl 0x55b71e1c4238 <line:119:5, col:16> col:16 reference 'Router::element_landmark_t &'
| `-LValueReferenceType 0x55b71e1c4200 'Router::element_landmark_t &'
|   `-SubstTemplateTypeParmType 0x55b71e1bf550 'Router::element_landmark_t' sugar
|     |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55b71dc4c168 'T'
|     `-RecordType 0x55b71e1be920 'Router::element_landmark_t'
|       `-CXXRecord 0x55b71e1be890 'element_landmark_t'
|-TypedefDecl 0x55b71e1c42c8 <line:120:5, col:22> col:22 const_reference 'const Router::element_landmark_t &'
| `-LValueReferenceType 0x55b71e1c4290 'const Router::element_landmark_t &'
|   `-QualType 0x55b71e1bf551 'const Router::element_landmark_t' const
|     `-SubstTemplateTypeParmType 0x55b71e1bf550 'Router::element_landmark_t' sugar
|       |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55b71dc4c168 'T'
|       `-RecordType 0x55b71e1be920 'Router::element_landmark_t'
|         `-CXXRecord 0x55b71e1be890 'element_landmark_t'
|-TypedefDecl 0x55b71e1c4358 <line:121:5, col:16> col:16 pointer 'Router::element_landmark_t *'
| `-PointerType 0x55b71e1c4320 'Router::element_landmark_t *'
|   `-SubstTemplateTypeParmType 0x55b71e1bf550 'Router::element_landmark_t' sugar
|     |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55b71dc4c168 'T'
|     `-RecordType 0x55b71e1be920 'Router::element_landmark_t'
|       `-CXXRecord 0x55b71e1be890 'element_landmark_t'
|-TypedefDecl 0x55b71e1c43e8 <line:122:5, col:22> col:22 const_pointer 'const Router::element_landmark_t *'
| `-PointerType 0x55b71e1c43b0 'const Router::element_landmark_t *'
|   `-QualType 0x55b71e1bf551 'const Router::element_landmark_t' const
|     `-SubstTemplateTypeParmType 0x55b71e1bf550 'Router::element_landmark_t' sugar
|       |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55b71dc4c168 'T'
|       `-RecordType 0x55b71e1be920 'Router::element_landmark_t'
|         `-CXXRecord 0x55b71e1be890 'element_landmark_t'
|-TypedefDecl 0x55b71e1c5040 <line:125:5, col:45> col:45 value_argument_type 'typename fast_argument<element_landmark_t>::type':'const Router::element_landmark_t &'
| `-ElaboratedType 0x55b71e1c4ff0 'typename fast_argument<element_landmark_t>::type' sugar
|   `-TypedefType 0x55b71e1c4fd0 'fast_argument<Router::element_landmark_t, true>::type' sugar
|     |-Typedef 0x55b71e1c4f08 'type'
|     `-LValueReferenceType 0x55b71e1c4ed0 'const Router::element_landmark_t &'
|       `-QualType 0x55b71e1c4c71 'const Router::element_landmark_t' const
|         `-SubstTemplateTypeParmType 0x55b71e1c4c70 'Router::element_landmark_t' sugar
|           |-TemplateTypeParmType 0x55b71dc1dad0 'T' dependent depth 0 index 0
|           | `-TemplateTypeParm 0x55b71dc1da78 'T'
|           `-RecordType 0x55b71e1be920 'Router::element_landmark_t'
|             `-CXXRecord 0x55b71e1be890 'element_landmark_t'
|-TypedefDecl 0x55b71e1c50a8 <line:126:5, col:22> col:22 const_access_type 'const Router::element_landmark_t &'
| `-LValueReferenceType 0x55b71e1c4290 'const Router::element_landmark_t &'
|   `-QualType 0x55b71e1bf551 'const Router::element_landmark_t' const
|     `-SubstTemplateTypeParmType 0x55b71e1bf550 'Router::element_landmark_t' sugar
|       |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55b71dc4c168 'T'
|       `-RecordType 0x55b71e1be920 'Router::element_landmark_t'
|         `-CXXRecord 0x55b71e1be890 'element_landmark_t'
|-TypedefDecl 0x55b71e1c5100 <line:128:5, col:17> col:17 size_type 'int'
| `-BuiltinType 0x55b71d92f580 'int'
|-TypedefDecl 0x55b71e1c5168 <line:130:5, col:16> col:16 iterator 'Router::element_landmark_t *'
| `-PointerType 0x55b71e1c4320 'Router::element_landmark_t *'
|   `-SubstTemplateTypeParmType 0x55b71e1bf550 'Router::element_landmark_t' sugar
|     |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55b71dc4c168 'T'
|     `-RecordType 0x55b71e1be920 'Router::element_landmark_t'
|       `-CXXRecord 0x55b71e1be890 'element_landmark_t'
|-TypedefDecl 0x55b71e1c51d0 <line:131:5, col:22> col:22 const_iterator 'const Router::element_landmark_t *'
| `-PointerType 0x55b71e1c43b0 'const Router::element_landmark_t *'
|   `-QualType 0x55b71e1bf551 'const Router::element_landmark_t' const
|     `-SubstTemplateTypeParmType 0x55b71e1bf550 'Router::element_landmark_t' sugar
|       |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55b71dc4c168 'T'
|       `-RecordType 0x55b71e1be920 'Router::element_landmark_t'
|         `-CXXRecord 0x55b71e1be890 'element_landmark_t'
|-EnumDecl 0x55b71e1c5228 <line:134:5> col:5
| `-EnumConstantDecl 0x55b71e1c5320 <col:12, col:40> col:12 RESERVE_GROW 'Vector<Router::element_landmark_t>::(anonymous enum at ../dummy_inc/click/vector.hh:134:5)'
|   `-ConstantExpr 0x55b71e1c5300 <col:27, col:40> 'Vector::size_type':'int' Int: -1
|     `-CStyleCastExpr 0x55b71dc4d388 <col:27, col:40> 'Vector::size_type':'int' <NoOp>
|       `-UnaryOperator 0x55b71dc4d360 <col:39, col:40> 'int' prefix '-'
|         `-IntegerLiteral 0x55b71dc4d340 <col:40> 'int' 1
|-CXXConstructorDecl 0x55b71e1c53a8 <line:137:5, col:28> col:21 Vector 'void ()' inline
|-CXXConstructorDecl 0x55b71e1c5638 <line:138:5, col:62> col:21 Vector 'void (Vector::size_type, Vector<Router::element_landmark_t>::value_argument_type)' inline
| |-ParmVarDecl 0x55b71e1c5460 <col:28, col:38> col:38 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55b71e1c5500 <col:41, col:61> col:61 v 'Vector<Router::element_landmark_t>::value_argument_type':'const Router::element_landmark_t &'
|-CXXConstructorDecl 0x55b71e1c58f8 <line:139:5, col:37> col:12 Vector 'void (const Vector<Router::element_landmark_t> &)' inline
| `-ParmVarDecl 0x55b71e1c57e0 <col:19, col:36> col:36 x 'const Vector<Router::element_landmark_t> &'
|-CXXConstructorDecl 0x55b71e1c5bb8 <line:141:5, col:32> col:12 Vector 'void (Vector<Router::element_landmark_t> &&)' inline
| `-ParmVarDecl 0x55b71e1c5aa0 <col:19, col:31> col:31 x 'Vector<Router::element_landmark_t> &&'
|-CXXMethodDecl 0x55b71e1c5f00 <line:144:5, col:51> col:23 operator= 'Vector<Router::element_landmark_t> &(const Vector<Router::element_landmark_t> &)' inline
| `-ParmVarDecl 0x55b71e1c5de0 <col:33, col:50> col:50 x 'const Vector<Router::element_landmark_t> &'
|-CXXMethodDecl 0x55b71e1c6210 <line:146:5, col:46> col:23 operator= 'Vector<Router::element_landmark_t> &(Vector<Router::element_landmark_t> &&)' inline
| `-ParmVarDecl 0x55b71e1c60f0 <col:33, col:45> col:45 x 'Vector<Router::element_landmark_t> &&'
|-CXXMethodDecl 0x55b71e1c6500 <line:148:5, col:70> col:23 assign 'Vector<Router::element_landmark_t> &(Vector::size_type, Vector<Router::element_landmark_t>::value_argument_type)' inline
| |-ParmVarDecl 0x55b71e1c6348 <col:30, col:40> col:40 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55b71e1c63c0 <col:43, col:69> col:63 v 'Vector<Router::element_landmark_t>::value_argument_type':'const Router::element_landmark_t &'
|-CXXMethodDecl 0x55b71e1c6628 <line:150:5, col:55> col:49 begin 'Vector<Router::element_landmark_t>::iterator ()'
| |-NoInlineAttr 0x55b71e1c6708 <col:20> Inherited
| `-OptimizeNoneAttr 0x55b71e1c6760 <col:30> Inherited
|-CXXMethodDecl 0x55b71e1c67a8 <line:151:5, col:53> col:49 end 'Vector<Router::element_landmark_t>::iterator ()'
| |-NoInlineAttr 0x55b71e1c6858 <col:20> Inherited
| `-OptimizeNoneAttr 0x55b71e1c68b0 <col:30> Inherited
|-CXXMethodDecl 0x55b71e1c6978 <line:152:5, col:63> col:55 begin 'Vector<Router::element_landmark_t>::const_iterator () const'
| |-NoInlineAttr 0x55b71e1c6a28 <col:20> Inherited
| `-OptimizeNoneAttr 0x55b71e1c6a80 <col:30> Inherited
|-CXXMethodDecl 0x55b71e1c6ac8 <line:153:5, col:61> col:55 end 'Vector<Router::element_landmark_t>::const_iterator () const'
| |-NoInlineAttr 0x55b71e1c6b78 <col:20> Inherited
| `-OptimizeNoneAttr 0x55b71e1c6bd0 <col:30> Inherited
|-CXXMethodDecl 0x55b71e1c6c18 <line:154:5, col:64> col:55 cbegin 'Vector<Router::element_landmark_t>::const_iterator () const'
| |-NoInlineAttr 0x55b71e1c6cc8 <col:20> Inherited
| `-OptimizeNoneAttr 0x55b71e1c6d20 <col:30> Inherited
|-CXXMethodDecl 0x55b71e1c6d68 <line:155:5, col:62> col:55 cend 'Vector<Router::element_landmark_t>::const_iterator () const'
| |-NoInlineAttr 0x55b71e1c6e18 <col:20> Inherited
| `-OptimizeNoneAttr 0x55b71e1c6e70 <col:30> Inherited
|-CXXMethodDecl 0x55b71e1c6e98 <line:157:5, col:29> col:22 size 'Vector::size_type () const' inline
|-CXXMethodDecl 0x55b71e1c6f48 <line:158:5, col:33> col:22 capacity 'Vector::size_type () const' inline
|-CXXMethodDecl 0x55b71e1c6ff8 <line:159:5, col:25> col:17 empty 'bool () const' inline
|-CXXMethodDecl 0x55b71e1c71b8 <line:160:5, col:64> col:17 resize 'void (Vector::size_type, Vector<Router::element_landmark_t>::value_argument_type)' inline
| |-ParmVarDecl 0x55b71e1c70a8 <col:24, col:34> col:34 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55b71e1c7120 <col:37, col:63> col:57 v 'Vector<Router::element_landmark_t>::value_argument_type':'const Router::element_landmark_t &'
|-CXXMethodDecl 0x55b71e1c7308 <line:161:5, col:36> col:17 reserve 'bool (Vector::size_type)' inline
| `-ParmVarDecl 0x55b71e1c7278 <col:25, col:35> col:35 n 'Vector::size_type':'int'
|-CXXMethodDecl 0x55b71e1c74b8 <line:163:5, col:65> col:43 operator[] 'Router::element_landmark_t &(Vector::size_type)'
| |-ParmVarDecl 0x55b71e1c73c0 <col:54, col:64> col:64 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x55b71e1c7570 <col:20>
| `-OptimizeNoneAttr 0x55b71e1c75c8 <col:30>
|-CXXMethodDecl 0x55b71e1c76e8 <line:164:5, col:73> col:49 operator[] 'const Router::element_landmark_t &(Vector::size_type) const'
| |-ParmVarDecl 0x55b71e1c75f0 <col:60, col:70> col:70 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x55b71e1c77a0 <col:20>
| `-OptimizeNoneAttr 0x55b71e1c77f8 <col:30>
|-CXXMethodDecl 0x55b71e1c78b0 <line:165:5, col:29> col:15 at 'Router::element_landmark_t &(Vector::size_type)' inline
| `-ParmVarDecl 0x55b71e1c7820 <col:18, col:28> col:28 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55b71e1c79f8 <line:166:5, col:37> col:21 at 'const Router::element_landmark_t &(Vector::size_type) const' inline
| `-ParmVarDecl 0x55b71e1c7968 <col:24, col:34> col:34 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55b71e1c7b28 <line:167:5, col:21> col:15 front 'Router::element_landmark_t &()' inline
|-CXXMethodDecl 0x55b71e1c7c58 <line:168:5, col:29> col:21 front 'const Router::element_landmark_t &() const' inline
|-CXXMethodDecl 0x55b71e1c7d28 <line:169:5, col:20> col:15 back 'Router::element_landmark_t &()' inline
|-CXXMethodDecl 0x55b71e1c7df8 <line:170:5, col:28> col:21 back 'const Router::element_landmark_t &() const' inline
|-CXXMethodDecl 0x55b71e1c7f38 <line:172:5, col:39> col:15 unchecked_at 'Router::element_landmark_t &(Vector::size_type)' inline
| `-ParmVarDecl 0x55b71e1c7ea8 <col:28, col:38> col:38 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55b71e1c8080 <line:173:5, col:47> col:21 unchecked_at 'const Router::element_landmark_t &(Vector::size_type) const' inline
| `-ParmVarDecl 0x55b71e1c7ff0 <col:34, col:44> col:44 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55b71e1c81c8 <line:174:5, col:59> col:15 at_u 'Router::element_landmark_t &(Vector::size_type)' inline
| |-ParmVarDecl 0x55b71e1c8138 <col:20, col:30> col:30 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x55b71e1c8280 <col:48> Inherited "" ""
|-CXXMethodDecl 0x55b71e1c8380 <line:175:5, col:71> col:21 at_u 'const Router::element_landmark_t &(Vector::size_type) const' inline
| |-ParmVarDecl 0x55b71e1c82f0 <col:26, col:36> col:36 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x55b71e1c8438 <col:60> Inherited "" ""
|-CXXMethodDecl 0x55b71e1c84f8 <line:177:5, col:20> col:15 data 'Router::element_landmark_t *()' inline
|-CXXMethodDecl 0x55b71e1c85f8 <line:178:5, col:28> col:21 data 'const Router::element_landmark_t *() const' inline
|-CXXMethodDecl 0x55b71e1c8778 <line:180:5, col:48> col:17 push_back 'void (Vector<Router::element_landmark_t>::value_argument_type)' inline
| `-ParmVarDecl 0x55b71e1c86b8 <col:27, col:47> col:47 v 'Vector<Router::element_landmark_t>::value_argument_type':'const Router::element_landmark_t &'
|-FunctionTemplateDecl 0x55b71e1c8f08 <line:182:5, line:183:63> col:48 push_back
| |-TemplateTypeParmDecl 0x55b71e1c8830 <line:182:15, col:43> col:24 typename depth 0 index 0 A
| | `-TemplateArgument type 'fast_argument<Router::element_landmark_t>':'fast_argument<Router::element_landmark_t, true>'
| `-CXXMethodDecl 0x55b71e1c8e68 <line:183:5, col:63> col:48 push_back 'typename A::enable_rvalue_reference (Router::element_landmark_t &&)' inline
|   `-ParmVarDecl 0x55b71e1c8d68 <col:58, col:62> col:62 v 'Router::element_landmark_t &&'
|-CXXMethodDecl 0x55b71e1c8fe8 <line:185:5, col:26> col:17 pop_back 'void ()' inline
|-CXXMethodDecl 0x55b71e1c9138 <line:186:5, col:49> col:17 push_front 'void (Vector<Router::element_landmark_t>::value_argument_type)' inline
| `-ParmVarDecl 0x55b71e1c90a8 <col:28, col:48> col:48 v 'Vector<Router::element_landmark_t>::value_argument_type':'const Router::element_landmark_t &'
|-CXXMethodDecl 0x55b71e1c91f0 <line:187:5, col:27> col:17 pop_front 'void ()' inline
|-CXXMethodDecl 0x55b71e1c9438 <line:189:5, col:62> col:21 insert 'Vector<Router::element_landmark_t>::iterator (Vector<Router::element_landmark_t>::iterator, Vector<Router::element_landmark_t>::value_argument_type)' inline
| |-ParmVarDecl 0x55b71e1c92b0 <col:28, col:37> col:37 it 'Vector<Router::element_landmark_t>::iterator':'Router::element_landmark_t *'
| `-ParmVarDecl 0x55b71e1c9328 <col:41, col:61> col:61 v 'Vector<Router::element_landmark_t>::value_argument_type':'const Router::element_landmark_t &'
|-CXXMethodDecl 0x55b71e1c95c8 <line:190:5, col:38> col:21 erase 'Vector<Router::element_landmark_t>::iterator (Vector<Router::element_landmark_t>::iterator)' inline
| `-ParmVarDecl 0x55b71e1c9508 <col:27, col:36> col:36 it 'Vector<Router::element_landmark_t>::iterator':'Router::element_landmark_t *'
|-CXXMethodDecl 0x55b71e1c97d8 <line:191:5, col:49> col:21 erase 'Vector<Router::element_landmark_t>::iterator (Vector<Router::element_landmark_t>::iterator, Vector<Router::element_landmark_t>::iterator)' inline
| |-ParmVarDecl 0x55b71e1c9690 <col:27, col:36> col:36 a 'Vector<Router::element_landmark_t>::iterator':'Router::element_landmark_t *'
| `-ParmVarDecl 0x55b71e1c9708 <col:39, col:48> col:48 b 'Vector<Router::element_landmark_t>::iterator':'Router::element_landmark_t *'
|-CXXMethodDecl 0x55b71e1c9898 <line:193:5, col:23> col:17 clear 'void ()' inline
|-CXXMethodDecl 0x55b71e1c9af8 <line:195:5, col:34> col:17 swap 'void (Vector<Router::element_landmark_t> &)' inline
| `-ParmVarDecl 0x55b71e1c9a00 <col:22, col:33> col:33 x 'Vector<Router::element_landmark_t> &'
`-CXXDestructorDecl 0x55b71e1c9bc8 <../dummy_inc/click/ipaddress.hh:13:29> col:29 implicit ~Vector 'void ()' inline default noexcept-unevaluated 0x55b71e1c9bc8

Layout: <CGRecordLayout
  LLVMType:%class.Vector.6 = type { %class.vector_memory.7 }
  NonVirtualBaseLLVMType:%class.Vector.6 = type { %class.vector_memory.7 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x55b71e11e720 <../dummy_inc/click/vector.hh:11:1, line:71:1> line:11:30 class vector_memory definition
|-DefinitionData standard_layout has_user_declared_ctor can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor simple trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveConstructor
| |-CopyAssignment trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveAssignment
| `-Destructor non_trivial user_declared
|-TemplateArgument type 'sized_array_memory<16>'
|-CXXRecordDecl 0x55b71e11e8f8 prev 0x55b71e11e720 <col:24, col:30> col:30 implicit class vector_memory
|-AccessSpecDecl 0x55b71e11e988 <col:46, col:52> col:46 public
|-TypedefDecl 0x55b71e11e9b0 <line:12:5, col:17> col:17 size_type 'int'
| `-BuiltinType 0x55b71d92f580 'int'
|-TypedefDecl 0x55b71e120580 <line:13:5, col:31> col:31 type 'typename sized_array_memory<16>::type':'char_array<16>'
| `-ElaboratedType 0x55b71e120530 'typename sized_array_memory<16>::type' sugar
|   `-TypedefType 0x55b71e11ee60 'sized_array_memory<16>::type' sugar
|     |-Typedef 0x55b71e11ed60 'type'
|     `-TemplateSpecializationType 0x55b71e11ecf0 'char_array<16UL>' sugar char_array
|       |-TemplateArgument expr
|       | `-ConstantExpr 0x55b71e11ebd0 <../dummy_inc/click/array_memory.hh:11:24> 'unsigned long' Int: 16
|       |   `-SubstNonTypeTemplateParmExpr 0x55b71e11ebb0 <col:24> 'unsigned long'
|       |     `-IntegerLiteral 0x55b71e11eb90 <col:24> 'unsigned long' 16
|       `-RecordType 0x55b71e11ecd0 'char_array<16>'
|         `-ClassTemplateSpecialization 0x55b71e11ebf0 'char_array'
|-TypedefDecl 0x55b71e120638 <../dummy_inc/click/vector.hh:14:5, col:19> col:19 iterator 'vector_memory<sized_array_memory<16> >::type *'
| `-PointerType 0x55b71e120600 'vector_memory<sized_array_memory<16> >::type *'
|   `-TypedefType 0x55b71e1205e0 'vector_memory<sized_array_memory<16> >::type' sugar
|     |-Typedef 0x55b71e120580 'type'
|     `-ElaboratedType 0x55b71e120530 'typename sized_array_memory<16>::type' sugar
|       `-TypedefType 0x55b71e11ee60 'sized_array_memory<16>::type' sugar
|         |-Typedef 0x55b71e11ed60 'type'
|         `-TemplateSpecializationType 0x55b71e11ecf0 'char_array<16UL>' sugar char_array
|           |-TemplateArgument expr
|           | `-ConstantExpr 0x55b71e11ebd0 <../dummy_inc/click/array_memory.hh:11:24> 'unsigned long' Int: 16
|           |   `-SubstNonTypeTemplateParmExpr 0x55b71e11ebb0 <col:24> 'unsigned long'
|           |     `-IntegerLiteral 0x55b71e11eb90 <col:24> 'unsigned long' 16
|           `-RecordType 0x55b71e11ecd0 'char_array<16>'
|             `-ClassTemplateSpecialization 0x55b71e11ebf0 'char_array'
|-CXXMethodDecl 0x55b71e1207b8 <../dummy_inc/click/vector.hh:15:5, line:18:5> line:15:17 need_argument_copy 'bool (const vector_memory<sized_array_memory<16> >::type *) const' inline
| `-ParmVarDecl 0x55b71e1206c8 <col:36, col:48> col:48 argp 'const vector_memory<sized_array_memory<16> >::type *'
|-CXXConstructorDecl 0x55b71e1208a8 <line:20:5, line:22:5> line:20:5 vector_memory 'void ()'
|-CXXDestructorDecl 0x55b71e120988 <line:23:5, col:20> col:5 ~vector_memory 'void ()' noexcept-unevaluated 0x55b71e120988
|-CXXMethodDecl 0x55b71e120c58 <line:25:5, col:43> col:10 assign 'void (const vector_memory<sized_array_memory<16> > &)'
| `-ParmVarDecl 0x55b71e120b60 <col:17, col:42> col:42 x 'const vector_memory<sized_array_memory<16> > &'
|-CXXMethodDecl 0x55b71e120e98 <line:26:5, col:44> col:10 assign 'void (vector_memory::size_type, const vector_memory<sized_array_memory<16> >::type *)'
| |-ParmVarDecl 0x55b71e120d10 <col:17, col:27> col:27 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55b71e120d88 <col:30, col:42> col:42 vp 'const vector_memory<sized_array_memory<16> >::type *'
|-CXXMethodDecl 0x55b71e121068 <line:27:5, col:44> col:10 resize 'void (vector_memory::size_type, const vector_memory<sized_array_memory<16> >::type *)'
| |-ParmVarDecl 0x55b71e120f58 <col:17, col:27> col:27 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55b71e120fd0 <col:30, col:42> col:42 vp 'const vector_memory<sized_array_memory<16> >::type *'
|-CXXMethodDecl 0x55b71e1211c8 <line:28:5, line:30:5> line:28:14 begin 'vector_memory<sized_array_memory<16> >::iterator ()'
|-CXXMethodDecl 0x55b71e121298 <line:31:5, line:33:5> line:31:14 end 'vector_memory<sized_array_memory<16> >::iterator ()'
|-CXXMethodDecl 0x55b71e1214e8 <line:34:5, col:48> col:14 insert 'vector_memory<sized_array_memory<16> >::iterator (vector_memory<sized_array_memory<16> >::iterator, const vector_memory<sized_array_memory<16> >::type *)'
| |-ParmVarDecl 0x55b71e121358 <col:21, col:30> col:30 it 'vector_memory<sized_array_memory<16> >::iterator':'vector_memory<sized_array_memory<16> >::type *'
| `-ParmVarDecl 0x55b71e1213d0 <col:34, col:46> col:46 vp 'const vector_memory<sized_array_memory<16> >::type *'
|-CXXMethodDecl 0x55b71e121748 <line:35:5, col:42> col:14 erase 'vector_memory<sized_array_memory<16> >::iterator (vector_memory<sized_array_memory<16> >::iterator, vector_memory<sized_array_memory<16> >::iterator)'
| |-ParmVarDecl 0x55b71e1215b8 <col:20, col:29> col:29 a 'vector_memory<sized_array_memory<16> >::iterator':'vector_memory<sized_array_memory<16> >::type *'
| `-ParmVarDecl 0x55b71e121630 <col:32, col:41> col:41 b 'vector_memory<sized_array_memory<16> >::iterator':'vector_memory<sized_array_memory<16> >::type *'
|-CXXMethodDecl 0x55b71e121908 <line:36:5, line:43:5> line:36:17 push_back 'void (const vector_memory<sized_array_memory<16> >::type *)' inline
| `-ParmVarDecl 0x55b71e121818 <col:27, col:39> col:39 vp 'const vector_memory<sized_array_memory<16> >::type *'
|-CXXMethodDecl 0x55b71e121ac8 <line:45:5, line:52:5> line:45:17 move_construct_back 'void (vector_memory<sized_array_memory<16> >::type *)' inline
| `-ParmVarDecl 0x55b71e1219d0 <col:37, col:43> col:43 vp 'vector_memory<sized_array_memory<16> >::type *'
|-CXXMethodDecl 0x55b71e121b80 <line:54:5, line:59:5> line:54:17 pop_back 'void ()' inline
|-CXXMethodDecl 0x55b71e121c30 <line:60:5, line:64:5> line:60:17 clear 'void ()' inline
|-CXXMethodDecl 0x55b71e121e68 <line:65:5, col:59> col:10 reserve_and_push_back 'bool (vector_memory::size_type, const vector_memory<sized_array_memory<16> >::type *)'
| |-ParmVarDecl 0x55b71e121ce0 <col:32, col:42> col:42 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55b71e121d58 <col:45, col:57> col:57 vp 'const vector_memory<sized_array_memory<16> >::type *'
|-CXXMethodDecl 0x55b71e122108 <line:66:5, col:35> col:10 swap 'void (vector_memory<sized_array_memory<16> > &)'
| `-ParmVarDecl 0x55b71e122010 <col:15, col:34> col:34 x 'vector_memory<sized_array_memory<16> > &'
|-FieldDecl 0x55b71e1221d0 <line:68:5, col:11> col:11 l_ 'vector_memory<sized_array_memory<16> >::type *'
|-FieldDecl 0x55b71e122220 <line:69:5, col:15> col:15 n_ 'vector_memory::size_type':'int'
`-FieldDecl 0x55b71e122270 <line:70:5, col:15> col:15 capacity_ 'vector_memory::size_type':'int'

Layout: <CGRecordLayout
  LLVMType:%class.vector_memory.9 = type { %struct.char_array.10*, i32, i32 }
  NonVirtualBaseLLVMType:%class.vector_memory.9 = type { %struct.char_array.10*, i32, i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x55b71e1ca2e0 <../dummy_inc/click/ipaddress.hh:13:1, col:29> ../dummy_inc/click/vector.hh:111:7 class Vector definition
|-DefinitionData standard_layout has_user_declared_ctor has_mutable_fields can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor non_trivial user_declared has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveConstructor exists non_trivial user_declared needs_overload_resolution
| |-CopyAssignment non_trivial has_const_param user_declared needs_overload_resolution implicit_has_const_param
| |-MoveAssignment exists non_trivial user_declared needs_overload_resolution
| `-Destructor simple non_trivial needs_overload_resolution
|-TemplateArgument type 'Router::Connection'
|-CXXRecordDecl 0x55b71e1ca4e8 prev 0x55b71e1ca2e0 <col:1, col:7> col:7 implicit class Vector
|-TypedefDecl 0x55b71e1ce730 <line:113:5, col:44> col:44 array_memory_type 'typename array_memory<Connection>::type':'sized_array_memory<16>'
| `-ElaboratedType 0x55b71e1ce6e0 'typename array_memory<Connection>::type' sugar
|   `-TypedefType 0x55b71e1ce6c0 'conditional<true, sized_array_memory<16>, typed_array_memory<Router::Connection> >::type' sugar
|     |-Typedef 0x55b71e1ce570 'type'
|     `-SubstTemplateTypeParmType 0x55b71e11e2f0 'sized_array_memory<16>' sugar
|       |-TemplateTypeParmType 0x55b71dc16000 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55b71dc15fa8 'T'
|       `-RecordType 0x55b71e11de40 'sized_array_memory<16>'
|         `-ClassTemplateSpecialization 0x55b71e11dd58 'sized_array_memory'
|-FieldDecl 0x55b71e1ce830 <line:114:5, col:46> col:46 vm_ 'vector_memory<Vector<Router::Connection>::array_memory_type>':'vector_memory<sized_array_memory<16> >' mutable
|-AccessSpecDecl 0x55b71e1ce880 <line:116:3, col:9> col:3 public
|-TypedefDecl 0x55b71e1ce8b8 <line:118:5, col:15> col:15 value_type 'Router::Connection':'Router::Connection'
| `-SubstTemplateTypeParmType 0x55b71e1ca580 'Router::Connection' sugar
|   |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x55b71dc4c168 'T'
|   `-RecordType 0x55b71e1a1260 'Router::Connection'
|     `-CXXRecord 0x55b71e1a11d0 'Connection'
|-TypedefDecl 0x55b71e1ce978 <line:119:5, col:16> col:16 reference 'Router::Connection &'
| `-LValueReferenceType 0x55b71e1ce940 'Router::Connection &'
|   `-SubstTemplateTypeParmType 0x55b71e1ca580 'Router::Connection' sugar
|     |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55b71dc4c168 'T'
|     `-RecordType 0x55b71e1a1260 'Router::Connection'
|       `-CXXRecord 0x55b71e1a11d0 'Connection'
|-TypedefDecl 0x55b71e1cea08 <line:120:5, col:22> col:22 const_reference 'const Router::Connection &'
| `-LValueReferenceType 0x55b71e1ce9d0 'const Router::Connection &'
|   `-QualType 0x55b71e1ca581 'const Router::Connection' const
|     `-SubstTemplateTypeParmType 0x55b71e1ca580 'Router::Connection' sugar
|       |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55b71dc4c168 'T'
|       `-RecordType 0x55b71e1a1260 'Router::Connection'
|         `-CXXRecord 0x55b71e1a11d0 'Connection'
|-TypedefDecl 0x55b71e1cea98 <line:121:5, col:16> col:16 pointer 'Router::Connection *'
| `-PointerType 0x55b71e1cea60 'Router::Connection *'
|   `-SubstTemplateTypeParmType 0x55b71e1ca580 'Router::Connection' sugar
|     |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55b71dc4c168 'T'
|     `-RecordType 0x55b71e1a1260 'Router::Connection'
|       `-CXXRecord 0x55b71e1a11d0 'Connection'
|-TypedefDecl 0x55b71e1ceb28 <line:122:5, col:22> col:22 const_pointer 'const Router::Connection *'
| `-PointerType 0x55b71e1ceaf0 'const Router::Connection *'
|   `-QualType 0x55b71e1ca581 'const Router::Connection' const
|     `-SubstTemplateTypeParmType 0x55b71e1ca580 'Router::Connection' sugar
|       |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55b71dc4c168 'T'
|       `-RecordType 0x55b71e1a1260 'Router::Connection'
|         `-CXXRecord 0x55b71e1a11d0 'Connection'
|-TypedefDecl 0x55b71e1cf780 <line:125:5, col:45> col:45 value_argument_type 'typename fast_argument<Connection>::type':'const Router::Connection &'
| `-ElaboratedType 0x55b71e1cf730 'typename fast_argument<Connection>::type' sugar
|   `-TypedefType 0x55b71e1cf710 'fast_argument<Router::Connection, true>::type' sugar
|     |-Typedef 0x55b71e1cf648 'type'
|     `-LValueReferenceType 0x55b71e1cf610 'const Router::Connection &'
|       `-QualType 0x55b71e1cf3b1 'const Router::Connection' const
|         `-SubstTemplateTypeParmType 0x55b71e1cf3b0 'Router::Connection' sugar
|           |-TemplateTypeParmType 0x55b71dc1dad0 'T' dependent depth 0 index 0
|           | `-TemplateTypeParm 0x55b71dc1da78 'T'
|           `-RecordType 0x55b71e1a1260 'Router::Connection'
|             `-CXXRecord 0x55b71e1a11d0 'Connection'
|-TypedefDecl 0x55b71e1cf7e8 <line:126:5, col:22> col:22 const_access_type 'const Router::Connection &'
| `-LValueReferenceType 0x55b71e1ce9d0 'const Router::Connection &'
|   `-QualType 0x55b71e1ca581 'const Router::Connection' const
|     `-SubstTemplateTypeParmType 0x55b71e1ca580 'Router::Connection' sugar
|       |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55b71dc4c168 'T'
|       `-RecordType 0x55b71e1a1260 'Router::Connection'
|         `-CXXRecord 0x55b71e1a11d0 'Connection'
|-TypedefDecl 0x55b71e1cf840 <line:128:5, col:17> col:17 size_type 'int'
| `-BuiltinType 0x55b71d92f580 'int'
|-TypedefDecl 0x55b71e1cf8a8 <line:130:5, col:16> col:16 iterator 'Router::Connection *'
| `-PointerType 0x55b71e1cea60 'Router::Connection *'
|   `-SubstTemplateTypeParmType 0x55b71e1ca580 'Router::Connection' sugar
|     |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55b71dc4c168 'T'
|     `-RecordType 0x55b71e1a1260 'Router::Connection'
|       `-CXXRecord 0x55b71e1a11d0 'Connection'
|-TypedefDecl 0x55b71e1cf910 <line:131:5, col:22> col:22 const_iterator 'const Router::Connection *'
| `-PointerType 0x55b71e1ceaf0 'const Router::Connection *'
|   `-QualType 0x55b71e1ca581 'const Router::Connection' const
|     `-SubstTemplateTypeParmType 0x55b71e1ca580 'Router::Connection' sugar
|       |-TemplateTypeParmType 0x55b71dc4c1c0 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55b71dc4c168 'T'
|       `-RecordType 0x55b71e1a1260 'Router::Connection'
|         `-CXXRecord 0x55b71e1a11d0 'Connection'
|-EnumDecl 0x55b71e1cf968 <line:134:5> col:5
| `-EnumConstantDecl 0x55b71e1cfa60 <col:12, col:40> col:12 RESERVE_GROW 'Vector<Router::Connection>::(anonymous enum at ../dummy_inc/click/vector.hh:134:5)'
|   `-ConstantExpr 0x55b71e1cfa40 <col:27, col:40> 'Vector::size_type':'int' Int: -1
|     `-CStyleCastExpr 0x55b71dc4d388 <col:27, col:40> 'Vector::size_type':'int' <NoOp>
|       `-UnaryOperator 0x55b71dc4d360 <col:39, col:40> 'int' prefix '-'
|         `-IntegerLiteral 0x55b71dc4d340 <col:40> 'int' 1
|-CXXConstructorDecl 0x55b71e1cfae8 <line:137:5, col:28> col:21 Vector 'void ()' inline
|-CXXConstructorDecl 0x55b71e1cfd78 <line:138:5, col:62> col:21 Vector 'void (Vector::size_type, Vector<Router::Connection>::value_argument_type)' inline
| |-ParmVarDecl 0x55b71e1cfba0 <col:28, col:38> col:38 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55b71e1cfc40 <col:41, col:61> col:61 v 'Vector<Router::Connection>::value_argument_type':'const Router::Connection &'
|-CXXConstructorDecl 0x55b71e1d0038 <line:139:5, col:37> col:12 Vector 'void (const Vector<Router::Connection> &)' inline
| `-ParmVarDecl 0x55b71e1cff20 <col:19, col:36> col:36 x 'const Vector<Router::Connection> &'
|-CXXConstructorDecl 0x55b71e1d02f8 <line:141:5, col:32> col:12 Vector 'void (Vector<Router::Connection> &&)' inline
| `-ParmVarDecl 0x55b71e1d01e0 <col:19, col:31> col:31 x 'Vector<Router::Connection> &&'
|-CXXMethodDecl 0x55b71e1d0640 <line:144:5, col:51> col:23 operator= 'Vector<Router::Connection> &(const Vector<Router::Connection> &)' inline
| `-ParmVarDecl 0x55b71e1d0520 <col:33, col:50> col:50 x 'const Vector<Router::Connection> &'
|-CXXMethodDecl 0x55b71e1d0950 <line:146:5, col:46> col:23 operator= 'Vector<Router::Connection> &(Vector<Router::Connection> &&)' inline
| `-ParmVarDecl 0x55b71e1d0830 <col:33, col:45> col:45 x 'Vector<Router::Connection> &&'
|-CXXMethodDecl 0x55b71e1d0c40 <line:148:5, col:70> col:23 assign 'Vector<Router::Connection> &(Vector::size_type, Vector<Router::Connection>::value_argument_type)' inline
| |-ParmVarDecl 0x55b71e1d0a88 <col:30, col:40> col:40 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55b71e1d0b00 <col:43, col:69> col:63 v 'Vector<Router::Connection>::value_argument_type':'const Router::Connection &'
|-CXXMethodDecl 0x55b71e1d0d98 <line:150:5, col:55> col:49 begin 'Vector<Router::Connection>::iterator ()'
| |-NoInlineAttr 0x55b71e1d0e78 <col:20> Inherited
| `-OptimizeNoneAttr 0x55b71e1d0ed0 <col:30> Inherited
|-CXXMethodDecl 0x55b71e1d0f18 <line:151:5, col:53> col:49 end 'Vector<Router::Connection>::iterator ()'
| |-NoInlineAttr 0x55b71e1d0fc8 <col:20> Inherited
| `-OptimizeNoneAttr 0x55b71e1d1020 <col:30> Inherited
|-CXXMethodDecl 0x55b71e1d10e8 <line:152:5, col:63> col:55 begin 'Vector<Router::Connection>::const_iterator () const'
| |-NoInlineAttr 0x55b71e1d1198 <col:20> Inherited
| `-OptimizeNoneAttr 0x55b71e1d11f0 <col:30> Inherited
|-CXXMethodDecl 0x55b71e1d1238 <line:153:5, col:61> col:55 end 'Vector<Router::Connection>::const_iterator () const'
| |-NoInlineAttr 0x55b71e1d12e8 <col:20> Inherited
| `-OptimizeNoneAttr 0x55b71e1d1340 <col:30> Inherited
|-CXXMethodDecl 0x55b71e1d1388 <line:154:5, col:64> col:55 cbegin 'Vector<Router::Connection>::const_iterator () const'
| |-NoInlineAttr 0x55b71e1d1438 <col:20> Inherited
| `-OptimizeNoneAttr 0x55b71e1d1490 <col:30> Inherited
|-CXXMethodDecl 0x55b71e1d14d8 <line:155:5, col:62> col:55 cend 'Vector<Router::Connection>::const_iterator () const'
| |-NoInlineAttr 0x55b71e1d1588 <col:20> Inherited
| `-OptimizeNoneAttr 0x55b71e1d15e0 <col:30> Inherited
|-CXXMethodDecl 0x55b71e1d1608 <line:157:5, col:29> col:22 size 'Vector::size_type () const' inline
|-CXXMethodDecl 0x55b71e1d16b8 <line:158:5, col:33> col:22 capacity 'Vector::size_type () const' inline
|-CXXMethodDecl 0x55b71e1d1768 <line:159:5, col:25> col:17 empty 'bool () const' inline
|-CXXMethodDecl 0x55b71e1d1928 <line:160:5, col:64> col:17 resize 'void (Vector::size_type, Vector<Router::Connection>::value_argument_type)' inline
| |-ParmVarDecl 0x55b71e1d1818 <col:24, col:34> col:34 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55b71e1d1890 <col:37, col:63> col:57 v 'Vector<Router::Connection>::value_argument_type':'const Router::Connection &'
|-CXXMethodDecl 0x55b71e1d1a78 <line:161:5, col:36> col:17 reserve 'bool (Vector::size_type)' inline
| `-ParmVarDecl 0x55b71e1d19e8 <col:25, col:35> col:35 n 'Vector::size_type':'int'
|-CXXMethodDecl 0x55b71e1d1c28 <line:163:5, col:65> col:43 operator[] 'Router::Connection &(Vector::size_type)'
| |-ParmVarDecl 0x55b71e1d1b30 <col:54, col:64> col:64 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x55b71e1d1ce0 <col:20>
| `-OptimizeNoneAttr 0x55b71e1d1d38 <col:30>
|-CXXMethodDecl 0x55b71e1d1e58 <line:164:5, col:73> col:49 operator[] 'const Router::Connection &(Vector::size_type) const'
| |-ParmVarDecl 0x55b71e1d1d60 <col:60, col:70> col:70 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x55b71e1d1f10 <col:20>
| `-OptimizeNoneAttr 0x55b71e1d1f68 <col:30>
|-CXXMethodDecl 0x55b71e1d2020 <line:165:5, col:29> col:15 at 'Router::Connection &(Vector::size_type)' inline
| `-ParmVarDecl 0x55b71e1d1f90 <col:18, col:28> col:28 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55b71e1d2168 <line:166:5, col:37> col:21 at 'const Router::Connection &(Vector::size_type) const' inline
| `-ParmVarDecl 0x55b71e1d20d8 <col:24, col:34> col:34 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55b71e1d2298 <line:167:5, col:21> col:15 front 'Router::Connection &()' inline
|-CXXMethodDecl 0x55b71e1d23c8 <line:168:5, col:29> col:21 front 'const Router::Connection &() const' inline
|-CXXMethodDecl 0x55b71e1d2498 <line:169:5, col:20> col:15 back 'Router::Connection &()' inline
|-CXXMethodDecl 0x55b71e1d2568 <line:170:5, col:28> col:21 back 'const Router::Connection &() const' inline
|-CXXMethodDecl 0x55b71e1d26a8 <line:172:5, col:39> col:15 unchecked_at 'Router::Connection &(Vector::size_type)' inline
| `-ParmVarDecl 0x55b71e1d2618 <col:28, col:38> col:38 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55b71e1d27f0 <line:173:5, col:47> col:21 unchecked_at 'const Router::Connection &(Vector::size_type) const' inline
| `-ParmVarDecl 0x55b71e1d2760 <col:34, col:44> col:44 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55b71e1d2938 <line:174:5, col:59> col:15 at_u 'Router::Connection &(Vector::size_type)' inline
| |-ParmVarDecl 0x55b71e1d28a8 <col:20, col:30> col:30 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x55b71e1d29f0 <col:48> Inherited "" ""
|-CXXMethodDecl 0x55b71e1d2af0 <line:175:5, col:71> col:21 at_u 'const Router::Connection &(Vector::size_type) const' inline
| |-ParmVarDecl 0x55b71e1d2a60 <col:26, col:36> col:36 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x55b71e1d2ba8 <col:60> Inherited "" ""
|-CXXMethodDecl 0x55b71e1d2c68 <line:177:5, col:20> col:15 data 'Router::Connection *()' inline
|-CXXMethodDecl 0x55b71e1d2d68 <line:178:5, col:28> col:21 data 'const Router::Connection *() const' inline
|-CXXMethodDecl 0x55b71e1d2f18 <line:180:5, col:48> col:17 push_back 'void (Vector<Router::Connection>::value_argument_type)' inline
| `-ParmVarDecl 0x55b71e1d2e28 <col:27, col:47> col:47 v 'Vector<Router::Connection>::value_argument_type':'const Router::Connection &'
|-FunctionTemplateDecl 0x55b71e1d36d8 <line:182:5, line:183:63> col:48 push_back
| |-TemplateTypeParmDecl 0x55b71e1d2fd0 <line:182:15, col:43> col:24 typename depth 0 index 0 A
| | `-TemplateArgument type 'fast_argument<Router::Connection>':'fast_argument<Router::Connection, true>'
| `-CXXMethodDecl 0x55b71e1d3638 <line:183:5, col:63> col:48 push_back 'typename A::enable_rvalue_reference (Router::Connection &&)' inline
|   `-ParmVarDecl 0x55b71e1d3538 <col:58, col:62> col:62 v 'Router::Connection &&'
|-CXXMethodDecl 0x55b71e1d37b8 <line:185:5, col:26> col:17 pop_back 'void ()' inline
|-CXXMethodDecl 0x55b71e1d3908 <line:186:5, col:49> col:17 push_front 'void (Vector<Router::Connection>::value_argument_type)' inline
| `-ParmVarDecl 0x55b71e1d3878 <col:28, col:48> col:48 v 'Vector<Router::Connection>::value_argument_type':'const Router::Connection &'
|-CXXMethodDecl 0x55b71e1d39c0 <line:187:5, col:27> col:17 pop_front 'void ()' inline
|-CXXMethodDecl 0x55b71e1d3c08 <line:189:5, col:62> col:21 insert 'Vector<Router::Connection>::iterator (Vector<Router::Connection>::iterator, Vector<Router::Connection>::value_argument_type)' inline
| |-ParmVarDecl 0x55b71e1d3a80 <col:28, col:37> col:37 it 'Vector<Router::Connection>::iterator':'Router::Connection *'
| `-ParmVarDecl 0x55b71e1d3af8 <col:41, col:61> col:61 v 'Vector<Router::Connection>::value_argument_type':'const Router::Connection &'
|-CXXMethodDecl 0x55b71e1d3dc8 <line:190:5, col:38> col:21 erase 'Vector<Router::Connection>::iterator (Vector<Router::Connection>::iterator)' inline
| `-ParmVarDecl 0x55b71e1d3cd8 <col:27, col:36> col:36 it 'Vector<Router::Connection>::iterator':'Router::Connection *'
|-CXXMethodDecl 0x55b71e1d4018 <line:191:5, col:49> col:21 erase 'Vector<Router::Connection>::iterator (Vector<Router::Connection>::iterator, Vector<Router::Connection>::iterator)' inline
| |-ParmVarDecl 0x55b71e1d3e90 <col:27, col:36> col:36 a 'Vector<Router::Connection>::iterator':'Router::Connection *'
| `-ParmVarDecl 0x55b71e1d3f08 <col:39, col:48> col:48 b 'Vector<Router::Connection>::iterator':'Router::Connection *'
|-CXXMethodDecl 0x55b71e1d40d8 <line:193:5, col:23> col:17 clear 'void ()' inline
|-CXXMethodDecl 0x55b71e1d4338 <line:195:5, col:34> col:17 swap 'void (Vector<Router::Connection> &)' inline
| `-ParmVarDecl 0x55b71e1d4240 <col:22, col:33> col:33 x 'Vector<Router::Connection> &'
`-CXXDestructorDecl 0x55b71e1d4408 <../dummy_inc/click/ipaddress.hh:13:29> col:29 implicit ~Vector 'void ()' inline default noexcept-unevaluated 0x55b71e1d4408

Layout: <CGRecordLayout
  LLVMType:%class.Vector.8 = type { %class.vector_memory.9 }
  NonVirtualBaseLLVMType:%class.Vector.8 = type { %class.vector_memory.9 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | union Handler::(anonymous at ../dummy_inc/click/handler.hh:290:5)
         0 |   HandlerCallback h
         0 |   ReadHandlerCallback r
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union Handler::(anonymous at ../dummy_inc/click/handler.hh:294:5)
         0 |   HandlerCallback h
         0 |   WriteHandlerCallback w
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class Handler
         0 |   class String _name
         0 |     struct String::rep_t _r
         0 |       const char * data
         8 |       int length
        16 |       struct String::memo_t * memo
        24 |   union Handler::(anonymous at ../dummy_inc/click/handler.hh:290:5) _read_hook
        24 |     HandlerCallback h
        24 |     ReadHandlerCallback r
        32 |   union Handler::(anonymous at ../dummy_inc/click/handler.hh:294:5) _write_hook
        32 |     HandlerCallback h
        32 |     WriteHandlerCallback w
        40 |   void * _read_user_data
        48 |   void * _write_user_data
        56 |   uint32_t _flags
        60 |   int _use_count
        64 |   int _next_by_name
           | [sizeof=72, dsize=68, align=8,
           |  nvsize=68, nvalign=8]

*** Dumping AST Record Layout
         0 | class ErrorHandler
         0 |   (ErrorHandler vtable pointer)
         8 |   int _nerrors
           | [sizeof=16, dsize=12, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x55b71e102ef0 prev 0x55b71e071798 <../dummy_inc/click/error.hh:90:1, line:592:1> line:90:7 referenced class ErrorHandler definition
|-DefinitionData polymorphic has_user_declared_ctor can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor simple non_trivial has_const_param implicit_has_const_param
| |-MoveConstructor
| |-CopyAssignment non_trivial has_const_param implicit_has_const_param
| |-MoveAssignment
| `-Destructor non_trivial user_declared
|-CXXRecordDecl 0x55b71e102fe8 <col:1, col:7> col:7 implicit referenced class ErrorHandler
|-AccessSpecDecl 0x55b71e103078 <col:22, col:28> col:22 public
|-EnumDecl 0x55b71e1030a0 <line:98:5, line:111:5> line:98:10 Level
| |-EnumConstantDecl 0x55b71e1031b8 <line:99:2, col:14> col:2 el_abort 'ErrorHandler::Level'
| | `-ConstantExpr 0x55b71e103198 <col:13, col:14> 'int' Int: -999
| |   `-UnaryOperator 0x55b71e103180 <col:13, col:14> 'int' prefix '-'
| |     `-IntegerLiteral 0x55b71e103160 <col:14> 'int' 999
| |-EnumConstantDecl 0x55b71e103260 <line:100:2, col:14> col:2 el_fatal 'ErrorHandler::Level'
| | `-ConstantExpr 0x55b71e103240 <col:13, col:14> 'int' Int: -1
| |   `-UnaryOperator 0x55b71e103228 <col:13, col:14> 'int' prefix '-'
| |     `-IntegerLiteral 0x55b71e103208 <col:14> 'int' 1
| |-EnumConstantDecl 0x55b71e1032f0 <line:102:2, col:17> col:2 el_emergency 'ErrorHandler::Level'
| | `-ConstantExpr 0x55b71e1032d0 <col:17> 'int' Int: 0
| |   `-IntegerLiteral 0x55b71e1032b0 <col:17> 'int' 0
| |-EnumConstantDecl 0x55b71e103380 <line:103:2, col:13> col:2 el_alert 'ErrorHandler::Level'
| | `-ConstantExpr 0x55b71e103360 <col:13> 'int' Int: 1
| |   `-IntegerLiteral 0x55b71e103340 <col:13> 'int' 1
| |-EnumConstantDecl 0x55b71e103410 <line:104:2, col:16> col:2 el_critical 'ErrorHandler::Level'
| | `-ConstantExpr 0x55b71e1033f0 <col:16> 'int' Int: 2
| |   `-IntegerLiteral 0x55b71e1033d0 <col:16> 'int' 2
| |-EnumConstantDecl 0x55b71e1034a0 <line:105:2, col:13> col:2 referenced el_error 'ErrorHandler::Level'
| | `-ConstantExpr 0x55b71e103480 <col:13> 'int' Int: 3
| |   `-IntegerLiteral 0x55b71e103460 <col:13> 'int' 3
| |-EnumConstantDecl 0x55b71e103530 <line:106:2, col:15> col:2 el_warning 'ErrorHandler::Level'
| | `-ConstantExpr 0x55b71e103510 <col:15> 'int' Int: 4
| |   `-IntegerLiteral 0x55b71e1034f0 <col:15> 'int' 4
| |-EnumConstantDecl 0x55b71e1035c0 <line:107:2, col:14> col:2 el_notice 'ErrorHandler::Level'
| | `-ConstantExpr 0x55b71e1035a0 <col:14> 'int' Int: 5
| |   `-IntegerLiteral 0x55b71e103580 <col:14> 'int' 5
| |-EnumConstantDecl 0x55b71e103650 <line:109:2, col:12> col:2 el_info 'ErrorHandler::Level'
| | `-ConstantExpr 0x55b71e103630 <col:12> 'int' Int: 6
| |   `-IntegerLiteral 0x55b71e103610 <col:12> 'int' 6
| `-EnumConstantDecl 0x55b71e1036e0 <line:110:2, col:13> col:2 el_debug 'ErrorHandler::Level'
|   `-ConstantExpr 0x55b71e1036c0 <col:13> 'int' Int: 7
|     `-IntegerLiteral 0x55b71e1036a0 <col:13> 'int' 7
|-VarDecl 0x55b71e103750 <line:114:5, col:31> col:23 e_abort 'const char []' static
|-VarDecl 0x55b71e1037d8 <col:5, line:115:10> col:2 e_fatal 'const char []' static
|-VarDecl 0x55b71e103860 <line:114:5, line:116:14> col:2 e_emergency 'const char []' static
|-VarDecl 0x55b71e1038e8 <line:114:5, line:117:10> col:2 e_alert 'const char []' static
|-VarDecl 0x55b71e103970 <line:114:5, line:118:13> col:2 e_critical 'const char []' static
|-VarDecl 0x55b71e1039f8 <line:114:5, line:119:10> col:2 e_error 'const char []' static
|-VarDecl 0x55b71e103a80 <line:114:5, line:120:12> col:2 e_warning 'const char []' static
|-VarDecl 0x55b71e103b08 <line:114:5, line:121:22> col:2 e_warning_annotated 'const char []' static
|-VarDecl 0x55b71e103b90 <line:114:5, line:122:11> col:2 e_notice 'const char []' static
|-VarDecl 0x55b71e103c18 <line:114:5, line:123:9> col:2 e_info 'const char []' static
|-VarDecl 0x55b71e103ca0 <line:114:5, line:124:10> col:2 e_debug 'const char []' static
|-CXXConstructorDecl 0x55b71e103da0 <line:127:5, line:129:5> line:127:5 used ErrorHandler 'void ()'
| |-CXXCtorInitializer Field 0x55b71e109088 '_nerrors' 'int'
| | `-IntegerLiteral 0x55b71e109818 <line:128:13> 'int' 0
| `-CompoundStmt 0x55b71e109888 <col:16, line:129:5>
|-CXXDestructorDecl 0x55b71e103e90 <line:131:5, line:132:5> line:131:13 used ~ErrorHandler 'void () noexcept' virtual
| `-CompoundStmt 0x55b71e109898 <col:29, line:132:5>
|-CXXMethodDecl 0x55b71e104048 <line:148:5, col:62> col:26 static_initialize 'ErrorHandler *(ErrorHandler *)' static
| `-ParmVarDecl 0x55b71e103f80 <col:44, col:58> col:58 errh 'ErrorHandler *'
|-CXXMethodDecl 0x55b71e104110 <line:154:5, col:32> col:17 static_cleanup 'void ()' static
|-CXXMethodDecl 0x55b71e1041f8 <line:159:5, line:161:5> line:159:26 default_handler 'ErrorHandler *()' static
| `-CompoundStmt 0x55b71e1098f0 <col:44, line:161:5>
|   `-ReturnStmt 0x55b71e1098e0 <line:160:2, col:9>
|     `-ImplicitCastExpr 0x55b71e1098c8 <col:9> 'ErrorHandler *' <LValueToRValue>
|       `-DeclRefExpr 0x55b71e1098a8 <col:9> 'ErrorHandler *' lvalue Var 0x55b71e1090e8 'the_default_handler' 'ErrorHandler *'
|-CXXMethodDecl 0x55b71e104338 <line:168:5, col:55> col:17 set_default_handler 'void (ErrorHandler *)' static
| `-ParmVarDecl 0x55b71e1042a8 <col:37, col:51> col:51 errh 'ErrorHandler *'
|-CXXMethodDecl 0x55b71e104400 <line:171:5, line:173:5> line:171:26 silent_handler 'ErrorHandler *()' static
| `-CompoundStmt 0x55b71e109950 <col:43, line:173:5>
|   `-ReturnStmt 0x55b71e109940 <line:172:2, col:9>
|     `-ImplicitCastExpr 0x55b71e109928 <col:9> 'ErrorHandler *' <LValueToRValue>
|       `-DeclRefExpr 0x55b71e109908 <col:9> 'ErrorHandler *' lvalue Var 0x55b71e109160 'the_silent_handler' 'ErrorHandler *'
|-VarDecl 0x55b71e1044b8 <line:176:5, col:22> col:22 ok_result 'const int' static
|-VarDecl 0x55b71e104538 <line:178:5, col:22> col:22 error_result 'const int' static
|-CXXMethodDecl 0x55b71e104648 <line:186:5, col:36> col:10 debug 'void (const char *, ...)'
| `-ParmVarDecl 0x55b71e1045b8 <col:16, col:28> col:28 fmt 'const char *'
|-CXXMethodDecl 0x55b71e104798 <line:188:5, col:38> col:10 message 'void (const char *, ...)'
| `-ParmVarDecl 0x55b71e104708 <col:18, col:30> col:30 fmt 'const char *'
|-CXXMethodDecl 0x55b71e1048f0 <line:193:5, col:37> col:9 warning 'int (const char *, ...)'
| `-ParmVarDecl 0x55b71e104858 <col:17, col:29> col:29 fmt 'const char *'
|-CXXMethodDecl 0x55b71e104a48 <line:196:5, col:35> col:9 error 'int (const char *, ...)'
| `-ParmVarDecl 0x55b71e1049b0 <col:15, col:27> col:27 fmt 'const char *'
|-CXXMethodDecl 0x55b71e104ba0 <line:201:5, col:35> col:9 fatal 'int (const char *, ...)'
| `-ParmVarDecl 0x55b71e104b08 <col:15, col:27> col:27 fmt 'const char *'
|-CXXMethodDecl 0x55b71e104db0 <line:204:5, col:61> col:10 ldebug 'void (const String &, const char *, ...)'
| |-ParmVarDecl 0x55b71e104c58 <col:17, col:31> col:31 landmark 'const String &'
| `-ParmVarDecl 0x55b71e104cd8 <col:41, col:53> col:53 fmt 'const char *'
|-CXXMethodDecl 0x55b71e104f88 <line:206:5, col:63> col:10 lmessage 'void (const String &, const char *, ...)'
| |-ParmVarDecl 0x55b71e104e70 <col:19, col:33> col:33 landmark 'const String &'
| `-ParmVarDecl 0x55b71e104ef0 <col:43, col:55> col:55 fmt 'const char *'
|-CXXMethodDecl 0x55b71e1051a8 <line:208:5, col:62> col:9 lwarning 'int (const String &, const char *, ...)'
| |-ParmVarDecl 0x55b71e105048 <col:18, col:32> col:32 landmark 'const String &'
| `-ParmVarDecl 0x55b71e1050c8 <col:42, col:54> col:54 fmt 'const char *'
|-CXXMethodDecl 0x55b71e105388 <line:210:5, col:60> col:9 lerror 'int (const String &, const char *, ...)'
| |-ParmVarDecl 0x55b71e105268 <col:16, col:30> col:30 landmark 'const String &'
| `-ParmVarDecl 0x55b71e1052e8 <col:40, col:52> col:52 fmt 'const char *'
|-CXXMethodDecl 0x55b71e105568 <line:212:5, col:60> col:9 lfatal 'int (const String &, const char *, ...)'
| |-ParmVarDecl 0x55b71e105448 <col:16, col:30> col:30 landmark 'const String &'
| `-ParmVarDecl 0x55b71e1054c8 <col:40, col:52> col:52 fmt 'const char *'
|-CXXMethodDecl 0x55b71e1056f0 <line:226:5, col:35> col:9 used xmessage 'int (const String &)'
| `-ParmVarDecl 0x55b71e105628 <col:18, col:32> col:32 str 'const String &'
|-CXXMethodDecl 0x55b71e1058c0 <line:232:5, line:234:5> line:232:9 used xmessage 'int (const String &, const String &)'
| |-ParmVarDecl 0x55b71e1057a8 <col:18, col:32> col:32 used anno 'const String &'
| |-ParmVarDecl 0x55b71e105820 <col:38, col:52> col:52 used str 'const String &'
| `-CompoundStmt 0x55b71e109ba8 <col:57, line:234:5>
|   `-ReturnStmt 0x55b71e109b98 <line:233:2, col:41>
|     `-ExprWithCleanups 0x55b71e109b80 <col:9, col:41> 'int'
|       `-CXXMemberCallExpr 0x55b71e109b28 <col:9, col:41> 'int'
|         |-MemberExpr 0x55b71e109af8 <col:9> '<bound member function type>' ->xmessage 0x55b71e1056f0
|         | `-CXXThisExpr 0x55b71e109ae8 <col:9> 'ErrorHandler *' implicit this
|         `-MaterializeTemporaryExpr 0x55b71e109b68 <col:18, col:40> 'const String' lvalue
|           `-ImplicitCastExpr 0x55b71e109b50 <col:18, col:40> 'const String' <NoOp>
|             `-CXXBindTemporaryExpr 0x55b71e109ac8 <col:18, col:40> 'String' (CXXTemporary 0x55b71e109ac8)
|               `-CallExpr 0x55b71e109a90 <col:18, col:40> 'String'
|                 |-ImplicitCastExpr 0x55b71e109a78 <col:18> 'String (*)(const String &, const String &)' <FunctionToPointerDecay>
|                 | `-DeclRefExpr 0x55b71e1099f0 <col:18> 'String (const String &, const String &)' lvalue CXXMethod 0x55b71e1078b8 'combine_anno' 'String (const String &, const String &)'
|                 |-DeclRefExpr 0x55b71e109a10 <col:31> 'const String' lvalue ParmVar 0x55b71e105820 'str' 'const String &'
|                 `-DeclRefExpr 0x55b71e109a30 <col:36> 'const String' lvalue ParmVar 0x55b71e1057a8 'anno' 'const String &'
|-CXXMethodDecl 0x55b71e105ba0 <line:241:5, line:243:5> line:241:9 xmessage 'int (const String &, const char *, __va_list_tag *)'
| |-ParmVarDecl 0x55b71e105980 <col:18, col:32> col:32 used anno 'const String &'
| |-ParmVarDecl 0x55b71e105a00 <col:38, col:50> col:50 used fmt 'const char *'
| |-ParmVarDecl 0x55b71e105a78 <col:55, col:63> col:63 used val '__va_list_tag *':'__va_list_tag *'
| `-CompoundStmt 0x55b71e109e38 <col:68, line:243:5>
|   `-ReturnStmt 0x55b71e109e28 <line:242:2, col:41>
|     `-ExprWithCleanups 0x55b71e109e10 <col:9, col:41> 'int'
|       `-CXXMemberCallExpr 0x55b71e109db0 <col:9, col:41> 'int'
|         |-MemberExpr 0x55b71e109d80 <col:9> '<bound member function type>' ->xmessage 0x55b71e1058c0
|         | `-CXXThisExpr 0x55b71e109d70 <col:9> 'ErrorHandler *' implicit this
|         |-DeclRefExpr 0x55b71e109c48 <col:18> 'const String' lvalue ParmVar 0x55b71e105980 'anno' 'const String &'
|         `-MaterializeTemporaryExpr 0x55b71e109df8 <col:24, col:40> 'const String' lvalue
|           `-ImplicitCastExpr 0x55b71e109de0 <col:24, col:40> 'const String' <NoOp>
|             `-CXXBindTemporaryExpr 0x55b71e109d50 <col:24, col:40> 'String' (CXXTemporary 0x55b71e109d50)
|               `-CXXMemberCallExpr 0x55b71e109ce8 <col:24, col:40> 'String'
|                 |-MemberExpr 0x55b71e109c78 <col:24> '<bound member function type>' ->vformat 0x55b71e106d80
|                 | `-CXXThisExpr 0x55b71e109c68 <col:24> 'ErrorHandler *' implicit this
|                 |-ImplicitCastExpr 0x55b71e109d18 <col:32> 'const char *' <LValueToRValue>
|                 | `-DeclRefExpr 0x55b71e109ca8 <col:32> 'const char *' lvalue ParmVar 0x55b71e105a00 'fmt' 'const char *'
|                 `-ImplicitCastExpr 0x55b71e109d30 <col:37> '__va_list_tag *':'__va_list_tag *' <LValueToRValue>
|                   `-DeclRefExpr 0x55b71e109cc8 <col:37> '__va_list_tag *':'__va_list_tag *' lvalue ParmVar 0x55b71e105a78 'val' '__va_list_tag *':'__va_list_tag *'
|-CXXMethodDecl 0x55b71e105e40 <line:251:5, line:254:5> line:251:9 used xmessage 'int (const String &, const String &, const String &)'
| |-ParmVarDecl 0x55b71e105c68 <col:18, col:32> col:32 used landmark 'const String &'
| |-ParmVarDecl 0x55b71e105ce0 <col:42, col:56> col:56 used anno 'const String &'
| |-ParmVarDecl 0x55b71e105d58 <line:252:4, col:18> col:18 used str 'const String &'
| `-CompoundStmt 0x55b71e10a178 <col:23, line:254:5>
|   `-ReturnStmt 0x55b71e10a168 <line:253:2, col:71>
|     `-ExprWithCleanups 0x55b71e10a150 <col:9, col:71> 'int'
|       `-CXXMemberCallExpr 0x55b71e10a0f0 <col:9, col:71> 'int'
|         |-MemberExpr 0x55b71e10a0c0 <col:9> '<bound member function type>' ->xmessage 0x55b71e1058c0
|         | `-CXXThisExpr 0x55b71e10a0b0 <col:9> 'ErrorHandler *' implicit this
|         |-MaterializeTemporaryExpr 0x55b71e10a138 <col:18, col:65> 'const String' lvalue
|         | `-ImplicitCastExpr 0x55b71e10a120 <col:18, col:65> 'const String' <NoOp>
|         |   `-CXXBindTemporaryExpr 0x55b71e10a070 <col:18, col:65> 'String' (CXXTemporary 0x55b71e10a070)
|         |     `-CallExpr 0x55b71e10a008 <col:18, col:65> 'String'
|         |       |-ImplicitCastExpr 0x55b71e109ff0 <col:18> 'String (*)(const String &, const String &)' <FunctionToPointerDecay>
|         |       | `-DeclRefExpr 0x55b71e109ed8 <col:18> 'String (const String &, const String &)' lvalue CXXMethod 0x55b71e1078b8 'combine_anno' 'String (const String &, const String &)'
|         |       |-DeclRefExpr 0x55b71e109ef8 <col:31> 'const String' lvalue ParmVar 0x55b71e105ce0 'anno' 'const String &'
|         |       `-MaterializeTemporaryExpr 0x55b71e10a050 <col:37, col:64> 'const String' lvalue
|         |         `-ImplicitCastExpr 0x55b71e10a038 <col:37, col:64> 'const String' <NoOp>
|         |           `-CXXBindTemporaryExpr 0x55b71e109fd0 <col:37, col:64> 'String' (CXXTemporary 0x55b71e109fd0)
|         |             `-CallExpr 0x55b71e109fa0 <col:37, col:64> 'String'
|         |               |-ImplicitCastExpr 0x55b71e109f88 <col:37> 'String (*)(const String &)' <FunctionToPointerDecay>
|         |               | `-DeclRefExpr 0x55b71e109f18 <col:37> 'String (const String &)' lvalue CXXMethod 0x55b71e107f08 'make_landmark_anno' 'String (const String &)'
|         |               `-DeclRefExpr 0x55b71e109f38 <col:56> 'const String' lvalue ParmVar 0x55b71e105c68 'landmark' 'const String &'
|         `-DeclRefExpr 0x55b71e10a090 <col:68> 'const String' lvalue ParmVar 0x55b71e105d58 'str' 'const String &'
|-CXXMethodDecl 0x55b71e1061c0 <line:264:5, line:267:5> line:264:9 xmessage 'int (const String &, const String &, const char *, __va_list_tag *)'
| |-ParmVarDecl 0x55b71e105f08 <col:18, col:32> col:32 used landmark 'const String &'
| |-ParmVarDecl 0x55b71e105f80 <col:42, col:56> col:56 used anno 'const String &'
| |-ParmVarDecl 0x55b71e106000 <line:265:4, col:16> col:16 used fmt 'const char *'
| |-ParmVarDecl 0x55b71e106078 <col:21, col:29> col:29 used val '__va_list_tag *':'__va_list_tag *'
| `-CompoundStmt 0x55b71e10a430 <col:34, line:267:5>
|   `-ReturnStmt 0x55b71e10a420 <line:266:2, col:51>
|     `-ExprWithCleanups 0x55b71e10a408 <col:9, col:51> 'int'
|       `-CXXMemberCallExpr 0x55b71e10a3a0 <col:9, col:51> 'int'
|         |-MemberExpr 0x55b71e10a370 <col:9> '<bound member function type>' ->xmessage 0x55b71e105e40
|         | `-CXXThisExpr 0x55b71e10a360 <col:9> 'ErrorHandler *' implicit this
|         |-DeclRefExpr 0x55b71e10a218 <col:18> 'const String' lvalue ParmVar 0x55b71e105f08 'landmark' 'const String &'
|         |-DeclRefExpr 0x55b71e10a238 <col:28> 'const String' lvalue ParmVar 0x55b71e105f80 'anno' 'const String &'
|         `-MaterializeTemporaryExpr 0x55b71e10a3f0 <col:34, col:50> 'const String' lvalue
|           `-ImplicitCastExpr 0x55b71e10a3d8 <col:34, col:50> 'const String' <NoOp>
|             `-CXXBindTemporaryExpr 0x55b71e10a340 <col:34, col:50> 'String' (CXXTemporary 0x55b71e10a340)
|               `-CXXMemberCallExpr 0x55b71e10a2d8 <col:34, col:50> 'String'
|                 |-MemberExpr 0x55b71e10a268 <col:34> '<bound member function type>' ->vformat 0x55b71e106d80
|                 | `-CXXThisExpr 0x55b71e10a258 <col:34> 'ErrorHandler *' implicit this
|                 |-ImplicitCastExpr 0x55b71e10a308 <col:42> 'const char *' <LValueToRValue>
|                 | `-DeclRefExpr 0x55b71e10a298 <col:42> 'const char *' lvalue ParmVar 0x55b71e106000 'fmt' 'const char *'
|                 `-ImplicitCastExpr 0x55b71e10a320 <col:47> '__va_list_tag *':'__va_list_tag *' <LValueToRValue>
|                   `-DeclRefExpr 0x55b71e10a2b8 <col:47> '__va_list_tag *':'__va_list_tag *' lvalue ParmVar 0x55b71e106078 'val' '__va_list_tag *':'__va_list_tag *'
|-CXXMethodDecl 0x55b71e1062d0 <line:286:5, line:288:5> line:286:9 nerrors 'int () const'
| `-CompoundStmt 0x55b71e10a4b0 <col:25, line:288:5>
|   `-ReturnStmt 0x55b71e10a4a0 <line:287:2, col:9>
|     `-ImplicitCastExpr 0x55b71e10a488 <col:9> 'int' <LValueToRValue>
|       `-MemberExpr 0x55b71e10a458 <col:9> 'const int' lvalue ->_nerrors 0x55b71e109088
|         `-CXXThisExpr 0x55b71e10a448 <col:9> 'const ErrorHandler *' implicit this
|-CXXMethodDecl 0x55b71e1064e0 <line:349:5, col:66> col:19 xformat 'String (int, const char *, ...)' static
| |-ParmVarDecl 0x55b71e106388 <col:27, col:31> col:31 default_flags 'int'
| `-ParmVarDecl 0x55b71e106408 <col:46, col:58> col:58 fmt 'const char *'
|-CXXMethodDecl 0x55b71e1067c8 <line:351:5, col:75> col:19 used vxformat 'String (int, const char *, __va_list_tag *)' static
| |-ParmVarDecl 0x55b71e1065a8 <col:28, col:32> col:32 default_flags 'int'
| |-ParmVarDecl 0x55b71e106628 <col:47, col:59> col:59 fmt 'const char *'
| `-ParmVarDecl 0x55b71e1066a0 <col:64, col:72> col:72 val '__va_list_tag *':'__va_list_tag *'
|-CXXMethodDecl 0x55b71e106960 <line:353:5, col:47> col:19 xformat 'String (const char *, ...)' static
| `-ParmVarDecl 0x55b71e106898 <col:27, col:39> col:39 fmt 'const char *'
|-CXXMethodDecl 0x55b71e106ba8 <line:355:5, line:357:5> line:355:19 vxformat 'String (const char *, __va_list_tag *)' static
| |-ParmVarDecl 0x55b71e106a20 <col:28, col:40> col:40 used fmt 'const char *'
| |-ParmVarDecl 0x55b71e106a98 <col:45, col:53> col:53 used val '__va_list_tag *':'__va_list_tag *'
| `-CompoundStmt 0x55b71e10a710 <col:58, line:357:5>
|   `-ReturnStmt 0x55b71e10a700 <line:356:2, col:29>
|     `-ExprWithCleanups 0x55b71e10a6e8 <col:9, col:29> 'String'
|       `-CXXConstructExpr 0x55b71e10a6b8 <col:9, col:29> 'String' 'void (String &&)' elidable
|         `-MaterializeTemporaryExpr 0x55b71e10a6a0 <col:9, col:29> 'String' xvalue
|           `-CXXBindTemporaryExpr 0x55b71e10a680 <col:9, col:29> 'String' (CXXTemporary 0x55b71e10a680)
|             `-CallExpr 0x55b71e10a610 <col:9, col:29> 'String'
|               |-ImplicitCastExpr 0x55b71e10a5f8 <col:9> 'String (*)(int, const char *, __va_list_tag *)' <FunctionToPointerDecay>
|               | `-DeclRefExpr 0x55b71e10a578 <col:9> 'String (int, const char *, __va_list_tag *)' lvalue CXXMethod 0x55b71e1067c8 'vxformat' 'String (int, const char *, __va_list_tag *)'
|               |-IntegerLiteral 0x55b71e10a518 <col:18> 'int' 0
|               |-ImplicitCastExpr 0x55b71e10a648 <col:21> 'const char *' <LValueToRValue>
|               | `-DeclRefExpr 0x55b71e10a538 <col:21> 'const char *' lvalue ParmVar 0x55b71e106a20 'fmt' 'const char *'
|               `-ImplicitCastExpr 0x55b71e10a660 <col:26> '__va_list_tag *':'__va_list_tag *' <LValueToRValue>
|                 `-DeclRefExpr 0x55b71e10a558 <col:26> '__va_list_tag *':'__va_list_tag *' lvalue ParmVar 0x55b71e106a98 'val' '__va_list_tag *':'__va_list_tag *'
|-CXXMethodDecl 0x55b71e106d80 <line:369:5, col:56> col:20 used vformat 'String (const char *, __va_list_tag *)' virtual
| |-ParmVarDecl 0x55b71e106c70 <col:28, col:40> col:40 fmt 'const char *'
| `-ParmVarDecl 0x55b71e106ce8 <col:45, col:53> col:53 val '__va_list_tag *':'__va_list_tag *'
|-CXXMethodDecl 0x55b71e106ed8 <line:379:5, col:39> col:12 format 'String (const char *, ...)'
| `-ParmVarDecl 0x55b71e106e48 <col:19, col:31> col:31 fmt 'const char *'
|-CXXMethodDecl 0x55b71e107020 <line:393:5, col:46> col:20 decorate 'String (const String &)' virtual
| `-ParmVarDecl 0x55b71e106f90 <col:29, col:43> col:43 str 'const String &'
|-CXXMethodDecl 0x55b71e1072c0 <line:424:5, col:69> col:19 emit 'void *(const String &, void *, bool)' virtual
| |-ParmVarDecl 0x55b71e1070d8 <col:24, col:38> col:38 str 'const String &'
| |-ParmVarDecl 0x55b71e107158 <col:43, col:49> col:49 user_data 'void *'
| `-ParmVarDecl 0x55b71e1071d0 <col:60, col:65> col:65 more 'bool'
|-CXXMethodDecl 0x55b71e107420 <line:438:5, line:441:5> line:438:18 account 'void (int)' virtual
| |-ParmVarDecl 0x55b71e107390 <col:26, col:30> col:30 used level 'int'
| `-CompoundStmt 0x55b71e10a828 <col:37, line:441:5>
|   `-IfStmt 0x55b71e10a810 <line:439:2, line:440:8>
|     |-BinaryOperator 0x55b71e10a798 <line:439:6, col:15> 'bool' '<='
|     | |-ImplicitCastExpr 0x55b71e10a768 <col:6> 'int' <LValueToRValue>
|     | | `-DeclRefExpr 0x55b71e10a728 <col:6> 'int' lvalue ParmVar 0x55b71e107390 'level' 'int'
|     | `-ImplicitCastExpr 0x55b71e10a780 <col:15> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x55b71e10a748 <col:15> 'ErrorHandler::Level' EnumConstant 0x55b71e1034a0 'el_error' 'ErrorHandler::Level'
|     `-UnaryOperator 0x55b71e10a7f8 <line:440:6, col:8> 'int' lvalue prefix '++'
|       `-MemberExpr 0x55b71e10a7c8 <col:8> 'int' lvalue ->_nerrors 0x55b71e109088
|         `-CXXThisExpr 0x55b71e10a7b8 <col:8> 'ErrorHandler *' implicit this
|-CXXMethodDecl 0x55b71e1074e8 <line:446:5, line:448:5> line:446:18 clear 'void ()' virtual
| `-CompoundStmt 0x55b71e10a8c0 <col:26, line:448:5>
|   `-BinaryOperator 0x55b71e10a8a0 <line:447:2, col:13> 'int' lvalue '='
|     |-MemberExpr 0x55b71e10a850 <col:2> 'int' lvalue ->_nerrors 0x55b71e109088
|     | `-CXXThisExpr 0x55b71e10a840 <col:2> 'ErrorHandler *' implicit this
|     `-IntegerLiteral 0x55b71e10a880 <col:13> 'int' 0
|-CXXMethodDecl 0x55b71e1076b0 <line:466:5, col:66> col:19 used make_anno 'String (const char *, const String &)' static
| |-ParmVarDecl 0x55b71e1075a0 <col:29, col:41> col:41 name 'const char *'
| `-ParmVarDecl 0x55b71e107618 <col:47, col:61> col:61 value 'const String &'
|-CXXMethodDecl 0x55b71e1078b8 <line:482:5, col:69> col:19 used combine_anno 'String (const String &, const String &)' static
| |-ParmVarDecl 0x55b71e107770 <col:32, col:46> col:46 str 'const String &'
| `-ParmVarDecl 0x55b71e1077e8 <col:51, col:65> col:65 anno 'const String &'
|-CXXMethodDecl 0x55b71e107b68 <line:516:5, line:517:68> line:516:24 parse_anno 'const char *(const String &, const char *, const char *, ...)' static
| |-ParmVarDecl 0x55b71e107978 <col:35, col:49> col:49 str 'const String &'
| |-ParmVarDecl 0x55b71e1079f8 <line:517:3, col:15> col:15 begin 'const char *'
| |-ParmVarDecl 0x55b71e107a78 <col:22, col:34> col:34 end 'const char *'
| `-SentinelAttr 0x55b71e107c20 <col:59> 0 0
|-CXXMethodDecl 0x55b71e107db8 <line:527:5, line:534:5> line:527:24 skip_anno 'const char *(const char *, const char *)' static
| |-ParmVarDecl 0x55b71e107c98 <col:34, col:46> col:46 used begin 'const char *'
| |-ParmVarDecl 0x55b71e107d18 <col:53, col:65> col:65 used end 'const char *'
| `-CompoundStmt 0x55b71e10af40 <col:70, line:534:5>
|   |-DeclStmt 0x55b71e10aa30 <line:528:2, col:20>
|   | |-VarDecl 0x55b71e10a8e8 <col:2, col:9> col:9 used name 'String' callinit destroyed
|   | | `-CXXConstructExpr 0x55b71e10a950 <col:9> 'String' 'void ()'
|   | `-VarDecl 0x55b71e10a988 <col:2, col:15> col:15 used value 'String' callinit destroyed
|   |   `-CXXConstructExpr 0x55b71e10a9f0 <col:15> 'String' 'void ()'
|   |-DeclStmt 0x55b71e10ab00 <line:529:2, col:23>
|   | `-VarDecl 0x55b71e10aa60 <col:2, col:18> col:14 used x 'const char *' cinit
|   |   `-ImplicitCastExpr 0x55b71e10aae8 <col:18> 'const char *' <LValueToRValue>
|   |     `-DeclRefExpr 0x55b71e10aac8 <col:18> 'const char *' lvalue ParmVar 0x55b71e107c98 'begin' 'const char *'
|   |-DoStmt 0x55b71e10aed8 <line:530:2, line:532:15>
|   | |-CompoundStmt 0x55b71e10adf8 <line:530:5, line:532:2>
|   | | `-ExprWithCleanups 0x55b71e10ade0 <line:531:6, col:58> 'const char *' lvalue
|   | |   `-BinaryOperator 0x55b71e10adc0 <col:6, col:58> 'const char *' lvalue '='
|   | |     |-DeclRefExpr 0x55b71e10ab18 <col:6> 'const char *' lvalue Var 0x55b71e10aa60 'x' 'const char *'
|   | |     `-CallExpr 0x55b71e10ad10 <col:10, col:58> 'const char *'
|   | |       |-ImplicitCastExpr 0x55b71e10acf8 <col:10> 'const char *(*)(const String &, const char *, const char *, String *, String *, bool)' <FunctionToPointerDecay>
|   | |       | `-DeclRefExpr 0x55b71e10acb0 <col:10> 'const char *(const String &, const char *, const char *, String *, String *, bool)' lvalue CXXMethod 0x55b71e109560 'skip_anno' 'const char *(const String &, const char *, const char *, String *, String *, bool)'
|   | |       |-MaterializeTemporaryExpr 0x55b71e10ad78 <col:20, col:27> 'const String' lvalue
|   | |       | `-ImplicitCastExpr 0x55b71e10ad60 <col:20, col:27> 'const String' <NoOp>
|   | |       |   `-CXXBindTemporaryExpr 0x55b71e10abd0 <col:20, col:27> 'String' (CXXTemporary 0x55b71e10abd0)
|   | |       |     `-CXXTemporaryObjectExpr 0x55b71e10ab98 <col:20, col:27> 'String' 'void ()'
|   | |       |-ImplicitCastExpr 0x55b71e10ad90 <col:30> 'const char *' <LValueToRValue>
|   | |       | `-DeclRefExpr 0x55b71e10abf0 <col:30> 'const char *' lvalue Var 0x55b71e10aa60 'x' 'const char *'
|   | |       |-ImplicitCastExpr 0x55b71e10ada8 <col:33> 'const char *' <LValueToRValue>
|   | |       | `-DeclRefExpr 0x55b71e10ac10 <col:33> 'const char *' lvalue ParmVar 0x55b71e107d18 'end' 'const char *'
|   | |       |-UnaryOperator 0x55b71e10ac50 <col:38, col:39> 'String *' prefix '&' cannot overflow
|   | |       | `-DeclRefExpr 0x55b71e10ac30 <col:39> 'String' lvalue Var 0x55b71e10a8e8 'name' 'String'
|   | |       |-UnaryOperator 0x55b71e10ac88 <col:45, col:46> 'String *' prefix '&' cannot overflow
|   | |       | `-DeclRefExpr 0x55b71e10ac68 <col:46> 'String' lvalue Var 0x55b71e10a988 'value' 'String'
|   | |       `-CXXBoolLiteralExpr 0x55b71e10aca0 <col:53> 'bool' false
|   | `-ImplicitCastExpr 0x55b71e10aec0 <line:532:11> 'bool' <MemberPointerToBoolean>
|   |   `-ImplicitCastExpr 0x55b71e10aea8 <col:11> 'String::unspecified_bool_type':'int (String::*)() const' <UserDefinedConversion>
|   |     `-CXXMemberCallExpr 0x55b71e10ae88 <col:11> 'String::unspecified_bool_type':'int (String::*)() const'
|   |       `-MemberExpr 0x55b71e10ae58 <col:11> '<bound member function type>' .operator int (String::*)() const 0x55b71dc6fdb8
|   |         `-ImplicitCastExpr 0x55b71e10ae40 <col:11> 'const String' lvalue <NoOp>
|   |           `-DeclRefExpr 0x55b71e10ae10 <col:11> 'String' lvalue Var 0x55b71e10a8e8 'name' 'String'
|   `-ReturnStmt 0x55b71e10af30 <line:533:2, col:9>
|     `-ImplicitCastExpr 0x55b71e10af18 <col:9> 'const char *' <LValueToRValue>
|       `-DeclRefExpr 0x55b71e10aef8 <col:9> 'const char *' lvalue Var 0x55b71e10aa60 'x' 'const char *'
|-CXXMethodDecl 0x55b71e107f08 <line:543:5, line:550:5> line:543:19 used make_landmark_anno 'String (const String &)' static
| |-ParmVarDecl 0x55b71e107e78 <col:38, col:52> col:52 used x 'const String &'
| `-CompoundStmt 0x55b71e10b548 <col:55, line:550:5>
|   `-IfStmt 0x55b71e10b520 <line:544:2, line:549:20> has_else
|     |-BinaryOperator 0x55b71e10b180 <line:544:6, col:19> 'bool' '&&'
|     | |-ImplicitCastExpr 0x55b71e10b168 <col:6> 'bool' <MemberPointerToBoolean>
|     | | `-ImplicitCastExpr 0x55b71e10b150 <col:6> 'String::unspecified_bool_type':'int (String::*)() const' <UserDefinedConversion>
|     | |   `-CXXMemberCallExpr 0x55b71e10b130 <col:6> 'String::unspecified_bool_type':'int (String::*)() const'
|     | |     `-MemberExpr 0x55b71e10b100 <col:6> '<bound member function type>' .operator int (String::*)() const 0x55b71dc6fdb8
|     | |       `-DeclRefExpr 0x55b71e10afa0 <col:6> 'const String' lvalue ParmVar 0x55b71e107e78 'x' 'const String &'
|     | `-BinaryOperator 0x55b71e10b0e0 <col:11, col:19> 'bool' '=='
|     |   |-ImplicitCastExpr 0x55b71e10b0b0 <col:11, col:14> 'int' <IntegralCast>
|     |   | `-CXXOperatorCallExpr 0x55b71e10b060 <col:11, col:14> 'char'
|     |   |   |-ImplicitCastExpr 0x55b71e10b048 <col:12, col:14> 'char (*)(int) const' <FunctionToPointerDecay>
|     |   |   | `-DeclRefExpr 0x55b71e10b000 <col:12, col:14> 'char (int) const' lvalue CXXMethod 0x55b71dc87610 'operator[]' 'char (int) const'
|     |   |   |-DeclRefExpr 0x55b71e10afc0 <col:11> 'const String' lvalue ParmVar 0x55b71e107e78 'x' 'const String &'
|     |   |   `-IntegerLiteral 0x55b71e10afe0 <col:13> 'int' 0
|     |   `-ImplicitCastExpr 0x55b71e10b0c8 <col:19> 'int' <IntegralCast>
|     |     `-CharacterLiteral 0x55b71e10b098 <col:19> 'char' 123
|     |-ReturnStmt 0x55b71e10b1f0 <line:545:6, col:13>
|     | `-CXXConstructExpr 0x55b71e10b1c0 <col:13> 'String' 'void (const String &)'
|     |   `-DeclRefExpr 0x55b71e10b1a0 <col:13> 'const String' lvalue ParmVar 0x55b71e107e78 'x' 'const String &'
|     `-IfStmt 0x55b71e10b4f8 <line:546:7, line:549:20> has_else
|       |-ImplicitCastExpr 0x55b71e10b288 <line:546:11> 'bool' <MemberPointerToBoolean>
|       | `-ImplicitCastExpr 0x55b71e10b270 <col:11> 'String::unspecified_bool_type':'int (String::*)() const' <UserDefinedConversion>
|       |   `-CXXMemberCallExpr 0x55b71e10b250 <col:11> 'String::unspecified_bool_type':'int (String::*)() const'
|       |     `-MemberExpr 0x55b71e10b220 <col:11> '<bound member function type>' .operator int (String::*)() const 0x55b71dc6fdb8
|       |       `-DeclRefExpr 0x55b71e10b200 <col:11> 'const String' lvalue ParmVar 0x55b71e107e78 'x' 'const String &'
|       |-ReturnStmt 0x55b71e10b410 <line:547:6, col:29>
|       | `-ExprWithCleanups 0x55b71e10b3f8 <col:13, col:29> 'String'
|       |   `-CXXConstructExpr 0x55b71e10b3c8 <col:13, col:29> 'String' 'void (String &&)' elidable
|       |     `-MaterializeTemporaryExpr 0x55b71e10b3b0 <col:13, col:29> 'String' xvalue
|       |       `-CXXBindTemporaryExpr 0x55b71e10b390 <col:13, col:29> 'String' (CXXTemporary 0x55b71e10b390)
|       |         `-CallExpr 0x55b71e10b340 <col:13, col:29> 'String'
|       |           |-ImplicitCastExpr 0x55b71e10b328 <col:13> 'String (*)(const char *, const String &)' <FunctionToPointerDecay>
|       |           | `-DeclRefExpr 0x55b71e10b2a0 <col:13> 'String (const char *, const String &)' lvalue CXXMethod 0x55b71e1076b0 'make_anno' 'String (const char *, const String &)'
|       |           |-ImplicitCastExpr 0x55b71e10b370 <col:23> 'const char *' <ArrayToPointerDecay>
|       |           | `-StringLiteral 0x55b71e10b2c0 <col:23> 'const char [2]' lvalue "l"
|       |           `-DeclRefExpr 0x55b71e10b2e0 <col:28> 'const String' lvalue ParmVar 0x55b71e107e78 'x' 'const String &'
|       `-ReturnStmt 0x55b71e10b4e8 <line:549:6, col:20>
|         `-ExprWithCleanups 0x55b71e10b4d0 <col:13, col:20> 'String'
|           `-CXXConstructExpr 0x55b71e10b4a0 <col:13, col:20> 'String' 'void (String &&)' elidable
|             `-MaterializeTemporaryExpr 0x55b71e10b488 <col:13, col:20> 'String' xvalue
|               `-CXXBindTemporaryExpr 0x55b71e10b468 <col:13, col:20> 'String' (CXXTemporary 0x55b71e10b468)
|                 `-CXXTemporaryObjectExpr 0x55b71e10b430 <col:13, col:20> 'String' 'void ()'
|-CXXMethodDecl 0x55b71e1080d0 <line:559:5, col:76> col:19 clean_landmark 'String (const String &, bool)' static
| |-ParmVarDecl 0x55b71e107fc0 <col:34, col:48> col:48 landmark 'const String &'
| `-ParmVarDecl 0x55b71e108038 <col:58, col:71> col:63 colon 'bool' cinit
|   `-CXXBoolLiteralExpr 0x55b71e109808 <col:71> 'bool' false
|-CXXRecordDecl 0x55b71e108180 <line:563:5, col:12> col:12 referenced struct Conversion
|-TypedefDecl 0x55b71e108478 <line:564:5, col:60> col:22 referenced ConversionFunction 'String (*)(int, __va_list_tag *)'
| `-PointerType 0x55b71e108410 'String (*)(int, __va_list_tag *)'
|   `-ParenType 0x55b71e1083b0 'String (int, __va_list_tag *)' sugar
|     `-FunctionProtoType 0x55b71e108370 'String (int, __va_list_tag *)' cdecl
|       |-RecordType 0x55b71dc6c630 'String'
|       | `-CXXRecord 0x55b71dc6c5a0 'String'
|       |-BuiltinType 0x55b71d92f580 'int'
|       `-DecayedType 0x55b71e0727e0 '__va_list_tag *' sugar
|         |-TypedefType 0x55b71e0727b0 'va_list' sugar
|         | |-Typedef 0x55b71db56430 'va_list'
|         | `-TypedefType 0x55b71db563e0 '__gnuc_va_list' sugar
|         |   |-Typedef 0x55b71da8dff8 '__gnuc_va_list'
|         |   `-TypedefType 0x55b71da8df60 '__builtin_va_list' sugar
|         |     |-Typedef 0x55b71d970d38 '__builtin_va_list'
|         |     `-ConstantArrayType 0x55b71d970ce0 '__va_list_tag [1]' 1 
|         |       `-RecordType 0x55b71d9302d0 '__va_list_tag'
|         |         `-CXXRecord 0x55b71d930238 '__va_list_tag'
|         `-PointerType 0x55b71db5c530 '__va_list_tag *'
|           `-RecordType 0x55b71d9302d0 '__va_list_tag'
|             `-CXXRecord 0x55b71d930238 '__va_list_tag'
|-EnumDecl 0x55b71e1084d0 <line:565:5, line:576:5> line:565:10 ConversionFlags
| |-EnumConstantDecl 0x55b71e1085d0 <line:566:2, col:16> col:2 cf_zero_pad 'ErrorHandler::ConversionFlags'
| | `-ImplicitCastExpr 0x55b71e108b30 <col:16> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71e1085b0 <col:16> 'int' Int: 1
| |     `-IntegerLiteral 0x55b71e108590 <col:16> 'int' 1
| |-EnumConstantDecl 0x55b71e108660 <line:567:2, col:21> col:2 cf_plus_positive 'ErrorHandler::ConversionFlags'
| | `-ImplicitCastExpr 0x55b71e108b48 <col:21> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71e108640 <col:21> 'int' Int: 2
| |     `-IntegerLiteral 0x55b71e108620 <col:21> 'int' 2
| |-EnumConstantDecl 0x55b71e1086f0 <line:568:2, col:22> col:2 cf_space_positive 'ErrorHandler::ConversionFlags'
| | `-ImplicitCastExpr 0x55b71e108b60 <col:22> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71e1086d0 <col:22> 'int' Int: 4
| |     `-IntegerLiteral 0x55b71e1086b0 <col:22> 'int' 4
| |-EnumConstantDecl 0x55b71e108780 <line:569:2, col:17> col:2 cf_left_just 'ErrorHandler::ConversionFlags'
| | `-ImplicitCastExpr 0x55b71e108b78 <col:17> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71e108760 <col:17> 'int' Int: 8
| |     `-IntegerLiteral 0x55b71e108740 <col:17> 'int' 8
| |-EnumConstantDecl 0x55b71e108810 <line:570:2, col:22> col:2 cf_alternate_form 'ErrorHandler::ConversionFlags'
| | `-ImplicitCastExpr 0x55b71e108b90 <col:22> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71e1087f0 <col:22> 'int' Int: 16
| |     `-IntegerLiteral 0x55b71e1087d0 <col:22> 'int' 16
| |-EnumConstantDecl 0x55b71e1088a0 <line:571:2, col:19> col:2 cf_singlequote 'ErrorHandler::ConversionFlags'
| | `-ImplicitCastExpr 0x55b71e108ba8 <col:19> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71e108880 <col:19> 'int' Int: 32
| |     `-IntegerLiteral 0x55b71e108860 <col:19> 'int' 32
| |-EnumConstantDecl 0x55b71e108930 <line:572:2, col:17> col:2 cf_uppercase 'ErrorHandler::ConversionFlags'
| | `-ImplicitCastExpr 0x55b71e108bc0 <col:17> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71e108910 <col:17> 'int' Int: 64
| |     `-IntegerLiteral 0x55b71e1088f0 <col:17> 'int' 64
| |-EnumConstantDecl 0x55b71e1089c0 <line:573:2, col:14> col:2 cf_signed 'ErrorHandler::ConversionFlags'
| | `-ImplicitCastExpr 0x55b71e108bd8 <col:14> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71e1089a0 <col:14> 'int' Int: 128
| |     `-IntegerLiteral 0x55b71e108980 <col:14> 'int' 128
| |-EnumConstantDecl 0x55b71e108a50 <line:574:2, col:16> col:2 cf_negative 'ErrorHandler::ConversionFlags'
| | `-ImplicitCastExpr 0x55b71e108bf0 <col:16> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71e108a30 <col:16> 'int' Int: 256
| |     `-IntegerLiteral 0x55b71e108a10 <col:16> 'int' 256
| `-EnumConstantDecl 0x55b71e108ae0 <line:575:2, col:12> col:2 cf_utf8 'ErrorHandler::ConversionFlags'
|   `-ImplicitCastExpr 0x55b71e108c08 <col:12> 'unsigned int' <IntegralCast>
|     `-ConstantExpr 0x55b71e108ac0 <col:12> 'int' Int: 1024
|       `-IntegerLiteral 0x55b71e108aa0 <col:12> 'int' 1024
|-CXXMethodDecl 0x55b71e108e18 <line:577:5, col:82> col:24 add_conversion 'ErrorHandler::Conversion *(const String &, ErrorHandler::ConversionFunction)' static
| |-ParmVarDecl 0x55b71e108c30 <col:39, col:53> col:53 name 'const String &'
| `-ParmVarDecl 0x55b71e108cd0 <col:59, col:78> col:78 func 'ErrorHandler::ConversionFunction':'String (*)(int, __va_list_tag *)'
|-CXXMethodDecl 0x55b71e108fa0 <line:578:5, col:56> col:16 remove_conversion 'int (ErrorHandler::Conversion *)' static
| `-ParmVarDecl 0x55b71e108ed8 <col:34, col:46> col:46 conversion 'ErrorHandler::Conversion *'
|-AccessSpecDecl 0x55b71e109048 <line:580:3, col:10> col:3 private
|-FieldDecl 0x55b71e109088 <line:582:5, col:9> col:9 referenced _nerrors 'int'
|-VarDecl 0x55b71e1090e8 <line:584:5, col:26> col:26 used the_default_handler 'ErrorHandler *' static
|-VarDecl 0x55b71e109160 <line:585:5, col:26> col:26 used the_silent_handler 'ErrorHandler *' static
|-CXXMethodDecl 0x55b71e109560 <line:587:5, line:590:14> line:587:24 used skip_anno 'const char *(const String &, const char *, const char *, String *, String *, bool)' static
| |-ParmVarDecl 0x55b71e1091d8 <col:34, col:48> col:48 str 'const String &'
| |-ParmVarDecl 0x55b71e109258 <line:588:6, col:18> col:18 begin 'const char *'
| |-ParmVarDecl 0x55b71e1092d8 <col:25, col:37> col:37 end 'const char *'
| |-ParmVarDecl 0x55b71e109350 <line:589:6, col:14> col:14 name_result 'String *'
| |-ParmVarDecl 0x55b71e1093c8 <col:27, col:35> col:35 value_result 'String *'
| `-ParmVarDecl 0x55b71e109440 <line:590:6, col:11> col:11 raw 'bool'
|-CXXMethodDecl 0x55b71e109688 <line:90:7> col:7 implicit operator= 'ErrorHandler &(const ErrorHandler &)' inline default noexcept-unevaluated 0x55b71e109688
| `-ParmVarDecl 0x55b71e109798 <col:7> col:7 'const ErrorHandler &'
`-CXXConstructorDecl 0x55b71e10b8a8 <col:7> col:7 implicit constexpr ErrorHandler 'void (const ErrorHandler &)' inline default noexcept-unevaluated 0x55b71e10b8a8
  `-ParmVarDecl 0x55b71e10b9b8 <col:7> col:7 'const ErrorHandler &'

Layout: <CGRecordLayout
  LLVMType:%class.ErrorHandler = type <{ i32 (...)**, i32, [4 x i8] }>
  NonVirtualBaseLLVMType:%class.ErrorHandler.base = type <{ i32 (...)**, i32 }>
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x55b71de9fad0 <../dummy_inc/click/handler.hh:290:5, line:293:5> line:290:5 union definition
|-DefinitionData pass_in_registers aggregate standard_layout trivially_copyable pod trivial literal has_variant_members
| |-DefaultConstructor exists trivial
| |-CopyConstructor simple trivial has_const_param implicit_has_const_param
| |-MoveConstructor exists simple trivial
| |-CopyAssignment trivial has_const_param implicit_has_const_param
| |-MoveAssignment exists simple trivial
| `-Destructor simple irrelevant trivial
|-FieldDecl 0x55b71de9fc20 <line:291:2, col:18> col:18 h 'HandlerCallback':'int (*)(int, String &, Element *, const Handler *, ErrorHandler *)'
|-FieldDecl 0x55b71de9fca0 <line:292:2, col:22> col:22 referenced r 'ReadHandlerCallback':'String (*)(Element *, void *)'
|-CXXConstructorDecl 0x55b71dea0a98 <line:290:5> col:5 implicit constexpr  'void (const Handler::(anonymous union at ../dummy_inc/click/handler.hh:290:5) &)' inline default trivial noexcept-unevaluated 0x55b71dea0a98
| `-ParmVarDecl 0x55b71dea0ba8 <col:5> col:5 'const Handler::(anonymous union at ../dummy_inc/click/handler.hh:290:5) &'
|-CXXConstructorDecl 0x55b71dea0c48 <col:5> col:5 implicit constexpr  'void (Handler::(anonymous union at ../dummy_inc/click/handler.hh:290:5) &&)' inline default trivial noexcept-unevaluated 0x55b71dea0c48
| `-ParmVarDecl 0x55b71dea0d58 <col:5> col:5 'Handler::(anonymous union at ../dummy_inc/click/handler.hh:290:5) &&'
|-CXXDestructorDecl 0x55b71dea0dc8 <col:5> col:5 implicit ~ 'void ()' inline default trivial noexcept-unevaluated 0x55b71dea0dc8
|-CXXMethodDecl 0x55b71dea1698 <col:5> col:5 implicit constexpr operator= 'Handler::(anonymous union at ../dummy_inc/click/handler.hh:290:5) &(const Handler::(anonymous union at ../dummy_inc/click/handler.hh:290:5) &)' inline default trivial noexcept-unevaluated 0x55b71dea1698
| `-ParmVarDecl 0x55b71dea17a8 <col:5> col:5 'const Handler::(anonymous union at ../dummy_inc/click/handler.hh:290:5) &'
|-CXXMethodDecl 0x55b71dea1818 <col:5> col:5 implicit constexpr operator= 'Handler::(anonymous union at ../dummy_inc/click/handler.hh:290:5) &(Handler::(anonymous union at ../dummy_inc/click/handler.hh:290:5) &&)' inline default trivial noexcept-unevaluated 0x55b71dea1818
| `-ParmVarDecl 0x55b71dea1928 <col:5> col:5 'Handler::(anonymous union at ../dummy_inc/click/handler.hh:290:5) &&'
`-CXXConstructorDecl 0x55b71e1ee0f8 <col:5> col:5 implicit used  'void () noexcept' inline default trivial
  `-CompoundStmt 0x55b71e1ee1d0 <col:5>

Layout: <CGRecordLayout
  LLVMType:%union.anon = type { i32 (i32, %class.String*, %class.Element*, %class.Handler*, %class.ErrorHandler*)* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x55b71de9fdd0 <../dummy_inc/click/handler.hh:294:5, line:297:5> line:294:5 union definition
|-DefinitionData pass_in_registers aggregate standard_layout trivially_copyable pod trivial literal has_variant_members
| |-DefaultConstructor exists trivial
| |-CopyConstructor simple trivial has_const_param implicit_has_const_param
| |-MoveConstructor exists simple trivial
| |-CopyAssignment trivial has_const_param implicit_has_const_param
| |-MoveAssignment exists simple trivial
| `-Destructor simple irrelevant trivial
|-FieldDecl 0x55b71de9fef8 <line:295:2, col:18> col:18 h 'HandlerCallback':'int (*)(int, String &, Element *, const Handler *, ErrorHandler *)'
|-FieldDecl 0x55b71de9ff80 <line:296:2, col:23> col:23 referenced w 'WriteHandlerCallback':'int (*)(const String &, Element *, void *, ErrorHandler *)'
|-CXXConstructorDecl 0x55b71dea0ef8 <line:294:5> col:5 implicit constexpr  'void (const Handler::(anonymous union at ../dummy_inc/click/handler.hh:294:5) &)' inline default trivial noexcept-unevaluated 0x55b71dea0ef8
| `-ParmVarDecl 0x55b71dea1008 <col:5> col:5 'const Handler::(anonymous union at ../dummy_inc/click/handler.hh:294:5) &'
|-CXXConstructorDecl 0x55b71dea10a8 <col:5> col:5 implicit constexpr  'void (Handler::(anonymous union at ../dummy_inc/click/handler.hh:294:5) &&)' inline default trivial noexcept-unevaluated 0x55b71dea10a8
| `-ParmVarDecl 0x55b71dea11b8 <col:5> col:5 'Handler::(anonymous union at ../dummy_inc/click/handler.hh:294:5) &&'
|-CXXDestructorDecl 0x55b71dea1228 <col:5> col:5 implicit ~ 'void ()' inline default trivial noexcept-unevaluated 0x55b71dea1228
|-CXXMethodDecl 0x55b71dea19c8 <col:5> col:5 implicit constexpr operator= 'Handler::(anonymous union at ../dummy_inc/click/handler.hh:294:5) &(const Handler::(anonymous union at ../dummy_inc/click/handler.hh:294:5) &)' inline default trivial noexcept-unevaluated 0x55b71dea19c8
| `-ParmVarDecl 0x55b71dea1ad8 <col:5> col:5 'const Handler::(anonymous union at ../dummy_inc/click/handler.hh:294:5) &'
|-CXXMethodDecl 0x55b71dea1b48 <col:5> col:5 implicit constexpr operator= 'Handler::(anonymous union at ../dummy_inc/click/handler.hh:294:5) &(Handler::(anonymous union at ../dummy_inc/click/handler.hh:294:5) &&)' inline default trivial noexcept-unevaluated 0x55b71dea1b48
| `-ParmVarDecl 0x55b71dea1c58 <col:5> col:5 'Handler::(anonymous union at ../dummy_inc/click/handler.hh:294:5) &&'
`-CXXConstructorDecl 0x55b71e1ee230 <col:5> col:5 implicit used  'void () noexcept' inline default trivial
  `-CompoundStmt 0x55b71e1ee310 <col:5>

Layout: <CGRecordLayout
  LLVMType:%union.anon.11 = type { i32 (i32, %class.String*, %class.Element*, %class.Handler*, %class.ErrorHandler*)* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x55b71de9b458 prev 0x55b71de9a960 <../dummy_inc/click/handler.hh:19:1, line:313:1> line:19:7 referenced class Handler definition
|-DefinitionData standard_layout has_user_declared_ctor has_mutable_fields can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor simple non_trivial has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveConstructor exists simple non_trivial needs_overload_resolution
| |-CopyAssignment non_trivial has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveAssignment exists simple non_trivial needs_overload_resolution
| `-Destructor simple non_trivial needs_overload_resolution
|-CXXRecordDecl 0x55b71de9b550 <col:1, col:7> col:7 implicit referenced class Handler
|-AccessSpecDecl 0x55b71de9b5e0 <col:17, col:23> col:17 public
|-EnumDecl 0x55b71de9b608 <line:21:5, line:59:5> line:21:10 Flags
| |-EnumConstantDecl 0x55b71de9b710 <line:22:2, col:11> col:2 referenced f_read 'Handler::Flags'
| | `-ImplicitCastExpr 0x55b71de9c460 <col:11> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71de9b6f0 <col:11> 'int' Int: 1
| |     `-IntegerLiteral 0x55b71de9b6d0 <col:11> 'int' 1
| |-EnumConstantDecl 0x55b71de9b7a0 <line:23:2, col:12> col:2 referenced f_write 'Handler::Flags'
| | `-ImplicitCastExpr 0x55b71de9c478 <col:12> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71de9b780 <col:12> 'int' Int: 2
| |     `-IntegerLiteral 0x55b71de9b760 <col:12> 'int' 2
| |-EnumConstantDecl 0x55b71de9b830 <line:24:2, col:17> col:2 referenced f_read_param 'Handler::Flags'
| | `-ImplicitCastExpr 0x55b71de9c490 <col:17> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71de9b810 <col:17> 'int' Int: 4
| |     `-IntegerLiteral 0x55b71de9b7f0 <col:17> 'int' 4
| |-EnumConstantDecl 0x55b71de9b8c0 <line:25:2, col:16> col:2 referenced f_exclusive 'Handler::Flags'
| | `-ImplicitCastExpr 0x55b71de9c4a8 <col:16> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71de9b8a0 <col:16> 'int' Int: 0
| |     `-IntegerLiteral 0x55b71de9b880 <col:16> 'int' 0
| |-EnumConstantDecl 0x55b71de9b950 <line:28:2, col:19> col:2 referenced f_nonexclusive 'Handler::Flags'
| | `-ImplicitCastExpr 0x55b71de9c4c0 <col:19> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71de9b930 <col:19> 'int' Int: 32
| |     `-IntegerLiteral 0x55b71de9b910 <col:19> 'int' 32
| |-EnumConstantDecl 0x55b71de9b9e0 <line:31:2, col:10> col:2 referenced f_raw 'Handler::Flags'
| | `-ImplicitCastExpr 0x55b71de9c4d8 <col:10> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71de9b9c0 <col:10> 'int' Int: 64
| |     `-IntegerLiteral 0x55b71de9b9a0 <col:10> 'int' 64
| |-EnumConstantDecl 0x55b71de9ba70 <line:32:2, col:19> col:2 referenced f_read_private 'Handler::Flags'
| | `-ImplicitCastExpr 0x55b71de9c4f0 <col:19> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71de9ba50 <col:19> 'int' Int: 128
| |     `-IntegerLiteral 0x55b71de9ba30 <col:19> 'int' 128
| |-EnumConstantDecl 0x55b71de9bb00 <line:34:2, col:20> col:2 referenced f_write_private 'Handler::Flags'
| | `-ImplicitCastExpr 0x55b71de9c508 <col:20> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71de9bae0 <col:20> 'int' Int: 256
| |     `-IntegerLiteral 0x55b71de9bac0 <col:20> 'int' 256
| |-EnumConstantDecl 0x55b71de9bb90 <line:36:2, col:17> col:2 referenced f_deprecated 'Handler::Flags'
| | `-ImplicitCastExpr 0x55b71de9c520 <col:17> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71de9bb70 <col:17> 'int' Int: 512
| |     `-IntegerLiteral 0x55b71de9bb50 <col:17> 'int' 512
| |-EnumConstantDecl 0x55b71de9bc20 <line:38:2, col:15> col:2 referenced f_uncommon 'Handler::Flags'
| | `-ImplicitCastExpr 0x55b71de9c538 <col:15> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71de9bc00 <col:15> 'int' Int: 1024
| |     `-IntegerLiteral 0x55b71de9bbe0 <col:15> 'int' 1024
| |-EnumConstantDecl 0x55b71de9bcb0 <line:40:2, col:11> col:2 referenced f_calm 'Handler::Flags'
| | `-ImplicitCastExpr 0x55b71de9c550 <col:11> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71de9bc90 <col:11> 'int' Int: 2048
| |     `-IntegerLiteral 0x55b71de9bc70 <col:11> 'int' 2048
| |-EnumConstantDecl 0x55b71de9bd40 <line:41:2, col:16> col:2 referenced f_expensive 'Handler::Flags'
| | `-ImplicitCastExpr 0x55b71de9c568 <col:16> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71de9bd20 <col:16> 'int' Int: 4096
| |     `-IntegerLiteral 0x55b71de9bd00 <col:16> 'int' 4096
| |-EnumConstantDecl 0x55b71de9bdd0 <line:42:2, col:13> col:2 referenced f_button 'Handler::Flags'
| | `-ImplicitCastExpr 0x55b71de9c580 <col:13> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71de9bdb0 <col:13> 'int' Int: 8192
| |     `-IntegerLiteral 0x55b71de9bd90 <col:13> 'int' 8192
| |-EnumConstantDecl 0x55b71de9be60 <line:43:2, col:15> col:2 referenced f_checkbox 'Handler::Flags'
| | `-ImplicitCastExpr 0x55b71de9c598 <col:15> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71de9be40 <col:15> 'int' Int: 16384
| |     `-IntegerLiteral 0x55b71de9be20 <col:15> 'int' 16384
| |-EnumConstantDecl 0x55b71de9bf30 <line:45:2, col:20> col:2 referenced f_driver0 'Handler::Flags'
| | `-ConstantExpr 0x55b71de9bf10 <col:14, col:20> 'unsigned int' Int: 67108864
| |   `-BinaryOperator 0x55b71de9bef0 <col:14, col:20> 'unsigned int' '<<'
| |     |-IntegerLiteral 0x55b71de9beb0 <col:14> 'unsigned int' 1
| |     `-IntegerLiteral 0x55b71de9bed0 <col:20> 'int' 26
| |-EnumConstantDecl 0x55b71de9c000 <line:46:9, col:27> col:9 referenced f_driver1 'Handler::Flags'
| | `-ConstantExpr 0x55b71de9bfe0 <col:21, col:27> 'unsigned int' Int: 134217728
| |   `-BinaryOperator 0x55b71de9bfc0 <col:21, col:27> 'unsigned int' '<<'
| |     |-IntegerLiteral 0x55b71de9bf80 <col:21> 'unsigned int' 1
| |     `-IntegerLiteral 0x55b71de9bfa0 <col:27> 'int' 27
| |-EnumConstantDecl 0x55b71de9c090 <line:48:2, col:17> col:2 referenced f_user_shift 'Handler::Flags'
| | `-ImplicitCastExpr 0x55b71de9c5b0 <col:17> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71de9c070 <col:17> 'int' Int: 28
| |     `-IntegerLiteral 0x55b71de9c050 <col:17> 'int' 28
| |-EnumConstantDecl 0x55b71de9c160 <line:49:2, col:18> col:2 referenced f_user0 'Handler::Flags'
| | `-ConstantExpr 0x55b71de9c140 <col:12, col:18> 'unsigned int' Int: 268435456
| |   `-BinaryOperator 0x55b71de9c120 <col:12, col:18> 'unsigned int' '<<'
| |     |-IntegerLiteral 0x55b71de9c0e0 <col:12> 'unsigned int' 1
| |     `-DeclRefExpr 0x55b71de9c100 <col:18> 'int' EnumConstant 0x55b71de9c090 'f_user_shift' 'Handler::Flags'
| |-EnumConstantDecl 0x55b71de9c1f0 <line:54:2, col:25> col:2 referenced f_read_comprehensive 'Handler::Flags'
| | `-ImplicitCastExpr 0x55b71de9c5c8 <col:25> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71de9c1d0 <col:25> 'int' Int: 8
| |     `-IntegerLiteral 0x55b71de9c1b0 <col:25> 'int' 8
| |-EnumConstantDecl 0x55b71de9c280 <line:55:2, col:26> col:2 referenced f_write_comprehensive 'Handler::Flags'
| | `-ImplicitCastExpr 0x55b71de9c5e0 <col:26> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71de9c260 <col:26> 'int' Int: 16
| |     `-IntegerLiteral 0x55b71de9c240 <col:26> 'int' 16
| `-EnumConstantDecl 0x55b71de9c410 <line:56:2, col:71> col:2 referenced f_special 'Handler::Flags'
|   `-ImplicitCastExpr 0x55b71de9c5f8 <col:14, col:71> 'unsigned int' <IntegralCast>
|     `-ConstantExpr 0x55b71de9c3f0 <col:14, col:71> 'int' Int: 31
|       `-BinaryOperator 0x55b71de9c3d0 <col:14, col:71> 'int' '|'
|         |-BinaryOperator 0x55b71de9c390 <col:14, col:48> 'int' '|'
|         | |-BinaryOperator 0x55b71de9c350 <col:14, col:33> 'int' '|'
|         | | |-BinaryOperator 0x55b71de9c310 <col:14, col:23> 'int' '|'
|         | | | |-DeclRefExpr 0x55b71de9c2d0 <col:14> 'int' EnumConstant 0x55b71de9b710 'f_read' 'Handler::Flags'
|         | | | `-DeclRefExpr 0x55b71de9c2f0 <col:23> 'int' EnumConstant 0x55b71de9b7a0 'f_write' 'Handler::Flags'
|         | | `-DeclRefExpr 0x55b71de9c330 <col:33> 'int' EnumConstant 0x55b71de9b830 'f_read_param' 'Handler::Flags'
|         | `-DeclRefExpr 0x55b71de9c370 <col:48> 'int' EnumConstant 0x55b71de9c1f0 'f_read_comprehensive' 'Handler::Flags'
|         `-DeclRefExpr 0x55b71de9c3b0 <col:71> 'int' EnumConstant 0x55b71de9c280 'f_write_comprehensive' 'Handler::Flags'
|-CXXMethodDecl 0x55b71de9c658 <line:62:5, line:64:5> line:62:26 name 'const String &() const' inline
| `-CompoundStmt 0x55b71dea2088 <col:39, line:64:5>
|   `-ReturnStmt 0x55b71dea2078 <line:63:2, col:9>
|     `-MemberExpr 0x55b71dea2048 <col:9> 'const String' lvalue ->_name 0x55b71de9fa80
|       `-CXXThisExpr 0x55b71dea2038 <col:9> 'const Handler *' implicit this
|-CXXMethodDecl 0x55b71de9c718 <line:69:5, line:71:5> line:69:21 flags 'uint32_t () const' inline
| `-CompoundStmt 0x55b71dea2108 <col:35, line:71:5>
|   `-ReturnStmt 0x55b71dea20f8 <line:70:2, col:9>
|     `-ImplicitCastExpr 0x55b71dea20e0 <col:9> 'uint32_t':'unsigned int' <LValueToRValue>
|       `-MemberExpr 0x55b71dea20b0 <col:9> 'const uint32_t':'const unsigned int' lvalue ->_flags 0x55b71dea0190
|         `-CXXThisExpr 0x55b71dea20a0 <col:9> 'const Handler *' implicit this
|-CXXMethodDecl 0x55b71de9c868 <line:75:5, line:77:5> line:75:18 user_data 'void *(int) const' inline
| |-ParmVarDecl 0x55b71de9c7d0 <col:28, col:32> col:32 used op 'int'
| `-CompoundStmt 0x55b71dea2288 <col:42, line:77:5>
|   `-ReturnStmt 0x55b71dea2278 <line:76:2, col:44>
|     `-ImplicitCastExpr 0x55b71dea2260 <col:9, col:44> 'void *' <LValueToRValue>
|       `-ConditionalOperator 0x55b71dea2230 <col:9, col:44> 'void *const' lvalue
|         |-BinaryOperator 0x55b71dea2190 <col:9, col:15> 'bool' '=='
|         | |-ImplicitCastExpr 0x55b71dea2160 <col:9> 'int' <LValueToRValue>
|         | | `-DeclRefExpr 0x55b71dea2120 <col:9> 'int' lvalue ParmVar 0x55b71de9c7d0 'op' 'int'
|         | `-ImplicitCastExpr 0x55b71dea2178 <col:15> 'int' <IntegralCast>
|         |   `-DeclRefExpr 0x55b71dea2140 <col:15> 'Handler::Flags' EnumConstant 0x55b71de9b7a0 'f_write' 'Handler::Flags'
|         |-MemberExpr 0x55b71dea21c0 <col:25> 'void *const' lvalue ->_write_user_data 0x55b71dea0130
|         | `-CXXThisExpr 0x55b71dea21b0 <col:25> 'const Handler *' implicit this
|         `-MemberExpr 0x55b71dea2200 <col:44> 'void *const' lvalue ->_read_user_data 0x55b71dea00c8
|           `-CXXThisExpr 0x55b71dea21f0 <col:44> 'const Handler *' implicit this
|-CXXMethodDecl 0x55b71de9c938 <line:80:5, line:82:5> line:80:18 read_user_data 'void *() const' inline
| `-CompoundStmt 0x55b71dea2308 <col:41, line:82:5>
|   `-ReturnStmt 0x55b71dea22f8 <line:81:2, col:9>
|     `-ImplicitCastExpr 0x55b71dea22e0 <col:9> 'void *' <LValueToRValue>
|       `-MemberExpr 0x55b71dea22b0 <col:9> 'void *const' lvalue ->_read_user_data 0x55b71dea00c8
|         `-CXXThisExpr 0x55b71dea22a0 <col:9> 'const Handler *' implicit this
|-CXXMethodDecl 0x55b71de9ca00 <line:85:5, line:87:5> line:85:18 write_user_data 'void *() const' inline
| `-CompoundStmt 0x55b71dea2388 <col:42, line:87:5>
|   `-ReturnStmt 0x55b71dea2378 <line:86:2, col:9>
|     `-ImplicitCastExpr 0x55b71dea2360 <col:9> 'void *' <LValueToRValue>
|       `-MemberExpr 0x55b71dea2330 <col:9> 'void *const' lvalue ->_write_user_data 0x55b71dea0130
|         `-CXXThisExpr 0x55b71dea2320 <col:9> 'const Handler *' implicit this
|-CXXMethodDecl 0x55b71de9cac8 <line:90:5, col:63> col:18 user_data1 'void *() const' inline
| `-DeprecatedAttr 0x55b71de9cb68 <col:52> "" ""
|-CXXMethodDecl 0x55b71de9cc00 <line:91:5, col:63> col:18 user_data2 'void *() const' inline
| `-DeprecatedAttr 0x55b71de9cca0 <col:52> "" ""
|-CXXMethodDecl 0x55b71de9cd30 <line:96:5, line:98:5> line:96:17 readable 'bool () const' inline
| `-CompoundStmt 0x55b71dea2478 <col:34, line:98:5>
|   `-ReturnStmt 0x55b71dea2468 <line:97:2, col:18>
|     `-ImplicitCastExpr 0x55b71dea2450 <col:9, col:18> 'bool' <IntegralToBoolean>
|       `-BinaryOperator 0x55b71dea2430 <col:9, col:18> 'unsigned int' '&'
|         |-ImplicitCastExpr 0x55b71dea2400 <col:9> 'uint32_t':'unsigned int' <LValueToRValue>
|         | `-MemberExpr 0x55b71dea23b0 <col:9> 'const uint32_t':'const unsigned int' lvalue ->_flags 0x55b71dea0190
|         |   `-CXXThisExpr 0x55b71dea23a0 <col:9> 'const Handler *' implicit this
|         `-ImplicitCastExpr 0x55b71dea2418 <col:18> 'unsigned int' <IntegralCast>
|           `-DeclRefExpr 0x55b71dea23e0 <col:18> 'Handler::Flags' EnumConstant 0x55b71de9b710 'f_read' 'Handler::Flags'
|-CXXMethodDecl 0x55b71de9cdf0 <line:102:5, line:104:5> line:102:17 read_param 'bool () const' inline
| `-CompoundStmt 0x55b71dea2568 <col:36, line:104:5>
|   `-ReturnStmt 0x55b71dea2558 <line:103:2, col:18>
|     `-ImplicitCastExpr 0x55b71dea2540 <col:9, col:18> 'bool' <IntegralToBoolean>
|       `-BinaryOperator 0x55b71dea2520 <col:9, col:18> 'unsigned int' '&'
|         |-ImplicitCastExpr 0x55b71dea24f0 <col:9> 'uint32_t':'unsigned int' <LValueToRValue>
|         | `-MemberExpr 0x55b71dea24a0 <col:9> 'const uint32_t':'const unsigned int' lvalue ->_flags 0x55b71dea0190
|         |   `-CXXThisExpr 0x55b71dea2490 <col:9> 'const Handler *' implicit this
|         `-ImplicitCastExpr 0x55b71dea2508 <col:18> 'unsigned int' <IntegralCast>
|           `-DeclRefExpr 0x55b71dea24d0 <col:18> 'Handler::Flags' EnumConstant 0x55b71de9b830 'f_read_param' 'Handler::Flags'
|-CXXMethodDecl 0x55b71de9ceb0 <line:111:5, line:113:5> line:111:17 used read_visible 'bool () const' inline
| `-CompoundStmt 0x55b71dea2748 <col:38, line:113:5>
|   `-ReturnStmt 0x55b71dea2738 <line:112:2, col:49>
|     `-BinaryOperator 0x55b71dea2718 <col:9, col:49> 'bool' '=='
|       |-ParenExpr 0x55b71dea26c0 <col:9, col:44> 'unsigned int'
|       | `-BinaryOperator 0x55b71dea26a0 <col:10, col:43> 'unsigned int' '&'
|       |   |-ImplicitCastExpr 0x55b71dea2670 <col:10> 'uint32_t':'unsigned int' <LValueToRValue>
|       |   | `-MemberExpr 0x55b71dea2590 <col:10> 'const uint32_t':'const unsigned int' lvalue ->_flags 0x55b71dea0190
|       |   |   `-CXXThisExpr 0x55b71dea2580 <col:10> 'const Handler *' implicit this
|       |   `-ImplicitCastExpr 0x55b71dea2688 <col:19, col:43> 'unsigned int' <IntegralCast>
|       |     `-ParenExpr 0x55b71dea2650 <col:19, col:43> 'int'
|       |       `-BinaryOperator 0x55b71dea2630 <col:20, col:29> 'int' '|'
|       |         |-ImplicitCastExpr 0x55b71dea2600 <col:20> 'int' <IntegralCast>
|       |         | `-DeclRefExpr 0x55b71dea25c0 <col:20> 'Handler::Flags' EnumConstant 0x55b71de9b710 'f_read' 'Handler::Flags'
|       |         `-ImplicitCastExpr 0x55b71dea2618 <col:29> 'int' <IntegralCast>
|       |           `-DeclRefExpr 0x55b71dea25e0 <col:29> 'Handler::Flags' EnumConstant 0x55b71de9ba70 'f_read_private' 'Handler::Flags'
|       `-ImplicitCastExpr 0x55b71dea2700 <col:49> 'unsigned int' <IntegralCast>
|         `-DeclRefExpr 0x55b71dea26e0 <col:49> 'Handler::Flags' EnumConstant 0x55b71de9b710 'f_read' 'Handler::Flags'
|-CXXMethodDecl 0x55b71de9cf70 <line:116:5, line:118:5> line:116:17 writable 'bool () const' inline
| `-CompoundStmt 0x55b71dea2838 <col:34, line:118:5>
|   `-ReturnStmt 0x55b71dea2828 <line:117:2, col:18>
|     `-ImplicitCastExpr 0x55b71dea2810 <col:9, col:18> 'bool' <IntegralToBoolean>
|       `-BinaryOperator 0x55b71dea27f0 <col:9, col:18> 'unsigned int' '&'
|         |-ImplicitCastExpr 0x55b71dea27c0 <col:9> 'uint32_t':'unsigned int' <LValueToRValue>
|         | `-MemberExpr 0x55b71dea2770 <col:9> 'const uint32_t':'const unsigned int' lvalue ->_flags 0x55b71dea0190
|         |   `-CXXThisExpr 0x55b71dea2760 <col:9> 'const Handler *' implicit this
|         `-ImplicitCastExpr 0x55b71dea27d8 <col:18> 'unsigned int' <IntegralCast>
|           `-DeclRefExpr 0x55b71dea27a0 <col:18> 'Handler::Flags' EnumConstant 0x55b71de9b7a0 'f_write' 'Handler::Flags'
|-CXXMethodDecl 0x55b71de9d030 <line:125:5, line:127:5> line:125:17 used write_visible 'bool () const' inline
| `-CompoundStmt 0x55b71dea2a18 <col:39, line:127:5>
|   `-ReturnStmt 0x55b71dea2a08 <line:126:2, col:51>
|     `-BinaryOperator 0x55b71dea29e8 <col:9, col:51> 'bool' '=='
|       |-ParenExpr 0x55b71dea2990 <col:9, col:46> 'unsigned int'
|       | `-BinaryOperator 0x55b71dea2970 <col:10, col:45> 'unsigned int' '&'
|       |   |-ImplicitCastExpr 0x55b71dea2940 <col:10> 'uint32_t':'unsigned int' <LValueToRValue>
|       |   | `-MemberExpr 0x55b71dea2860 <col:10> 'const uint32_t':'const unsigned int' lvalue ->_flags 0x55b71dea0190
|       |   |   `-CXXThisExpr 0x55b71dea2850 <col:10> 'const Handler *' implicit this
|       |   `-ImplicitCastExpr 0x55b71dea2958 <col:19, col:45> 'unsigned int' <IntegralCast>
|       |     `-ParenExpr 0x55b71dea2920 <col:19, col:45> 'int'
|       |       `-BinaryOperator 0x55b71dea2900 <col:20, col:30> 'int' '|'
|       |         |-ImplicitCastExpr 0x55b71dea28d0 <col:20> 'int' <IntegralCast>
|       |         | `-DeclRefExpr 0x55b71dea2890 <col:20> 'Handler::Flags' EnumConstant 0x55b71de9b7a0 'f_write' 'Handler::Flags'
|       |         `-ImplicitCastExpr 0x55b71dea28e8 <col:30> 'int' <IntegralCast>
|       |           `-DeclRefExpr 0x55b71dea28b0 <col:30> 'Handler::Flags' EnumConstant 0x55b71de9bb00 'f_write_private' 'Handler::Flags'
|       `-ImplicitCastExpr 0x55b71dea29d0 <col:51> 'unsigned int' <IntegralCast>
|         `-DeclRefExpr 0x55b71dea29b0 <col:51> 'Handler::Flags' EnumConstant 0x55b71de9b7a0 'f_write' 'Handler::Flags'
|-CXXMethodDecl 0x55b71de9d0f0 <line:130:5, line:132:5> line:130:17 visible 'bool () const' inline
| `-CompoundStmt 0x55b71dea2b20 <col:33, line:132:5>
|   `-ReturnStmt 0x55b71dea2b10 <line:131:2, col:41>
|     `-BinaryOperator 0x55b71dea2af0 <col:9, col:41> 'bool' '||'
|       |-CXXMemberCallExpr 0x55b71dea2a70 <col:9, col:22> 'bool'
|       | `-MemberExpr 0x55b71dea2a40 <col:9> '<bound member function type>' ->read_visible 0x55b71de9ceb0
|       |   `-CXXThisExpr 0x55b71dea2a30 <col:9> 'const Handler *' implicit this
|       `-CXXMemberCallExpr 0x55b71dea2ad0 <col:27, col:41> 'bool'
|         `-MemberExpr 0x55b71dea2aa0 <col:27> '<bound member function type>' ->write_visible 0x55b71de9d030
|           `-CXXThisExpr 0x55b71dea2a90 <col:27> 'const Handler *' implicit this
|-CXXMethodDecl 0x55b71de9d1b0 <line:136:5, line:138:5> line:136:17 allow_concurrent_handlers 'bool () const' inline
| `-CompoundStmt 0x55b71dea2c30 <col:51, line:138:5>
|   `-ReturnStmt 0x55b71dea2c20 <line:137:9, col:40>
|     `-ImplicitCastExpr 0x55b71dea2c08 <col:16, col:40> 'bool' <IntegralToBoolean>
|       `-ParenExpr 0x55b71dea2be8 <col:16, col:40> 'unsigned int'
|         `-BinaryOperator 0x55b71dea2bc8 <col:17, col:26> 'unsigned int' '&'
|           |-ImplicitCastExpr 0x55b71dea2b98 <col:17> 'uint32_t':'unsigned int' <LValueToRValue>
|           | `-MemberExpr 0x55b71dea2b48 <col:17> 'const uint32_t':'const unsigned int' lvalue ->_flags 0x55b71dea0190
|           |   `-CXXThisExpr 0x55b71dea2b38 <col:17> 'const Handler *' implicit this
|           `-ImplicitCastExpr 0x55b71dea2bb0 <col:26> 'unsigned int' <IntegralCast>
|             `-DeclRefExpr 0x55b71dea2b78 <col:26> 'Handler::Flags' EnumConstant 0x55b71de9b950 'f_nonexclusive' 'Handler::Flags'
|-CXXMethodDecl 0x55b71de9d270 <line:142:5, line:144:5> line:142:17 allow_concurrent_threads 'bool () const' inline
| `-CompoundStmt 0x55b71dea2d40 <col:50, line:144:5>
|   `-ReturnStmt 0x55b71dea2d30 <line:143:9, col:40>
|     `-ImplicitCastExpr 0x55b71dea2d18 <col:16, col:40> 'bool' <IntegralToBoolean>
|       `-ParenExpr 0x55b71dea2cf8 <col:16, col:40> 'unsigned int'
|         `-BinaryOperator 0x55b71dea2cd8 <col:17, col:26> 'unsigned int' '&'
|           |-ImplicitCastExpr 0x55b71dea2ca8 <col:17> 'uint32_t':'unsigned int' <LValueToRValue>
|           | `-MemberExpr 0x55b71dea2c58 <col:17> 'const uint32_t':'const unsigned int' lvalue ->_flags 0x55b71dea0190
|           |   `-CXXThisExpr 0x55b71dea2c48 <col:17> 'const Handler *' implicit this
|           `-ImplicitCastExpr 0x55b71dea2cc0 <col:26> 'unsigned int' <IntegralCast>
|             `-DeclRefExpr 0x55b71dea2c88 <col:26> 'Handler::Flags' EnumConstant 0x55b71de9b950 'f_nonexclusive' 'Handler::Flags'
|-CXXMethodDecl 0x55b71de9d330 <line:164:5, line:166:5> line:164:17 raw 'bool () const' inline
| `-CompoundStmt 0x55b71dea2e30 <col:29, line:166:5>
|   `-ReturnStmt 0x55b71dea2e20 <line:165:2, col:18>
|     `-ImplicitCastExpr 0x55b71dea2e08 <col:9, col:18> 'bool' <IntegralToBoolean>
|       `-BinaryOperator 0x55b71dea2de8 <col:9, col:18> 'unsigned int' '&'
|         |-ImplicitCastExpr 0x55b71dea2db8 <col:9> 'uint32_t':'unsigned int' <LValueToRValue>
|         | `-MemberExpr 0x55b71dea2d68 <col:9> 'const uint32_t':'const unsigned int' lvalue ->_flags 0x55b71dea0190
|         |   `-CXXThisExpr 0x55b71dea2d58 <col:9> 'const Handler *' implicit this
|         `-ImplicitCastExpr 0x55b71dea2dd0 <col:18> 'unsigned int' <IntegralCast>
|           `-DeclRefExpr 0x55b71dea2d98 <col:18> 'Handler::Flags' EnumConstant 0x55b71de9b9e0 'f_raw' 'Handler::Flags'
|-CXXMethodDecl 0x55b71de9d5b8 <line:177:5, col:75> col:12 used call_read 'String (Element *, const String &, ErrorHandler *) const'
| |-ParmVarDecl 0x55b71de9d3e0 <col:22, col:31> col:31 e 'Element *'
| |-ParmVarDecl 0x55b71de9d458 <col:34, col:48> col:48 param 'const String &'
| `-ParmVarDecl 0x55b71de9d4d0 <col:55, col:69> col:69 errh 'ErrorHandler *'
|-CXXMethodDecl 0x55b71de9d7c8 <line:186:5, line:188:5> line:186:19 call_read 'String (Element *, ErrorHandler *) const' inline
| |-ParmVarDecl 0x55b71de9d680 <col:29, col:38> col:38 used e 'Element *'
| |-ParmVarDecl 0x55b71de9d6f8 <col:41, col:62> col:55 used errh 'ErrorHandler *' cinit
| | `-ImplicitCastExpr 0x55b71dea1f70 <col:62> 'ErrorHandler *' <NullToPointer>
| |   `-IntegerLiteral 0x55b71dea1f50 <col:62> 'int' 0
| `-CompoundStmt 0x55b71dea30d0 <col:71, line:188:5>
|   `-ReturnStmt 0x55b71dea30c0 <line:187:2, col:36>
|     `-ExprWithCleanups 0x55b71dea30a8 <col:9, col:36> 'String'
|       `-CXXConstructExpr 0x55b71dea3078 <col:9, col:36> 'String' 'void (String &&)' elidable
|         `-MaterializeTemporaryExpr 0x55b71dea3060 <col:9, col:36> 'String' xvalue
|           `-CXXBindTemporaryExpr 0x55b71dea3040 <col:9, col:36> 'String' (CXXTemporary 0x55b71dea3040)
|             `-CXXMemberCallExpr 0x55b71dea2fa0 <col:9, col:36> 'String'
|               |-MemberExpr 0x55b71dea2f70 <col:9> '<bound member function type>' ->call_read 0x55b71de9d5b8
|               | `-CXXThisExpr 0x55b71dea2f60 <col:9> 'const Handler *' implicit this
|               |-ImplicitCastExpr 0x55b71dea2fd8 <col:19> 'Element *' <LValueToRValue>
|               | `-DeclRefExpr 0x55b71dea2eb8 <col:19> 'Element *' lvalue ParmVar 0x55b71de9d680 'e' 'Element *'
|               |-MaterializeTemporaryExpr 0x55b71dea3008 <col:22, col:29> 'const String' lvalue
|               | `-ImplicitCastExpr 0x55b71dea2ff0 <col:22, col:29> 'const String' <NoOp>
|               |   `-CXXBindTemporaryExpr 0x55b71dea2f20 <col:22, col:29> 'String' (CXXTemporary 0x55b71dea2f20)
|               |     `-CXXTemporaryObjectExpr 0x55b71dea2ee8 <col:22, col:29> 'String' 'void ()'
|               `-ImplicitCastExpr 0x55b71dea3020 <col:32> 'ErrorHandler *' <LValueToRValue>
|                 `-DeclRefExpr 0x55b71dea2f40 <col:32> 'ErrorHandler *' lvalue ParmVar 0x55b71de9d6f8 'errh' 'ErrorHandler *'
|-CXXMethodDecl 0x55b71de9da60 <line:198:5, col:73> col:9 call_write 'int (const String &, Element *, ErrorHandler *) const'
| |-ParmVarDecl 0x55b71de9d888 <col:20, col:34> col:34 value 'const String &'
| |-ParmVarDecl 0x55b71de9d900 <col:41, col:50> col:50 e 'Element *'
| `-ParmVarDecl 0x55b71de9d978 <col:53, col:67> col:67 errh 'ErrorHandler *'
|-CXXMethodDecl 0x55b71de9dbe8 <line:207:5, col:37> col:12 unparse_name 'String (Element *) const'
| `-ParmVarDecl 0x55b71de9db28 <col:25, col:34> col:34 e 'Element *'
|-CXXMethodDecl 0x55b71de9de18 <line:216:5, col:63> col:19 unparse_name 'String (Element *, const String &)' static
| |-ParmVarDecl 0x55b71de9dca0 <col:32, col:41> col:41 e 'Element *'
| `-ParmVarDecl 0x55b71de9dd18 <col:44, col:58> col:58 hname 'const String &'
|-CXXMethodDecl 0x55b71de9df30 <line:223:5, line:225:5> line:223:34 blank_handler 'const Handler *()' static inline
| `-CompoundStmt 0x55b71dea3130 <col:50, line:225:5>
|   `-ReturnStmt 0x55b71dea3120 <line:224:2, col:9>
|     `-ImplicitCastExpr 0x55b71dea3108 <col:9> 'const Handler *' <LValueToRValue>
|       `-DeclRefExpr 0x55b71dea30e8 <col:9> 'const Handler *' lvalue Var 0x55b71dea02c0 'the_blank_handler' 'const Handler *'
|-EnumDecl 0x55b71de9dfd0 <line:229:5, line:251:5> line:229:5
| |-EnumConstantDecl 0x55b71de9e0d0 <line:230:2, col:11> col:2 h_read 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55b71de9ec60 <col:11> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71de9e0b0 <col:11> 'Handler::Flags' Int: 1
| |     `-DeclRefExpr 0x55b71de9e090 <col:11> 'Handler::Flags' EnumConstant 0x55b71de9b710 'f_read' 'Handler::Flags'
| |-EnumConstantDecl 0x55b71de9e160 <line:231:2, col:12> col:2 h_write 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55b71de9ec78 <col:12> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71de9e140 <col:12> 'Handler::Flags' Int: 2
| |     `-DeclRefExpr 0x55b71de9e120 <col:12> 'Handler::Flags' EnumConstant 0x55b71de9b7a0 'f_write' 'Handler::Flags'
| |-EnumConstantDecl 0x55b71de9e1f0 <line:232:2, col:17> col:2 h_read_param 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55b71de9ec90 <col:17> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71de9e1d0 <col:17> 'Handler::Flags' Int: 4
| |     `-DeclRefExpr 0x55b71de9e1b0 <col:17> 'Handler::Flags' EnumConstant 0x55b71de9b830 'f_read_param' 'Handler::Flags'
| |-EnumConstantDecl 0x55b71de9e280 <line:233:2, col:16> col:2 h_exclusive 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55b71de9eca8 <col:16> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71de9e260 <col:16> 'Handler::Flags' Int: 0
| |     `-DeclRefExpr 0x55b71de9e240 <col:16> 'Handler::Flags' EnumConstant 0x55b71de9b8c0 'f_exclusive' 'Handler::Flags'
| |-EnumConstantDecl 0x55b71de9e310 <line:234:2, col:19> col:2 h_nonexclusive 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55b71de9ecc0 <col:19> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71de9e2f0 <col:19> 'Handler::Flags' Int: 32
| |     `-DeclRefExpr 0x55b71de9e2d0 <col:19> 'Handler::Flags' EnumConstant 0x55b71de9b950 'f_nonexclusive' 'Handler::Flags'
| |-EnumConstantDecl 0x55b71de9e3a0 <line:235:2, col:10> col:2 h_raw 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55b71de9ecd8 <col:10> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71de9e380 <col:10> 'Handler::Flags' Int: 64
| |     `-DeclRefExpr 0x55b71de9e360 <col:10> 'Handler::Flags' EnumConstant 0x55b71de9b9e0 'f_raw' 'Handler::Flags'
| |-EnumConstantDecl 0x55b71de9e430 <line:236:2, col:19> col:2 h_read_private 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55b71de9ecf0 <col:19> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71de9e410 <col:19> 'Handler::Flags' Int: 128
| |     `-DeclRefExpr 0x55b71de9e3f0 <col:19> 'Handler::Flags' EnumConstant 0x55b71de9ba70 'f_read_private' 'Handler::Flags'
| |-EnumConstantDecl 0x55b71de9e4c0 <line:237:2, col:20> col:2 h_write_private 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55b71de9ed08 <col:20> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71de9e4a0 <col:20> 'Handler::Flags' Int: 256
| |     `-DeclRefExpr 0x55b71de9e480 <col:20> 'Handler::Flags' EnumConstant 0x55b71de9bb00 'f_write_private' 'Handler::Flags'
| |-EnumConstantDecl 0x55b71de9e550 <line:238:2, col:17> col:2 h_deprecated 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55b71de9ed20 <col:17> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71de9e530 <col:17> 'Handler::Flags' Int: 512
| |     `-DeclRefExpr 0x55b71de9e510 <col:17> 'Handler::Flags' EnumConstant 0x55b71de9bb90 'f_deprecated' 'Handler::Flags'
| |-EnumConstantDecl 0x55b71de9e5e0 <line:239:2, col:15> col:2 h_uncommon 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55b71de9ed38 <col:15> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71de9e5c0 <col:15> 'Handler::Flags' Int: 1024
| |     `-DeclRefExpr 0x55b71de9e5a0 <col:15> 'Handler::Flags' EnumConstant 0x55b71de9bc20 'f_uncommon' 'Handler::Flags'
| |-EnumConstantDecl 0x55b71de9e670 <line:240:2, col:11> col:2 h_calm 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55b71de9ed50 <col:11> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71de9e650 <col:11> 'Handler::Flags' Int: 2048
| |     `-DeclRefExpr 0x55b71de9e630 <col:11> 'Handler::Flags' EnumConstant 0x55b71de9bcb0 'f_calm' 'Handler::Flags'
| |-EnumConstantDecl 0x55b71de9e700 <line:241:2, col:16> col:2 h_expensive 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55b71de9ed68 <col:16> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71de9e6e0 <col:16> 'Handler::Flags' Int: 4096
| |     `-DeclRefExpr 0x55b71de9e6c0 <col:16> 'Handler::Flags' EnumConstant 0x55b71de9bd40 'f_expensive' 'Handler::Flags'
| |-EnumConstantDecl 0x55b71de9e790 <line:242:2, col:13> col:2 h_button 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55b71de9ed80 <col:13> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71de9e770 <col:13> 'Handler::Flags' Int: 8192
| |     `-DeclRefExpr 0x55b71de9e750 <col:13> 'Handler::Flags' EnumConstant 0x55b71de9bdd0 'f_button' 'Handler::Flags'
| |-EnumConstantDecl 0x55b71de9e820 <line:243:2, col:15> col:2 h_checkbox 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55b71de9ed98 <col:15> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71de9e800 <col:15> 'Handler::Flags' Int: 16384
| |     `-DeclRefExpr 0x55b71de9e7e0 <col:15> 'Handler::Flags' EnumConstant 0x55b71de9be60 'f_checkbox' 'Handler::Flags'
| |-EnumConstantDecl 0x55b71de9e8b0 <line:244:2, col:20> col:2 h_driver_flag_0 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55b71de9edb0 <col:20> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71de9e890 <col:20> 'Handler::Flags' Int: 67108864
| |     `-DeclRefExpr 0x55b71de9e870 <col:20> 'Handler::Flags' EnumConstant 0x55b71de9bf30 'f_driver0' 'Handler::Flags'
| |-EnumConstantDecl 0x55b71de9e940 <line:245:9, col:27> col:9 h_driver_flag_1 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55b71de9edc8 <col:27> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71de9e920 <col:27> 'Handler::Flags' Int: 134217728
| |     `-DeclRefExpr 0x55b71de9e900 <col:27> 'Handler::Flags' EnumConstant 0x55b71de9c000 'f_driver1' 'Handler::Flags'
| |-EnumConstantDecl 0x55b71de9e9d0 <line:246:2, col:22> col:2 h_user_flag_shift 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55b71de9ede0 <col:22> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71de9e9b0 <col:22> 'Handler::Flags' Int: 28
| |     `-DeclRefExpr 0x55b71de9e990 <col:22> 'Handler::Flags' EnumConstant 0x55b71de9c090 'f_user_shift' 'Handler::Flags'
| |-EnumConstantDecl 0x55b71de9ea60 <line:247:2, col:18> col:2 h_user_flag_0 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55b71de9edf8 <col:18> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71de9ea40 <col:18> 'Handler::Flags' Int: 268435456
| |     `-DeclRefExpr 0x55b71de9ea20 <col:18> 'Handler::Flags' EnumConstant 0x55b71de9c160 'f_user0' 'Handler::Flags'
| |-EnumConstantDecl 0x55b71de9eaf0 <line:248:2, col:25> col:2 h_read_comprehensive 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55b71de9ee10 <col:25> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71de9ead0 <col:25> 'Handler::Flags' Int: 8
| |     `-DeclRefExpr 0x55b71de9eab0 <col:25> 'Handler::Flags' EnumConstant 0x55b71de9c1f0 'f_read_comprehensive' 'Handler::Flags'
| |-EnumConstantDecl 0x55b71de9eb80 <line:249:2, col:26> col:2 h_write_comprehensive 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55b71de9ee28 <col:26> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55b71de9eb60 <col:26> 'Handler::Flags' Int: 16
| |     `-DeclRefExpr 0x55b71de9eb40 <col:26> 'Handler::Flags' EnumConstant 0x55b71de9c280 'f_write_comprehensive' 'Handler::Flags'
