
*** Dumping AST Record Layout
         0 | struct __pthread_cond_s::(anonymous at /usr/include/bits/thread-shared-types.h:97:5)
         0 |   unsigned int __low
         4 |   unsigned int __high
           | [sizeof=8, dsize=8, align=4,
           |  nvsize=8, nvalign=4]

*** Dumping AST Record Layout
         0 | union __pthread_cond_s::(anonymous at /usr/include/bits/thread-shared-types.h:94:17)
         0 |   unsigned long long __wseq
         0 |   struct __pthread_cond_s::(anonymous at /usr/include/bits/thread-shared-types.h:97:5) __wseq32
         0 |     unsigned int __low
         4 |     unsigned int __high
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __pthread_internal_list
         0 |   struct __pthread_internal_list * __prev
         8 |   struct __pthread_internal_list * __next
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __pthread_mutex_s
         0 |   int __lock
         4 |   unsigned int __count
         8 |   int __owner
        12 |   unsigned int __nusers
        16 |   int __kind
        20 |   short __spins
        22 |   short __elision
        24 |   struct __pthread_internal_list __list
        24 |     struct __pthread_internal_list * __prev
        32 |     struct __pthread_internal_list * __next
           | [sizeof=40, dsize=40, align=8,
           |  nvsize=40, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __pthread_cond_s::(anonymous at /usr/include/bits/thread-shared-types.h:106:5)
         0 |   unsigned int __low
         4 |   unsigned int __high
           | [sizeof=8, dsize=8, align=4,
           |  nvsize=8, nvalign=4]

*** Dumping AST Record Layout
         0 | union __pthread_cond_s::(anonymous at /usr/include/bits/thread-shared-types.h:103:17)
         0 |   unsigned long long __g1_start
         0 |   struct __pthread_cond_s::(anonymous at /usr/include/bits/thread-shared-types.h:106:5) __g1_start32
         0 |     unsigned int __low
         4 |     unsigned int __high
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __pthread_cond_s
         0 |   union __pthread_cond_s::(anonymous at /usr/include/bits/thread-shared-types.h:94:17) 
         0 |     unsigned long long __wseq
         0 |     struct __pthread_cond_s::(anonymous at /usr/include/bits/thread-shared-types.h:97:5) __wseq32
         0 |       unsigned int __low
         4 |       unsigned int __high
         8 |   union __pthread_cond_s::(anonymous at /usr/include/bits/thread-shared-types.h:103:17) 
         8 |     unsigned long long __g1_start
         8 |     struct __pthread_cond_s::(anonymous at /usr/include/bits/thread-shared-types.h:106:5) __g1_start32
         8 |       unsigned int __low
        12 |       unsigned int __high
        16 |   unsigned int [2] __g_refs
        24 |   unsigned int [2] __g_size
        32 |   unsigned int __g1_orig_size
        36 |   unsigned int __wrefs
        40 |   unsigned int [2] __g_signals
           | [sizeof=48, dsize=48, align=8,
           |  nvsize=48, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __pthread_rwlock_arch_t
         0 |   unsigned int __readers
         4 |   unsigned int __writers
         8 |   unsigned int __wrphase_futex
        12 |   unsigned int __writers_futex
        16 |   unsigned int __pad3
        20 |   unsigned int __pad4
        24 |   int __cur_writer
        28 |   int __shared
        32 |   signed char __rwelision
        33 |   unsigned char [7] __pad1
        40 |   unsigned long __pad2
        48 |   unsigned int __flags
           | [sizeof=56, dsize=56, align=8,
           |  nvsize=56, nvalign=8]

*** Dumping AST Record Layout
         0 | lldiv_t
         0 |   long long quot
         8 |   long long rem
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct msghdr
         0 |   void * msg_name
         8 |   socklen_t msg_namelen
        16 |   struct iovec * msg_iov
        24 |   size_t msg_iovlen
        32 |   void * msg_control
        40 |   size_t msg_controllen
        48 |   int msg_flags
           | [sizeof=56, dsize=56, align=8,
           |  nvsize=56, nvalign=8]

*** Dumping AST Record Layout
         0 | struct in_addr
         0 |   in_addr_t s_addr
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | union in6_addr::(anonymous at /usr/include/netinet/in.h:214:5)
         0 |   uint8_t [16] __u6_addr8
         0 |   uint16_t [8] __u6_addr16
         0 |   uint32_t [4] __u6_addr32
           | [sizeof=16, dsize=16, align=4,
           |  nvsize=16, nvalign=4]

*** Dumping AST Record Layout
         0 | struct sockaddr
         0 |   sa_family_t sa_family
         2 |   char [14] sa_data
           | [sizeof=16, dsize=16, align=2,
           |  nvsize=16, nvalign=2]

*** Dumping AST Record Layout
         0 | struct in6_addr
         0 |   union in6_addr::(anonymous at /usr/include/netinet/in.h:214:5) __in6_u
         0 |     uint8_t [16] __u6_addr8
         0 |     uint16_t [8] __u6_addr16
         0 |     uint32_t [4] __u6_addr32
           | [sizeof=16, dsize=16, align=4,
           |  nvsize=16, nvalign=4]

*** Dumping AST Record Layout
         0 | struct sockaddr_storage
         0 |   sa_family_t ss_family
         2 |   char [118] __ss_padding
       120 |   unsigned long __ss_align
           | [sizeof=128, dsize=128, align=8,
           |  nvsize=128, nvalign=8]

*** Dumping AST Record Layout
         0 | struct sockaddr_in6
         0 |   sa_family_t sin6_family
         2 |   in_port_t sin6_port
         4 |   uint32_t sin6_flowinfo
         8 |   struct in6_addr sin6_addr
         8 |     union in6_addr::(anonymous at /usr/include/netinet/in.h:214:5) __in6_u
         8 |       uint8_t [16] __u6_addr8
         8 |       uint16_t [8] __u6_addr16
         8 |       uint32_t [4] __u6_addr32
        24 |   uint32_t sin6_scope_id
           | [sizeof=28, dsize=28, align=4,
           |  nvsize=28, nvalign=4]

*** Dumping AST Record Layout
         0 | struct timeval
         0 |   __time_t tv_sec
         8 |   __suseconds_t tv_usec
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct String::memo_t
         0 |   volatile uint32_t refcount
         4 |   uint32_t capacity
         8 |   volatile uint32_t dirty
        12 |   char [8] real_data
           | [sizeof=20, dsize=20, align=4,
           |  nvsize=20, nvalign=4]

*** Dumping AST Record Layout
         0 | class IPAddress
         0 |   uint32_t _addr
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | union Timestamp::rep_t
         0 |   int64_t x
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class Timestamp
         0 |   union Timestamp::rep_t _t
         0 |     int64_t x
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct timespec
         0 |   __time_t tv_sec
         8 |   __syscall_slong_t tv_nsec
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class Element::Port
         0 |   class Element * _e
         8 |   int _port
           | [sizeof=16, dsize=12, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | struct libdivide_u32_t
         0 |   uint32_t magic
         4 |   uint8_t more
           | [sizeof=8, dsize=8, align=4,
           |  nvsize=8, nvalign=4]

*** Dumping AST Record Layout
         0 | class IPFlowID
         0 |   class IPAddress _saddr
         0 |     uint32_t _addr
         4 |   class IPAddress _daddr
         4 |     uint32_t _addr
         8 |   uint16_t _sport
        10 |   uint16_t _dport
           | [sizeof=12, dsize=12, align=4,
           |  nvsize=12, nvalign=4]

*** Dumping AST Record Layout
         0 | class IPRewriterEntry
         0 |   class IPFlowID _flowid
         0 |     class IPAddress _saddr
         0 |       uint32_t _addr
         4 |     class IPAddress _daddr
         4 |       uint32_t _addr
         8 |     uint16_t _sport
        10 |     uint16_t _dport
   12:0-23 |   uint32_t _output
        15 |   uint8_t _direction
        16 |   class IPRewriterEntry * _hashnext
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class vector_memory<class sized_array_memory<8> >
         0 |   vector_memory<class sized_array_memory<8> >::type * l_
         8 |   vector_memory::size_type n_
        12 |   vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class Vector<class IPRewriterFlow *>
         0 |   class vector_memory<class sized_array_memory<8> > vm_
         0 |     vector_memory<class sized_array_memory<8> >::type * l_
         8 |     vector_memory::size_type n_
        12 |     vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union IPRewriterInput::(anonymous at ../elements/ip/iprewriterbase.hh:23:5)
         0 |   class IPRewriterPattern * pattern
         0 |   class IPMapper * mapper
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class IPRewriterInput
         0 |   class IPRewriterBase * owner
         8 |   int owner_input
        12 |   int kind
        16 |   int foutput
        24 |   class IPRewriterBase * reply_element
        32 |   int routput
        36 |   uint32_t count
        40 |   uint32_t failures
        48 |   union IPRewriterInput::(anonymous at ../elements/ip/iprewriterbase.hh:23:5) u
        48 |     class IPRewriterPattern * pattern
        48 |     class IPMapper * mapper
           | [sizeof=56, dsize=56, align=8,
           |  nvsize=56, nvalign=8]

*** Dumping AST Record Layout
         0 | class HashContainer_const_iterator<class IPRewriterEntry, class HashContainer_adapter<class IPRewriterEntry> >
         0 |   class IPRewriterEntry * _element
         8 |   class IPRewriterEntry ** _pprev
        16 |   HashContainer_const_iterator<class IPRewriterEntry, class HashContainer_adapter<class IPRewriterEntry> >::bucket_count_type _bucket
        24 |   const HashContainer<class IPRewriterEntry, class HashContainer_adapter<class IPRewriterEntry> > * _hc
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | class HashContainer_iterator<class IPRewriterEntry, class HashContainer_adapter<class IPRewriterEntry> >
         0 |   class HashContainer_const_iterator<class IPRewriterEntry, class HashContainer_adapter<class IPRewriterEntry> > (base)
         0 |     class IPRewriterEntry * _element
         8 |     class IPRewriterEntry ** _pprev
        16 |     HashContainer_const_iterator<class IPRewriterEntry, class HashContainer_adapter<class IPRewriterEntry> >::bucket_count_type _bucket
        24 |     const HashContainer<class IPRewriterEntry, class HashContainer_adapter<class IPRewriterEntry> > * _hc
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | class IPRewriterFlow
         0 |   class IPRewriterEntry [2] _e
        48 |   uint16_t _ip_csum_delta
        50 |   uint16_t _udp_csum_delta
        52 |   click_jiffies_t _expiry_j
   56:0-31 |   size_t _place
        60 |   uint8_t _ip_p
        61 |   uint8_t _tflags
        62 |   _Bool _guaranteed
        63 |   uint8_t _reply_anno
        64 |   class IPRewriterInput * _owner
           | [sizeof=72, dsize=72, align=8,
           |  nvsize=72, nvalign=8]

*** Dumping AST Record Layout
         0 | class TCPRewriter::TCPFlow
         0 |   class IPRewriterFlow (base)
         0 |     class IPRewriterEntry [2] _e
        48 |     uint16_t _ip_csum_delta
        50 |     uint16_t _udp_csum_delta
        52 |     click_jiffies_t _expiry_j
   56:0-31 |     size_t _place
        60 |     uint8_t _ip_p
        61 |     uint8_t _tflags
        62 |     _Bool _guaranteed
        63 |     uint8_t _reply_anno
        64 |     class IPRewriterInput * _owner
        72 |   struct TCPRewriter::TCPFlow::delta_transition * _dt
           | [sizeof=80, dsize=80, align=8,
           |  nvsize=80, nvalign=8]

*** Dumping AST Record Layout
         0 | class UDPRewriter::UDPFlow
         0 |   class IPRewriterFlow (base)
         0 |     class IPRewriterEntry [2] _e
        48 |     uint16_t _ip_csum_delta
        50 |     uint16_t _udp_csum_delta
        52 |     click_jiffies_t _expiry_j
   56:0-31 |     size_t _place
        60 |     uint8_t _ip_p
        61 |     uint8_t _tflags
        62 |     _Bool _guaranteed
        63 |     uint8_t _reply_anno
        64 |     class IPRewriterInput * _owner
           | [sizeof=72, dsize=72, align=8,
           |  nvsize=72, nvalign=8]

*** Dumping AST Record Layout
         0 | class MyRewriterPattern
         0 |   class IPAddress _saddr
         0 |     uint32_t _addr
         4 |   int _sport
         8 |   class IPAddress _daddr
         8 |     uint32_t _addr
        12 |   int _dport
        16 |   uint32_t _variation_top
        20 |   _Bool _sequential
           | [sizeof=24, dsize=21, align=4,
           |  nvsize=21, nvalign=4]

*** Dumping AST Record Layout
         0 | class MyInputSpec
         0 |   int kind
         4 |   int foutput
         8 |   int doutput
        12 |   class MyRewriterPattern pattern
        12 |     class IPAddress _saddr
        12 |       uint32_t _addr
        16 |     int _sport
        20 |     class IPAddress _daddr
        20 |       uint32_t _addr
        24 |     int _dport
        28 |     uint32_t _variation_top
        32 |     _Bool _sequential
        36 |   int __placeholder
           | [sizeof=40, dsize=40, align=4,
           |  nvsize=40, nvalign=4]

*** Dumping AST Record Layout
         0 | struct String::rep_t
         0 |   const char * data
         8 |   int length
        16 |   struct String::memo_t * memo
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class String
         0 |   struct String::rep_t _r
         0 |     const char * data
         8 |     int length
        16 |     struct String::memo_t * memo
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct StringAccum::rep_t
         0 |   unsigned char * s
         8 |   int len
        12 |   int cap
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct TimerSet::heap_element
         0 |   class Timestamp expiry_s
         0 |     union Timestamp::rep_t _t
         0 |       int64_t x
         8 |   class Timer * t
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct pollfd
         0 |   int fd
         4 |   short events
         6 |   short revents
           | [sizeof=8, dsize=8, align=4,
           |  nvsize=8, nvalign=4]

*** Dumping AST Record Layout
         0 | struct SelectSet::SelectorInfo
         0 |   class Element * read
         8 |   class Element * write
        16 |   int pollfd
           | [sizeof=24, dsize=20, align=8,
           |  nvsize=20, nvalign=8]

*** Dumping AST Record Layout
         0 | struct Router::Port
         0 |   int idx
         4 |   int port
           | [sizeof=8, dsize=8, align=4,
           |  nvsize=8, nvalign=4]

*** Dumping AST Record Layout
         0 | struct Router::element_landmark_t
         0 |   uint32_t first_landmarkid
         8 |   class String filename
         8 |     struct String::rep_t _r
         8 |       const char * data
        16 |       int length
        24 |       struct String::memo_t * memo
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | class vector_memory<class sized_array_memory<4> >
         0 |   vector_memory<class sized_array_memory<4> >::type * l_
         8 |   vector_memory::size_type n_
        12 |   vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class Vector<int>
         0 |   class vector_memory<class sized_array_memory<4> > vm_
         0 |     vector_memory<class sized_array_memory<4> >::type * l_
         8 |     vector_memory::size_type n_
        12 |     vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct Router::Connection
         0 |   struct Router::Port [2] p
           | [sizeof=16, dsize=16, align=4,
           |  nvsize=16, nvalign=4]

*** Dumping AST Record Layout
         0 | class atomic_uint32_t
         0 |   uint32_t _val
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | class Element
         0 |   (Element vtable pointer)
         8 |   class Element::Port *[2] _ports
        24 |   class Element::Port [4] _inline_ports
        88 |   int [2] _nports
        96 |   class Router * _router
       104 |   int _eindex
           | [sizeof=112, dsize=108, align=8,
           |  nvsize=108, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x55adbc2642d8 prev 0x55adbc25ba48 <../dummy_inc/click/element.hh:214:5, line:252:5> line:214:11 referenced class Port definition
|-DefinitionData pass_in_registers standard_layout trivially_copyable has_user_declared_ctor can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor simple trivial has_const_param implicit_has_const_param
| |-MoveConstructor exists simple trivial
| |-CopyAssignment trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveAssignment exists simple trivial needs_implicit
| `-Destructor simple irrelevant trivial
|-CXXRecordDecl 0x55adbc2643d0 <col:5, col:11> col:11 implicit referenced class Port
|-AccessSpecDecl 0x55adbc264460 <col:18, col:24> col:18 public
|-CXXMethodDecl 0x55adbc2644d8 <line:216:9, col:30> col:21 used active 'bool () const' inline
|-CXXMethodDecl 0x55adbc264598 <line:217:9, col:35> col:25 element 'Element *() const' inline
|-CXXMethodDecl 0x55adbc264660 <line:218:9, col:27> col:20 port 'int () const' inline
|-CXXMethodDecl 0x55adbc2647d8 <line:220:9, col:65> col:49 used push 'void (Packet *) const'
| |-ParmVarDecl 0x55adbc264710 <col:54, col:62> col:62 p 'Packet *'
| |-NoInlineAttr 0x55adbc264880 <col:24>
| `-OptimizeNoneAttr 0x55adbc2648d8 <col:34>
|-CXXMethodDecl 0x55adbc264920 <line:221:9, col:31> col:24 used pull 'Packet *() const' inline
|-CXXMethodDecl 0x55adbc264bd8 <line:227:9, col:63> col:21 used assign 'void (bool, Element *, int)' inline
| |-ParmVarDecl 0x55adbc2649d0 <col:28, col:33> col:33 isoutput 'bool'
| |-ParmVarDecl 0x55adbc264a48 <col:43, col:52> col:52 e 'Element *'
| `-ParmVarDecl 0x55adbc264ac8 <col:55, col:59> col:59 port 'int'
|-AccessSpecDecl 0x55adbc264ca0 <line:229:7, col:14> col:7 private
|-FieldDecl 0x55adbc264cd8 <line:231:9, col:18> col:18 referenced _e 'Element *'
|-FieldDecl 0x55adbc264d40 <line:232:9, col:13> col:13 referenced _port 'int'
|-CXXConstructorDecl 0x55adbc264dc8 <line:247:9, col:21> col:16 Port 'void ()' inline
|-CXXMethodDecl 0x55adbc2650e8 <line:248:9, col:79> col:21 assign 'void (bool, Element *, Element *, int)' inline
| |-ParmVarDecl 0x55adbc264e80 <col:28, col:33> col:33 isoutput 'bool'
| |-ParmVarDecl 0x55adbc264ef8 <col:43, col:52> col:52 owner 'Element *'
| |-ParmVarDecl 0x55adbc264f70 <col:59, col:68> col:68 e 'Element *'
| `-ParmVarDecl 0x55adbc264ff0 <col:71, col:75> col:75 port 'int'
|-FriendDecl 0x55adbc265200 <line:250:9, col:22> col:16 'class Element':'Element'
|-CXXConstructorDecl 0x55adbc1d3888 <line:214:11> col:11 implicit constexpr Port 'void (const Element::Port &)' inline default trivial noexcept-unevaluated 0x55adbc1d3888
| `-ParmVarDecl 0x55adbc1d3998 <col:11> col:11 'const Element::Port &'
|-CXXConstructorDecl 0x55adbc1d3a38 <col:11> col:11 implicit constexpr Port 'void (Element::Port &&)' inline default trivial noexcept-unevaluated 0x55adbc1d3a38
| `-ParmVarDecl 0x55adbc1d3b48 <col:11> col:11 'Element::Port &&'
`-CXXDestructorDecl 0x55adbc5b3b10 <col:11> col:11 implicit ~Port 'void () noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.Element::Port" = type <{ %class.Element*, i32, [4 x i8] }>
  NonVirtualBaseLLVMType:%"class.Element::Port.base" = type <{ %class.Element*, i32 }>
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class Vector<class Element *>
         0 |   class vector_memory<class sized_array_memory<8> > vm_
         0 |     vector_memory<class sized_array_memory<8> >::type * l_
         8 |     vector_memory::size_type n_
        12 |     vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class vector_memory<class typed_array_memory<class String> >
         0 |   vector_memory<class typed_array_memory<class String> >::type * l_
         8 |   vector_memory::size_type n_
        12 |   vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class Vector<class String>
         0 |   class vector_memory<class typed_array_memory<class String> > vm_
         0 |     vector_memory<class typed_array_memory<class String> >::type * l_
         8 |     vector_memory::size_type n_
        12 |     vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class Vector<unsigned int>
         0 |   class vector_memory<class sized_array_memory<4> > vm_
         0 |     vector_memory<class sized_array_memory<4> >::type * l_
         8 |     vector_memory::size_type n_
        12 |     vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class vector_memory<class typed_array_memory<struct Router::element_landmark_t> >
         0 |   vector_memory<class typed_array_memory<struct Router::element_landmark_t> >::type * l_
         8 |   vector_memory::size_type n_
        12 |   vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class Vector<struct Router::element_landmark_t>
         0 |   class vector_memory<class typed_array_memory<struct Router::element_landmark_t> > vm_
         0 |     vector_memory<class typed_array_memory<struct Router::element_landmark_t> >::type * l_
         8 |     vector_memory::size_type n_
        12 |     vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class vector_memory<class sized_array_memory<16> >
         0 |   vector_memory<class sized_array_memory<16> >::type * l_
         8 |   vector_memory::size_type n_
        12 |   vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class Vector<struct Router::Connection>
         0 |   class vector_memory<class sized_array_memory<16> > vm_
         0 |     vector_memory<class sized_array_memory<16> >::type * l_
         8 |     vector_memory::size_type n_
        12 |     vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class Vector<void *>
         0 |   class vector_memory<class sized_array_memory<8> > vm_
         0 |     vector_memory<class sized_array_memory<8> >::type * l_
         8 |     vector_memory::size_type n_
        12 |     vector_memory::size_type capacity_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class Router
         0 |   class Master * _master
         8 |   class atomic_uint32_t _runcount
         8 |     uint32_t _val
        12 |   volatile int _state
    16:0-0 |   _Bool _have_connections
    16:1-1 |   _Bool _conn_sorted
    16:2-2 |   _Bool _have_configuration
        20 |   volatile int _running
        24 |   class atomic_uint32_t _refcount
        24 |     uint32_t _val
        32 |   class Vector<class Element *> _elements
        32 |     class vector_memory<class sized_array_memory<8> > vm_
        32 |       vector_memory<class sized_array_memory<8> >::type * l_
        40 |       vector_memory::size_type n_
        44 |       vector_memory::size_type capacity_
        48 |   class Vector<class String> _element_names
        48 |     class vector_memory<class typed_array_memory<class String> > vm_
        48 |       vector_memory<class typed_array_memory<class String> >::type * l_
        56 |       vector_memory::size_type n_
        60 |       vector_memory::size_type capacity_
        64 |   class Vector<class String> _element_configurations
        64 |     class vector_memory<class typed_array_memory<class String> > vm_
        64 |       vector_memory<class typed_array_memory<class String> >::type * l_
        72 |       vector_memory::size_type n_
        76 |       vector_memory::size_type capacity_
        80 |   class Vector<unsigned int> _element_landmarkids
        80 |     class vector_memory<class sized_array_memory<4> > vm_
        80 |       vector_memory<class sized_array_memory<4> >::type * l_
        88 |       vector_memory::size_type n_
        92 |       vector_memory::size_type capacity_
        96 |   class Vector<int> _element_home_thread_ids
        96 |     class vector_memory<class sized_array_memory<4> > vm_
        96 |       vector_memory<class sized_array_memory<4> >::type * l_
       104 |       vector_memory::size_type n_
       108 |       vector_memory::size_type capacity_
       112 |   class Vector<struct Router::element_landmark_t> _element_landmarks
       112 |     class vector_memory<class typed_array_memory<struct Router::element_landmark_t> > vm_
       112 |       vector_memory<class typed_array_memory<struct Router::element_landmark_t> >::type * l_
       120 |       vector_memory::size_type n_
       124 |       vector_memory::size_type capacity_
       128 |   uint32_t _last_landmarkid
       136 |   class Vector<int> _element_name_sorter
       136 |     class vector_memory<class sized_array_memory<4> > vm_
       136 |       vector_memory<class sized_array_memory<4> >::type * l_
       144 |       vector_memory::size_type n_
       148 |       vector_memory::size_type capacity_
       152 |   Vector<int> [2] _element_gport_offset
       184 |   class Vector<int> _element_configure_order
       184 |     class vector_memory<class sized_array_memory<4> > vm_
       184 |       vector_memory<class sized_array_memory<4> >::type * l_
       192 |       vector_memory::size_type n_
       196 |       vector_memory::size_type capacity_
       200 |   class Vector<struct Router::Connection> _conn
       200 |     class vector_memory<class sized_array_memory<16> > vm_
       200 |       vector_memory<class sized_array_memory<16> >::type * l_
       208 |       vector_memory::size_type n_
       212 |       vector_memory::size_type capacity_
       216 |   class Vector<int> _conn_output_sorter
       216 |     class vector_memory<class sized_array_memory<4> > vm_
       216 |       vector_memory<class sized_array_memory<4> >::type * l_
       224 |       vector_memory::size_type n_
       228 |       vector_memory::size_type capacity_
       232 |   class Vector<class String> _requirements
       232 |     class vector_memory<class typed_array_memory<class String> > vm_
       232 |       vector_memory<class typed_array_memory<class String> >::type * l_
       240 |       vector_memory::size_type n_
       244 |       vector_memory::size_type capacity_
       248 |   class Vector<int> _ehandler_first_by_element
       248 |     class vector_memory<class sized_array_memory<4> > vm_
       248 |       vector_memory<class sized_array_memory<4> >::type * l_
       256 |       vector_memory::size_type n_
       260 |       vector_memory::size_type capacity_
       264 |   class Vector<int> _ehandler_to_handler
       264 |     class vector_memory<class sized_array_memory<4> > vm_
       264 |       vector_memory<class sized_array_memory<4> >::type * l_
       272 |       vector_memory::size_type n_
       276 |       vector_memory::size_type capacity_
       280 |   class Vector<int> _ehandler_next
       280 |     class vector_memory<class sized_array_memory<4> > vm_
       280 |       vector_memory<class sized_array_memory<4> >::type * l_
       288 |       vector_memory::size_type n_
       292 |       vector_memory::size_type capacity_
       296 |   class Vector<int> _handler_first_by_name
       296 |     class vector_memory<class sized_array_memory<4> > vm_
       296 |       vector_memory<class sized_array_memory<4> >::type * l_
       304 |       vector_memory::size_type n_
       308 |       vector_memory::size_type capacity_
       312 |   class Handler ** _handler_bufs
       320 |   int _nhandlers_bufs
       324 |   int _free_handler
       328 |   class Vector<class String> _attachment_names
       328 |     class vector_memory<class typed_array_memory<class String> > vm_
       328 |       vector_memory<class typed_array_memory<class String> >::type * l_
       336 |       vector_memory::size_type n_
       340 |       vector_memory::size_type capacity_
       344 |   class Vector<void *> _attachments
       344 |     class vector_memory<class sized_array_memory<8> > vm_
       344 |       vector_memory<class sized_array_memory<8> >::type * l_
       352 |       vector_memory::size_type n_
       356 |       vector_memory::size_type capacity_
       360 |   class Element * _root_element
       368 |   class String _configuration
       368 |     struct String::rep_t _r
       368 |       const char * data
       376 |       int length
       384 |       struct String::memo_t * memo
       392 |   struct Router::notifier_signals_t * _notifier_signals
       400 |   class HashMap_ArenaFactory * _arena_factory
       408 |   class Router * _hotswap_router
       416 |   class ThreadSched * _thread_sched
       424 |   class NameInfo * _name_info
       432 |   class Vector<int> _flow_code_override_eindex
       432 |     class vector_memory<class sized_array_memory<4> > vm_
       432 |       vector_memory<class sized_array_memory<4> >::type * l_
       440 |       vector_memory::size_type n_
       444 |       vector_memory::size_type capacity_
       448 |   class Vector<class String> _flow_code_override
       448 |     class vector_memory<class typed_array_memory<class String> > vm_
       448 |       vector_memory<class typed_array_memory<class String> >::type * l_
       456 |       vector_memory::size_type n_
       460 |       vector_memory::size_type capacity_
       464 |   class Router * _next_router
           | [sizeof=472, dsize=472, align=8,
           |  nvsize=472, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x55adbbfa93e0 <../dummy_inc/click/atomic.hh:52:1, line:94:1> line:52:7 referenced class atomic_uint32_t definition
|-DefinitionData pass_in_registers standard_layout trivially_copyable trivial literal
| |-DefaultConstructor exists trivial
| |-CopyConstructor simple trivial has_const_param implicit_has_const_param
| |-MoveConstructor exists simple trivial
| |-CopyAssignment trivial has_const_param implicit_has_const_param
| |-MoveAssignment exists simple trivial
| `-Destructor simple irrelevant trivial
|-CXXRecordDecl 0x55adbbfa94f8 <col:1, col:7> col:7 implicit referenced class atomic_uint32_t
|-AccessSpecDecl 0x55adbbfa9588 <col:25, col:31> col:25 public
|-CXXMethodDecl 0x55adbbfa9658 <line:57:5, col:29> col:21 used value 'uint32_t () const' inline
|-CXXConversionDecl 0x55adbbfa9740 <line:58:5, col:32> col:12 operator unsigned int 'uint32_t () const' inline
|-CXXMethodDecl 0x55adbbfa9958 <line:60:5, col:49> col:29 used operator= 'atomic_uint32_t &(uint32_t)' inline
| `-ParmVarDecl 0x55adbbfa9800 <col:39, col:48> col:48 x 'uint32_t':'unsigned int'
|-CXXMethodDecl 0x55adbbfa9b08 <line:62:5, col:53> col:29 operator+= 'atomic_uint32_t &(int32_t)' inline
| `-ParmVarDecl 0x55adbbfa9a10 <col:40, col:48> col:48 delta 'int32_t':'int'
|-CXXMethodDecl 0x55adbbfa9c50 <line:63:5, col:53> col:29 operator-= 'atomic_uint32_t &(int32_t)' inline
| `-ParmVarDecl 0x55adbbfa9bc0 <col:40, col:48> col:48 delta 'int32_t':'int'
|-CXXMethodDecl 0x55adbbfaa730 <line:64:5, col:53> col:29 operator|= 'atomic_uint32_t &(uint32_t)' inline
| `-ParmVarDecl 0x55adbbfaa6a0 <col:40, col:49> col:49 mask 'uint32_t':'unsigned int'
|-CXXMethodDecl 0x55adbbfaa878 <line:65:5, col:53> col:29 operator&= 'atomic_uint32_t &(uint32_t)' inline
| `-ParmVarDecl 0x55adbbfaa7e8 <col:40, col:49> col:49 mask 'uint32_t':'unsigned int'
|-CXXMethodDecl 0x55adbbfaa940 <line:67:5, col:28> col:17 used operator++ 'void ()' inline
|-CXXMethodDecl 0x55adbbfaaa88 <line:68:5, col:31> col:17 used operator++ 'void (int)' inline
| `-ParmVarDecl 0x55adbbfaa9f8 <col:28> col:31 'int'
|-CXXMethodDecl 0x55adbbfaab50 <line:69:5, col:28> col:17 used operator-- 'void ()' inline
|-CXXMethodDecl 0x55adbbfaac98 <line:70:5, col:31> col:17 operator-- 'void (int)' inline
| `-ParmVarDecl 0x55adbbfaac08 <col:28> col:31 'int'
|-CXXMethodDecl 0x55adbbfaae18 <line:72:5, col:42> col:21 swap 'uint32_t (uint32_t)' inline
| `-ParmVarDecl 0x55adbbfaad50 <col:26, col:35> col:35 desired 'uint32_t':'unsigned int'
|-CXXMethodDecl 0x55adbbfaaf60 <line:73:5, col:49> col:21 fetch_and_add 'uint32_t (uint32_t)' inline
| `-ParmVarDecl 0x55adbbfaaed0 <col:35, col:44> col:44 delta 'uint32_t':'unsigned int'
|-CXXMethodDecl 0x55adbbfab028 <line:74:5, col:30> col:17 dec_and_test 'bool ()' inline
|-CXXMethodDecl 0x55adbbfab1e8 <line:75:5, col:69> col:21 used compare_swap 'uint32_t (uint32_t, uint32_t)' inline
| |-ParmVarDecl 0x55adbbfab0d8 <col:34, col:43> col:43 expected 'uint32_t':'unsigned int'
| `-ParmVarDecl 0x55adbbfab150 <col:53, col:62> col:62 desired 'uint32_t':'unsigned int'
|-CXXMethodDecl 0x55adbbfab438 <line:76:5, col:97> col:17 compare_and_swap 'bool (uint32_t, uint32_t)' inline
| |-ParmVarDecl 0x55adbbfab2a8 <col:34, col:43> col:43 expected 'uint32_t':'unsigned int'
| |-ParmVarDecl 0x55adbbfab320 <col:53, col:62> col:62 desired 'uint32_t':'unsigned int'
| `-DeprecatedAttr 0x55adbbfab4e8 <col:86> "" ""
|-CXXMethodDecl 0x55adbbfab758 <line:78:5, col:71> col:28 used swap 'uint32_t (volatile uint32_t &, uint32_t)' static inline
| |-ParmVarDecl 0x55adbbfab5c8 <col:33, col:52> col:52 x 'volatile uint32_t &'
| `-ParmVarDecl 0x55adbbfab640 <col:55, col:64> col:64 desired 'uint32_t':'unsigned int'
|-CXXMethodDecl 0x55adbbfab908 <line:79:5, col:48> col:24 used inc 'void (volatile uint32_t &)' static inline
| `-ParmVarDecl 0x55adbbfab818 <col:28, col:47> col:47 x 'volatile uint32_t &'
|-CXXMethodDecl 0x55adbbfabab8 <line:80:5, col:57> col:24 used dec_and_test 'bool (volatile uint32_t &)' static inline
| `-ParmVarDecl 0x55adbbfab9c0 <col:37, col:56> col:56 x 'volatile uint32_t &'
|-CXXMethodDecl 0x55adbbfabd88 <line:81:5, col:98> col:28 compare_swap 'uint32_t (volatile uint32_t &, uint32_t, uint32_t)' static inline
| |-ParmVarDecl 0x55adbbfabb70 <col:41, col:60> col:60 x 'volatile uint32_t &'
| |-ParmVarDecl 0x55adbbfabbe8 <col:63, col:72> col:72 expected 'uint32_t':'unsigned int'
| `-ParmVarDecl 0x55adbbfabc60 <col:82, col:91> col:91 desired 'uint32_t':'unsigned int'
|-CXXMethodDecl 0x55adbbfac068 <line:82:5, col:126> col:24 compare_and_swap 'bool (volatile uint32_t &, uint32_t, uint32_t)' static inline
| |-ParmVarDecl 0x55adbbfabe50 <col:41, col:60> col:60 x 'volatile uint32_t &'
| |-ParmVarDecl 0x55adbbfabec8 <col:63, col:72> col:72 expected 'uint32_t':'unsigned int'
| |-ParmVarDecl 0x55adbbfabf40 <col:82, col:91> col:91 desired 'uint32_t':'unsigned int'
| `-DeprecatedAttr 0x55adbbfac120 <col:115> "" ""
|-AccessSpecDecl 0x55adbbfac190 <line:84:3, col:10> col:3 private
|-FieldDecl 0x55adbbfac1c8 <line:91:5, col:14> col:14 referenced _val 'uint32_t':'unsigned int'
|-CXXMethodDecl 0x55adbbfac8d0 <line:52:7> col:7 implicit constexpr operator= 'atomic_uint32_t &(const atomic_uint32_t &)' inline default trivial noexcept-unevaluated 0x55adbbfac8d0
| `-ParmVarDecl 0x55adbbfac9d8 <col:7> col:7 'const atomic_uint32_t &'
|-CXXMethodDecl 0x55adbbfaca78 <col:7> col:7 implicit constexpr operator= 'atomic_uint32_t &(atomic_uint32_t &&)' inline default trivial noexcept-unevaluated 0x55adbbfaca78
| `-ParmVarDecl 0x55adbbfacb88 <col:7> col:7 'atomic_uint32_t &&'
|-CXXConstructorDecl 0x55adbc04b598 <col:7> col:7 implicit used atomic_uint32_t 'void () noexcept' inline default trivial
| `-CompoundStmt 0x55adbc240e90 <col:7>
|-CXXConstructorDecl 0x55adbc04b670 <col:7> col:7 implicit constexpr atomic_uint32_t 'void (const atomic_uint32_t &)' inline default trivial noexcept-unevaluated 0x55adbc04b670
| `-ParmVarDecl 0x55adbc04b788 <col:7> col:7 'const atomic_uint32_t &'
|-CXXConstructorDecl 0x55adbc04b7f8 <col:7> col:7 implicit constexpr atomic_uint32_t 'void (atomic_uint32_t &&)' inline default trivial noexcept-unevaluated 0x55adbc04b7f8
| `-ParmVarDecl 0x55adbc04b908 <col:7> col:7 'atomic_uint32_t &&'
`-CXXDestructorDecl 0x55adbc243800 <col:7> col:7 implicit referenced ~atomic_uint32_t 'void () noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%class.atomic_uint32_t = type { i32 }
  NonVirtualBaseLLVMType:%class.atomic_uint32_t = type { i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x55adbc321680 <../dummy_inc/click/vector.hh:11:1, line:71:1> line:11:30 class vector_memory definition
|-DefinitionData standard_layout has_user_declared_ctor can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor simple trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveConstructor
| |-CopyAssignment trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveAssignment
| `-Destructor non_trivial user_declared
|-TemplateArgument type 'sized_array_memory<8>'
|-CXXRecordDecl 0x55adbc321858 prev 0x55adbc321680 <col:24, col:30> col:30 implicit class vector_memory
|-AccessSpecDecl 0x55adbc3218e8 <col:46, col:52> col:46 public
|-TypedefDecl 0x55adbc321910 <line:12:5, col:17> col:17 size_type 'int'
| `-BuiltinType 0x55adbbce2370 'int'
|-TypedefDecl 0x55adbc3234e0 <line:13:5, col:31> col:31 type 'typename sized_array_memory<8>::type':'char_array<8>'
| `-ElaboratedType 0x55adbc323490 'typename sized_array_memory<8>::type' sugar
|   `-TypedefType 0x55adbc321dc0 'sized_array_memory<8>::type' sugar
|     |-Typedef 0x55adbc321cc0 'type'
|     `-TemplateSpecializationType 0x55adbc321c50 'char_array<8UL>' sugar char_array
|       |-TemplateArgument expr
|       | `-ConstantExpr 0x55adbc321b30 <../dummy_inc/click/array_memory.hh:11:24> 'unsigned long' Int: 8
|       |   `-SubstNonTypeTemplateParmExpr 0x55adbc321b10 <col:24> 'unsigned long'
|       |     `-IntegerLiteral 0x55adbc321af0 <col:24> 'unsigned long' 8
|       `-RecordType 0x55adbc321c30 'char_array<8>'
|         `-ClassTemplateSpecialization 0x55adbc321b50 'char_array'
|-TypedefDecl 0x55adbc323598 <../dummy_inc/click/vector.hh:14:5, col:19> col:19 iterator 'vector_memory<sized_array_memory<8> >::type *'
| `-PointerType 0x55adbc323560 'vector_memory<sized_array_memory<8> >::type *'
|   `-TypedefType 0x55adbc323540 'vector_memory<sized_array_memory<8> >::type' sugar
|     |-Typedef 0x55adbc3234e0 'type'
|     `-ElaboratedType 0x55adbc323490 'typename sized_array_memory<8>::type' sugar
|       `-TypedefType 0x55adbc321dc0 'sized_array_memory<8>::type' sugar
|         |-Typedef 0x55adbc321cc0 'type'
|         `-TemplateSpecializationType 0x55adbc321c50 'char_array<8UL>' sugar char_array
|           |-TemplateArgument expr
|           | `-ConstantExpr 0x55adbc321b30 <../dummy_inc/click/array_memory.hh:11:24> 'unsigned long' Int: 8
|           |   `-SubstNonTypeTemplateParmExpr 0x55adbc321b10 <col:24> 'unsigned long'
|           |     `-IntegerLiteral 0x55adbc321af0 <col:24> 'unsigned long' 8
|           `-RecordType 0x55adbc321c30 'char_array<8>'
|             `-ClassTemplateSpecialization 0x55adbc321b50 'char_array'
|-CXXMethodDecl 0x55adbc323718 <../dummy_inc/click/vector.hh:15:5, line:18:5> line:15:17 need_argument_copy 'bool (const vector_memory<sized_array_memory<8> >::type *) const' inline
| `-ParmVarDecl 0x55adbc323628 <col:36, col:48> col:48 argp 'const vector_memory<sized_array_memory<8> >::type *'
|-CXXConstructorDecl 0x55adbc323808 <line:20:5, line:22:5> line:20:5 vector_memory 'void ()'
|-CXXDestructorDecl 0x55adbc3238e8 <line:23:5, col:20> col:5 used ~vector_memory 'void () noexcept'
|-CXXMethodDecl 0x55adbc323bb8 <line:25:5, col:43> col:10 assign 'void (const vector_memory<sized_array_memory<8> > &)'
| `-ParmVarDecl 0x55adbc323ac0 <col:17, col:42> col:42 x 'const vector_memory<sized_array_memory<8> > &'
|-CXXMethodDecl 0x55adbc323df8 <line:26:5, col:44> col:10 assign 'void (vector_memory::size_type, const vector_memory<sized_array_memory<8> >::type *)'
| |-ParmVarDecl 0x55adbc323c70 <col:17, col:27> col:27 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55adbc323ce8 <col:30, col:42> col:42 vp 'const vector_memory<sized_array_memory<8> >::type *'
|-CXXMethodDecl 0x55adbc323fc8 <line:27:5, col:44> col:10 resize 'void (vector_memory::size_type, const vector_memory<sized_array_memory<8> >::type *)'
| |-ParmVarDecl 0x55adbc323eb8 <col:17, col:27> col:27 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55adbc323f30 <col:30, col:42> col:42 vp 'const vector_memory<sized_array_memory<8> >::type *'
|-CXXMethodDecl 0x55adbc324128 <line:28:5, line:30:5> line:28:14 begin 'vector_memory<sized_array_memory<8> >::iterator ()'
|-CXXMethodDecl 0x55adbc3241f8 <line:31:5, line:33:5> line:31:14 end 'vector_memory<sized_array_memory<8> >::iterator ()'
|-CXXMethodDecl 0x55adbc324448 <line:34:5, col:48> col:14 insert 'vector_memory<sized_array_memory<8> >::iterator (vector_memory<sized_array_memory<8> >::iterator, const vector_memory<sized_array_memory<8> >::type *)'
| |-ParmVarDecl 0x55adbc3242b8 <col:21, col:30> col:30 it 'vector_memory<sized_array_memory<8> >::iterator':'vector_memory<sized_array_memory<8> >::type *'
| `-ParmVarDecl 0x55adbc324330 <col:34, col:46> col:46 vp 'const vector_memory<sized_array_memory<8> >::type *'
|-CXXMethodDecl 0x55adbc3246a8 <line:35:5, col:42> col:14 erase 'vector_memory<sized_array_memory<8> >::iterator (vector_memory<sized_array_memory<8> >::iterator, vector_memory<sized_array_memory<8> >::iterator)'
| |-ParmVarDecl 0x55adbc324518 <col:20, col:29> col:29 a 'vector_memory<sized_array_memory<8> >::iterator':'vector_memory<sized_array_memory<8> >::type *'
| `-ParmVarDecl 0x55adbc324590 <col:32, col:41> col:41 b 'vector_memory<sized_array_memory<8> >::iterator':'vector_memory<sized_array_memory<8> >::type *'
|-CXXMethodDecl 0x55adbc324868 <line:36:5, line:43:5> line:36:17 push_back 'void (const vector_memory<sized_array_memory<8> >::type *)' inline
| `-ParmVarDecl 0x55adbc324778 <col:27, col:39> col:39 vp 'const vector_memory<sized_array_memory<8> >::type *'
|-CXXMethodDecl 0x55adbc324a28 <line:45:5, line:52:5> line:45:17 move_construct_back 'void (vector_memory<sized_array_memory<8> >::type *)' inline
| `-ParmVarDecl 0x55adbc324930 <col:37, col:43> col:43 vp 'vector_memory<sized_array_memory<8> >::type *'
|-CXXMethodDecl 0x55adbc324ae0 <line:54:5, line:59:5> line:54:17 pop_back 'void ()' inline
|-CXXMethodDecl 0x55adbc3275d0 <line:60:5, line:64:5> line:60:17 clear 'void ()' inline
|-CXXMethodDecl 0x55adbc327808 <line:65:5, col:59> col:10 reserve_and_push_back 'bool (vector_memory::size_type, const vector_memory<sized_array_memory<8> >::type *)'
| |-ParmVarDecl 0x55adbc327680 <col:32, col:42> col:42 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55adbc3276f8 <col:45, col:57> col:57 vp 'const vector_memory<sized_array_memory<8> >::type *'
|-CXXMethodDecl 0x55adbc327aa8 <line:66:5, col:35> col:10 swap 'void (vector_memory<sized_array_memory<8> > &)'
| `-ParmVarDecl 0x55adbc3279b0 <col:15, col:34> col:34 x 'vector_memory<sized_array_memory<8> > &'
|-FieldDecl 0x55adbc327b70 <line:68:5, col:11> col:11 l_ 'vector_memory<sized_array_memory<8> >::type *'
|-FieldDecl 0x55adbc327bc0 <line:69:5, col:15> col:15 n_ 'vector_memory::size_type':'int'
`-FieldDecl 0x55adbc327c10 <line:70:5, col:15> col:15 capacity_ 'vector_memory::size_type':'int'

Layout: <CGRecordLayout
  LLVMType:%class.vector_memory = type { %struct.char_array*, i32, i32 }
  NonVirtualBaseLLVMType:%class.vector_memory = type { %struct.char_array*, i32, i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x55adbc565418 <../dummy_inc/click/ipaddress.hh:13:1, col:29> ../dummy_inc/click/vector.hh:111:7 class Vector definition
|-DefinitionData standard_layout has_user_declared_ctor has_mutable_fields can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor non_trivial user_declared has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveConstructor exists non_trivial user_declared needs_overload_resolution
| |-CopyAssignment non_trivial has_const_param user_declared needs_overload_resolution implicit_has_const_param
| |-MoveAssignment exists non_trivial user_declared needs_overload_resolution
| `-Destructor simple non_trivial needs_overload_resolution
|-TemplateArgument type 'Element *'
|-CXXRecordDecl 0x55adbc56f568 prev 0x55adbc565418 <col:1, col:7> col:7 implicit class Vector
|-TypedefDecl 0x55adbc570580 <line:113:5, col:44> col:44 array_memory_type 'typename array_memory<Element *>::type':'sized_array_memory<8>'
| `-ElaboratedType 0x55adbc570530 'typename array_memory<Element *>::type' sugar
|   `-TypedefType 0x55adbc570510 'conditional<true, sized_array_memory<8>, typed_array_memory<Element *> >::type' sugar
|     |-Typedef 0x55adbc5703c0 'type'
|     `-SubstTemplateTypeParmType 0x55adbc321250 'sized_array_memory<8>' sugar
|       |-TemplateTypeParmType 0x55adbbfc9040 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55adbbfc8fe8 'T'
|       `-RecordType 0x55adbc320da0 'sized_array_memory<8>'
|         `-ClassTemplateSpecialization 0x55adbc320cb8 'sized_array_memory'
|-FieldDecl 0x55adbc570680 <line:114:5, col:46> col:46 vm_ 'vector_memory<Vector<Element *>::array_memory_type>':'vector_memory<sized_array_memory<8> >' mutable
|-AccessSpecDecl 0x55adbc5706d0 <line:116:3, col:9> col:3 public
|-TypedefDecl 0x55adbc570708 <line:118:5, col:15> col:15 value_type 'Element *':'Element *'
| `-SubstTemplateTypeParmType 0x55adbc56f600 'Element *' sugar
|   |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|   `-PointerType 0x55adbc24d850 'Element *'
|     `-RecordType 0x55adbc24d5d0 'Element'
|       `-CXXRecord 0x55adbc257290 'Element'
|-TypedefDecl 0x55adbc570798 <line:119:5, col:16> col:16 reference 'Element *&'
| `-LValueReferenceType 0x55adbc570760 'Element *&'
|   `-SubstTemplateTypeParmType 0x55adbc56f600 'Element *' sugar
|     |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|     `-PointerType 0x55adbc24d850 'Element *'
|       `-RecordType 0x55adbc24d5d0 'Element'
|         `-CXXRecord 0x55adbc257290 'Element'
|-TypedefDecl 0x55adbc570858 <line:120:5, col:22> col:22 const_reference 'Element *const &'
| `-LValueReferenceType 0x55adbc570820 'Element *const &'
|   `-QualType 0x55adbc56f601 'Element *const' const
|     `-SubstTemplateTypeParmType 0x55adbc56f600 'Element *' sugar
|       |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|       `-PointerType 0x55adbc24d850 'Element *'
|         `-RecordType 0x55adbc24d5d0 'Element'
|           `-CXXRecord 0x55adbc257290 'Element'
|-TypedefDecl 0x55adbc5708e8 <line:121:5, col:16> col:16 pointer 'Element **'
| `-PointerType 0x55adbc5708b0 'Element **'
|   `-SubstTemplateTypeParmType 0x55adbc56f600 'Element *' sugar
|     |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|     `-PointerType 0x55adbc24d850 'Element *'
|       `-RecordType 0x55adbc24d5d0 'Element'
|         `-CXXRecord 0x55adbc257290 'Element'
|-TypedefDecl 0x55adbc5709a8 <line:122:5, col:22> col:22 const_pointer 'Element *const *'
| `-PointerType 0x55adbc570970 'Element *const *'
|   `-QualType 0x55adbc56f601 'Element *const' const
|     `-SubstTemplateTypeParmType 0x55adbc56f600 'Element *' sugar
|       |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|       `-PointerType 0x55adbc24d850 'Element *'
|         `-RecordType 0x55adbc24d5d0 'Element'
|           `-CXXRecord 0x55adbc257290 'Element'
|-TypedefDecl 0x55adbc571580 <line:125:5, col:45> col:45 value_argument_type 'typename fast_argument<Element *>::type':'Element *'
| `-ElaboratedType 0x55adbc571530 'typename fast_argument<Element *>::type' sugar
|   `-TypedefType 0x55adbc571510 'fast_argument<Element *, false>::type' sugar
|     |-Typedef 0x55adbc5714a0 'type'
|     `-SubstTemplateTypeParmType 0x55adbc571260 'Element *' sugar
|       |-TemplateTypeParmType 0x55adbbfd1240 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55adbbfd11f0 'T'
|       `-PointerType 0x55adbc24d850 'Element *'
|         `-RecordType 0x55adbc24d5d0 'Element'
|           `-CXXRecord 0x55adbc257290 'Element'
|-TypedefDecl 0x55adbc5715e8 <line:126:5, col:22> col:22 const_access_type 'Element *const &'
| `-LValueReferenceType 0x55adbc570820 'Element *const &'
|   `-QualType 0x55adbc56f601 'Element *const' const
|     `-SubstTemplateTypeParmType 0x55adbc56f600 'Element *' sugar
|       |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|       `-PointerType 0x55adbc24d850 'Element *'
|         `-RecordType 0x55adbc24d5d0 'Element'
|           `-CXXRecord 0x55adbc257290 'Element'
|-TypedefDecl 0x55adbc571640 <line:128:5, col:17> col:17 size_type 'int'
| `-BuiltinType 0x55adbbce2370 'int'
|-TypedefDecl 0x55adbc5716a8 <line:130:5, col:16> col:16 iterator 'Element **'
| `-PointerType 0x55adbc5708b0 'Element **'
|   `-SubstTemplateTypeParmType 0x55adbc56f600 'Element *' sugar
|     |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|     `-PointerType 0x55adbc24d850 'Element *'
|       `-RecordType 0x55adbc24d5d0 'Element'
|         `-CXXRecord 0x55adbc257290 'Element'
|-TypedefDecl 0x55adbc571710 <line:131:5, col:22> col:22 const_iterator 'Element *const *'
| `-PointerType 0x55adbc570970 'Element *const *'
|   `-QualType 0x55adbc56f601 'Element *const' const
|     `-SubstTemplateTypeParmType 0x55adbc56f600 'Element *' sugar
|       |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|       `-PointerType 0x55adbc24d850 'Element *'
|         `-RecordType 0x55adbc24d5d0 'Element'
|           `-CXXRecord 0x55adbc257290 'Element'
|-EnumDecl 0x55adbc571768 <line:134:5> col:5
| `-EnumConstantDecl 0x55adbc571860 <col:12, col:40> col:12 RESERVE_GROW 'Vector<Element *>::(anonymous enum at ../dummy_inc/click/vector.hh:134:5)'
|   `-ConstantExpr 0x55adbc571840 <col:27, col:40> 'Vector::size_type':'int' Int: -1
|     `-CStyleCastExpr 0x55adbc0003c8 <col:27, col:40> 'Vector::size_type':'int' <NoOp>
|       `-UnaryOperator 0x55adbc0003a0 <col:39, col:40> 'int' prefix '-'
|         `-IntegerLiteral 0x55adbc000380 <col:40> 'int' 1
|-CXXConstructorDecl 0x55adbc5718e8 <line:137:5, col:28> col:21 Vector 'void ()' inline
|-CXXConstructorDecl 0x55adbc573fc8 <line:138:5, col:62> col:21 Vector 'void (Vector::size_type, Vector<Element *>::value_argument_type)' inline
| |-ParmVarDecl 0x55adbc5719a0 <col:28, col:38> col:38 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55adbc571a40 <col:41, col:61> col:61 v 'Vector<Element *>::value_argument_type':'Element *'
|-CXXConstructorDecl 0x55adbc574258 <line:139:5, col:37> col:12 Vector 'void (const Vector<Element *> &)' inline
| `-ParmVarDecl 0x55adbc574140 <col:19, col:36> col:36 x 'const Vector<Element *> &'
|-CXXConstructorDecl 0x55adbc574518 <line:141:5, col:32> col:12 Vector 'void (Vector<Element *> &&)' inline
| `-ParmVarDecl 0x55adbc574400 <col:19, col:31> col:31 x 'Vector<Element *> &&'
|-CXXMethodDecl 0x55adbc574830 <line:144:5, col:51> col:23 operator= 'Vector<Element *> &(const Vector<Element *> &)' inline
| `-ParmVarDecl 0x55adbc574710 <col:33, col:50> col:50 x 'const Vector<Element *> &'
|-CXXMethodDecl 0x55adbc574b40 <line:146:5, col:46> col:23 operator= 'Vector<Element *> &(Vector<Element *> &&)' inline
| `-ParmVarDecl 0x55adbc574a20 <col:33, col:45> col:45 x 'Vector<Element *> &&'
|-CXXMethodDecl 0x55adbc574e30 <line:148:5, col:70> col:23 assign 'Vector<Element *> &(Vector::size_type, Vector<Element *>::value_argument_type)' inline
| |-ParmVarDecl 0x55adbc574c78 <col:30, col:40> col:40 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55adbc574cf0 <col:43, col:69> col:63 v 'Vector<Element *>::value_argument_type':'Element *'
|-CXXMethodDecl 0x55adbc574f88 <line:150:5, col:55> col:49 begin 'Vector<Element *>::iterator ()'
| |-NoInlineAttr 0x55adbc575068 <col:20> Inherited
| `-OptimizeNoneAttr 0x55adbc5750c0 <col:30> Inherited
|-CXXMethodDecl 0x55adbc575108 <line:151:5, col:53> col:49 end 'Vector<Element *>::iterator ()'
| |-NoInlineAttr 0x55adbc5751b8 <col:20> Inherited
| `-OptimizeNoneAttr 0x55adbc575210 <col:30> Inherited
|-CXXMethodDecl 0x55adbc5752d8 <line:152:5, col:63> col:55 begin 'Vector<Element *>::const_iterator () const'
| |-NoInlineAttr 0x55adbc575388 <col:20> Inherited
| `-OptimizeNoneAttr 0x55adbc5753e0 <col:30> Inherited
|-CXXMethodDecl 0x55adbc575428 <line:153:5, col:61> col:55 end 'Vector<Element *>::const_iterator () const'
| |-NoInlineAttr 0x55adbc5754d8 <col:20> Inherited
| `-OptimizeNoneAttr 0x55adbc575530 <col:30> Inherited
|-CXXMethodDecl 0x55adbc575578 <line:154:5, col:64> col:55 cbegin 'Vector<Element *>::const_iterator () const'
| |-NoInlineAttr 0x55adbc575628 <col:20> Inherited
| `-OptimizeNoneAttr 0x55adbc575680 <col:30> Inherited
|-CXXMethodDecl 0x55adbc5756c8 <line:155:5, col:62> col:55 cend 'Vector<Element *>::const_iterator () const'
| |-NoInlineAttr 0x55adbc575778 <col:20> Inherited
| `-OptimizeNoneAttr 0x55adbc5757d0 <col:30> Inherited
|-CXXMethodDecl 0x55adbc5757f8 <line:157:5, col:29> col:22 used size 'Vector::size_type () const' inline
|-CXXMethodDecl 0x55adbc5758a8 <line:158:5, col:33> col:22 capacity 'Vector::size_type () const' inline
|-CXXMethodDecl 0x55adbc575958 <line:159:5, col:25> col:17 empty 'bool () const' inline
|-CXXMethodDecl 0x55adbc575b18 <line:160:5, col:64> col:17 resize 'void (Vector::size_type, Vector<Element *>::value_argument_type)' inline
| |-ParmVarDecl 0x55adbc575a08 <col:24, col:34> col:34 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55adbc575a80 <col:37, col:63> col:57 v 'Vector<Element *>::value_argument_type':'Element *'
|-CXXMethodDecl 0x55adbc575c68 <line:161:5, col:36> col:17 reserve 'bool (Vector::size_type)' inline
| `-ParmVarDecl 0x55adbc575bd8 <col:25, col:35> col:35 n 'Vector::size_type':'int'
|-CXXMethodDecl 0x55adbc575e18 <line:163:5, col:65> col:43 operator[] 'Element *&(Vector::size_type)'
| |-ParmVarDecl 0x55adbc575d20 <col:54, col:64> col:64 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x55adbc575ed0 <col:20>
| `-OptimizeNoneAttr 0x55adbc575f28 <col:30>
|-CXXMethodDecl 0x55adbc576048 <line:164:5, col:73> col:49 operator[] 'Element *const &(Vector::size_type) const'
| |-ParmVarDecl 0x55adbc575f50 <col:60, col:70> col:70 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x55adbc576100 <col:20>
| `-OptimizeNoneAttr 0x55adbc576158 <col:30>
|-CXXMethodDecl 0x55adbc576210 <line:165:5, col:29> col:15 at 'Element *&(Vector::size_type)' inline
| `-ParmVarDecl 0x55adbc576180 <col:18, col:28> col:28 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55adbc576358 <line:166:5, col:37> col:21 at 'Element *const &(Vector::size_type) const' inline
| `-ParmVarDecl 0x55adbc5762c8 <col:24, col:34> col:34 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55adbc576488 <line:167:5, col:21> col:15 front 'Element *&()' inline
|-CXXMethodDecl 0x55adbc5765b8 <line:168:5, col:29> col:21 front 'Element *const &() const' inline
|-CXXMethodDecl 0x55adbc576688 <line:169:5, col:20> col:15 back 'Element *&()' inline
|-CXXMethodDecl 0x55adbc576758 <line:170:5, col:28> col:21 back 'Element *const &() const' inline
|-CXXMethodDecl 0x55adbc576898 <line:172:5, col:39> col:15 unchecked_at 'Element *&(Vector::size_type)' inline
| `-ParmVarDecl 0x55adbc576808 <col:28, col:38> col:38 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55adbc5769e0 <line:173:5, col:47> col:21 unchecked_at 'Element *const &(Vector::size_type) const' inline
| `-ParmVarDecl 0x55adbc576950 <col:34, col:44> col:44 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55adbc576b28 <line:174:5, col:59> col:15 at_u 'Element *&(Vector::size_type)' inline
| |-ParmVarDecl 0x55adbc576a98 <col:20, col:30> col:30 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x55adbc576be0 <col:48> Inherited "" ""
|-CXXMethodDecl 0x55adbc576ce0 <line:175:5, col:71> col:21 at_u 'Element *const &(Vector::size_type) const' inline
| |-ParmVarDecl 0x55adbc576c50 <col:26, col:36> col:36 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x55adbc576d98 <col:60> Inherited "" ""
|-CXXMethodDecl 0x55adbc576e58 <line:177:5, col:20> col:15 data 'Element **()' inline
|-CXXMethodDecl 0x55adbc576f58 <line:178:5, col:28> col:21 data 'Element *const *() const' inline
|-CXXMethodDecl 0x55adbc5770d8 <line:180:5, col:48> col:17 push_back 'void (Vector<Element *>::value_argument_type)' inline
| `-ParmVarDecl 0x55adbc577018 <col:27, col:47> col:47 v 'Vector<Element *>::value_argument_type':'Element *'
|-FunctionTemplateDecl 0x55adbc577898 <line:182:5, line:183:63> col:48 push_back
| |-TemplateTypeParmDecl 0x55adbc577190 <line:182:15, col:43> col:24 typename depth 0 index 0 A
| | `-TemplateArgument type 'fast_argument<Element *>':'fast_argument<Element *, false>'
| `-CXXMethodDecl 0x55adbc5777f8 <line:183:5, col:63> col:48 push_back 'typename A::enable_rvalue_reference (Element *&&)' inline
|   `-ParmVarDecl 0x55adbc5776f8 <col:58, col:62> col:62 v 'Element *&&'
|-CXXMethodDecl 0x55adbc577978 <line:185:5, col:26> col:17 pop_back 'void ()' inline
|-CXXMethodDecl 0x55adbc577ac8 <line:186:5, col:49> col:17 push_front 'void (Vector<Element *>::value_argument_type)' inline
| `-ParmVarDecl 0x55adbc577a38 <col:28, col:48> col:48 v 'Vector<Element *>::value_argument_type':'Element *'
|-CXXMethodDecl 0x55adbc577b80 <line:187:5, col:27> col:17 pop_front 'void ()' inline
|-CXXMethodDecl 0x55adbc577dc8 <line:189:5, col:62> col:21 insert 'Vector<Element *>::iterator (Vector<Element *>::iterator, Vector<Element *>::value_argument_type)' inline
| |-ParmVarDecl 0x55adbc577c40 <col:28, col:37> col:37 it 'Vector<Element *>::iterator':'Element **'
| `-ParmVarDecl 0x55adbc577cb8 <col:41, col:61> col:61 v 'Vector<Element *>::value_argument_type':'Element *'
|-CXXMethodDecl 0x55adbc577f88 <line:190:5, col:38> col:21 erase 'Vector<Element *>::iterator (Vector<Element *>::iterator)' inline
| `-ParmVarDecl 0x55adbc577e98 <col:27, col:36> col:36 it 'Vector<Element *>::iterator':'Element **'
|-CXXMethodDecl 0x55adbc5781d8 <line:191:5, col:49> col:21 erase 'Vector<Element *>::iterator (Vector<Element *>::iterator, Vector<Element *>::iterator)' inline
| |-ParmVarDecl 0x55adbc578050 <col:27, col:36> col:36 a 'Vector<Element *>::iterator':'Element **'
| `-ParmVarDecl 0x55adbc5780c8 <col:39, col:48> col:48 b 'Vector<Element *>::iterator':'Element **'
|-CXXMethodDecl 0x55adbc578298 <line:193:5, col:23> col:17 clear 'void ()' inline
|-CXXMethodDecl 0x55adbc5784f8 <line:195:5, col:34> col:17 swap 'void (Vector<Element *> &)' inline
| `-ParmVarDecl 0x55adbc578400 <col:22, col:33> col:33 x 'Vector<Element *> &'
`-CXXDestructorDecl 0x55adbc5785c8 <../dummy_inc/click/ipaddress.hh:13:29> col:29 implicit ~Vector 'void ()' inline default noexcept-unevaluated 0x55adbc5785c8

Layout: <CGRecordLayout
  LLVMType:%class.Vector = type { %class.vector_memory }
  NonVirtualBaseLLVMType:%class.Vector = type { %class.vector_memory }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x55adbc029070 <../dummy_inc/click/string.hh:189:5, line:198:5> line:189:12 referenced struct memo_t definition
|-DefinitionData pass_in_registers aggregate standard_layout trivially_copyable pod trivial
| |-DefaultConstructor exists trivial needs_implicit
| |-CopyConstructor simple trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveConstructor exists simple trivial needs_implicit
| |-CopyAssignment trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveAssignment exists simple trivial needs_implicit
| `-Destructor simple irrelevant trivial needs_implicit
|-CXXRecordDecl 0x55adbc029188 <col:5, col:12> col:12 implicit struct memo_t
|-FieldDecl 0x55adbc029228 <line:190:2, col:20> col:20 referenced refcount 'volatile uint32_t':'volatile unsigned int'
|-FieldDecl 0x55adbc029288 <line:191:2, col:11> col:11 referenced capacity 'uint32_t':'unsigned int'
|-FieldDecl 0x55adbc0292e8 <line:192:2, col:20> col:20 dirty 'volatile uint32_t':'volatile unsigned int'
`-FieldDecl 0x55adbc029398 <line:197:2, col:18> col:7 real_data 'char [8]'

Layout: <CGRecordLayout
  LLVMType:%"struct.String::memo_t" = type { i32, i32, i32, [8 x i8] }
  NonVirtualBaseLLVMType:%"struct.String::memo_t" = type { i32, i32, i32, [8 x i8] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x55adbc0296a0 <../dummy_inc/click/string.hh:204:5, line:208:5> line:204:12 referenced struct rep_t definition
|-DefinitionData pass_in_registers aggregate standard_layout trivially_copyable pod trivial literal
| |-DefaultConstructor exists trivial
| |-CopyConstructor simple trivial has_const_param implicit_has_const_param
| |-MoveConstructor exists simple trivial
| |-CopyAssignment trivial has_const_param implicit_has_const_param
| |-MoveAssignment exists simple trivial
| `-Destructor simple irrelevant trivial
|-CXXRecordDecl 0x55adbc0297b8 <col:5, col:12> col:12 implicit struct rep_t
|-FieldDecl 0x55adbc029860 <line:205:2, col:14> col:14 referenced data 'const char *'
|-FieldDecl 0x55adbc0298c8 <line:206:2, col:6> col:6 referenced length 'int'
|-FieldDecl 0x55adbc029958 <line:207:2, col:10> col:10 referenced memo 'String::memo_t *'
|-CXXConstructorDecl 0x55adbc02e140 <line:204:12> col:12 implicit used rep_t 'void () noexcept' inline default trivial
| `-CompoundStmt 0x55adbc02e578 <col:12>
|-CXXConstructorDecl 0x55adbc02e248 <col:12> col:12 implicit used constexpr rep_t 'void (const String::rep_t &) noexcept' inline default trivial
| |-ParmVarDecl 0x55adbc02e358 <col:12> col:12 used 'const String::rep_t &'
| |-CXXCtorInitializer Field 0x55adbc029860 'data' 'const char *'
| | `-ImplicitCastExpr 0x55adbc0319c0 <col:12> 'const char *' <LValueToRValue>
| |   `-MemberExpr 0x55adbc031990 <col:12> 'const char *const' lvalue .data 0x55adbc029860
| |     `-DeclRefExpr 0x55adbc031970 <col:12> 'const String::rep_t' lvalue ParmVar 0x55adbc02e358 '' 'const String::rep_t &'
| |-CXXCtorInitializer Field 0x55adbc0298c8 'length' 'int'
| | `-ImplicitCastExpr 0x55adbc031a50 <col:12> 'int' <LValueToRValue>
| |   `-MemberExpr 0x55adbc031a20 <col:12> 'const int' lvalue .length 0x55adbc0298c8
| |     `-DeclRefExpr 0x55adbc031a00 <col:12> 'const String::rep_t' lvalue ParmVar 0x55adbc02e358 '' 'const String::rep_t &'
| |-CXXCtorInitializer Field 0x55adbc029958 'memo' 'String::memo_t *'
| | `-ImplicitCastExpr 0x55adbc031ae0 <col:12> 'String::memo_t *' <LValueToRValue>
| |   `-MemberExpr 0x55adbc031ab0 <col:12> 'String::memo_t *const' lvalue .memo 0x55adbc029958
| |     `-DeclRefExpr 0x55adbc031a90 <col:12> 'const String::rep_t' lvalue ParmVar 0x55adbc02e358 '' 'const String::rep_t &'
| `-CompoundStmt 0x55adbc031b38 <col:12>
|-CXXConstructorDecl 0x55adbc02e3f8 <col:12> col:12 implicit constexpr rep_t 'void (String::rep_t &&)' inline default trivial noexcept-unevaluated 0x55adbc02e3f8
| `-ParmVarDecl 0x55adbc02e508 <col:12> col:12 'String::rep_t &&'
|-CXXDestructorDecl 0x55adbc034860 <col:12> col:12 implicit ~rep_t 'void () noexcept' inline default trivial
|-CXXMethodDecl 0x55adbc03dee8 <col:12> col:12 implicit used constexpr operator= 'String::rep_t &(const String::rep_t &) noexcept' inline default trivial
| |-ParmVarDecl 0x55adbc03dff8 <col:12> col:12 used 'const String::rep_t &'
| `-CompoundStmt 0x55adbc03e510 <col:12>
|   |-BinaryOperator 0x55adbc03e328 <col:12> 'const char *' lvalue '='
|   | |-MemberExpr 0x55adbc03e2e0 <col:12> 'const char *' lvalue ->data 0x55adbc029860
|   | | `-CXXThisExpr 0x55adbc03e2d0 <col:12> 'String::rep_t *' this
|   | `-ImplicitCastExpr 0x55adbc03e310 <col:12> 'const char *' <LValueToRValue>
|   |   `-MemberExpr 0x55adbc03e2a0 <col:12> 'const char *const' lvalue .data 0x55adbc029860
|   |     `-DeclRefExpr 0x55adbc03e280 <col:12> 'const String::rep_t' lvalue ParmVar 0x55adbc03dff8 '' 'const String::rep_t &'
|   |-BinaryOperator 0x55adbc03e3f0 <col:12> 'int' lvalue '='
|   | |-MemberExpr 0x55adbc03e3a8 <col:12> 'int' lvalue ->length 0x55adbc0298c8
|   | | `-CXXThisExpr 0x55adbc03e398 <col:12> 'String::rep_t *' this
|   | `-ImplicitCastExpr 0x55adbc03e3d8 <col:12> 'int' <LValueToRValue>
|   |   `-MemberExpr 0x55adbc03e368 <col:12> 'const int' lvalue .length 0x55adbc0298c8
|   |     `-DeclRefExpr 0x55adbc03e348 <col:12> 'const String::rep_t' lvalue ParmVar 0x55adbc03dff8 '' 'const String::rep_t &'
|   |-BinaryOperator 0x55adbc03e4b8 <col:12> 'String::memo_t *' lvalue '='
|   | |-MemberExpr 0x55adbc03e470 <col:12> 'String::memo_t *' lvalue ->memo 0x55adbc029958
|   | | `-CXXThisExpr 0x55adbc03e460 <col:12> 'String::rep_t *' this
|   | `-ImplicitCastExpr 0x55adbc03e4a0 <col:12> 'String::memo_t *' <LValueToRValue>
|   |   `-MemberExpr 0x55adbc03e430 <col:12> 'String::memo_t *const' lvalue .memo 0x55adbc029958
|   |     `-DeclRefExpr 0x55adbc03e410 <col:12> 'const String::rep_t' lvalue ParmVar 0x55adbc03dff8 '' 'const String::rep_t &'
|   `-ReturnStmt 0x55adbc03e500 <col:12>
|     `-UnaryOperator 0x55adbc03e4e8 <col:12> 'String::rep_t' lvalue prefix '*' cannot overflow
|       `-CXXThisExpr 0x55adbc03e4d8 <col:12> 'String::rep_t *' this
`-CXXMethodDecl 0x55adbc03e068 <col:12> col:12 implicit constexpr operator= 'String::rep_t &(String::rep_t &&)' inline default trivial noexcept-unevaluated 0x55adbc03e068
  `-ParmVarDecl 0x55adbc03e178 <col:12> col:12 'String::rep_t &&'

Layout: <CGRecordLayout
  LLVMType:%"struct.String::rep_t" = type { i8*, i32, %"struct.String::memo_t"* }
  NonVirtualBaseLLVMType:%"struct.String::rep_t" = type { i8*, i32, %"struct.String::memo_t"* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x55adbc01f5e0 <../dummy_inc/click/string.hh:19:1, line:304:1> line:19:7 referenced class String definition
|-DefinitionData standard_layout has_user_declared_ctor has_mutable_fields can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor non_trivial user_declared has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveConstructor exists non_trivial user_declared
| |-CopyAssignment non_trivial has_const_param user_declared needs_overload_resolution implicit_has_const_param
| |-MoveAssignment exists non_trivial user_declared
| `-Destructor non_trivial user_declared
|-CXXRecordDecl 0x55adbc01f6f8 <col:1, col:7> col:7 implicit referenced class String
|-AccessSpecDecl 0x55adbc01f788 <col:16, col:22> col:16 public
|-TypedefDecl 0x55adbc01f7c8 <line:21:5, col:25> col:25 referenced const_iterator 'const char *'
| `-PointerType 0x55adbbce2dc0 'const char *'
|   `-QualType 0x55adbbce2311 'const char' const
|     `-BuiltinType 0x55adbbce2310 'char'
|-TypedefDecl 0x55adbc01f850 <line:22:5, col:28> col:28 iterator 'String::const_iterator':'const char *'
| `-TypedefType 0x55adbc01f820 'String::const_iterator' sugar
|   |-Typedef 0x55adbc01f7c8 'const_iterator'
|   `-PointerType 0x55adbbce2dc0 'const char *'
|     `-QualType 0x55adbbce2311 'const char' const
|       `-BuiltinType 0x55adbbce2310 'char'
|-TypedefDecl 0x55adbc01f9c0 <line:24:5, col:52> col:27 referenced unspecified_bool_type 'int (String::*)() const'
| `-MemberPointerType 0x55adbc01f930 'int (String::*)() const'
|   |-RecordType 0x55adbc01f670 'String'
|   | `-CXXRecord 0x55adbc01f5e0 'String'
|   `-ParenType 0x55adbc01f8d0 'int () const' sugar
|     `-FunctionProtoType 0x55adbc002000 'int () const' const cdecl
|       `-BuiltinType 0x55adbbce2370 'int'
|-TypedefDecl 0x55adbc01fa28 <line:27:5, col:21> col:21 referenced intmax_t 'int64_t':'long'
| `-TypedefType 0x55adbbe40540 'int64_t' sugar
|   |-Typedef 0x55adbbd4b2d0 'int64_t'
|   `-TypedefType 0x55adbbd244d0 '__int64_t' sugar
|     |-Typedef 0x55adbbd240a8 '__int64_t'
|     `-BuiltinType 0x55adbbce2390 'long'
|-TypedefDecl 0x55adbc01fa90 <line:28:5, col:22> col:22 referenced uintmax_t 'uint64_t':'unsigned long'
| `-TypedefType 0x55adbbe40460 'uint64_t' sugar
|   |-Typedef 0x55adbbd4b470 'uint64_t'
|   `-TypedefType 0x55adbbd24560 '__uint64_t' sugar
|     |-Typedef 0x55adbbd24118 '__uint64_t'
|     `-BuiltinType 0x55adbbce2430 'unsigned long'
|-TypedefDecl 0x55adbc01fb20 <line:36:5, col:22> col:22 int_large_t 'String::intmax_t':'long'
| `-TypedefType 0x55adbc01faf0 'String::intmax_t' sugar
|   |-Typedef 0x55adbc01fa28 'intmax_t'
|   `-TypedefType 0x55adbbe40540 'int64_t' sugar
|     |-Typedef 0x55adbbd4b2d0 'int64_t'
|     `-TypedefType 0x55adbbd244d0 '__int64_t' sugar
|       |-Typedef 0x55adbbd240a8 '__int64_t'
|       `-BuiltinType 0x55adbbce2390 'long'
|-TypedefDecl 0x55adbc01fbb0 <line:37:5, col:23> col:23 uint_large_t 'String::uintmax_t':'unsigned long'
| `-TypedefType 0x55adbc01fb80 'String::uintmax_t' sugar
|   |-Typedef 0x55adbc01fa90 'uintmax_t'
|   `-TypedefType 0x55adbbe40460 'uint64_t' sugar
|     |-Typedef 0x55adbbd4b470 'uint64_t'
|     `-TypedefType 0x55adbbd24560 '__uint64_t' sugar
|       |-Typedef 0x55adbbd24118 '__uint64_t'
|       `-BuiltinType 0x55adbbce2430 'unsigned long'
|-CXXConstructorDecl 0x55adbc01fc70 <line:39:5, col:19> col:12 used String 'void ()' inline
|-CXXConstructorDecl 0x55adbc01fe18 <line:40:5, col:34> col:12 used String 'void (const String &)' inline
| `-ParmVarDecl 0x55adbc01fd58 <col:19, col:33> col:33 x 'const String &'
|-CXXConstructorDecl 0x55adbc01ffc8 <line:42:5, col:29> col:12 used String 'void (String &&)' inline
| `-ParmVarDecl 0x55adbc01ff08 <col:19, col:28> col:28 x 'String &&'
|-CXXConstructorDecl 0x55adbc020120 <line:44:5, col:35> col:12 used String 'void (const char *)' inline
| `-ParmVarDecl 0x55adbc020090 <col:19, col:31> col:31 cstr 'const char *'
|-CXXConstructorDecl 0x55adbc020338 <line:45:5, col:41> col:12 String 'void (const char *, int)' inline
| |-ParmVarDecl 0x55adbc0201e8 <col:19, col:31> col:31 s 'const char *'
| `-ParmVarDecl 0x55adbc020268 <col:34, col:38> col:38 len 'int'
|-CXXConstructorDecl 0x55adbc020558 <line:46:5, col:50> col:12 String 'void (const unsigned char *, int)' inline
| |-ParmVarDecl 0x55adbc020408 <col:19, col:40> col:40 s 'const unsigned char *'
| `-ParmVarDecl 0x55adbc020488 <col:43, col:47> col:47 len 'int'
|-CXXConstructorDecl 0x55adbc020778 <line:47:5, col:54> col:12 used String 'void (const char *, const char *)' inline
| |-ParmVarDecl 0x55adbc020628 <col:19, col:31> col:31 first 'const char *'
| `-ParmVarDecl 0x55adbc0206a8 <col:38, col:50> col:50 last 'const char *'
|-CXXConstructorDecl 0x55adbc020998 <line:48:5, col:72> col:12 String 'void (const unsigned char *, const unsigned char *)' inline
| |-ParmVarDecl 0x55adbc020848 <col:19, col:40> col:40 first 'const unsigned char *'
| `-ParmVarDecl 0x55adbc0208c8 <col:47, col:68> col:68 last 'const unsigned char *'
|-CXXConstructorDecl 0x55adbc020b28 <line:49:5, col:34> col:21 used String 'void (bool)' inline
| `-ParmVarDecl 0x55adbc020a60 <col:28, col:33> col:33 x 'bool'
|-CXXConstructorDecl 0x55adbc020ca8 <line:50:5, col:34> col:21 String 'void (char)' inline
| `-ParmVarDecl 0x55adbc020be8 <col:28, col:33> col:33 c 'char'
|-CXXConstructorDecl 0x55adbc020e38 <line:51:5, col:43> col:21 String 'void (unsigned char)' inline
| `-ParmVarDecl 0x55adbc020d70 <col:28, col:42> col:42 c 'unsigned char'
|-CXXConstructorDecl 0x55adbc020f90 <line:52:5, col:26> col:14 String 'void (int)'
| `-ParmVarDecl 0x55adbc020f00 <col:21, col:25> col:25 x 'int'
|-CXXConstructorDecl 0x55adbc021118 <line:53:5, col:31> col:14 String 'void (unsigned int)'
| `-ParmVarDecl 0x55adbc021058 <col:21, col:30> col:30 x 'unsigned int'
|-CXXConstructorDecl 0x55adbc021270 <line:54:5, col:27> col:14 String 'void (long)'
| `-ParmVarDecl 0x55adbc0211e0 <col:21, col:26> col:26 x 'long'
|-CXXConstructorDecl 0x55adbc0213f8 <line:55:5, col:36> col:14 String 'void (unsigned long)'
| `-ParmVarDecl 0x55adbc021338 <col:21, col:35> col:35 x 'unsigned long'
|-CXXConstructorDecl 0x55adbc021588 <line:57:5, col:32> col:14 String 'void (long long)'
| `-ParmVarDecl 0x55adbc0214c0 <col:21, col:31> col:31 x 'long long'
|-CXXConstructorDecl 0x55adbc021718 <line:58:5, col:41> col:14 String 'void (unsigned long long)'
| `-ParmVarDecl 0x55adbc021650 <col:21, col:40> col:40 x 'unsigned long long'
|-CXXConstructorDecl 0x55adbc0218a8 <line:65:5, col:29> col:14 String 'void (double)'
| `-ParmVarDecl 0x55adbc0217e0 <col:21, col:28> col:28 x 'double'
|-CXXDestructorDecl 0x55adbc0219a0 <line:67:5, col:20> col:12 used ~String 'void () noexcept' inline
|-CXXMethodDecl 0x55adbc021ac8 <line:69:5, col:44> col:33 make_empty 'const String &()' static inline
|-CXXMethodDecl 0x55adbc021c48 <line:70:5, col:52> col:26 used make_uninitialized 'String (int)' static inline
| `-ParmVarDecl 0x55adbc021b80 <col:45, col:49> col:49 len 'int'
|-CXXMethodDecl 0x55adbc021d98 <line:71:5, col:74> col:26 make_garbage 'String (int)' static inline
| |-ParmVarDecl 0x55adbc021d08 <col:39, col:43> col:43 len 'int'
| `-DeprecatedAttr 0x55adbc021e40 <col:63> "" ""
|-CXXMethodDecl 0x55adbc021f88 <line:72:5, col:54> col:26 make_stable 'String (const char *)' static inline
| `-ParmVarDecl 0x55adbc021ec8 <col:38, col:50> col:50 cstr 'const char *'
|-CXXMethodDecl 0x55adbc022198 <line:73:5, col:60> col:26 make_stable 'String (const char *, int)' static inline
| |-ParmVarDecl 0x55adbc022048 <col:38, col:50> col:50 s 'const char *'
| `-ParmVarDecl 0x55adbc0220c8 <col:53, col:57> col:57 len 'int'
|-CXXMethodDecl 0x55adbc0223b8 <line:74:5, col:73> col:26 make_stable 'String (const char *, const char *)' static inline
| |-ParmVarDecl 0x55adbc022260 <col:38, col:50> col:50 first 'const char *'
| `-ParmVarDecl 0x55adbc0222e0 <col:57, col:69> col:69 last 'const char *'
|-CXXMethodDecl 0x55adbc022698 <line:75:5, col:80> col:19 make_numeric 'String (String::intmax_t, int, bool)' static
| |-ParmVarDecl 0x55adbc022478 <col:32, col:41> col:41 x 'String::intmax_t':'long'
| |-ParmVarDecl 0x55adbc0224f8 <col:44, col:55> col:48 base 'int' cinit
| | `-IntegerLiteral 0x55adbc02dc10 <col:55> 'int' 10
| `-ParmVarDecl 0x55adbc022570 <col:59, col:76> col:64 uppercase 'bool' cinit
|   `-CXXBoolLiteralExpr 0x55adbc02dc30 <col:76> 'bool' true
|-CXXMethodDecl 0x55adbc022978 <line:76:5, col:81> col:19 make_numeric 'String (String::uintmax_t, int, bool)' static
| |-ParmVarDecl 0x55adbc022760 <col:32, col:42> col:42 x 'String::uintmax_t':'unsigned long'
| |-ParmVarDecl 0x55adbc0227e0 <col:45, col:56> col:49 base 'int' cinit
| | `-IntegerLiteral 0x55adbc02dc40 <col:56> 'int' 10
| `-ParmVarDecl 0x55adbc022858 <col:60, col:77> col:65 uppercase 'bool' cinit
|   `-CXXBoolLiteralExpr 0x55adbc02dc60 <col:77> 'bool' true
|-CXXMethodDecl 0x55adbc022a80 <line:78:5, col:31> col:24 used data 'const char *() const' inline
|-CXXMethodDecl 0x55adbc022b48 <line:79:5, col:25> col:16 used length 'int () const' inline
|-CXXMethodDecl 0x55adbc022c10 <line:81:5, col:60> col:52 c_str 'const char *() const'
| |-NoInlineAttr 0x55adbc022cb0 <col:20>
| `-OptimizeNoneAttr 0x55adbc022d08 <col:30>
|-CXXConversionDecl 0x55adbc022df8 <line:83:5, col:45> col:12 used operator int (String::*)() const 'String::unspecified_bool_type () const' inline
|-CXXMethodDecl 0x55adbc022ec8 <line:84:5, col:25> col:17 used empty 'bool () const' inline
|-CXXMethodDecl 0x55adbc022f88 <line:85:5, col:29> col:17 operator! 'bool () const' inline
|-CXXMethodDecl 0x55adbc023078 <line:87:5, col:35> col:27 used begin 'String::const_iterator () const' inline
|-CXXMethodDecl 0x55adbc023138 <line:88:5, col:33> col:27 used end 'String::const_iterator () const' inline
|-CXXMethodDecl 0x55adbc0232b8 <line:90:5, col:35> col:17 used operator[] 'char (int) const' inline
| `-ParmVarDecl 0x55adbc0231f0 <col:28, col:32> col:32 i 'int'
|-CXXMethodDecl 0x55adbc023408 <line:91:5, col:27> col:17 at 'char (int) const' inline
| `-ParmVarDecl 0x55adbc023378 <col:20, col:24> col:24 i 'int'
|-CXXMethodDecl 0x55adbc0234f8 <line:92:5, col:25> col:17 front 'char () const' inline
|-CXXMethodDecl 0x55adbc0235b8 <line:93:5, col:24> col:17 back 'char () const' inline
|-CXXMethodDecl 0x55adbc023808 <line:95:5, col:64> col:21 used hashcode 'uint32_t (const char *, const char *)' static
| |-ParmVarDecl 0x55adbc023670 <col:30, col:42> col:42 begin 'const char *'
| `-ParmVarDecl 0x55adbc0236f0 <col:49, col:61> col:61 end 'const char *'
|-CXXMethodDecl 0x55adbc023a68 <line:96:5, line:97:33> line:96:28 hashcode 'uint32_t (const unsigned char *, const unsigned char *)' static inline
| |-ParmVarDecl 0x55adbc0238d0 <col:37, col:58> col:58 begin 'const unsigned char *'
| `-ParmVarDecl 0x55adbc023950 <line:97:9, col:30> col:30 end 'const unsigned char *'
|-CXXMethodDecl 0x55adbc023b38 <line:98:5, col:32> col:21 hashcode 'uint32_t () const' inline
|-CXXMethodDecl 0x55adbc023d48 <line:100:5, col:65> col:19 substring 'String (const char *, const char *) const' inline
| |-ParmVarDecl 0x55adbc023bf0 <col:29, col:41> col:41 begin 'const char *'
| `-ParmVarDecl 0x55adbc023c70 <col:48, col:60> col:60 end 'const char *'
|-CXXMethodDecl 0x55adbc023f68 <line:101:5, col:40> col:12 used substring 'String (int, int) const'
| |-ParmVarDecl 0x55adbc023e10 <col:22, col:26> col:26 pos 'int'
| `-ParmVarDecl 0x55adbc023e90 <col:31, col:35> col:35 len 'int'
|-CXXMethodDecl 0x55adbc0240f8 <line:102:5, col:38> col:19 substring 'String (int) const' inline
| `-ParmVarDecl 0x55adbc024030 <col:29, col:33> col:33 pos 'int'
|-CXXMethodDecl 0x55adbc0241e8 <line:103:5, col:25> col:12 trim_space 'String () const'
|-CXXMethodDecl 0x55adbc024358 <line:105:5, col:41> col:17 equals 'bool (const String &) const' inline
| `-ParmVarDecl 0x55adbc024298 <col:24, col:38> col:38 x 'const String &'
|-CXXMethodDecl 0x55adbc024568 <line:106:5, col:48> col:17 used equals 'bool (const char *, int) const' inline
| |-ParmVarDecl 0x55adbc024418 <col:24, col:36> col:36 s 'const char *'
| `-ParmVarDecl 0x55adbc024498 <col:39, col:43> col:43 len 'int'
|-CXXMethodDecl 0x55adbc024780 <line:107:5, col:63> col:23 used compare 'int (const String &, const String &)' static inline
| |-ParmVarDecl 0x55adbc024628 <col:31, col:45> col:45 a 'const String &'
| `-ParmVarDecl 0x55adbc0246a0 <col:48, col:62> col:62 b 'const String &'
|-CXXMethodDecl 0x55adbc024910 <line:108:5, col:41> col:16 used compare 'int (const String &) const' inline
| `-ParmVarDecl 0x55adbc024840 <col:24, col:38> col:38 x 'const String &'
|-CXXMethodDecl 0x55adbc024b30 <line:109:5, col:41> col:9 used compare 'int (const char *, int) const'
| |-ParmVarDecl 0x55adbc0249d0 <col:17, col:29> col:29 s 'const char *'
| `-ParmVarDecl 0x55adbc024a50 <col:32, col:36> col:36 len 'int'
|-CXXMethodDecl 0x55adbc024c80 <line:110:5, col:46> col:17 starts_with 'bool (const String &) const' inline
| `-ParmVarDecl 0x55adbc024bf0 <col:29, col:43> col:43 x 'const String &'
|-CXXMethodDecl 0x55adbc024e58 <line:111:5, col:46> col:10 used starts_with 'bool (const char *, int) const'
| |-ParmVarDecl 0x55adbc024d40 <col:22, col:34> col:34 s 'const char *'
| `-ParmVarDecl 0x55adbc024dc0 <col:37, col:41> col:41 len 'int'
|-CXXMethodDecl 0x55adbc024fa8 <line:112:5, col:44> col:10 glob_match 'bool (const String &) const'
| `-ParmVarDecl 0x55adbc024f18 <col:21, col:35> col:35 pattern 'const String &'
|-CXXMethodDecl 0x55adbc0261f0 <line:125:5, col:42> col:9 find_left 'int (char, int) const'
| |-ParmVarDecl 0x55adbc025060 <col:19, col:24> col:24 c 'char'
| `-ParmVarDecl 0x55adbc026110 <col:27, col:39> col:31 start 'int' cinit
|   `-IntegerLiteral 0x55adbc02dc70 <col:39> 'int' 0
|-CXXMethodDecl 0x55adbc026410 <line:126:5, col:51> col:9 find_left 'int (const String &, int) const'
| |-ParmVarDecl 0x55adbc0262b0 <col:19, col:33> col:33 x 'const String &'
| `-ParmVarDecl 0x55adbc026330 <col:36, col:48> col:40 start 'int' cinit
|   `-IntegerLiteral 0x55adbc02dc90 <col:48> 'int' 0
|-CXXMethodDecl 0x55adbc0265f0 <line:127:5, col:52> col:9 find_right 'int (char, int) const'
| |-ParmVarDecl 0x55adbc0264d0 <col:20, col:25> col:25 c 'char'
| `-ParmVarDecl 0x55adbc026550 <col:28, col:40> col:32 start 'int' cinit
|   `-IntegerLiteral 0x55adbc02dcb0 <col:40> 'int' 2147483647
|-CXXMethodDecl 0x55adbc0266c0 <line:129:5, col:20> col:12 lower 'String () const'
|-CXXMethodDecl 0x55adbc026780 <line:130:5, col:20> col:12 upper 'String () const'
|-CXXMethodDecl 0x55adbc026840 <line:131:5, col:24> col:12 printable 'String () const'
|-CXXMethodDecl 0x55adbc026900 <line:132:5, col:25> col:12 quoted_hex 'String () const'
|-CXXMethodDecl 0x55adbc0269c0 <line:133:5, col:26> col:12 encode_json 'String () const'
|-CXXMethodDecl 0x55adbc026b68 <line:135:5, col:45> col:20 used operator= 'String &(const String &)' inline
| `-ParmVarDecl 0x55adbc026a70 <col:30, col:44> col:44 x 'const String &'
|-CXXMethodDecl 0x55adbc026ce8 <line:137:5, col:40> col:20 used operator= 'String &(String &&)' inline
| `-ParmVarDecl 0x55adbc026c20 <col:30, col:39> col:39 x 'String &&'
|-CXXMethodDecl 0x55adbc026e68 <line:139:5, col:46> col:20 operator= 'String &(const char *)' inline
| `-ParmVarDecl 0x55adbc026da8 <col:30, col:42> col:42 cstr 'const char *'
|-CXXMethodDecl 0x55adbc026fe8 <line:141:5, col:31> col:17 swap 'void (String &)' inline
| `-ParmVarDecl 0x55adbc026f20 <col:22, col:30> col:30 x 'String &'
|-CXXMethodDecl 0x55adbc027130 <line:143:5, col:39> col:17 append 'void (const String &)' inline
| `-ParmVarDecl 0x55adbc0270a0 <col:24, col:38> col:38 x 'const String &'
|-CXXMethodDecl 0x55adbc027280 <line:144:5, col:40> col:17 used append 'void (const char *)' inline
| `-ParmVarDecl 0x55adbc0271f0 <col:24, col:36> col:36 cstr 'const char *'
|-CXXMethodDecl 0x55adbc027458 <line:145:5, col:46> col:17 used append 'void (const char *, int)' inline
| |-ParmVarDecl 0x55adbc027340 <col:24, col:36> col:36 s 'const char *'
| `-ParmVarDecl 0x55adbc0273c0 <col:39, col:43> col:43 len 'int'
|-CXXMethodDecl 0x55adbc027638 <line:146:5, col:59> col:17 append 'void (const char *, const char *)' inline
| |-ParmVarDecl 0x55adbc027520 <col:24, col:36> col:36 first 'const char *'
| `-ParmVarDecl 0x55adbc0275a0 <col:43, col:55> col:55 last 'const char *'
|-CXXMethodDecl 0x55adbc027788 <line:147:5, col:30> col:17 append 'void (char)' inline
| `-ParmVarDecl 0x55adbc0276f8 <col:24, col:29> col:29 c 'char'
|-CXXMethodDecl 0x55adbc027998 <line:148:5, col:36> col:10 append_fill 'void (int, int)'
| |-ParmVarDecl 0x55adbc027848 <col:22, col:26> col:26 c 'int'
| `-ParmVarDecl 0x55adbc0278c8 <col:29, col:33> col:33 len 'int'
|-CXXMethodDecl 0x55adbc027af8 <line:149:5, col:39> col:11 used append_uninitialized 'char *(int)'
| `-ParmVarDecl 0x55adbc027a60 <col:32, col:36> col:36 len 'int'
|-CXXMethodDecl 0x55adbc027c50 <line:150:5, col:68> col:18 append_garbage 'char *(int)' inline
| |-ParmVarDecl 0x55adbc027bb8 <col:33, col:37> col:37 len 'int'
| `-DeprecatedAttr 0x55adbc027cf8 <col:57> "" ""
|-CXXMethodDecl 0x55adbc027e08 <line:152:5, col:46> col:20 used operator+= 'String &(const String &)' inline
| `-ParmVarDecl 0x55adbc027d78 <col:31, col:45> col:45 x 'const String &'
|-CXXMethodDecl 0x55adbc027f58 <line:153:5, col:47> col:20 operator+= 'String &(const char *)' inline
| `-ParmVarDecl 0x55adbc027ec8 <col:31, col:43> col:43 cstr 'const char *'
|-CXXMethodDecl 0x55adbc0280d8 <line:154:5, col:37> col:20 operator+= 'String &(char)' inline
| `-ParmVarDecl 0x55adbc028010 <col:31, col:36> col:36 c 'char'
|-CXXMethodDecl 0x55adbc0281a0 <line:160:5, col:29> col:17 is_shared 'bool () const' inline
|-CXXMethodDecl 0x55adbc028260 <line:161:5, col:29> col:17 is_stable 'bool () const' inline
|-CXXMethodDecl 0x55adbc028320 <line:163:5, col:60> col:19 unique 'String () const' inline
| `-DeprecatedAttr 0x55adbc0283c0 <col:49> "" ""
|-CXXMethodDecl 0x55adbc028450 <line:164:5, col:30> col:19 used unshared 'String () const' inline
|-CXXMethodDecl 0x55adbc028510 <line:165:5, col:29> col:19 compact 'String () const' inline
|-CXXMethodDecl 0x55adbc028600 <line:167:5, col:24> col:11 mutable_data 'char *()'
|-CXXMethodDecl 0x55adbc0286c8 <line:168:5, col:25> col:11 mutable_c_str 'char *()'
|-CXXMethodDecl 0x55adbc028788 <line:170:5, col:52> col:33 make_out_of_memory 'const String &()' static inline
|-CXXMethodDecl 0x55adbc028848 <line:171:5, col:33> col:17 out_of_memory 'bool () const' inline
|-CXXMethodDecl 0x55adbc028940 <line:172:5, col:50> col:31 out_of_memory_data 'const char *()' static inline
|-CXXMethodDecl 0x55adbc028a08 <line:173:5, col:44> col:23 out_of_memory_length 'int ()' static inline
|-CXXMethodDecl 0x55adbc028ad0 <line:174:5, col:42> col:31 used empty_data 'const char *()' static inline
|-CXXMethodDecl 0x55adbc028ca8 <line:180:5, col:81> col:31 skip_utf8_char 'const char *(const char *, const char *)' static inline
| |-ParmVarDecl 0x55adbc028b88 <col:46, col:58> col:58 first 'const char *'
| `-ParmVarDecl 0x55adbc028c08 <col:65, col:77> col:77 last 'const char *'
|-CXXMethodDecl 0x55adbc028ed0 <line:181:5, line:182:38> line:181:33 used skip_utf8_char 'const unsigned char *(const unsigned char *, const unsigned char *)' static
| |-ParmVarDecl 0x55adbc028d70 <col:48, col:69> col:69 first 'const unsigned char *'
| `-ParmVarDecl 0x55adbc028df0 <line:182:13, col:34> col:34 last 'const unsigned char *'
|-VarDecl 0x55adbc028fe0 <line:184:5, col:35> col:23 used bool_data 'const char [11]' static
|-AccessSpecDecl 0x55adbc029048 <line:186:3, col:10> col:3 private
|-CXXRecordDecl 0x55adbc029070 <line:189:5, line:198:5> line:189:12 referenced struct memo_t definition
| |-DefinitionData pass_in_registers aggregate standard_layout trivially_copyable pod trivial
| | |-DefaultConstructor exists trivial needs_implicit
| | |-CopyConstructor simple trivial has_const_param needs_implicit implicit_has_const_param
| | |-MoveConstructor exists simple trivial needs_implicit
| | |-CopyAssignment trivial has_const_param needs_implicit implicit_has_const_param
| | |-MoveAssignment exists simple trivial needs_implicit
| | `-Destructor simple irrelevant trivial needs_implicit
| |-CXXRecordDecl 0x55adbc029188 <col:5, col:12> col:12 implicit struct memo_t
| |-FieldDecl 0x55adbc029228 <line:190:2, col:20> col:20 referenced refcount 'volatile uint32_t':'volatile unsigned int'
| |-FieldDecl 0x55adbc029288 <line:191:2, col:11> col:11 referenced capacity 'uint32_t':'unsigned int'
| |-FieldDecl 0x55adbc0292e8 <line:192:2, col:20> col:20 dirty 'volatile uint32_t':'volatile unsigned int'
| `-FieldDecl 0x55adbc029398 <line:197:2, col:18> col:7 real_data 'char [8]'
|-EnumDecl 0x55adbc029400 <line:200:5, line:202:5> line:200:5
| `-EnumConstantDecl 0x55adbc029638 <line:201:2, col:32> col:2 referenced MEMO_SPACE 'String::(anonymous enum at ../dummy_inc/click/string.hh:200:5)'
|   `-ImplicitCastExpr 0x55adbc029688 <col:15, col:32> 'unsigned int' <IntegralCast>
|     `-ConstantExpr 0x55adbc029618 <col:15, col:32> 'unsigned long' Int: 12
|       `-BinaryOperator 0x55adbc029528 <col:15, col:32> 'unsigned long' '-'
|         |-UnaryExprOrTypeTraitExpr 0x55adbc0294d0 <col:15, col:28> 'unsigned long' sizeof 'String::memo_t'
|         `-ImplicitCastExpr 0x55adbc029510 <col:32> 'unsigned long' <IntegralCast>
|           `-IntegerLiteral 0x55adbc0294f0 <col:32> 'int' 8
|-CXXRecordDecl 0x55adbc0296a0 <line:204:5, line:208:5> line:204:12 referenced struct rep_t definition
| |-DefinitionData pass_in_registers aggregate standard_layout trivially_copyable pod trivial literal
| | |-DefaultConstructor exists trivial
| | |-CopyConstructor simple trivial has_const_param implicit_has_const_param
| | |-MoveConstructor exists simple trivial
| | |-CopyAssignment trivial has_const_param implicit_has_const_param
| | |-MoveAssignment exists simple trivial
| | `-Destructor simple irrelevant trivial
| |-CXXRecordDecl 0x55adbc0297b8 <col:5, col:12> col:12 implicit struct rep_t
| |-FieldDecl 0x55adbc029860 <line:205:2, col:14> col:14 referenced data 'const char *'
| |-FieldDecl 0x55adbc0298c8 <line:206:2, col:6> col:6 referenced length 'int'
| |-FieldDecl 0x55adbc029958 <line:207:2, col:10> col:10 referenced memo 'String::memo_t *'
| |-CXXConstructorDecl 0x55adbc02e140 <line:204:12> col:12 implicit used rep_t 'void () noexcept' inline default trivial
| | `-CompoundStmt 0x55adbc02e578 <col:12>
| |-CXXConstructorDecl 0x55adbc02e248 <col:12> col:12 implicit used constexpr rep_t 'void (const String::rep_t &) noexcept' inline default trivial
| | |-ParmVarDecl 0x55adbc02e358 <col:12> col:12 used 'const String::rep_t &'
| | |-CXXCtorInitializer Field 0x55adbc029860 'data' 'const char *'
| | | `-ImplicitCastExpr 0x55adbc0319c0 <col:12> 'const char *' <LValueToRValue>
| | |   `-MemberExpr 0x55adbc031990 <col:12> 'const char *const' lvalue .data 0x55adbc029860
| | |     `-DeclRefExpr 0x55adbc031970 <col:12> 'const String::rep_t' lvalue ParmVar 0x55adbc02e358 '' 'const String::rep_t &'
| | |-CXXCtorInitializer Field 0x55adbc0298c8 'length' 'int'
| | | `-ImplicitCastExpr 0x55adbc031a50 <col:12> 'int' <LValueToRValue>
| | |   `-MemberExpr 0x55adbc031a20 <col:12> 'const int' lvalue .length 0x55adbc0298c8
| | |     `-DeclRefExpr 0x55adbc031a00 <col:12> 'const String::rep_t' lvalue ParmVar 0x55adbc02e358 '' 'const String::rep_t &'
| | |-CXXCtorInitializer Field 0x55adbc029958 'memo' 'String::memo_t *'
| | | `-ImplicitCastExpr 0x55adbc031ae0 <col:12> 'String::memo_t *' <LValueToRValue>
| | |   `-MemberExpr 0x55adbc031ab0 <col:12> 'String::memo_t *const' lvalue .memo 0x55adbc029958
| | |     `-DeclRefExpr 0x55adbc031a90 <col:12> 'const String::rep_t' lvalue ParmVar 0x55adbc02e358 '' 'const String::rep_t &'
| | `-CompoundStmt 0x55adbc031b38 <col:12>
| |-CXXConstructorDecl 0x55adbc02e3f8 <col:12> col:12 implicit constexpr rep_t 'void (String::rep_t &&)' inline default trivial noexcept-unevaluated 0x55adbc02e3f8
| | `-ParmVarDecl 0x55adbc02e508 <col:12> col:12 'String::rep_t &&'
| |-CXXDestructorDecl 0x55adbc034860 <col:12> col:12 implicit ~rep_t 'void () noexcept' inline default trivial
| |-CXXMethodDecl 0x55adbc03dee8 <col:12> col:12 implicit used constexpr operator= 'String::rep_t &(const String::rep_t &) noexcept' inline default trivial
| | |-ParmVarDecl 0x55adbc03dff8 <col:12> col:12 used 'const String::rep_t &'
| | `-CompoundStmt 0x55adbc03e510 <col:12>
| |   |-BinaryOperator 0x55adbc03e328 <col:12> 'const char *' lvalue '='
| |   | |-MemberExpr 0x55adbc03e2e0 <col:12> 'const char *' lvalue ->data 0x55adbc029860
| |   | | `-CXXThisExpr 0x55adbc03e2d0 <col:12> 'String::rep_t *' this
| |   | `-ImplicitCastExpr 0x55adbc03e310 <col:12> 'const char *' <LValueToRValue>
| |   |   `-MemberExpr 0x55adbc03e2a0 <col:12> 'const char *const' lvalue .data 0x55adbc029860
| |   |     `-DeclRefExpr 0x55adbc03e280 <col:12> 'const String::rep_t' lvalue ParmVar 0x55adbc03dff8 '' 'const String::rep_t &'
| |   |-BinaryOperator 0x55adbc03e3f0 <col:12> 'int' lvalue '='
| |   | |-MemberExpr 0x55adbc03e3a8 <col:12> 'int' lvalue ->length 0x55adbc0298c8
| |   | | `-CXXThisExpr 0x55adbc03e398 <col:12> 'String::rep_t *' this
| |   | `-ImplicitCastExpr 0x55adbc03e3d8 <col:12> 'int' <LValueToRValue>
| |   |   `-MemberExpr 0x55adbc03e368 <col:12> 'const int' lvalue .length 0x55adbc0298c8
| |   |     `-DeclRefExpr 0x55adbc03e348 <col:12> 'const String::rep_t' lvalue ParmVar 0x55adbc03dff8 '' 'const String::rep_t &'
| |   |-BinaryOperator 0x55adbc03e4b8 <col:12> 'String::memo_t *' lvalue '='
| |   | |-MemberExpr 0x55adbc03e470 <col:12> 'String::memo_t *' lvalue ->memo 0x55adbc029958
| |   | | `-CXXThisExpr 0x55adbc03e460 <col:12> 'String::rep_t *' this
| |   | `-ImplicitCastExpr 0x55adbc03e4a0 <col:12> 'String::memo_t *' <LValueToRValue>
| |   |   `-MemberExpr 0x55adbc03e430 <col:12> 'String::memo_t *const' lvalue .memo 0x55adbc029958
| |   |     `-DeclRefExpr 0x55adbc03e410 <col:12> 'const String::rep_t' lvalue ParmVar 0x55adbc03dff8 '' 'const String::rep_t &'
| |   `-ReturnStmt 0x55adbc03e500 <col:12>
| |     `-UnaryOperator 0x55adbc03e4e8 <col:12> 'String::rep_t' lvalue prefix '*' cannot overflow
| |       `-CXXThisExpr 0x55adbc03e4d8 <col:12> 'String::rep_t *' this
| `-CXXMethodDecl 0x55adbc03e068 <col:12> col:12 implicit constexpr operator= 'String::rep_t &(String::rep_t &&)' inline default trivial noexcept-unevaluated 0x55adbc03e068
|   `-ParmVarDecl 0x55adbc03e178 <col:12> col:12 'String::rep_t &&'
|-FieldDecl 0x55adbc0299d0 <line:211:5, col:19> col:19 referenced _r 'String::rep_t' mutable
|-CXXMethodDecl 0x55adbc029c18 <line:256:5, line:261:5> line:256:17 used assign_memo 'void (const char *, int, String::memo_t *) const' inline
| |-ParmVarDecl 0x55adbc029a38 <col:29, col:41> col:41 used data 'const char *'
| |-ParmVarDecl 0x55adbc029ab8 <col:47, col:51> col:51 used length 'int'
| |-ParmVarDecl 0x55adbc029b30 <col:59, col:67> col:67 used memo 'String::memo_t *'
| `-CompoundStmt 0x55adbc02e100 <col:79, line:261:5>
|   |-BinaryOperator 0x55adbc02dd78 <line:257:2, col:12> 'const char *' lvalue '='
|   | |-MemberExpr 0x55adbc02dd10 <col:2, col:5> 'const char *' lvalue .data 0x55adbc029860
|   | | `-MemberExpr 0x55adbc02dce0 <col:2> 'String::rep_t' lvalue ->_r 0x55adbc0299d0
|   | |   `-CXXThisExpr 0x55adbc02dcd0 <col:2> 'const String *' implicit this
|   | `-ImplicitCastExpr 0x55adbc02dd60 <col:12> 'const char *' <LValueToRValue>
|   |   `-DeclRefExpr 0x55adbc02dd40 <col:12> 'const char *' lvalue ParmVar 0x55adbc029a38 'data' 'const char *'
|   |-BinaryOperator 0x55adbc02de40 <line:258:2, col:14> 'int' lvalue '='
|   | |-MemberExpr 0x55adbc02ddd8 <col:2, col:5> 'int' lvalue .length 0x55adbc0298c8
|   | | `-MemberExpr 0x55adbc02dda8 <col:2> 'String::rep_t' lvalue ->_r 0x55adbc0299d0
|   | |   `-CXXThisExpr 0x55adbc02dd98 <col:2> 'const String *' implicit this
|   | `-ImplicitCastExpr 0x55adbc02de28 <col:14> 'int' <LValueToRValue>
|   |   `-DeclRefExpr 0x55adbc02de08 <col:14> 'int' lvalue ParmVar 0x55adbc029ab8 'length' 'int'
|   `-IfStmt 0x55adbc02e0e8 <line:259:2, line:260:41>
|     |-ImplicitCastExpr 0x55adbc02df60 <line:259:6, col:21> 'bool' <PointerToBoolean>
|     | `-ImplicitCastExpr 0x55adbc02df48 <col:6, col:21> 'String::memo_t *' <LValueToRValue>
|     |   `-ParenExpr 0x55adbc02df28 <col:6, col:21> 'String::memo_t *' lvalue
|     |     `-BinaryOperator 0x55adbc02df08 <col:7, col:17> 'String::memo_t *' lvalue '='
|     |       |-MemberExpr 0x55adbc02dea0 <col:7, col:10> 'String::memo_t *' lvalue .memo 0x55adbc029958
|     |       | `-MemberExpr 0x55adbc02de70 <col:7> 'String::rep_t' lvalue ->_r 0x55adbc0299d0
|     |       |   `-CXXThisExpr 0x55adbc02de60 <col:7> 'const String *' implicit this
|     |       `-ImplicitCastExpr 0x55adbc02def0 <col:17> 'String::memo_t *' <LValueToRValue>
|     |         `-DeclRefExpr 0x55adbc02ded0 <col:17> 'String::memo_t *' lvalue ParmVar 0x55adbc029b30 'memo' 'String::memo_t *'
|     `-CallExpr 0x55adbc02e0c0 <line:260:6, col:41> 'void'
|       |-ImplicitCastExpr 0x55adbc02e0a8 <col:6, col:23> 'void (*)(volatile uint32_t &)' <FunctionToPointerDecay>
|       | `-DeclRefExpr 0x55adbc02dfb0 <col:6, col:23> 'void (volatile uint32_t &)' lvalue CXXMethod 0x55adbbfad938 'inc' 'void (volatile uint32_t &)'
|       `-MemberExpr 0x55adbc02e018 <col:27, col:33> 'volatile uint32_t':'volatile unsigned int' lvalue ->refcount 0x55adbc029228
|         `-ImplicitCastExpr 0x55adbc02e000 <col:27> 'String::memo_t *' <LValueToRValue>
|           `-DeclRefExpr 0x55adbc02dfe0 <col:27> 'String::memo_t *' lvalue ParmVar 0x55adbc029b30 'memo' 'String::memo_t *'
|-CXXConstructorDecl 0x55adbc029ec8 <line:263:5, line:265:5> line:263:12 used String 'void (const char *, int, String::memo_t *)' inline
| |-ParmVarDecl 0x55adbc029ce8 <col:19, col:31> col:31 used data 'const char *'
| |-ParmVarDecl 0x55adbc029d68 <col:37, col:41> col:41 used length 'int'
| |-ParmVarDecl 0x55adbc029de0 <col:49, col:57> col:57 used memo 'String::memo_t *'
| |-CXXCtorInitializer Field 0x55adbc0299d0 '_r' 'String::rep_t'
| | `-CXXConstructExpr 0x55adbc02e588 <col:12> 'String::rep_t' 'void () noexcept'
| `-CompoundStmt 0x55adbc02e718 <col:63, line:265:5>
|   `-CXXMemberCallExpr 0x55adbc02e680 <line:264:2, col:32> 'void'
|     |-MemberExpr 0x55adbc02e5f0 <col:2> '<bound member function type>' ->assign_memo 0x55adbc029c18
|     | `-ImplicitCastExpr 0x55adbc02e6b8 <col:2> 'const String *' <NoOp>
|     |   `-CXXThisExpr 0x55adbc02e5e0 <col:2> 'String *' implicit this
|     |-ImplicitCastExpr 0x55adbc02e6d0 <col:14> 'const char *' <LValueToRValue>
|     | `-DeclRefExpr 0x55adbc02e620 <col:14> 'const char *' lvalue ParmVar 0x55adbc029ce8 'data' 'const char *'
|     |-ImplicitCastExpr 0x55adbc02e6e8 <col:20> 'int' <LValueToRValue>
|     | `-DeclRefExpr 0x55adbc02e640 <col:20> 'int' lvalue ParmVar 0x55adbc029d68 'length' 'int'
|     `-ImplicitCastExpr 0x55adbc02e700 <col:28> 'String::memo_t *' <LValueToRValue>
|       `-DeclRefExpr 0x55adbc02e660 <col:28> 'String::memo_t *' lvalue ParmVar 0x55adbc029de0 'memo' 'String::memo_t *'
|-CXXMethodDecl 0x55adbc02a058 <line:267:5, line:269:5> line:267:17 used assign 'void (const String &) const' inline
| |-ParmVarDecl 0x55adbc029f98 <col:24, col:38> col:38 used x 'const String &'
| `-CompoundStmt 0x55adbc02e970 <col:47, line:269:5>
|   `-CXXMemberCallExpr 0x55adbc02e8f0 <line:268:2, col:47> 'void'
|     |-MemberExpr 0x55adbc02e740 <col:2> '<bound member function type>' ->assign_memo 0x55adbc029c18
|     | `-CXXThisExpr 0x55adbc02e730 <col:2> 'const String *' implicit this
|     |-ImplicitCastExpr 0x55adbc02e928 <col:14, col:19> 'const char *' <LValueToRValue>
|     | `-MemberExpr 0x55adbc02e7c0 <col:14, col:19> 'const char *' lvalue .data 0x55adbc029860
|     |   `-MemberExpr 0x55adbc02e790 <col:14, col:16> 'String::rep_t' lvalue ._r 0x55adbc0299d0
|     |     `-DeclRefExpr 0x55adbc02e770 <col:14> 'const String' lvalue ParmVar 0x55adbc029f98 'x' 'const String &'
|     |-ImplicitCastExpr 0x55adbc02e940 <col:25, col:30> 'int' <LValueToRValue>
|     | `-MemberExpr 0x55adbc02e840 <col:25, col:30> 'int' lvalue .length 0x55adbc0298c8
|     |   `-MemberExpr 0x55adbc02e810 <col:25, col:27> 'String::rep_t' lvalue ._r 0x55adbc0299d0
|     |     `-DeclRefExpr 0x55adbc02e7f0 <col:25> 'const String' lvalue ParmVar 0x55adbc029f98 'x' 'const String &'
|     `-ImplicitCastExpr 0x55adbc02e958 <col:38, col:43> 'String::memo_t *' <LValueToRValue>
|       `-MemberExpr 0x55adbc02e8c0 <col:38, col:43> 'String::memo_t *' lvalue .memo 0x55adbc029958
|         `-MemberExpr 0x55adbc02e890 <col:38, col:40> 'String::rep_t' lvalue ._r 0x55adbc0299d0
|           `-DeclRefExpr 0x55adbc02e870 <col:38> 'const String' lvalue ParmVar 0x55adbc029f98 'x' 'const String &'
|-CXXMethodDecl 0x55adbc02c370 <line:271:5, line:278:5> line:271:17 used deref 'void () const' inline
| `-CompoundStmt 0x55adbc02f330 <col:31, line:278:5>
|   `-IfStmt 0x55adbc02f318 <line:272:2, line:277:2>
|     |-ImplicitCastExpr 0x55adbc02ea10 <line:272:6, col:9> 'bool' <PointerToBoolean>
|     | `-ImplicitCastExpr 0x55adbc02e9f8 <col:6, col:9> 'String::memo_t *' <LValueToRValue>
|     |   `-MemberExpr 0x55adbc02e9c8 <col:6, col:9> 'String::memo_t *' lvalue .memo 0x55adbc029958
|     |     `-MemberExpr 0x55adbc02e998 <col:6> 'String::rep_t' lvalue ->_r 0x55adbc0299d0
|     |       `-CXXThisExpr 0x55adbc02e988 <col:6> 'const String *' implicit this
|     `-CompoundStmt 0x55adbc02f2f0 <col:15, line:277:2>
|       |-ParenExpr 0x55adbc02eec0 <line:273:6, col:166> 'void'
|       | `-ConditionalOperator 0x55adbc02ee90 <col:7, col:165> 'void'
|       |   |-CXXStaticCastExpr 0x55adbc02eb20 <col:7, col:44> 'bool' static_cast<_Bool> <NoOp>
|       |   | `-ImplicitCastExpr 0x55adbc02eb08 <col:27, col:36> 'bool' <IntegralToBoolean> part_of_explicit_cast
|       |   |   `-ImplicitCastExpr 0x55adbc02eaf0 <col:27, col:36> 'uint32_t':'unsigned int' <LValueToRValue> part_of_explicit_cast
|       |   |     `-MemberExpr 0x55adbc02eab0 <col:27, col:36> 'volatile uint32_t':'volatile unsigned int' lvalue ->refcount 0x55adbc029228
|       |   |       `-ImplicitCastExpr 0x55adbc02ea98 <col:27, col:30> 'String::memo_t *' <LValueToRValue>
|       |   |         `-MemberExpr 0x55adbc02ea68 <col:27, col:30> 'String::memo_t *' lvalue .memo 0x55adbc029958
|       |   |           `-MemberExpr 0x55adbc02ea38 <col:27> 'String::rep_t' lvalue ->_r 0x55adbc0299d0
|       |   |             `-CXXThisExpr 0x55adbc02ea28 <col:27> 'const String *' implicit this
|       |   |-CXXFunctionalCastExpr 0x55adbc02eb80 <col:48, col:55> 'void' functional cast to void <ToVoid>
|       |   | `-IntegerLiteral 0x55adbc02eb60 <col:54> 'int' 0
|       |   `-CallExpr 0x55adbc02edf0 <col:59, col:165> 'void'
|       |     |-ImplicitCastExpr 0x55adbc02edd8 <col:59> 'void (*)(const char *, const char *, unsigned int, const char *) __attribute__((noreturn)) throw()' <FunctionToPointerDecay>
|       |     | `-DeclRefExpr 0x55adbc02ed58 <col:59> 'void (const char *, const char *, unsigned int, const char *) __attribute__((noreturn)) throw()' lvalue Function 0x55adbbd86da0 '__assert_fail' 'void (const char *, const char *, unsigned int, const char *) __attribute__((noreturn)) throw()'
|       |     |-ImplicitCastExpr 0x55adbc02ee30 <col:74> 'const char *' <ArrayToPointerDecay>
|       |     | `-StringLiteral 0x55adbc02ec68 <col:74> 'const char [18]' lvalue "_r.memo->refcount"
|       |     |-ImplicitCastExpr 0x55adbc02ee48 <col:95> 'const char *' <ArrayToPointerDecay>
|       |     | `-StringLiteral 0x55adbc02ec98 <col:95> 'const char [29]' lvalue "../dummy_inc/click/string.hh"
|       |     |-ImplicitCastExpr 0x55adbc02ee60 <col:127> 'unsigned int' <IntegralCast>
|       |     | `-IntegerLiteral 0x55adbc02ecd0 <col:127> 'int' 273
|       |     `-ImplicitCastExpr 0x55adbc02ee78 <col:132, col:146> 'const char *' <ArrayToPointerDecay>
|       |       `-UnaryOperator 0x55adbc02ed40 <col:132, col:146> 'const char [27]' lvalue prefix '__extension__' cannot overflow
|       |         `-PredefinedExpr 0x55adbc02ed28 <col:146> 'const char [27]' lvalue __PRETTY_FUNCTION__
|       |           `-StringLiteral 0x55adbc02ecf0 <col:146> 'const char [27]' lvalue "void String::deref() const"
|       |-IfStmt 0x55adbc02f210 <line:274:6, line:275:22>
|       | |-CallExpr 0x55adbc02f0d0 <line:274:10, col:57> 'bool'
|       | | |-ImplicitCastExpr 0x55adbc02f0b8 <col:10, col:27> 'bool (*)(volatile uint32_t &)' <FunctionToPointerDecay>
|       | | | `-DeclRefExpr 0x55adbc02f030 <col:10, col:27> 'bool (volatile uint32_t &)' lvalue CXXMethod 0x55adbbfb0120 'dec_and_test' 'bool (volatile uint32_t &)'
|       | | `-MemberExpr 0x55adbc02f000 <col:40, col:49> 'volatile uint32_t':'volatile unsigned int' lvalue ->refcount 0x55adbc029228
|       | |   `-ImplicitCastExpr 0x55adbc02efe8 <col:40, col:43> 'String::memo_t *' <LValueToRValue>
|       | |     `-MemberExpr 0x55adbc02efb8 <col:40, col:43> 'String::memo_t *' lvalue .memo 0x55adbc029958
|       | |       `-MemberExpr 0x55adbc02ef88 <col:40> 'String::rep_t' lvalue ->_r 0x55adbc0299d0
|       | |         `-CXXThisExpr 0x55adbc02ef78 <col:40> 'const String *' implicit this
|       | `-CallExpr 0x55adbc02f1d0 <line:275:3, col:22> 'void'
|       |   |-ImplicitCastExpr 0x55adbc02f1b8 <col:3> 'void (*)(String::memo_t *)' <FunctionToPointerDecay>
|       |   | `-DeclRefExpr 0x55adbc02f0f8 <col:3> 'void (String::memo_t *)' lvalue CXXMethod 0x55adbc02d048 'delete_memo' 'void (String::memo_t *)'
|       |   `-ImplicitCastExpr 0x55adbc02f1f8 <col:15, col:18> 'String::memo_t *' <LValueToRValue>
|       |     `-MemberExpr 0x55adbc02f158 <col:15, col:18> 'String::memo_t *' lvalue .memo 0x55adbc029958
|       |       `-MemberExpr 0x55adbc02f128 <col:15> 'String::rep_t' lvalue ->_r 0x55adbc0299d0
|       |         `-CXXThisExpr 0x55adbc02f118 <col:15> 'const String *' implicit this
|       `-BinaryOperator 0x55adbc02f2d0 <line:276:6, col:16> 'String::memo_t *' lvalue '='
|         |-MemberExpr 0x55adbc02f268 <col:6, col:9> 'String::memo_t *' lvalue .memo 0x55adbc029958
|         | `-MemberExpr 0x55adbc02f238 <col:6> 'String::rep_t' lvalue ->_r 0x55adbc0299d0
|         |   `-CXXThisExpr 0x55adbc02f228 <col:6> 'const String *' implicit this
|         `-ImplicitCastExpr 0x55adbc02f2b8 <col:16> 'String::memo_t *' <NullToPointer>
|           `-IntegerLiteral 0x55adbc02f298 <col:16> 'int' 0
|-CXXMethodDecl 0x55adbc02c608 <line:280:5, col:56> col:10 used assign 'void (const char *, int, bool)'
| |-ParmVarDecl 0x55adbc02c428 <col:17, col:29> col:29 s 'const char *'
| |-ParmVarDecl 0x55adbc02c4a8 <col:32, col:36> col:36 len 'int'
| `-ParmVarDecl 0x55adbc02c520 <col:41, col:46> col:46 need_deref 'bool'
|-CXXMethodDecl 0x55adbc02c6e0 <line:281:5, col:31> col:10 assign_out_of_memory 'void ()'
|-CXXMethodDecl 0x55adbc02c930 <line:282:5, col:53> col:10 used append 'void (const char *, int, String::memo_t *)'
| |-ParmVarDecl 0x55adbc02c798 <col:17, col:29> col:29 s 'const char *'
| |-ParmVarDecl 0x55adbc02c818 <col:32, col:36> col:36 len 'int'
| `-ParmVarDecl 0x55adbc02c890 <col:41, col:49> col:49 memo 'String::memo_t *'
|-CXXMethodDecl 0x55adbc02cb18 <line:283:5, col:58> col:19 used hard_make_stable 'String (const char *, int)' static
| |-ParmVarDecl 0x55adbc02ca00 <col:36, col:48> col:48 s 'const char *'
| `-ParmVarDecl 0x55adbc02ca80 <col:51, col:55> col:55 len 'int'
|-CXXMethodDecl 0x55adbc02cc18 <line:284:5, line:286:5> line:284:27 used absent_memo 'String::memo_t *()' static inline
| `-CompoundStmt 0x55adbc02f408 <col:41, line:286:5>
|   `-ReturnStmt 0x55adbc02f3f8 <line:285:2, col:48>
|     `-CXXReinterpretCastExpr 0x55adbc02f3c8 <col:9, col:48> 'String::memo_t *' reinterpret_cast<struct String::memo_t *> <IntegralToPointer>
|       `-CXXFunctionalCastExpr 0x55adbc02f390 <col:36, col:47> 'uintptr_t':'unsigned long' functional cast to uintptr_t <NoOp>
|         `-ImplicitCastExpr 0x55adbc02f378 <col:46> 'uintptr_t':'unsigned long' <IntegralCast> part_of_explicit_cast
|           `-IntegerLiteral 0x55adbc02f358 <col:46> 'int' 1
|-CXXMethodDecl 0x55adbc02ceb8 <line:287:5, col:68> col:20 create_memo 'String::memo_t *(char *, int, int)' static
| |-ParmVarDecl 0x55adbc02ccd0 <col:32, col:38> col:38 space 'char *'
| |-ParmVarDecl 0x55adbc02cd50 <col:45, col:49> col:49 dirty 'int'
| `-ParmVarDecl 0x55adbc02cdd0 <col:56, col:60> col:60 capacity 'int'
|-CXXMethodDecl 0x55adbc02d048 <line:288:5, col:41> col:17 used delete_memo 'void (String::memo_t *)' static
| `-ParmVarDecl 0x55adbc02cf80 <col:29, col:37> col:37 memo 'String::memo_t *'
|-CXXMethodDecl 0x55adbc02d118 <line:289:5, col:30> col:17 hard_c_str 'const char *() const'
|-CXXMethodDecl 0x55adbc02d2e8 <line:290:5, col:46> col:10 used hard_equals 'bool (const char *, int) const'
| |-ParmVarDecl 0x55adbc02d1d0 <col:22, col:34> col:34 s 'const char *'
| `-ParmVarDecl 0x55adbc02d250 <col:37, col:41> col:41 len 'int'
|-VarDecl 0x55adbc02d3a8 <line:292:5, col:23> col:23 used null_data 'const char' static
|-VarDecl 0x55adbc02d470 <line:293:5, col:34> col:23 used oom_data 'const char [15]' static
|-VarDecl 0x55adbc02d578 <line:294:5, col:34> col:23 int_data 'const char [20]' static
|-VarDecl 0x55adbc02d5f0 <line:295:5, col:24> col:24 used null_string_rep 'const String::rep_t' static
|-VarDecl 0x55adbc02d668 <line:296:5, col:24> col:24 used oom_string_rep 'const String::rep_t' static
|-EnumDecl 0x55adbc02d6d0 <line:297:5, col:25> col:5
| `-EnumConstantDecl 0x55adbc02d7d0 <col:12, col:22> col:12 referenced oom_len 'String::(anonymous enum at ../dummy_inc/click/string.hh:297:5)'
|   `-ImplicitCastExpr 0x55adbc02d820 <col:22> 'unsigned int' <IntegralCast>
|     `-ConstantExpr 0x55adbc02d7b0 <col:22> 'int' Int: 14
|       `-IntegerLiteral 0x55adbc02d790 <col:22> 'int' 14
|-CXXMethodDecl 0x55adbc02da38 <line:299:5, col:46> col:19 make_claim 'String (char *, int, int)' static
| |-ParmVarDecl 0x55adbc02d850 <col:30, col:35> col:36 'char *'
| |-ParmVarDecl 0x55adbc02d8d0 <col:38> col:41 'int'
| `-ParmVarDecl 0x55adbc02d950 <col:43> col:46 'int'
|-FriendDecl 0x55adbc02db40 <line:301:5, col:19> col:12 'struct rep_t':'String::rep_t'
`-FriendDecl 0x55adbc02dbd0 <line:302:5, col:18> col:12 'class StringAccum':'StringAccum'

Layout: <CGRecordLayout
  LLVMType:%class.String = type { %"struct.String::rep_t" }
  NonVirtualBaseLLVMType:%class.String = type { %"struct.String::rep_t" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x55adbc420880 <../dummy_inc/click/vector.hh:11:1, line:71:1> line:11:30 class vector_memory definition
|-DefinitionData standard_layout has_user_declared_ctor can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor simple trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveConstructor
| |-CopyAssignment trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveAssignment
| `-Destructor non_trivial user_declared
|-TemplateArgument type 'typed_array_memory<String>'
|-CXXRecordDecl 0x55adbc420a58 prev 0x55adbc420880 <col:24, col:30> col:30 implicit class vector_memory
|-AccessSpecDecl 0x55adbc420ae8 <col:46, col:52> col:46 public
|-TypedefDecl 0x55adbc420b10 <line:12:5, col:17> col:17 size_type 'int'
| `-BuiltinType 0x55adbbce2370 'int'
|-TypedefDecl 0x55adbc422470 <line:13:5, col:31> col:31 type 'typename typed_array_memory<String>::type':'String'
| `-ElaboratedType 0x55adbc422420 'typename typed_array_memory<String>::type' sugar
|   `-TypedefType 0x55adbc422400 'typed_array_memory<String>::type' sugar
|     |-Typedef 0x55adbc420d28 'type'
|     `-SubstTemplateTypeParmType 0x55adbc420cf0 'String' sugar
|       |-TemplateTypeParmType 0x55adbbfefa30 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55adbbfef9e0 'T'
|       `-RecordType 0x55adbc01f670 'String'
|         `-CXXRecord 0x55adbc01f5e0 'String'
|-TypedefDecl 0x55adbc422528 <line:14:5, col:19> col:19 iterator 'vector_memory<typed_array_memory<String> >::type *'
| `-PointerType 0x55adbc4224f0 'vector_memory<typed_array_memory<String> >::type *'
|   `-TypedefType 0x55adbc4224d0 'vector_memory<typed_array_memory<String> >::type' sugar
|     |-Typedef 0x55adbc422470 'type'
|     `-ElaboratedType 0x55adbc422420 'typename typed_array_memory<String>::type' sugar
|       `-TypedefType 0x55adbc422400 'typed_array_memory<String>::type' sugar
|         |-Typedef 0x55adbc420d28 'type'
|         `-SubstTemplateTypeParmType 0x55adbc420cf0 'String' sugar
|           |-TemplateTypeParmType 0x55adbbfefa30 'T' dependent depth 0 index 0
|           | `-TemplateTypeParm 0x55adbbfef9e0 'T'
|           `-RecordType 0x55adbc01f670 'String'
|             `-CXXRecord 0x55adbc01f5e0 'String'
|-CXXMethodDecl 0x55adbc4226a8 <line:15:5, line:18:5> line:15:17 need_argument_copy 'bool (const vector_memory<typed_array_memory<String> >::type *) const' inline
| `-ParmVarDecl 0x55adbc4225b8 <col:36, col:48> col:48 argp 'const vector_memory<typed_array_memory<String> >::type *'
|-CXXConstructorDecl 0x55adbc422798 <line:20:5, line:22:5> line:20:5 vector_memory 'void ()'
|-CXXDestructorDecl 0x55adbc422878 <line:23:5, col:20> col:5 ~vector_memory 'void ()' noexcept-unevaluated 0x55adbc422878
|-CXXMethodDecl 0x55adbc422b48 <line:25:5, col:43> col:10 assign 'void (const vector_memory<typed_array_memory<String> > &)'
| `-ParmVarDecl 0x55adbc422a50 <col:17, col:42> col:42 x 'const vector_memory<typed_array_memory<String> > &'
|-CXXMethodDecl 0x55adbc422d88 <line:26:5, col:44> col:10 assign 'void (vector_memory::size_type, const vector_memory<typed_array_memory<String> >::type *)'
| |-ParmVarDecl 0x55adbc422c00 <col:17, col:27> col:27 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55adbc422c78 <col:30, col:42> col:42 vp 'const vector_memory<typed_array_memory<String> >::type *'
|-CXXMethodDecl 0x55adbc422f58 <line:27:5, col:44> col:10 resize 'void (vector_memory::size_type, const vector_memory<typed_array_memory<String> >::type *)'
| |-ParmVarDecl 0x55adbc422e48 <col:17, col:27> col:27 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55adbc422ec0 <col:30, col:42> col:42 vp 'const vector_memory<typed_array_memory<String> >::type *'
|-CXXMethodDecl 0x55adbc4230b8 <line:28:5, line:30:5> line:28:14 begin 'vector_memory<typed_array_memory<String> >::iterator ()'
|-CXXMethodDecl 0x55adbc423188 <line:31:5, line:33:5> line:31:14 end 'vector_memory<typed_array_memory<String> >::iterator ()'
|-CXXMethodDecl 0x55adbc4233d8 <line:34:5, col:48> col:14 insert 'vector_memory<typed_array_memory<String> >::iterator (vector_memory<typed_array_memory<String> >::iterator, const vector_memory<typed_array_memory<String> >::type *)'
| |-ParmVarDecl 0x55adbc423248 <col:21, col:30> col:30 it 'vector_memory<typed_array_memory<String> >::iterator':'vector_memory<typed_array_memory<String> >::type *'
| `-ParmVarDecl 0x55adbc4232c0 <col:34, col:46> col:46 vp 'const vector_memory<typed_array_memory<String> >::type *'
|-CXXMethodDecl 0x55adbc423638 <line:35:5, col:42> col:14 erase 'vector_memory<typed_array_memory<String> >::iterator (vector_memory<typed_array_memory<String> >::iterator, vector_memory<typed_array_memory<String> >::iterator)'
| |-ParmVarDecl 0x55adbc4234a8 <col:20, col:29> col:29 a 'vector_memory<typed_array_memory<String> >::iterator':'vector_memory<typed_array_memory<String> >::type *'
| `-ParmVarDecl 0x55adbc423520 <col:32, col:41> col:41 b 'vector_memory<typed_array_memory<String> >::iterator':'vector_memory<typed_array_memory<String> >::type *'
|-CXXMethodDecl 0x55adbc4237f8 <line:36:5, line:43:5> line:36:17 push_back 'void (const vector_memory<typed_array_memory<String> >::type *)' inline
| `-ParmVarDecl 0x55adbc423708 <col:27, col:39> col:39 vp 'const vector_memory<typed_array_memory<String> >::type *'
|-CXXMethodDecl 0x55adbc4239b8 <line:45:5, line:52:5> line:45:17 move_construct_back 'void (vector_memory<typed_array_memory<String> >::type *)' inline
| `-ParmVarDecl 0x55adbc4238c0 <col:37, col:43> col:43 vp 'vector_memory<typed_array_memory<String> >::type *'
|-CXXMethodDecl 0x55adbc423a70 <line:54:5, line:59:5> line:54:17 pop_back 'void ()' inline
|-CXXMethodDecl 0x55adbc423b20 <line:60:5, line:64:5> line:60:17 clear 'void ()' inline
|-CXXMethodDecl 0x55adbc423d58 <line:65:5, col:59> col:10 reserve_and_push_back 'bool (vector_memory::size_type, const vector_memory<typed_array_memory<String> >::type *)'
| |-ParmVarDecl 0x55adbc423bd0 <col:32, col:42> col:42 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55adbc423c48 <col:45, col:57> col:57 vp 'const vector_memory<typed_array_memory<String> >::type *'
|-CXXMethodDecl 0x55adbc423ff8 <line:66:5, col:35> col:10 swap 'void (vector_memory<typed_array_memory<String> > &)'
| `-ParmVarDecl 0x55adbc423f00 <col:15, col:34> col:34 x 'vector_memory<typed_array_memory<String> > &'
|-FieldDecl 0x55adbc4240c0 <line:68:5, col:11> col:11 l_ 'vector_memory<typed_array_memory<String> >::type *'
|-FieldDecl 0x55adbc424110 <line:69:5, col:15> col:15 n_ 'vector_memory::size_type':'int'
`-FieldDecl 0x55adbc424160 <line:70:5, col:15> col:15 capacity_ 'vector_memory::size_type':'int'

Layout: <CGRecordLayout
  LLVMType:%class.vector_memory.1 = type { %class.String*, i32, i32 }
  NonVirtualBaseLLVMType:%class.vector_memory.1 = type { %class.String*, i32, i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x55adbc259f00 <../dummy_inc/click/ipaddress.hh:13:1, col:29> ../dummy_inc/click/vector.hh:111:7 class Vector definition
|-DefinitionData standard_layout has_user_declared_ctor has_mutable_fields can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor non_trivial user_declared has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveConstructor exists non_trivial user_declared needs_overload_resolution
| |-CopyAssignment non_trivial has_const_param user_declared needs_overload_resolution implicit_has_const_param
| |-MoveAssignment exists non_trivial user_declared needs_overload_resolution
| `-Destructor simple non_trivial needs_overload_resolution
|-TemplateArgument type 'String'
|-CXXRecordDecl 0x55adbc41f528 prev 0x55adbc259f00 <col:1, col:7> col:7 implicit class Vector
|-TypedefDecl 0x55adbc4207f0 <line:113:5, col:44> col:44 array_memory_type 'typename array_memory<String>::type':'typed_array_memory<String>'
| `-ElaboratedType 0x55adbc4207a0 'typename array_memory<String>::type' sugar
|   `-TypedefType 0x55adbc420780 'conditional<false, sized_array_memory<24>, typed_array_memory<String> >::type' sugar
|     |-Typedef 0x55adbc420630 'type'
|     `-SubstTemplateTypeParmType 0x55adbc4204c0 'typed_array_memory<String>' sugar
|       |-TemplateTypeParmType 0x55adbbfc9830 'F' dependent depth 0 index 1
|       | `-TemplateTypeParm 0x55adbbfc97d8 'F'
|       `-RecordType 0x55adbc420120 'typed_array_memory<String>'
|         `-ClassTemplateSpecialization 0x55adbc420040 'typed_array_memory'
|-FieldDecl 0x55adbc4241b0 <line:114:5, col:46> col:46 vm_ 'vector_memory<Vector<String>::array_memory_type>':'vector_memory<typed_array_memory<String> >' mutable
|-AccessSpecDecl 0x55adbc424200 <line:116:3, col:9> col:3 public
|-TypedefDecl 0x55adbc424238 <line:118:5, col:15> col:15 value_type 'String':'String'
| `-SubstTemplateTypeParmType 0x55adbc41f5c0 'String' sugar
|   |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|   `-RecordType 0x55adbc01f670 'String'
|     `-CXXRecord 0x55adbc01f5e0 'String'
|-TypedefDecl 0x55adbc4242c8 <line:119:5, col:16> col:16 reference 'String &'
| `-LValueReferenceType 0x55adbc424290 'String &'
|   `-SubstTemplateTypeParmType 0x55adbc41f5c0 'String' sugar
|     |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|     `-RecordType 0x55adbc01f670 'String'
|       `-CXXRecord 0x55adbc01f5e0 'String'
|-TypedefDecl 0x55adbc424358 <line:120:5, col:22> col:22 const_reference 'const String &'
| `-LValueReferenceType 0x55adbc424320 'const String &'
|   `-QualType 0x55adbc41f5c1 'const String' const
|     `-SubstTemplateTypeParmType 0x55adbc41f5c0 'String' sugar
|       |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|       `-RecordType 0x55adbc01f670 'String'
|         `-CXXRecord 0x55adbc01f5e0 'String'
|-TypedefDecl 0x55adbc4243e8 <line:121:5, col:16> col:16 pointer 'String *'
| `-PointerType 0x55adbc4243b0 'String *'
|   `-SubstTemplateTypeParmType 0x55adbc41f5c0 'String' sugar
|     |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|     `-RecordType 0x55adbc01f670 'String'
|       `-CXXRecord 0x55adbc01f5e0 'String'
|-TypedefDecl 0x55adbc424478 <line:122:5, col:22> col:22 const_pointer 'const String *'
| `-PointerType 0x55adbc424440 'const String *'
|   `-QualType 0x55adbc41f5c1 'const String' const
|     `-SubstTemplateTypeParmType 0x55adbc41f5c0 'String' sugar
|       |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|       `-RecordType 0x55adbc01f670 'String'
|         `-CXXRecord 0x55adbc01f5e0 'String'
|-TypedefDecl 0x55adbc4250d0 <line:125:5, col:45> col:45 value_argument_type 'typename fast_argument<String>::type':'const String &'
| `-ElaboratedType 0x55adbc425080 'typename fast_argument<String>::type' sugar
|   `-TypedefType 0x55adbc425060 'fast_argument<String, true>::type' sugar
|     |-Typedef 0x55adbc424f98 'type'
|     `-LValueReferenceType 0x55adbc424f60 'const String &'
|       `-QualType 0x55adbc424d01 'const String' const
|         `-SubstTemplateTypeParmType 0x55adbc424d00 'String' sugar
|           |-TemplateTypeParmType 0x55adbbfd0b10 'T' dependent depth 0 index 0
|           | `-TemplateTypeParm 0x55adbbfd0ab8 'T'
|           `-RecordType 0x55adbc01f670 'String'
|             `-CXXRecord 0x55adbc01f5e0 'String'
|-TypedefDecl 0x55adbc425138 <line:126:5, col:22> col:22 const_access_type 'const String &'
| `-LValueReferenceType 0x55adbc424320 'const String &'
|   `-QualType 0x55adbc41f5c1 'const String' const
|     `-SubstTemplateTypeParmType 0x55adbc41f5c0 'String' sugar
|       |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|       `-RecordType 0x55adbc01f670 'String'
|         `-CXXRecord 0x55adbc01f5e0 'String'
|-TypedefDecl 0x55adbc425190 <line:128:5, col:17> col:17 size_type 'int'
| `-BuiltinType 0x55adbbce2370 'int'
|-TypedefDecl 0x55adbc4251f8 <line:130:5, col:16> col:16 iterator 'String *'
| `-PointerType 0x55adbc4243b0 'String *'
|   `-SubstTemplateTypeParmType 0x55adbc41f5c0 'String' sugar
|     |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|     `-RecordType 0x55adbc01f670 'String'
|       `-CXXRecord 0x55adbc01f5e0 'String'
|-TypedefDecl 0x55adbc425260 <line:131:5, col:22> col:22 const_iterator 'const String *'
| `-PointerType 0x55adbc424440 'const String *'
|   `-QualType 0x55adbc41f5c1 'const String' const
|     `-SubstTemplateTypeParmType 0x55adbc41f5c0 'String' sugar
|       |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|       `-RecordType 0x55adbc01f670 'String'
|         `-CXXRecord 0x55adbc01f5e0 'String'
|-EnumDecl 0x55adbc4252b8 <line:134:5> col:5
| `-EnumConstantDecl 0x55adbc4253b0 <col:12, col:40> col:12 RESERVE_GROW 'Vector<String>::(anonymous enum at ../dummy_inc/click/vector.hh:134:5)'
|   `-ConstantExpr 0x55adbc425390 <col:27, col:40> 'Vector::size_type':'int' Int: -1
|     `-CStyleCastExpr 0x55adbc0003c8 <col:27, col:40> 'Vector::size_type':'int' <NoOp>
|       `-UnaryOperator 0x55adbc0003a0 <col:39, col:40> 'int' prefix '-'
|         `-IntegerLiteral 0x55adbc000380 <col:40> 'int' 1
|-CXXConstructorDecl 0x55adbc425438 <line:137:5, col:28> col:21 Vector 'void ()' inline
|-CXXConstructorDecl 0x55adbc4256c8 <line:138:5, col:62> col:21 Vector 'void (Vector::size_type, Vector<String>::value_argument_type)' inline
| |-ParmVarDecl 0x55adbc4254f0 <col:28, col:38> col:38 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55adbc425590 <col:41, col:61> col:61 v 'Vector<String>::value_argument_type':'const String &'
|-CXXConstructorDecl 0x55adbc425958 <line:139:5, col:37> col:12 Vector 'void (const Vector<String> &)' inline
| `-ParmVarDecl 0x55adbc425840 <col:19, col:36> col:36 x 'const Vector<String> &'
|-CXXConstructorDecl 0x55adbc425c18 <line:141:5, col:32> col:12 Vector 'void (Vector<String> &&)' inline
| `-ParmVarDecl 0x55adbc425b00 <col:19, col:31> col:31 x 'Vector<String> &&'
|-CXXMethodDecl 0x55adbc425f30 <line:144:5, col:51> col:23 operator= 'Vector<String> &(const Vector<String> &)' inline
| `-ParmVarDecl 0x55adbc425e10 <col:33, col:50> col:50 x 'const Vector<String> &'
|-CXXMethodDecl 0x55adbc426240 <line:146:5, col:46> col:23 operator= 'Vector<String> &(Vector<String> &&)' inline
| `-ParmVarDecl 0x55adbc426120 <col:33, col:45> col:45 x 'Vector<String> &&'
|-CXXMethodDecl 0x55adbc426530 <line:148:5, col:70> col:23 assign 'Vector<String> &(Vector::size_type, Vector<String>::value_argument_type)' inline
| |-ParmVarDecl 0x55adbc426378 <col:30, col:40> col:40 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55adbc4263f0 <col:43, col:69> col:63 v 'Vector<String>::value_argument_type':'const String &'
|-CXXMethodDecl 0x55adbc426658 <line:150:5, col:55> col:49 begin 'Vector<String>::iterator ()'
| |-NoInlineAttr 0x55adbc426708 <col:20> Inherited
| `-OptimizeNoneAttr 0x55adbc426760 <col:30> Inherited
|-CXXMethodDecl 0x55adbc4267a8 <line:151:5, col:53> col:49 end 'Vector<String>::iterator ()'
| |-NoInlineAttr 0x55adbc426858 <col:20> Inherited
| `-OptimizeNoneAttr 0x55adbc427d70 <col:30> Inherited
|-CXXMethodDecl 0x55adbc427e38 <line:152:5, col:63> col:55 used begin 'Vector<String>::const_iterator () const'
| |-NoInlineAttr 0x55adbc427ee8 <col:20> Inherited
| `-OptimizeNoneAttr 0x55adbc427f40 <col:30> Inherited
|-CXXMethodDecl 0x55adbc427f88 <line:153:5, col:61> col:55 used end 'Vector<String>::const_iterator () const'
| |-NoInlineAttr 0x55adbc428038 <col:20> Inherited
| `-OptimizeNoneAttr 0x55adbc428090 <col:30> Inherited
|-CXXMethodDecl 0x55adbc4280d8 <line:154:5, col:64> col:55 cbegin 'Vector<String>::const_iterator () const'
| |-NoInlineAttr 0x55adbc428188 <col:20> Inherited
| `-OptimizeNoneAttr 0x55adbc4281e0 <col:30> Inherited
|-CXXMethodDecl 0x55adbc428228 <line:155:5, col:62> col:55 cend 'Vector<String>::const_iterator () const'
| |-NoInlineAttr 0x55adbc4282d8 <col:20> Inherited
| `-OptimizeNoneAttr 0x55adbc428330 <col:30> Inherited
|-CXXMethodDecl 0x55adbc428358 <line:157:5, col:29> col:22 used size 'Vector::size_type () const' inline
|-CXXMethodDecl 0x55adbc428408 <line:158:5, col:33> col:22 capacity 'Vector::size_type () const' inline
|-CXXMethodDecl 0x55adbc4284b8 <line:159:5, col:25> col:17 empty 'bool () const' inline
|-CXXMethodDecl 0x55adbc428678 <line:160:5, col:64> col:17 resize 'void (Vector::size_type, Vector<String>::value_argument_type)' inline
| |-ParmVarDecl 0x55adbc428568 <col:24, col:34> col:34 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55adbc4285e0 <col:37, col:63> col:57 v 'Vector<String>::value_argument_type':'const String &'
|-CXXMethodDecl 0x55adbc4287c8 <line:161:5, col:36> col:17 reserve 'bool (Vector::size_type)' inline
| `-ParmVarDecl 0x55adbc428738 <col:25, col:35> col:35 n 'Vector::size_type':'int'
|-CXXMethodDecl 0x55adbc428978 <line:163:5, col:65> col:43 operator[] 'String &(Vector::size_type)'
| |-ParmVarDecl 0x55adbc428880 <col:54, col:64> col:64 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x55adbc428a30 <col:20>
| `-OptimizeNoneAttr 0x55adbc428a88 <col:30>
|-CXXMethodDecl 0x55adbc428ba8 <line:164:5, col:73> col:49 operator[] 'const String &(Vector::size_type) const'
| |-ParmVarDecl 0x55adbc428ab0 <col:60, col:70> col:70 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x55adbc428c60 <col:20>
| `-OptimizeNoneAttr 0x55adbc428cb8 <col:30>
|-CXXMethodDecl 0x55adbc428d70 <line:165:5, col:29> col:15 at 'String &(Vector::size_type)' inline
| `-ParmVarDecl 0x55adbc428ce0 <col:18, col:28> col:28 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55adbc428eb8 <line:166:5, col:37> col:21 at 'const String &(Vector::size_type) const' inline
| `-ParmVarDecl 0x55adbc428e28 <col:24, col:34> col:34 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55adbc428fe8 <line:167:5, col:21> col:15 front 'String &()' inline
|-CXXMethodDecl 0x55adbc4290e8 <line:168:5, col:29> col:21 front 'const String &() const' inline
|-CXXMethodDecl 0x55adbc4291b8 <line:169:5, col:20> col:15 back 'String &()' inline
|-CXXMethodDecl 0x55adbc429288 <line:170:5, col:28> col:21 back 'const String &() const' inline
|-CXXMethodDecl 0x55adbc4293c8 <line:172:5, col:39> col:15 unchecked_at 'String &(Vector::size_type)' inline
| `-ParmVarDecl 0x55adbc429338 <col:28, col:38> col:38 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55adbc429510 <line:173:5, col:47> col:21 unchecked_at 'const String &(Vector::size_type) const' inline
| `-ParmVarDecl 0x55adbc429480 <col:34, col:44> col:44 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55adbc429658 <line:174:5, col:59> col:15 at_u 'String &(Vector::size_type)' inline
| |-ParmVarDecl 0x55adbc4295c8 <col:20, col:30> col:30 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x55adbc429710 <col:48> Inherited "" ""
|-CXXMethodDecl 0x55adbc429810 <line:175:5, col:71> col:21 at_u 'const String &(Vector::size_type) const' inline
| |-ParmVarDecl 0x55adbc429780 <col:26, col:36> col:36 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x55adbc4298c8 <col:60> Inherited "" ""
|-CXXMethodDecl 0x55adbc429988 <line:177:5, col:20> col:15 data 'String *()' inline
|-CXXMethodDecl 0x55adbc429a88 <line:178:5, col:28> col:21 data 'const String *() const' inline
|-CXXMethodDecl 0x55adbc429c08 <line:180:5, col:48> col:17 used push_back 'void (Vector<String>::value_argument_type)' inline
| `-ParmVarDecl 0x55adbc429b48 <col:27, col:47> col:47 v 'Vector<String>::value_argument_type':'const String &'
|-FunctionTemplateDecl 0x55adbc42a398 <line:182:5, line:183:63> col:48 push_back
| |-TemplateTypeParmDecl 0x55adbc429cc0 <line:182:15, col:43> col:24 typename depth 0 index 0 A
| | `-TemplateArgument type 'fast_argument<String>':'fast_argument<String, true>'
| `-CXXMethodDecl 0x55adbc42a2f8 <line:183:5, col:63> col:48 push_back 'typename A::enable_rvalue_reference (String &&)' inline
|   `-ParmVarDecl 0x55adbc42a1f8 <col:58, col:62> col:62 v 'String &&'
|-CXXMethodDecl 0x55adbc42a478 <line:185:5, col:26> col:17 pop_back 'void ()' inline
|-CXXMethodDecl 0x55adbc42a5c8 <line:186:5, col:49> col:17 push_front 'void (Vector<String>::value_argument_type)' inline
| `-ParmVarDecl 0x55adbc42a538 <col:28, col:48> col:48 v 'Vector<String>::value_argument_type':'const String &'
|-CXXMethodDecl 0x55adbc42a680 <line:187:5, col:27> col:17 pop_front 'void ()' inline
|-CXXMethodDecl 0x55adbc42a8c8 <line:189:5, col:62> col:21 insert 'Vector<String>::iterator (Vector<String>::iterator, Vector<String>::value_argument_type)' inline
| |-ParmVarDecl 0x55adbc42a740 <col:28, col:37> col:37 it 'Vector<String>::iterator':'String *'
| `-ParmVarDecl 0x55adbc42a7b8 <col:41, col:61> col:61 v 'Vector<String>::value_argument_type':'const String &'
|-CXXMethodDecl 0x55adbc42aa58 <line:190:5, col:38> col:21 erase 'Vector<String>::iterator (Vector<String>::iterator)' inline
| `-ParmVarDecl 0x55adbc42a998 <col:27, col:36> col:36 it 'Vector<String>::iterator':'String *'
|-CXXMethodDecl 0x55adbc42ac68 <line:191:5, col:49> col:21 erase 'Vector<String>::iterator (Vector<String>::iterator, Vector<String>::iterator)' inline
| |-ParmVarDecl 0x55adbc42ab20 <col:27, col:36> col:36 a 'Vector<String>::iterator':'String *'
| `-ParmVarDecl 0x55adbc42ab98 <col:39, col:48> col:48 b 'Vector<String>::iterator':'String *'
|-CXXMethodDecl 0x55adbc42ad28 <line:193:5, col:23> col:17 used clear 'void ()' inline
|-CXXMethodDecl 0x55adbc42af88 <line:195:5, col:34> col:17 swap 'void (Vector<String> &)' inline
| `-ParmVarDecl 0x55adbc42ae90 <col:22, col:33> col:33 x 'Vector<String> &'
`-CXXDestructorDecl 0x55adbc42b058 <../dummy_inc/click/ipaddress.hh:13:29> col:29 implicit ~Vector 'void ()' inline default noexcept-unevaluated 0x55adbc42b058

Layout: <CGRecordLayout
  LLVMType:%class.Vector.0 = type { %class.vector_memory.1 }
  NonVirtualBaseLLVMType:%class.Vector.0 = type { %class.vector_memory.1 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x55adbc472f10 <../dummy_inc/click/vector.hh:11:1, line:71:1> line:11:30 class vector_memory definition
|-DefinitionData standard_layout has_user_declared_ctor can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor simple trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveConstructor
| |-CopyAssignment trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveAssignment
| `-Destructor non_trivial user_declared
|-TemplateArgument type 'sized_array_memory<4>'
|-CXXRecordDecl 0x55adbc4730e8 prev 0x55adbc472f10 <col:24, col:30> col:30 implicit class vector_memory
|-AccessSpecDecl 0x55adbc473178 <col:46, col:52> col:46 public
|-TypedefDecl 0x55adbc4731a0 <line:12:5, col:17> col:17 size_type 'int'
| `-BuiltinType 0x55adbbce2370 'int'
|-TypedefDecl 0x55adbc474d70 <line:13:5, col:31> col:31 type 'typename sized_array_memory<4>::type':'char_array<4>'
| `-ElaboratedType 0x55adbc474d20 'typename sized_array_memory<4>::type' sugar
|   `-TypedefType 0x55adbc473650 'sized_array_memory<4>::type' sugar
|     |-Typedef 0x55adbc473550 'type'
|     `-TemplateSpecializationType 0x55adbc4734e0 'char_array<4UL>' sugar char_array
|       |-TemplateArgument expr
|       | `-ConstantExpr 0x55adbc4733c0 <../dummy_inc/click/array_memory.hh:11:24> 'unsigned long' Int: 4
|       |   `-SubstNonTypeTemplateParmExpr 0x55adbc4733a0 <col:24> 'unsigned long'
|       |     `-IntegerLiteral 0x55adbc473380 <col:24> 'unsigned long' 4
|       `-RecordType 0x55adbc4734c0 'char_array<4>'
|         `-ClassTemplateSpecialization 0x55adbc4733e0 'char_array'
|-TypedefDecl 0x55adbc474e28 <../dummy_inc/click/vector.hh:14:5, col:19> col:19 iterator 'vector_memory<sized_array_memory<4> >::type *'
| `-PointerType 0x55adbc474df0 'vector_memory<sized_array_memory<4> >::type *'
|   `-TypedefType 0x55adbc474dd0 'vector_memory<sized_array_memory<4> >::type' sugar
|     |-Typedef 0x55adbc474d70 'type'
|     `-ElaboratedType 0x55adbc474d20 'typename sized_array_memory<4>::type' sugar
|       `-TypedefType 0x55adbc473650 'sized_array_memory<4>::type' sugar
|         |-Typedef 0x55adbc473550 'type'
|         `-TemplateSpecializationType 0x55adbc4734e0 'char_array<4UL>' sugar char_array
|           |-TemplateArgument expr
|           | `-ConstantExpr 0x55adbc4733c0 <../dummy_inc/click/array_memory.hh:11:24> 'unsigned long' Int: 4
|           |   `-SubstNonTypeTemplateParmExpr 0x55adbc4733a0 <col:24> 'unsigned long'
|           |     `-IntegerLiteral 0x55adbc473380 <col:24> 'unsigned long' 4
|           `-RecordType 0x55adbc4734c0 'char_array<4>'
|             `-ClassTemplateSpecialization 0x55adbc4733e0 'char_array'
|-CXXMethodDecl 0x55adbc474fa8 <../dummy_inc/click/vector.hh:15:5, line:18:5> line:15:17 need_argument_copy 'bool (const vector_memory<sized_array_memory<4> >::type *) const' inline
| `-ParmVarDecl 0x55adbc474eb8 <col:36, col:48> col:48 argp 'const vector_memory<sized_array_memory<4> >::type *'
|-CXXConstructorDecl 0x55adbc475098 <line:20:5, line:22:5> line:20:5 vector_memory 'void ()'
|-CXXDestructorDecl 0x55adbc475178 <line:23:5, col:20> col:5 ~vector_memory 'void ()' noexcept-unevaluated 0x55adbc475178
|-CXXMethodDecl 0x55adbc475448 <line:25:5, col:43> col:10 assign 'void (const vector_memory<sized_array_memory<4> > &)'
| `-ParmVarDecl 0x55adbc475350 <col:17, col:42> col:42 x 'const vector_memory<sized_array_memory<4> > &'
|-CXXMethodDecl 0x55adbc475688 <line:26:5, col:44> col:10 assign 'void (vector_memory::size_type, const vector_memory<sized_array_memory<4> >::type *)'
| |-ParmVarDecl 0x55adbc475500 <col:17, col:27> col:27 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55adbc475578 <col:30, col:42> col:42 vp 'const vector_memory<sized_array_memory<4> >::type *'
|-CXXMethodDecl 0x55adbc475858 <line:27:5, col:44> col:10 resize 'void (vector_memory::size_type, const vector_memory<sized_array_memory<4> >::type *)'
| |-ParmVarDecl 0x55adbc475748 <col:17, col:27> col:27 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55adbc4757c0 <col:30, col:42> col:42 vp 'const vector_memory<sized_array_memory<4> >::type *'
|-CXXMethodDecl 0x55adbc4759b8 <line:28:5, line:30:5> line:28:14 begin 'vector_memory<sized_array_memory<4> >::iterator ()'
|-CXXMethodDecl 0x55adbc475a88 <line:31:5, line:33:5> line:31:14 end 'vector_memory<sized_array_memory<4> >::iterator ()'
|-CXXMethodDecl 0x55adbc475cd8 <line:34:5, col:48> col:14 insert 'vector_memory<sized_array_memory<4> >::iterator (vector_memory<sized_array_memory<4> >::iterator, const vector_memory<sized_array_memory<4> >::type *)'
| |-ParmVarDecl 0x55adbc475b48 <col:21, col:30> col:30 it 'vector_memory<sized_array_memory<4> >::iterator':'vector_memory<sized_array_memory<4> >::type *'
| `-ParmVarDecl 0x55adbc475bc0 <col:34, col:46> col:46 vp 'const vector_memory<sized_array_memory<4> >::type *'
|-CXXMethodDecl 0x55adbc475f38 <line:35:5, col:42> col:14 erase 'vector_memory<sized_array_memory<4> >::iterator (vector_memory<sized_array_memory<4> >::iterator, vector_memory<sized_array_memory<4> >::iterator)'
| |-ParmVarDecl 0x55adbc475da8 <col:20, col:29> col:29 a 'vector_memory<sized_array_memory<4> >::iterator':'vector_memory<sized_array_memory<4> >::type *'
| `-ParmVarDecl 0x55adbc475e20 <col:32, col:41> col:41 b 'vector_memory<sized_array_memory<4> >::iterator':'vector_memory<sized_array_memory<4> >::type *'
|-CXXMethodDecl 0x55adbc4760f8 <line:36:5, line:43:5> line:36:17 push_back 'void (const vector_memory<sized_array_memory<4> >::type *)' inline
| `-ParmVarDecl 0x55adbc476008 <col:27, col:39> col:39 vp 'const vector_memory<sized_array_memory<4> >::type *'
|-CXXMethodDecl 0x55adbc4762b8 <line:45:5, line:52:5> line:45:17 move_construct_back 'void (vector_memory<sized_array_memory<4> >::type *)' inline
| `-ParmVarDecl 0x55adbc4761c0 <col:37, col:43> col:43 vp 'vector_memory<sized_array_memory<4> >::type *'
|-CXXMethodDecl 0x55adbc476370 <line:54:5, line:59:5> line:54:17 pop_back 'void ()' inline
|-CXXMethodDecl 0x55adbc476420 <line:60:5, line:64:5> line:60:17 clear 'void ()' inline
|-CXXMethodDecl 0x55adbc476658 <line:65:5, col:59> col:10 reserve_and_push_back 'bool (vector_memory::size_type, const vector_memory<sized_array_memory<4> >::type *)'
| |-ParmVarDecl 0x55adbc4764d0 <col:32, col:42> col:42 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55adbc476548 <col:45, col:57> col:57 vp 'const vector_memory<sized_array_memory<4> >::type *'
|-CXXMethodDecl 0x55adbc4768f8 <line:66:5, col:35> col:10 swap 'void (vector_memory<sized_array_memory<4> > &)'
| `-ParmVarDecl 0x55adbc476800 <col:15, col:34> col:34 x 'vector_memory<sized_array_memory<4> > &'
|-FieldDecl 0x55adbc4769c0 <line:68:5, col:11> col:11 l_ 'vector_memory<sized_array_memory<4> >::type *'
|-FieldDecl 0x55adbc476a10 <line:69:5, col:15> col:15 n_ 'vector_memory::size_type':'int'
`-FieldDecl 0x55adbc476a60 <line:70:5, col:15> col:15 capacity_ 'vector_memory::size_type':'int'

Layout: <CGRecordLayout
  LLVMType:%class.vector_memory.3 = type { %struct.char_array.4*, i32, i32 }
  NonVirtualBaseLLVMType:%class.vector_memory.3 = type { %struct.char_array.4*, i32, i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x55adbc578910 <../dummy_inc/click/ipaddress.hh:13:1, col:29> ../dummy_inc/click/vector.hh:111:7 class Vector definition
|-DefinitionData standard_layout has_user_declared_ctor has_mutable_fields can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor non_trivial user_declared has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveConstructor exists non_trivial user_declared needs_overload_resolution
| |-CopyAssignment non_trivial has_const_param user_declared needs_overload_resolution implicit_has_const_param
| |-MoveAssignment exists non_trivial user_declared needs_overload_resolution
| `-Destructor simple non_trivial needs_overload_resolution
|-TemplateArgument type 'unsigned int'
|-CXXRecordDecl 0x55adbc578b18 prev 0x55adbc578910 <col:1, col:7> col:7 implicit class Vector
|-TypedefDecl 0x55adbc579b30 <line:113:5, col:44> col:44 array_memory_type 'typename array_memory<unsigned int>::type':'sized_array_memory<4>'
| `-ElaboratedType 0x55adbc579ae0 'typename array_memory<unsigned int>::type' sugar
|   `-TypedefType 0x55adbc579ac0 'conditional<true, sized_array_memory<4>, typed_array_memory<unsigned int> >::type' sugar
|     |-Typedef 0x55adbc579970 'type'
|     `-SubstTemplateTypeParmType 0x55adbc472ae0 'sized_array_memory<4>' sugar
|       |-TemplateTypeParmType 0x55adbbfc9040 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55adbbfc8fe8 'T'
|       `-RecordType 0x55adbc472630 'sized_array_memory<4>'
|         `-ClassTemplateSpecialization 0x55adbc472548 'sized_array_memory'
|-FieldDecl 0x55adbc579c30 <line:114:5, col:46> col:46 vm_ 'vector_memory<Vector<unsigned int>::array_memory_type>':'vector_memory<sized_array_memory<4> >' mutable
|-AccessSpecDecl 0x55adbc579c80 <line:116:3, col:9> col:3 public
|-TypedefDecl 0x55adbc579cb8 <line:118:5, col:15> col:15 value_type 'unsigned int':'unsigned int'
| `-SubstTemplateTypeParmType 0x55adbc578bb0 'unsigned int' sugar
|   |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|   `-BuiltinType 0x55adbbce2410 'unsigned int'
|-TypedefDecl 0x55adbc579d48 <line:119:5, col:16> col:16 reference 'unsigned int &'
| `-LValueReferenceType 0x55adbc579d10 'unsigned int &'
|   `-SubstTemplateTypeParmType 0x55adbc578bb0 'unsigned int' sugar
|     |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|     `-BuiltinType 0x55adbbce2410 'unsigned int'
|-TypedefDecl 0x55adbc579dd8 <line:120:5, col:22> col:22 const_reference 'const unsigned int &'
| `-LValueReferenceType 0x55adbc579da0 'const unsigned int &'
|   `-QualType 0x55adbc578bb1 'const unsigned int' const
|     `-SubstTemplateTypeParmType 0x55adbc578bb0 'unsigned int' sugar
|       |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|       `-BuiltinType 0x55adbbce2410 'unsigned int'
|-TypedefDecl 0x55adbc579e68 <line:121:5, col:16> col:16 pointer 'unsigned int *'
| `-PointerType 0x55adbc579e30 'unsigned int *'
|   `-SubstTemplateTypeParmType 0x55adbc578bb0 'unsigned int' sugar
|     |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|     `-BuiltinType 0x55adbbce2410 'unsigned int'
|-TypedefDecl 0x55adbc579ef8 <line:122:5, col:22> col:22 const_pointer 'const unsigned int *'
| `-PointerType 0x55adbc579ec0 'const unsigned int *'
|   `-QualType 0x55adbc578bb1 'const unsigned int' const
|     `-SubstTemplateTypeParmType 0x55adbc578bb0 'unsigned int' sugar
|       |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|       `-BuiltinType 0x55adbbce2410 'unsigned int'
|-TypedefDecl 0x55adbc57aae0 <line:125:5, col:45> col:45 value_argument_type 'typename fast_argument<unsigned int>::type':'unsigned int'
| `-ElaboratedType 0x55adbc57aa90 'typename fast_argument<unsigned int>::type' sugar
|   `-TypedefType 0x55adbc57aa70 'fast_argument<unsigned int, false>::type' sugar
|     |-Typedef 0x55adbc57aa00 'type'
|     `-SubstTemplateTypeParmType 0x55adbc57a7c0 'unsigned int' sugar
|       |-TemplateTypeParmType 0x55adbbfd1240 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55adbbfd11f0 'T'
|       `-BuiltinType 0x55adbbce2410 'unsigned int'
|-TypedefDecl 0x55adbc57ab48 <line:126:5, col:22> col:22 const_access_type 'const unsigned int &'
| `-LValueReferenceType 0x55adbc579da0 'const unsigned int &'
|   `-QualType 0x55adbc578bb1 'const unsigned int' const
|     `-SubstTemplateTypeParmType 0x55adbc578bb0 'unsigned int' sugar
|       |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|       `-BuiltinType 0x55adbbce2410 'unsigned int'
|-TypedefDecl 0x55adbc57aba0 <line:128:5, col:17> col:17 size_type 'int'
| `-BuiltinType 0x55adbbce2370 'int'
|-TypedefDecl 0x55adbc57ac08 <line:130:5, col:16> col:16 iterator 'unsigned int *'
| `-PointerType 0x55adbc579e30 'unsigned int *'
|   `-SubstTemplateTypeParmType 0x55adbc578bb0 'unsigned int' sugar
|     |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|     `-BuiltinType 0x55adbbce2410 'unsigned int'
|-TypedefDecl 0x55adbc57ac70 <line:131:5, col:22> col:22 const_iterator 'const unsigned int *'
| `-PointerType 0x55adbc579ec0 'const unsigned int *'
|   `-QualType 0x55adbc578bb1 'const unsigned int' const
|     `-SubstTemplateTypeParmType 0x55adbc578bb0 'unsigned int' sugar
|       |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|       `-BuiltinType 0x55adbbce2410 'unsigned int'
|-EnumDecl 0x55adbc57acc8 <line:134:5> col:5
| `-EnumConstantDecl 0x55adbc57adc0 <col:12, col:40> col:12 RESERVE_GROW 'Vector<unsigned int>::(anonymous enum at ../dummy_inc/click/vector.hh:134:5)'
|   `-ConstantExpr 0x55adbc57ada0 <col:27, col:40> 'Vector::size_type':'int' Int: -1
|     `-CStyleCastExpr 0x55adbc0003c8 <col:27, col:40> 'Vector::size_type':'int' <NoOp>
|       `-UnaryOperator 0x55adbc0003a0 <col:39, col:40> 'int' prefix '-'
|         `-IntegerLiteral 0x55adbc000380 <col:40> 'int' 1
|-CXXConstructorDecl 0x55adbc57ae48 <line:137:5, col:28> col:21 Vector 'void ()' inline
|-CXXConstructorDecl 0x55adbc57b098 <line:138:5, col:62> col:21 Vector 'void (Vector::size_type, Vector<unsigned int>::value_argument_type)' inline
| |-ParmVarDecl 0x55adbc57af00 <col:28, col:38> col:38 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55adbc57afa0 <col:41, col:61> col:61 v 'Vector<unsigned int>::value_argument_type':'unsigned int'
|-CXXConstructorDecl 0x55adbc57b358 <line:139:5, col:37> col:12 Vector 'void (const Vector<unsigned int> &)' inline
| `-ParmVarDecl 0x55adbc57b240 <col:19, col:36> col:36 x 'const Vector<unsigned int> &'
|-CXXConstructorDecl 0x55adbc57b618 <line:141:5, col:32> col:12 Vector 'void (Vector<unsigned int> &&)' inline
| `-ParmVarDecl 0x55adbc57b500 <col:19, col:31> col:31 x 'Vector<unsigned int> &&'
|-CXXMethodDecl 0x55adbc57b960 <line:144:5, col:51> col:23 operator= 'Vector<unsigned int> &(const Vector<unsigned int> &)' inline
| `-ParmVarDecl 0x55adbc57b840 <col:33, col:50> col:50 x 'const Vector<unsigned int> &'
|-CXXMethodDecl 0x55adbc57bc70 <line:146:5, col:46> col:23 operator= 'Vector<unsigned int> &(Vector<unsigned int> &&)' inline
| `-ParmVarDecl 0x55adbc57bb50 <col:33, col:45> col:45 x 'Vector<unsigned int> &&'
|-CXXMethodDecl 0x55adbc57d3f8 <line:148:5, col:70> col:23 assign 'Vector<unsigned int> &(Vector::size_type, Vector<unsigned int>::value_argument_type)' inline
| |-ParmVarDecl 0x55adbc57bda8 <col:30, col:40> col:40 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55adbc57be20 <col:43, col:69> col:63 v 'Vector<unsigned int>::value_argument_type':'unsigned int'
|-CXXMethodDecl 0x55adbc57d528 <line:150:5, col:55> col:49 begin 'Vector<unsigned int>::iterator ()'
| |-NoInlineAttr 0x55adbc57d608 <col:20> Inherited
| `-OptimizeNoneAttr 0x55adbc57d660 <col:30> Inherited
|-CXXMethodDecl 0x55adbc57d6a8 <line:151:5, col:53> col:49 end 'Vector<unsigned int>::iterator ()'
| |-NoInlineAttr 0x55adbc57d758 <col:20> Inherited
| `-OptimizeNoneAttr 0x55adbc57d7b0 <col:30> Inherited
|-CXXMethodDecl 0x55adbc57d848 <line:152:5, col:63> col:55 begin 'Vector<unsigned int>::const_iterator () const'
| |-NoInlineAttr 0x55adbc57d8f8 <col:20> Inherited
| `-OptimizeNoneAttr 0x55adbc57d950 <col:30> Inherited
|-CXXMethodDecl 0x55adbc57d998 <line:153:5, col:61> col:55 end 'Vector<unsigned int>::const_iterator () const'
| |-NoInlineAttr 0x55adbc57da48 <col:20> Inherited
| `-OptimizeNoneAttr 0x55adbc57daa0 <col:30> Inherited
|-CXXMethodDecl 0x55adbc57dae8 <line:154:5, col:64> col:55 cbegin 'Vector<unsigned int>::const_iterator () const'
| |-NoInlineAttr 0x55adbc57db98 <col:20> Inherited
| `-OptimizeNoneAttr 0x55adbc57dbf0 <col:30> Inherited
|-CXXMethodDecl 0x55adbc57dc38 <line:155:5, col:62> col:55 cend 'Vector<unsigned int>::const_iterator () const'
| |-NoInlineAttr 0x55adbc57dce8 <col:20> Inherited
| `-OptimizeNoneAttr 0x55adbc57dd40 <col:30> Inherited
|-CXXMethodDecl 0x55adbc57dd68 <line:157:5, col:29> col:22 size 'Vector::size_type () const' inline
|-CXXMethodDecl 0x55adbc57de18 <line:158:5, col:33> col:22 capacity 'Vector::size_type () const' inline
|-CXXMethodDecl 0x55adbc57dec8 <line:159:5, col:25> col:17 empty 'bool () const' inline
|-CXXMethodDecl 0x55adbc57e088 <line:160:5, col:64> col:17 resize 'void (Vector::size_type, Vector<unsigned int>::value_argument_type)' inline
| |-ParmVarDecl 0x55adbc57df78 <col:24, col:34> col:34 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55adbc57dff0 <col:37, col:63> col:57 v 'Vector<unsigned int>::value_argument_type':'unsigned int'
|-CXXMethodDecl 0x55adbc57e1d8 <line:161:5, col:36> col:17 reserve 'bool (Vector::size_type)' inline
| `-ParmVarDecl 0x55adbc57e148 <col:25, col:35> col:35 n 'Vector::size_type':'int'
|-CXXMethodDecl 0x55adbc57e388 <line:163:5, col:65> col:43 operator[] 'unsigned int &(Vector::size_type)'
| |-ParmVarDecl 0x55adbc57e290 <col:54, col:64> col:64 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x55adbc57e440 <col:20>
| `-OptimizeNoneAttr 0x55adbc57e498 <col:30>
|-CXXMethodDecl 0x55adbc57e5b8 <line:164:5, col:73> col:49 operator[] 'const unsigned int &(Vector::size_type) const'
| |-ParmVarDecl 0x55adbc57e4c0 <col:60, col:70> col:70 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x55adbc57e670 <col:20>
| `-OptimizeNoneAttr 0x55adbc57e6c8 <col:30>
|-CXXMethodDecl 0x55adbc57e780 <line:165:5, col:29> col:15 at 'unsigned int &(Vector::size_type)' inline
| `-ParmVarDecl 0x55adbc57e6f0 <col:18, col:28> col:28 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55adbc57e8c8 <line:166:5, col:37> col:21 at 'const unsigned int &(Vector::size_type) const' inline
| `-ParmVarDecl 0x55adbc57e838 <col:24, col:34> col:34 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55adbc57e9f8 <line:167:5, col:21> col:15 front 'unsigned int &()' inline
|-CXXMethodDecl 0x55adbc57eb28 <line:168:5, col:29> col:21 front 'const unsigned int &() const' inline
|-CXXMethodDecl 0x55adbc57ebf8 <line:169:5, col:20> col:15 back 'unsigned int &()' inline
|-CXXMethodDecl 0x55adbc57ecc8 <line:170:5, col:28> col:21 back 'const unsigned int &() const' inline
|-CXXMethodDecl 0x55adbc57ee08 <line:172:5, col:39> col:15 unchecked_at 'unsigned int &(Vector::size_type)' inline
| `-ParmVarDecl 0x55adbc57ed78 <col:28, col:38> col:38 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55adbc57ef50 <line:173:5, col:47> col:21 unchecked_at 'const unsigned int &(Vector::size_type) const' inline
| `-ParmVarDecl 0x55adbc57eec0 <col:34, col:44> col:44 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55adbc57f098 <line:174:5, col:59> col:15 at_u 'unsigned int &(Vector::size_type)' inline
| |-ParmVarDecl 0x55adbc57f008 <col:20, col:30> col:30 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x55adbc57f150 <col:48> Inherited "" ""
|-CXXMethodDecl 0x55adbc57f250 <line:175:5, col:71> col:21 at_u 'const unsigned int &(Vector::size_type) const' inline
| |-ParmVarDecl 0x55adbc57f1c0 <col:26, col:36> col:36 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x55adbc57f308 <col:60> Inherited "" ""
|-CXXMethodDecl 0x55adbc57f3c8 <line:177:5, col:20> col:15 data 'unsigned int *()' inline
|-CXXMethodDecl 0x55adbc57f4c8 <line:178:5, col:28> col:21 data 'const unsigned int *() const' inline
|-CXXMethodDecl 0x55adbc57f648 <line:180:5, col:48> col:17 push_back 'void (Vector<unsigned int>::value_argument_type)' inline
| `-ParmVarDecl 0x55adbc57f588 <col:27, col:47> col:47 v 'Vector<unsigned int>::value_argument_type':'unsigned int'
|-FunctionTemplateDecl 0x55adbc57fe08 <line:182:5, line:183:63> col:48 push_back
| |-TemplateTypeParmDecl 0x55adbc57f700 <line:182:15, col:43> col:24 typename depth 0 index 0 A
| | `-TemplateArgument type 'fast_argument<unsigned int>':'fast_argument<unsigned int, false>'
| `-CXXMethodDecl 0x55adbc57fd68 <line:183:5, col:63> col:48 push_back 'typename A::enable_rvalue_reference (unsigned int &&)' inline
|   `-ParmVarDecl 0x55adbc57fc68 <col:58, col:62> col:62 v 'unsigned int &&'
|-CXXMethodDecl 0x55adbc57fee8 <line:185:5, col:26> col:17 pop_back 'void ()' inline
|-CXXMethodDecl 0x55adbc580038 <line:186:5, col:49> col:17 push_front 'void (Vector<unsigned int>::value_argument_type)' inline
| `-ParmVarDecl 0x55adbc57ffa8 <col:28, col:48> col:48 v 'Vector<unsigned int>::value_argument_type':'unsigned int'
|-CXXMethodDecl 0x55adbc5800f0 <line:187:5, col:27> col:17 pop_front 'void ()' inline
|-CXXMethodDecl 0x55adbc580338 <line:189:5, col:62> col:21 insert 'Vector<unsigned int>::iterator (Vector<unsigned int>::iterator, Vector<unsigned int>::value_argument_type)' inline
| |-ParmVarDecl 0x55adbc5801b0 <col:28, col:37> col:37 it 'Vector<unsigned int>::iterator':'unsigned int *'
| `-ParmVarDecl 0x55adbc580228 <col:41, col:61> col:61 v 'Vector<unsigned int>::value_argument_type':'unsigned int'
|-CXXMethodDecl 0x55adbc5804f8 <line:190:5, col:38> col:21 erase 'Vector<unsigned int>::iterator (Vector<unsigned int>::iterator)' inline
| `-ParmVarDecl 0x55adbc580408 <col:27, col:36> col:36 it 'Vector<unsigned int>::iterator':'unsigned int *'
|-CXXMethodDecl 0x55adbc580748 <line:191:5, col:49> col:21 erase 'Vector<unsigned int>::iterator (Vector<unsigned int>::iterator, Vector<unsigned int>::iterator)' inline
| |-ParmVarDecl 0x55adbc5805c0 <col:27, col:36> col:36 a 'Vector<unsigned int>::iterator':'unsigned int *'
| `-ParmVarDecl 0x55adbc580638 <col:39, col:48> col:48 b 'Vector<unsigned int>::iterator':'unsigned int *'
|-CXXMethodDecl 0x55adbc580808 <line:193:5, col:23> col:17 clear 'void ()' inline
|-CXXMethodDecl 0x55adbc580a68 <line:195:5, col:34> col:17 swap 'void (Vector<unsigned int> &)' inline
| `-ParmVarDecl 0x55adbc580970 <col:22, col:33> col:33 x 'Vector<unsigned int> &'
`-CXXDestructorDecl 0x55adbc580b38 <../dummy_inc/click/ipaddress.hh:13:29> col:29 implicit ~Vector 'void ()' inline default noexcept-unevaluated 0x55adbc580b38

Layout: <CGRecordLayout
  LLVMType:%class.Vector.2 = type { %class.vector_memory.3 }
  NonVirtualBaseLLVMType:%class.Vector.2 = type { %class.vector_memory.3 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x55adbc461c08 <../dummy_inc/click/ipaddress.hh:13:1, col:29> ../dummy_inc/click/vector.hh:111:7 class Vector definition
|-DefinitionData standard_layout has_user_declared_ctor has_mutable_fields can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor non_trivial user_declared has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveConstructor exists non_trivial user_declared needs_overload_resolution
| |-CopyAssignment non_trivial has_const_param user_declared needs_overload_resolution implicit_has_const_param
| |-MoveAssignment exists non_trivial user_declared needs_overload_resolution
| `-Destructor simple non_trivial needs_overload_resolution
|-TemplateArgument type 'int'
|-CXXRecordDecl 0x55adbc461e18 prev 0x55adbc461c08 <col:1, col:7> col:7 implicit class Vector
|-TypedefDecl 0x55adbc472e80 <line:113:5, col:44> col:44 array_memory_type 'typename array_memory<int>::type':'sized_array_memory<4>'
| `-ElaboratedType 0x55adbc472e30 'typename array_memory<int>::type' sugar
|   `-TypedefType 0x55adbc472e10 'conditional<true, sized_array_memory<4>, typed_array_memory<int> >::type' sugar
|     |-Typedef 0x55adbc472cc0 'type'
|     `-SubstTemplateTypeParmType 0x55adbc472ae0 'sized_array_memory<4>' sugar
|       |-TemplateTypeParmType 0x55adbbfc9040 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55adbbfc8fe8 'T'
|       `-RecordType 0x55adbc472630 'sized_array_memory<4>'
|         `-ClassTemplateSpecialization 0x55adbc472548 'sized_array_memory'
|-FieldDecl 0x55adbc476ab0 <line:114:5, col:46> col:46 vm_ 'vector_memory<Vector<int>::array_memory_type>':'vector_memory<sized_array_memory<4> >' mutable
|-AccessSpecDecl 0x55adbc476b00 <line:116:3, col:9> col:3 public
|-TypedefDecl 0x55adbc476b38 <line:118:5, col:15> col:15 value_type 'int':'int'
| `-SubstTemplateTypeParmType 0x55adbc461eb0 'int' sugar
|   |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|   `-BuiltinType 0x55adbbce2370 'int'
|-TypedefDecl 0x55adbc476bc8 <line:119:5, col:16> col:16 reference 'int &'
| `-LValueReferenceType 0x55adbc476b90 'int &'
|   `-SubstTemplateTypeParmType 0x55adbc461eb0 'int' sugar
|     |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|     `-BuiltinType 0x55adbbce2370 'int'
|-TypedefDecl 0x55adbc476c58 <line:120:5, col:22> col:22 const_reference 'const int &'
| `-LValueReferenceType 0x55adbc476c20 'const int &'
|   `-QualType 0x55adbc461eb1 'const int' const
|     `-SubstTemplateTypeParmType 0x55adbc461eb0 'int' sugar
|       |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|       `-BuiltinType 0x55adbbce2370 'int'
|-TypedefDecl 0x55adbc476ce8 <line:121:5, col:16> col:16 pointer 'int *'
| `-PointerType 0x55adbc476cb0 'int *'
|   `-SubstTemplateTypeParmType 0x55adbc461eb0 'int' sugar
|     |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|     `-BuiltinType 0x55adbbce2370 'int'
|-TypedefDecl 0x55adbc476d78 <line:122:5, col:22> col:22 const_pointer 'const int *'
| `-PointerType 0x55adbc476d40 'const int *'
|   `-QualType 0x55adbc461eb1 'const int' const
|     `-SubstTemplateTypeParmType 0x55adbc461eb0 'int' sugar
|       |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|       `-BuiltinType 0x55adbbce2370 'int'
|-TypedefDecl 0x55adbc477960 <line:125:5, col:45> col:45 value_argument_type 'typename fast_argument<int>::type':'int'
| `-ElaboratedType 0x55adbc477910 'typename fast_argument<int>::type' sugar
|   `-TypedefType 0x55adbc4778f0 'fast_argument<int, false>::type' sugar
|     |-Typedef 0x55adbc477880 'type'
|     `-SubstTemplateTypeParmType 0x55adbc477640 'int' sugar
|       |-TemplateTypeParmType 0x55adbbfd1240 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55adbbfd11f0 'T'
|       `-BuiltinType 0x55adbbce2370 'int'
|-TypedefDecl 0x55adbc4779c8 <line:126:5, col:22> col:22 const_access_type 'const int &'
| `-LValueReferenceType 0x55adbc476c20 'const int &'
|   `-QualType 0x55adbc461eb1 'const int' const
|     `-SubstTemplateTypeParmType 0x55adbc461eb0 'int' sugar
|       |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|       `-BuiltinType 0x55adbbce2370 'int'
|-TypedefDecl 0x55adbc477a20 <line:128:5, col:17> col:17 size_type 'int'
| `-BuiltinType 0x55adbbce2370 'int'
|-TypedefDecl 0x55adbc477a88 <line:130:5, col:16> col:16 iterator 'int *'
| `-PointerType 0x55adbc476cb0 'int *'
|   `-SubstTemplateTypeParmType 0x55adbc461eb0 'int' sugar
|     |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|     `-BuiltinType 0x55adbbce2370 'int'
|-TypedefDecl 0x55adbc477af0 <line:131:5, col:22> col:22 const_iterator 'const int *'
| `-PointerType 0x55adbc476d40 'const int *'
|   `-QualType 0x55adbc461eb1 'const int' const
|     `-SubstTemplateTypeParmType 0x55adbc461eb0 'int' sugar
|       |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|       `-BuiltinType 0x55adbbce2370 'int'
|-EnumDecl 0x55adbc477b48 <line:134:5> col:5
| `-EnumConstantDecl 0x55adbc477c40 <col:12, col:40> col:12 RESERVE_GROW 'Vector<int>::(anonymous enum at ../dummy_inc/click/vector.hh:134:5)'
|   `-ConstantExpr 0x55adbc477c20 <col:27, col:40> 'Vector::size_type':'int' Int: -1
|     `-CStyleCastExpr 0x55adbc0003c8 <col:27, col:40> 'Vector::size_type':'int' <NoOp>
|       `-UnaryOperator 0x55adbc0003a0 <col:39, col:40> 'int' prefix '-'
|         `-IntegerLiteral 0x55adbc000380 <col:40> 'int' 1
|-CXXConstructorDecl 0x55adbc477cc8 <line:137:5, col:28> col:21 Vector 'void ()' inline
|-CXXConstructorDecl 0x55adbc477f18 <line:138:5, col:62> col:21 Vector 'void (Vector::size_type, Vector<int>::value_argument_type)' inline
| |-ParmVarDecl 0x55adbc477d80 <col:28, col:38> col:38 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55adbc477e20 <col:41, col:61> col:61 v 'Vector<int>::value_argument_type':'int'
|-CXXConstructorDecl 0x55adbc4781d8 <line:139:5, col:37> col:12 Vector 'void (const Vector<int> &)' inline
| `-ParmVarDecl 0x55adbc4780c0 <col:19, col:36> col:36 x 'const Vector<int> &'
|-CXXConstructorDecl 0x55adbc478498 <line:141:5, col:32> col:12 Vector 'void (Vector<int> &&)' inline
| `-ParmVarDecl 0x55adbc478380 <col:19, col:31> col:31 x 'Vector<int> &&'
|-CXXMethodDecl 0x55adbc4787e0 <line:144:5, col:51> col:23 operator= 'Vector<int> &(const Vector<int> &)' inline
| `-ParmVarDecl 0x55adbc4786c0 <col:33, col:50> col:50 x 'const Vector<int> &'
|-CXXMethodDecl 0x55adbc478af0 <line:146:5, col:46> col:23 operator= 'Vector<int> &(Vector<int> &&)' inline
| `-ParmVarDecl 0x55adbc4789d0 <col:33, col:45> col:45 x 'Vector<int> &&'
|-CXXMethodDecl 0x55adbc478de0 <line:148:5, col:70> col:23 assign 'Vector<int> &(Vector::size_type, Vector<int>::value_argument_type)' inline
| |-ParmVarDecl 0x55adbc478c28 <col:30, col:40> col:40 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55adbc478ca0 <col:43, col:69> col:63 v 'Vector<int>::value_argument_type':'int'
|-CXXMethodDecl 0x55adbc478f08 <line:150:5, col:55> col:49 begin 'Vector<int>::iterator ()'
| |-NoInlineAttr 0x55adbc478fe8 <col:20> Inherited
| `-OptimizeNoneAttr 0x55adbc479040 <col:30> Inherited
|-CXXMethodDecl 0x55adbc479088 <line:151:5, col:53> col:49 end 'Vector<int>::iterator ()'
| |-NoInlineAttr 0x55adbc479138 <col:20> Inherited
| `-OptimizeNoneAttr 0x55adbc479190 <col:30> Inherited
|-CXXMethodDecl 0x55adbc479258 <line:152:5, col:63> col:55 begin 'Vector<int>::const_iterator () const'
| |-NoInlineAttr 0x55adbc479308 <col:20> Inherited
| `-OptimizeNoneAttr 0x55adbc479360 <col:30> Inherited
|-CXXMethodDecl 0x55adbc4793a8 <line:153:5, col:61> col:55 end 'Vector<int>::const_iterator () const'
| |-NoInlineAttr 0x55adbc479458 <col:20> Inherited
| `-OptimizeNoneAttr 0x55adbc4794b0 <col:30> Inherited
|-CXXMethodDecl 0x55adbc4794f8 <line:154:5, col:64> col:55 cbegin 'Vector<int>::const_iterator () const'
| |-NoInlineAttr 0x55adbc4795a8 <col:20> Inherited
| `-OptimizeNoneAttr 0x55adbc479600 <col:30> Inherited
|-CXXMethodDecl 0x55adbc479648 <line:155:5, col:62> col:55 cend 'Vector<int>::const_iterator () const'
| |-NoInlineAttr 0x55adbc4796f8 <col:20> Inherited
| `-OptimizeNoneAttr 0x55adbc479750 <col:30> Inherited
|-CXXMethodDecl 0x55adbc479778 <line:157:5, col:29> col:22 size 'Vector::size_type () const' inline
|-CXXMethodDecl 0x55adbc479828 <line:158:5, col:33> col:22 capacity 'Vector::size_type () const' inline
|-CXXMethodDecl 0x55adbc4798d8 <line:159:5, col:25> col:17 empty 'bool () const' inline
|-CXXMethodDecl 0x55adbc479a98 <line:160:5, col:64> col:17 resize 'void (Vector::size_type, Vector<int>::value_argument_type)' inline
| |-ParmVarDecl 0x55adbc479988 <col:24, col:34> col:34 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55adbc479a00 <col:37, col:63> col:57 v 'Vector<int>::value_argument_type':'int'
|-CXXMethodDecl 0x55adbc479be8 <line:161:5, col:36> col:17 reserve 'bool (Vector::size_type)' inline
| `-ParmVarDecl 0x55adbc479b58 <col:25, col:35> col:35 n 'Vector::size_type':'int'
|-CXXMethodDecl 0x55adbc479d98 <line:163:5, col:65> col:43 used operator[] 'int &(Vector::size_type)'
| |-ParmVarDecl 0x55adbc479ca0 <col:54, col:64> col:64 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x55adbc479e50 <col:20>
| `-OptimizeNoneAttr 0x55adbc479ea8 <col:30>
|-CXXMethodDecl 0x55adbc47a5d8 <line:164:5, col:73> col:49 operator[] 'const int &(Vector::size_type) const'
| |-ParmVarDecl 0x55adbc479ed0 <col:60, col:70> col:70 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x55adbc47a690 <col:20>
| `-OptimizeNoneAttr 0x55adbc47a6e8 <col:30>
|-CXXMethodDecl 0x55adbc47a7a0 <line:165:5, col:29> col:15 at 'int &(Vector::size_type)' inline
| `-ParmVarDecl 0x55adbc47a710 <col:18, col:28> col:28 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55adbc47a8e8 <line:166:5, col:37> col:21 at 'const int &(Vector::size_type) const' inline
| `-ParmVarDecl 0x55adbc47a858 <col:24, col:34> col:34 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55adbc47aa18 <line:167:5, col:21> col:15 front 'int &()' inline
|-CXXMethodDecl 0x55adbc47ab48 <line:168:5, col:29> col:21 front 'const int &() const' inline
|-CXXMethodDecl 0x55adbc47ac18 <line:169:5, col:20> col:15 back 'int &()' inline
|-CXXMethodDecl 0x55adbc47ace8 <line:170:5, col:28> col:21 used back 'const int &() const' inline
|-CXXMethodDecl 0x55adbc47ae28 <line:172:5, col:39> col:15 unchecked_at 'int &(Vector::size_type)' inline
| `-ParmVarDecl 0x55adbc47ad98 <col:28, col:38> col:38 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55adbc47af70 <line:173:5, col:47> col:21 unchecked_at 'const int &(Vector::size_type) const' inline
| `-ParmVarDecl 0x55adbc47aee0 <col:34, col:44> col:44 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55adbc47b0b8 <line:174:5, col:59> col:15 at_u 'int &(Vector::size_type)' inline
| |-ParmVarDecl 0x55adbc47b028 <col:20, col:30> col:30 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x55adbc47b170 <col:48> Inherited "" ""
|-CXXMethodDecl 0x55adbc47b270 <line:175:5, col:71> col:21 at_u 'const int &(Vector::size_type) const' inline
| |-ParmVarDecl 0x55adbc47b1e0 <col:26, col:36> col:36 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x55adbc47b328 <col:60> Inherited "" ""
|-CXXMethodDecl 0x55adbc47b3e8 <line:177:5, col:20> col:15 data 'int *()' inline
|-CXXMethodDecl 0x55adbc47b4e8 <line:178:5, col:28> col:21 data 'const int *() const' inline
|-CXXMethodDecl 0x55adbc47b668 <line:180:5, col:48> col:17 push_back 'void (Vector<int>::value_argument_type)' inline
| `-ParmVarDecl 0x55adbc47b5a8 <col:27, col:47> col:47 v 'Vector<int>::value_argument_type':'int'
|-FunctionTemplateDecl 0x55adbc47be28 <line:182:5, line:183:63> col:48 push_back
| |-TemplateTypeParmDecl 0x55adbc47b720 <line:182:15, col:43> col:24 typename depth 0 index 0 A
| | `-TemplateArgument type 'fast_argument<int>':'fast_argument<int, false>'
| `-CXXMethodDecl 0x55adbc47bd88 <line:183:5, col:63> col:48 push_back 'typename A::enable_rvalue_reference (int &&)' inline
|   `-ParmVarDecl 0x55adbc47bc88 <col:58, col:62> col:62 v 'int &&'
|-CXXMethodDecl 0x55adbc47bf08 <line:185:5, col:26> col:17 pop_back 'void ()' inline
|-CXXMethodDecl 0x55adbc47c058 <line:186:5, col:49> col:17 push_front 'void (Vector<int>::value_argument_type)' inline
| `-ParmVarDecl 0x55adbc47bfc8 <col:28, col:48> col:48 v 'Vector<int>::value_argument_type':'int'
|-CXXMethodDecl 0x55adbc47c110 <line:187:5, col:27> col:17 pop_front 'void ()' inline
|-CXXMethodDecl 0x55adbc47c358 <line:189:5, col:62> col:21 insert 'Vector<int>::iterator (Vector<int>::iterator, Vector<int>::value_argument_type)' inline
| |-ParmVarDecl 0x55adbc47c1d0 <col:28, col:37> col:37 it 'Vector<int>::iterator':'int *'
| `-ParmVarDecl 0x55adbc47c248 <col:41, col:61> col:61 v 'Vector<int>::value_argument_type':'int'
|-CXXMethodDecl 0x55adbc47c518 <line:190:5, col:38> col:21 erase 'Vector<int>::iterator (Vector<int>::iterator)' inline
| `-ParmVarDecl 0x55adbc47c428 <col:27, col:36> col:36 it 'Vector<int>::iterator':'int *'
|-CXXMethodDecl 0x55adbc47c768 <line:191:5, col:49> col:21 erase 'Vector<int>::iterator (Vector<int>::iterator, Vector<int>::iterator)' inline
| |-ParmVarDecl 0x55adbc47c5e0 <col:27, col:36> col:36 a 'Vector<int>::iterator':'int *'
| `-ParmVarDecl 0x55adbc47c658 <col:39, col:48> col:48 b 'Vector<int>::iterator':'int *'
|-CXXMethodDecl 0x55adbc47c828 <line:193:5, col:23> col:17 used clear 'void ()' inline
|-CXXMethodDecl 0x55adbc47ca88 <line:195:5, col:34> col:17 swap 'void (Vector<int> &)' inline
| `-ParmVarDecl 0x55adbc47c990 <col:22, col:33> col:33 x 'Vector<int> &'
`-CXXDestructorDecl 0x55adbc47cb58 <../dummy_inc/click/ipaddress.hh:13:29> col:29 implicit ~Vector 'void ()' inline default noexcept-unevaluated 0x55adbc47cb58

Layout: <CGRecordLayout
  LLVMType:%class.Vector.5 = type { %class.vector_memory.3 }
  NonVirtualBaseLLVMType:%class.Vector.5 = type { %class.vector_memory.3 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x55adbc580d80 <../dummy_inc/click/router.hh:247:5, line:250:5> line:247:12 referenced struct element_landmark_t definition
|-DefinitionData aggregate standard_layout has_mutable_fields
| |-DefaultConstructor exists non_trivial needs_implicit
| |-CopyConstructor simple non_trivial has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveConstructor exists simple non_trivial needs_overload_resolution
| |-CopyAssignment non_trivial has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveAssignment exists simple non_trivial needs_overload_resolution
| `-Destructor simple non_trivial needs_overload_resolution
|-CXXRecordDecl 0x55adbc580e98 <col:5, col:12> col:12 implicit struct element_landmark_t
|-FieldDecl 0x55adbc580f38 <line:248:9, col:18> col:18 first_landmarkid 'uint32_t':'unsigned int'
|-FieldDecl 0x55adbc580f98 <line:249:9, col:16> col:16 filename 'String'
|-CXXConstructorDecl 0x55adbc581030 <line:247:12> col:12 implicit element_landmark_t 'void (const Router::element_landmark_t &)' inline default noexcept-unevaluated 0x55adbc581030
| `-ParmVarDecl 0x55adbc581148 <col:12> col:12 'const Router::element_landmark_t &'
|-CXXConstructorDecl 0x55adbc5811e8 <col:12> col:12 implicit element_landmark_t 'void (Router::element_landmark_t &&)' inline default noexcept-unevaluated 0x55adbc5811e8
| `-ParmVarDecl 0x55adbc5812f8 <col:12> col:12 'Router::element_landmark_t &&'
|-CXXMethodDecl 0x55adbc581398 <col:12> col:12 implicit operator= 'Router::element_landmark_t &(const Router::element_landmark_t &)' inline default noexcept-unevaluated 0x55adbc581398
| `-ParmVarDecl 0x55adbc5814a8 <col:12> col:12 'const Router::element_landmark_t &'
|-CXXMethodDecl 0x55adbc581518 <col:12> col:12 implicit operator= 'Router::element_landmark_t &(Router::element_landmark_t &&)' inline default noexcept-unevaluated 0x55adbc581518
| `-ParmVarDecl 0x55adbc581628 <col:12> col:12 'Router::element_landmark_t &&'
`-CXXDestructorDecl 0x55adbc5816b0 <col:12> col:12 implicit ~element_landmark_t 'void ()' inline default noexcept-unevaluated 0x55adbc5816b0

Layout: <CGRecordLayout
  LLVMType:%"struct.Router::element_landmark_t" = type { i32, %class.String }
  NonVirtualBaseLLVMType:%"struct.Router::element_landmark_t" = type { i32, %class.String }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x55adbc582c40 <../dummy_inc/click/vector.hh:11:1, line:71:1> line:11:30 class vector_memory definition
|-DefinitionData standard_layout has_user_declared_ctor can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor simple trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveConstructor
| |-CopyAssignment trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveAssignment
| `-Destructor non_trivial user_declared
|-TemplateArgument type 'typed_array_memory<Router::element_landmark_t>'
|-CXXRecordDecl 0x55adbc582e18 prev 0x55adbc582c40 <col:24, col:30> col:30 implicit class vector_memory
|-AccessSpecDecl 0x55adbc582ea8 <col:46, col:52> col:46 public
|-TypedefDecl 0x55adbc582ed0 <line:12:5, col:17> col:17 size_type 'int'
| `-BuiltinType 0x55adbbce2370 'int'
|-TypedefDecl 0x55adbc584890 <line:13:5, col:31> col:31 type 'typename typed_array_memory<element_landmark_t>::type':'Router::element_landmark_t'
| `-ElaboratedType 0x55adbc584840 'typename typed_array_memory<element_landmark_t>::type' sugar
|   `-TypedefType 0x55adbc584820 'typed_array_memory<Router::element_landmark_t>::type' sugar
|     |-Typedef 0x55adbc5830e8 'type'
|     `-SubstTemplateTypeParmType 0x55adbc5830b0 'Router::element_landmark_t' sugar
|       |-TemplateTypeParmType 0x55adbbfefa30 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55adbbfef9e0 'T'
|       `-RecordType 0x55adbc580e10 'Router::element_landmark_t'
|         `-CXXRecord 0x55adbc580d80 'element_landmark_t'
|-TypedefDecl 0x55adbc584948 <line:14:5, col:19> col:19 iterator 'vector_memory<typed_array_memory<Router::element_landmark_t> >::type *'
| `-PointerType 0x55adbc584910 'vector_memory<typed_array_memory<Router::element_landmark_t> >::type *'
|   `-TypedefType 0x55adbc5848f0 'vector_memory<typed_array_memory<Router::element_landmark_t> >::type' sugar
|     |-Typedef 0x55adbc584890 'type'
|     `-ElaboratedType 0x55adbc584840 'typename typed_array_memory<element_landmark_t>::type' sugar
|       `-TypedefType 0x55adbc584820 'typed_array_memory<Router::element_landmark_t>::type' sugar
|         |-Typedef 0x55adbc5830e8 'type'
|         `-SubstTemplateTypeParmType 0x55adbc5830b0 'Router::element_landmark_t' sugar
|           |-TemplateTypeParmType 0x55adbbfefa30 'T' dependent depth 0 index 0
|           | `-TemplateTypeParm 0x55adbbfef9e0 'T'
|           `-RecordType 0x55adbc580e10 'Router::element_landmark_t'
|             `-CXXRecord 0x55adbc580d80 'element_landmark_t'
|-CXXMethodDecl 0x55adbc584ac8 <line:15:5, line:18:5> line:15:17 need_argument_copy 'bool (const vector_memory<typed_array_memory<Router::element_landmark_t> >::type *) const' inline
| `-ParmVarDecl 0x55adbc5849d8 <col:36, col:48> col:48 argp 'const vector_memory<typed_array_memory<Router::element_landmark_t> >::type *'
|-CXXConstructorDecl 0x55adbc584bb8 <line:20:5, line:22:5> line:20:5 vector_memory 'void ()'
|-CXXDestructorDecl 0x55adbc584c98 <line:23:5, col:20> col:5 ~vector_memory 'void ()' noexcept-unevaluated 0x55adbc584c98
|-CXXMethodDecl 0x55adbc584f68 <line:25:5, col:43> col:10 assign 'void (const vector_memory<typed_array_memory<Router::element_landmark_t> > &)'
| `-ParmVarDecl 0x55adbc584e70 <col:17, col:42> col:42 x 'const vector_memory<typed_array_memory<Router::element_landmark_t> > &'
|-CXXMethodDecl 0x55adbc5851a8 <line:26:5, col:44> col:10 assign 'void (vector_memory::size_type, const vector_memory<typed_array_memory<Router::element_landmark_t> >::type *)'
| |-ParmVarDecl 0x55adbc585020 <col:17, col:27> col:27 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55adbc585098 <col:30, col:42> col:42 vp 'const vector_memory<typed_array_memory<Router::element_landmark_t> >::type *'
|-CXXMethodDecl 0x55adbc587160 <line:27:5, col:44> col:10 resize 'void (vector_memory::size_type, const vector_memory<typed_array_memory<Router::element_landmark_t> >::type *)'
| |-ParmVarDecl 0x55adbc585268 <col:17, col:27> col:27 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55adbc5852e0 <col:30, col:42> col:42 vp 'const vector_memory<typed_array_memory<Router::element_landmark_t> >::type *'
|-CXXMethodDecl 0x55adbc5872b8 <line:28:5, line:30:5> line:28:14 begin 'vector_memory<typed_array_memory<Router::element_landmark_t> >::iterator ()'
|-CXXMethodDecl 0x55adbc587388 <line:31:5, line:33:5> line:31:14 end 'vector_memory<typed_array_memory<Router::element_landmark_t> >::iterator ()'
|-CXXMethodDecl 0x55adbc5875d8 <line:34:5, col:48> col:14 insert 'vector_memory<typed_array_memory<Router::element_landmark_t> >::iterator (vector_memory<typed_array_memory<Router::element_landmark_t> >::iterator, const vector_memory<typed_array_memory<Router::element_landmark_t> >::type *)'
| |-ParmVarDecl 0x55adbc587448 <col:21, col:30> col:30 it 'vector_memory<typed_array_memory<Router::element_landmark_t> >::iterator':'vector_memory<typed_array_memory<Router::element_landmark_t> >::type *'
| `-ParmVarDecl 0x55adbc5874c0 <col:34, col:46> col:46 vp 'const vector_memory<typed_array_memory<Router::element_landmark_t> >::type *'
|-CXXMethodDecl 0x55adbc587838 <line:35:5, col:42> col:14 erase 'vector_memory<typed_array_memory<Router::element_landmark_t> >::iterator (vector_memory<typed_array_memory<Router::element_landmark_t> >::iterator, vector_memory<typed_array_memory<Router::element_landmark_t> >::iterator)'
| |-ParmVarDecl 0x55adbc5876a8 <col:20, col:29> col:29 a 'vector_memory<typed_array_memory<Router::element_landmark_t> >::iterator':'vector_memory<typed_array_memory<Router::element_landmark_t> >::type *'
| `-ParmVarDecl 0x55adbc587720 <col:32, col:41> col:41 b 'vector_memory<typed_array_memory<Router::element_landmark_t> >::iterator':'vector_memory<typed_array_memory<Router::element_landmark_t> >::type *'
|-CXXMethodDecl 0x55adbc5879f8 <line:36:5, line:43:5> line:36:17 push_back 'void (const vector_memory<typed_array_memory<Router::element_landmark_t> >::type *)' inline
| `-ParmVarDecl 0x55adbc587908 <col:27, col:39> col:39 vp 'const vector_memory<typed_array_memory<Router::element_landmark_t> >::type *'
|-CXXMethodDecl 0x55adbc587bb8 <line:45:5, line:52:5> line:45:17 move_construct_back 'void (vector_memory<typed_array_memory<Router::element_landmark_t> >::type *)' inline
| `-ParmVarDecl 0x55adbc587ac0 <col:37, col:43> col:43 vp 'vector_memory<typed_array_memory<Router::element_landmark_t> >::type *'
|-CXXMethodDecl 0x55adbc587c70 <line:54:5, line:59:5> line:54:17 pop_back 'void ()' inline
|-CXXMethodDecl 0x55adbc587d20 <line:60:5, line:64:5> line:60:17 clear 'void ()' inline
|-CXXMethodDecl 0x55adbc587f58 <line:65:5, col:59> col:10 reserve_and_push_back 'bool (vector_memory::size_type, const vector_memory<typed_array_memory<Router::element_landmark_t> >::type *)'
| |-ParmVarDecl 0x55adbc587dd0 <col:32, col:42> col:42 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55adbc587e48 <col:45, col:57> col:57 vp 'const vector_memory<typed_array_memory<Router::element_landmark_t> >::type *'
|-CXXMethodDecl 0x55adbc5881f8 <line:66:5, col:35> col:10 swap 'void (vector_memory<typed_array_memory<Router::element_landmark_t> > &)'
| `-ParmVarDecl 0x55adbc588100 <col:15, col:34> col:34 x 'vector_memory<typed_array_memory<Router::element_landmark_t> > &'
|-FieldDecl 0x55adbc5882c0 <line:68:5, col:11> col:11 l_ 'vector_memory<typed_array_memory<Router::element_landmark_t> >::type *'
|-FieldDecl 0x55adbc588310 <line:69:5, col:15> col:15 n_ 'vector_memory::size_type':'int'
`-FieldDecl 0x55adbc588360 <line:70:5, col:15> col:15 capacity_ 'vector_memory::size_type':'int'

Layout: <CGRecordLayout
  LLVMType:%class.vector_memory.7 = type { %"struct.Router::element_landmark_t"*, i32, i32 }
  NonVirtualBaseLLVMType:%class.vector_memory.7 = type { %"struct.Router::element_landmark_t"*, i32, i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x55adbc5817a0 <../dummy_inc/click/ipaddress.hh:13:1, col:29> ../dummy_inc/click/vector.hh:111:7 class Vector definition
|-DefinitionData standard_layout has_user_declared_ctor has_mutable_fields can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor non_trivial user_declared has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveConstructor exists non_trivial user_declared needs_overload_resolution
| |-CopyAssignment non_trivial has_const_param user_declared needs_overload_resolution implicit_has_const_param
| |-MoveAssignment exists non_trivial user_declared needs_overload_resolution
| `-Destructor simple non_trivial needs_overload_resolution
|-TemplateArgument type 'Router::element_landmark_t'
|-CXXRecordDecl 0x55adbc5819a8 prev 0x55adbc5817a0 <col:1, col:7> col:7 implicit class Vector
|-TypedefDecl 0x55adbc582bb0 <line:113:5, col:44> col:44 array_memory_type 'typename array_memory<element_landmark_t>::type':'typed_array_memory<Router::element_landmark_t>'
| `-ElaboratedType 0x55adbc582b60 'typename array_memory<element_landmark_t>::type' sugar
|   `-TypedefType 0x55adbc582b40 'conditional<false, sized_array_memory<32>, typed_array_memory<Router::element_landmark_t> >::type' sugar
|     |-Typedef 0x55adbc5829f0 'type'
|     `-SubstTemplateTypeParmType 0x55adbc582880 'typed_array_memory<Router::element_landmark_t>' sugar
|       |-TemplateTypeParmType 0x55adbbfc9830 'F' dependent depth 0 index 1
|       | `-TemplateTypeParm 0x55adbbfc97d8 'F'
|       `-RecordType 0x55adbc5824e0 'typed_array_memory<Router::element_landmark_t>'
|         `-ClassTemplateSpecialization 0x55adbc582400 'typed_array_memory'
|-FieldDecl 0x55adbc5883b0 <line:114:5, col:46> col:46 vm_ 'vector_memory<Vector<Router::element_landmark_t>::array_memory_type>':'vector_memory<typed_array_memory<Router::element_landmark_t> >' mutable
|-AccessSpecDecl 0x55adbc588400 <line:116:3, col:9> col:3 public
|-TypedefDecl 0x55adbc588438 <line:118:5, col:15> col:15 value_type 'Router::element_landmark_t':'Router::element_landmark_t'
| `-SubstTemplateTypeParmType 0x55adbc581a40 'Router::element_landmark_t' sugar
|   |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|   `-RecordType 0x55adbc580e10 'Router::element_landmark_t'
|     `-CXXRecord 0x55adbc580d80 'element_landmark_t'
|-TypedefDecl 0x55adbc5884c8 <line:119:5, col:16> col:16 reference 'Router::element_landmark_t &'
| `-LValueReferenceType 0x55adbc588490 'Router::element_landmark_t &'
|   `-SubstTemplateTypeParmType 0x55adbc581a40 'Router::element_landmark_t' sugar
|     |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|     `-RecordType 0x55adbc580e10 'Router::element_landmark_t'
|       `-CXXRecord 0x55adbc580d80 'element_landmark_t'
|-TypedefDecl 0x55adbc588558 <line:120:5, col:22> col:22 const_reference 'const Router::element_landmark_t &'
| `-LValueReferenceType 0x55adbc588520 'const Router::element_landmark_t &'
|   `-QualType 0x55adbc581a41 'const Router::element_landmark_t' const
|     `-SubstTemplateTypeParmType 0x55adbc581a40 'Router::element_landmark_t' sugar
|       |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|       `-RecordType 0x55adbc580e10 'Router::element_landmark_t'
|         `-CXXRecord 0x55adbc580d80 'element_landmark_t'
|-TypedefDecl 0x55adbc5885e8 <line:121:5, col:16> col:16 pointer 'Router::element_landmark_t *'
| `-PointerType 0x55adbc5885b0 'Router::element_landmark_t *'
|   `-SubstTemplateTypeParmType 0x55adbc581a40 'Router::element_landmark_t' sugar
|     |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|     `-RecordType 0x55adbc580e10 'Router::element_landmark_t'
|       `-CXXRecord 0x55adbc580d80 'element_landmark_t'
|-TypedefDecl 0x55adbc588678 <line:122:5, col:22> col:22 const_pointer 'const Router::element_landmark_t *'
| `-PointerType 0x55adbc588640 'const Router::element_landmark_t *'
|   `-QualType 0x55adbc581a41 'const Router::element_landmark_t' const
|     `-SubstTemplateTypeParmType 0x55adbc581a40 'Router::element_landmark_t' sugar
|       |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|       `-RecordType 0x55adbc580e10 'Router::element_landmark_t'
|         `-CXXRecord 0x55adbc580d80 'element_landmark_t'
|-TypedefDecl 0x55adbc5892d0 <line:125:5, col:45> col:45 value_argument_type 'typename fast_argument<element_landmark_t>::type':'const Router::element_landmark_t &'
| `-ElaboratedType 0x55adbc589280 'typename fast_argument<element_landmark_t>::type' sugar
|   `-TypedefType 0x55adbc589260 'fast_argument<Router::element_landmark_t, true>::type' sugar
|     |-Typedef 0x55adbc589198 'type'
|     `-LValueReferenceType 0x55adbc589160 'const Router::element_landmark_t &'
|       `-QualType 0x55adbc588f01 'const Router::element_landmark_t' const
|         `-SubstTemplateTypeParmType 0x55adbc588f00 'Router::element_landmark_t' sugar
|           |-TemplateTypeParmType 0x55adbbfd0b10 'T' dependent depth 0 index 0
|           | `-TemplateTypeParm 0x55adbbfd0ab8 'T'
|           `-RecordType 0x55adbc580e10 'Router::element_landmark_t'
|             `-CXXRecord 0x55adbc580d80 'element_landmark_t'
|-TypedefDecl 0x55adbc589338 <line:126:5, col:22> col:22 const_access_type 'const Router::element_landmark_t &'
| `-LValueReferenceType 0x55adbc588520 'const Router::element_landmark_t &'
|   `-QualType 0x55adbc581a41 'const Router::element_landmark_t' const
|     `-SubstTemplateTypeParmType 0x55adbc581a40 'Router::element_landmark_t' sugar
|       |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|       `-RecordType 0x55adbc580e10 'Router::element_landmark_t'
|         `-CXXRecord 0x55adbc580d80 'element_landmark_t'
|-TypedefDecl 0x55adbc589390 <line:128:5, col:17> col:17 size_type 'int'
| `-BuiltinType 0x55adbbce2370 'int'
|-TypedefDecl 0x55adbc5893f8 <line:130:5, col:16> col:16 iterator 'Router::element_landmark_t *'
| `-PointerType 0x55adbc5885b0 'Router::element_landmark_t *'
|   `-SubstTemplateTypeParmType 0x55adbc581a40 'Router::element_landmark_t' sugar
|     |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|     `-RecordType 0x55adbc580e10 'Router::element_landmark_t'
|       `-CXXRecord 0x55adbc580d80 'element_landmark_t'
|-TypedefDecl 0x55adbc589460 <line:131:5, col:22> col:22 const_iterator 'const Router::element_landmark_t *'
| `-PointerType 0x55adbc588640 'const Router::element_landmark_t *'
|   `-QualType 0x55adbc581a41 'const Router::element_landmark_t' const
|     `-SubstTemplateTypeParmType 0x55adbc581a40 'Router::element_landmark_t' sugar
|       |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|       `-RecordType 0x55adbc580e10 'Router::element_landmark_t'
|         `-CXXRecord 0x55adbc580d80 'element_landmark_t'
|-EnumDecl 0x55adbc5894b8 <line:134:5> col:5
| `-EnumConstantDecl 0x55adbc5895b0 <col:12, col:40> col:12 RESERVE_GROW 'Vector<Router::element_landmark_t>::(anonymous enum at ../dummy_inc/click/vector.hh:134:5)'
|   `-ConstantExpr 0x55adbc589590 <col:27, col:40> 'Vector::size_type':'int' Int: -1
|     `-CStyleCastExpr 0x55adbc0003c8 <col:27, col:40> 'Vector::size_type':'int' <NoOp>
|       `-UnaryOperator 0x55adbc0003a0 <col:39, col:40> 'int' prefix '-'
|         `-IntegerLiteral 0x55adbc000380 <col:40> 'int' 1
|-CXXConstructorDecl 0x55adbc589638 <line:137:5, col:28> col:21 Vector 'void ()' inline
|-CXXConstructorDecl 0x55adbc5898c8 <line:138:5, col:62> col:21 Vector 'void (Vector::size_type, Vector<Router::element_landmark_t>::value_argument_type)' inline
| |-ParmVarDecl 0x55adbc5896f0 <col:28, col:38> col:38 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55adbc589790 <col:41, col:61> col:61 v 'Vector<Router::element_landmark_t>::value_argument_type':'const Router::element_landmark_t &'
|-CXXConstructorDecl 0x55adbc589b88 <line:139:5, col:37> col:12 Vector 'void (const Vector<Router::element_landmark_t> &)' inline
| `-ParmVarDecl 0x55adbc589a70 <col:19, col:36> col:36 x 'const Vector<Router::element_landmark_t> &'
|-CXXConstructorDecl 0x55adbc589e48 <line:141:5, col:32> col:12 Vector 'void (Vector<Router::element_landmark_t> &&)' inline
| `-ParmVarDecl 0x55adbc589d30 <col:19, col:31> col:31 x 'Vector<Router::element_landmark_t> &&'
|-CXXMethodDecl 0x55adbc58a190 <line:144:5, col:51> col:23 operator= 'Vector<Router::element_landmark_t> &(const Vector<Router::element_landmark_t> &)' inline
| `-ParmVarDecl 0x55adbc58a070 <col:33, col:50> col:50 x 'const Vector<Router::element_landmark_t> &'
|-CXXMethodDecl 0x55adbc58a4a0 <line:146:5, col:46> col:23 operator= 'Vector<Router::element_landmark_t> &(Vector<Router::element_landmark_t> &&)' inline
| `-ParmVarDecl 0x55adbc58a380 <col:33, col:45> col:45 x 'Vector<Router::element_landmark_t> &&'
|-CXXMethodDecl 0x55adbc58a790 <line:148:5, col:70> col:23 assign 'Vector<Router::element_landmark_t> &(Vector::size_type, Vector<Router::element_landmark_t>::value_argument_type)' inline
| |-ParmVarDecl 0x55adbc58a5d8 <col:30, col:40> col:40 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55adbc58a650 <col:43, col:69> col:63 v 'Vector<Router::element_landmark_t>::value_argument_type':'const Router::element_landmark_t &'
|-CXXMethodDecl 0x55adbc58a8b8 <line:150:5, col:55> col:49 begin 'Vector<Router::element_landmark_t>::iterator ()'
| |-NoInlineAttr 0x55adbc58a998 <col:20> Inherited
| `-OptimizeNoneAttr 0x55adbc58a9f0 <col:30> Inherited
|-CXXMethodDecl 0x55adbc58aa38 <line:151:5, col:53> col:49 end 'Vector<Router::element_landmark_t>::iterator ()'
| |-NoInlineAttr 0x55adbc58aae8 <col:20> Inherited
| `-OptimizeNoneAttr 0x55adbc58ab40 <col:30> Inherited
|-CXXMethodDecl 0x55adbc58ac08 <line:152:5, col:63> col:55 begin 'Vector<Router::element_landmark_t>::const_iterator () const'
| |-NoInlineAttr 0x55adbc58acb8 <col:20> Inherited
| `-OptimizeNoneAttr 0x55adbc58ad10 <col:30> Inherited
|-CXXMethodDecl 0x55adbc58ad58 <line:153:5, col:61> col:55 end 'Vector<Router::element_landmark_t>::const_iterator () const'
| |-NoInlineAttr 0x55adbc58ae08 <col:20> Inherited
| `-OptimizeNoneAttr 0x55adbc58ae60 <col:30> Inherited
|-CXXMethodDecl 0x55adbc58aea8 <line:154:5, col:64> col:55 cbegin 'Vector<Router::element_landmark_t>::const_iterator () const'
| |-NoInlineAttr 0x55adbc58af58 <col:20> Inherited
| `-OptimizeNoneAttr 0x55adbc58afb0 <col:30> Inherited
|-CXXMethodDecl 0x55adbc58aff8 <line:155:5, col:62> col:55 cend 'Vector<Router::element_landmark_t>::const_iterator () const'
| |-NoInlineAttr 0x55adbc58b0a8 <col:20> Inherited
| `-OptimizeNoneAttr 0x55adbc58b100 <col:30> Inherited
|-CXXMethodDecl 0x55adbc58b128 <line:157:5, col:29> col:22 size 'Vector::size_type () const' inline
|-CXXMethodDecl 0x55adbc58b1d8 <line:158:5, col:33> col:22 capacity 'Vector::size_type () const' inline
|-CXXMethodDecl 0x55adbc58b288 <line:159:5, col:25> col:17 empty 'bool () const' inline
|-CXXMethodDecl 0x55adbc58b448 <line:160:5, col:64> col:17 resize 'void (Vector::size_type, Vector<Router::element_landmark_t>::value_argument_type)' inline
| |-ParmVarDecl 0x55adbc58b338 <col:24, col:34> col:34 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55adbc58b3b0 <col:37, col:63> col:57 v 'Vector<Router::element_landmark_t>::value_argument_type':'const Router::element_landmark_t &'
|-CXXMethodDecl 0x55adbc58b598 <line:161:5, col:36> col:17 reserve 'bool (Vector::size_type)' inline
| `-ParmVarDecl 0x55adbc58b508 <col:25, col:35> col:35 n 'Vector::size_type':'int'
|-CXXMethodDecl 0x55adbc58b748 <line:163:5, col:65> col:43 operator[] 'Router::element_landmark_t &(Vector::size_type)'
| |-ParmVarDecl 0x55adbc58b650 <col:54, col:64> col:64 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x55adbc58b800 <col:20>
| `-OptimizeNoneAttr 0x55adbc58b858 <col:30>
|-CXXMethodDecl 0x55adbc58b978 <line:164:5, col:73> col:49 operator[] 'const Router::element_landmark_t &(Vector::size_type) const'
| |-ParmVarDecl 0x55adbc58b880 <col:60, col:70> col:70 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x55adbc58ba30 <col:20>
| `-OptimizeNoneAttr 0x55adbc58ba88 <col:30>
|-CXXMethodDecl 0x55adbc58bb40 <line:165:5, col:29> col:15 at 'Router::element_landmark_t &(Vector::size_type)' inline
| `-ParmVarDecl 0x55adbc58bab0 <col:18, col:28> col:28 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55adbc58bc88 <line:166:5, col:37> col:21 at 'const Router::element_landmark_t &(Vector::size_type) const' inline
| `-ParmVarDecl 0x55adbc58bbf8 <col:24, col:34> col:34 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55adbc58bdb8 <line:167:5, col:21> col:15 front 'Router::element_landmark_t &()' inline
|-CXXMethodDecl 0x55adbc58bee8 <line:168:5, col:29> col:21 front 'const Router::element_landmark_t &() const' inline
|-CXXMethodDecl 0x55adbc58bfb8 <line:169:5, col:20> col:15 back 'Router::element_landmark_t &()' inline
|-CXXMethodDecl 0x55adbc58c088 <line:170:5, col:28> col:21 back 'const Router::element_landmark_t &() const' inline
|-CXXMethodDecl 0x55adbc58c1c8 <line:172:5, col:39> col:15 unchecked_at 'Router::element_landmark_t &(Vector::size_type)' inline
| `-ParmVarDecl 0x55adbc58c138 <col:28, col:38> col:38 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55adbc58c310 <line:173:5, col:47> col:21 unchecked_at 'const Router::element_landmark_t &(Vector::size_type) const' inline
| `-ParmVarDecl 0x55adbc58c280 <col:34, col:44> col:44 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55adbc58c458 <line:174:5, col:59> col:15 at_u 'Router::element_landmark_t &(Vector::size_type)' inline
| |-ParmVarDecl 0x55adbc58c3c8 <col:20, col:30> col:30 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x55adbc58c510 <col:48> Inherited "" ""
|-CXXMethodDecl 0x55adbc58c610 <line:175:5, col:71> col:21 at_u 'const Router::element_landmark_t &(Vector::size_type) const' inline
| |-ParmVarDecl 0x55adbc58c580 <col:26, col:36> col:36 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x55adbc58c6c8 <col:60> Inherited "" ""
|-CXXMethodDecl 0x55adbc58c788 <line:177:5, col:20> col:15 data 'Router::element_landmark_t *()' inline
|-CXXMethodDecl 0x55adbc58c888 <line:178:5, col:28> col:21 data 'const Router::element_landmark_t *() const' inline
|-CXXMethodDecl 0x55adbc58ca08 <line:180:5, col:48> col:17 push_back 'void (Vector<Router::element_landmark_t>::value_argument_type)' inline
| `-ParmVarDecl 0x55adbc58c948 <col:27, col:47> col:47 v 'Vector<Router::element_landmark_t>::value_argument_type':'const Router::element_landmark_t &'
|-FunctionTemplateDecl 0x55adbc58d198 <line:182:5, line:183:63> col:48 push_back
| |-TemplateTypeParmDecl 0x55adbc58cac0 <line:182:15, col:43> col:24 typename depth 0 index 0 A
| | `-TemplateArgument type 'fast_argument<Router::element_landmark_t>':'fast_argument<Router::element_landmark_t, true>'
| `-CXXMethodDecl 0x55adbc58d0f8 <line:183:5, col:63> col:48 push_back 'typename A::enable_rvalue_reference (Router::element_landmark_t &&)' inline
|   `-ParmVarDecl 0x55adbc58cff8 <col:58, col:62> col:62 v 'Router::element_landmark_t &&'
|-CXXMethodDecl 0x55adbc58d278 <line:185:5, col:26> col:17 pop_back 'void ()' inline
|-CXXMethodDecl 0x55adbc58d3c8 <line:186:5, col:49> col:17 push_front 'void (Vector<Router::element_landmark_t>::value_argument_type)' inline
| `-ParmVarDecl 0x55adbc58d338 <col:28, col:48> col:48 v 'Vector<Router::element_landmark_t>::value_argument_type':'const Router::element_landmark_t &'
|-CXXMethodDecl 0x55adbc58d480 <line:187:5, col:27> col:17 pop_front 'void ()' inline
|-CXXMethodDecl 0x55adbc58d6c8 <line:189:5, col:62> col:21 insert 'Vector<Router::element_landmark_t>::iterator (Vector<Router::element_landmark_t>::iterator, Vector<Router::element_landmark_t>::value_argument_type)' inline
| |-ParmVarDecl 0x55adbc58d540 <col:28, col:37> col:37 it 'Vector<Router::element_landmark_t>::iterator':'Router::element_landmark_t *'
| `-ParmVarDecl 0x55adbc58d5b8 <col:41, col:61> col:61 v 'Vector<Router::element_landmark_t>::value_argument_type':'const Router::element_landmark_t &'
|-CXXMethodDecl 0x55adbc58d858 <line:190:5, col:38> col:21 erase 'Vector<Router::element_landmark_t>::iterator (Vector<Router::element_landmark_t>::iterator)' inline
| `-ParmVarDecl 0x55adbc58d798 <col:27, col:36> col:36 it 'Vector<Router::element_landmark_t>::iterator':'Router::element_landmark_t *'
|-CXXMethodDecl 0x55adbc58da68 <line:191:5, col:49> col:21 erase 'Vector<Router::element_landmark_t>::iterator (Vector<Router::element_landmark_t>::iterator, Vector<Router::element_landmark_t>::iterator)' inline
| |-ParmVarDecl 0x55adbc58d920 <col:27, col:36> col:36 a 'Vector<Router::element_landmark_t>::iterator':'Router::element_landmark_t *'
| `-ParmVarDecl 0x55adbc58d998 <col:39, col:48> col:48 b 'Vector<Router::element_landmark_t>::iterator':'Router::element_landmark_t *'
|-CXXMethodDecl 0x55adbc58db28 <line:193:5, col:23> col:17 clear 'void ()' inline
|-CXXMethodDecl 0x55adbc58dd88 <line:195:5, col:34> col:17 swap 'void (Vector<Router::element_landmark_t> &)' inline
| `-ParmVarDecl 0x55adbc58dc90 <col:22, col:33> col:33 x 'Vector<Router::element_landmark_t> &'
`-CXXDestructorDecl 0x55adbc58de58 <../dummy_inc/click/ipaddress.hh:13:29> col:29 implicit ~Vector 'void ()' inline default noexcept-unevaluated 0x55adbc58de58

Layout: <CGRecordLayout
  LLVMType:%class.Vector.6 = type { %class.vector_memory.7 }
  NonVirtualBaseLLVMType:%class.Vector.6 = type { %class.vector_memory.7 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x55adbc4e3fb0 <../dummy_inc/click/vector.hh:11:1, line:71:1> line:11:30 class vector_memory definition
|-DefinitionData standard_layout has_user_declared_ctor can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor simple trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveConstructor
| |-CopyAssignment trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveAssignment
| `-Destructor non_trivial user_declared
|-TemplateArgument type 'sized_array_memory<16>'
|-CXXRecordDecl 0x55adbc4e4188 prev 0x55adbc4e3fb0 <col:24, col:30> col:30 implicit class vector_memory
|-AccessSpecDecl 0x55adbc4e4218 <col:46, col:52> col:46 public
|-TypedefDecl 0x55adbc4e4240 <line:12:5, col:17> col:17 size_type 'int'
| `-BuiltinType 0x55adbbce2370 'int'
|-TypedefDecl 0x55adbc4e5e10 <line:13:5, col:31> col:31 type 'typename sized_array_memory<16>::type':'char_array<16>'
| `-ElaboratedType 0x55adbc4e5dc0 'typename sized_array_memory<16>::type' sugar
|   `-TypedefType 0x55adbc4e46f0 'sized_array_memory<16>::type' sugar
|     |-Typedef 0x55adbc4e45f0 'type'
|     `-TemplateSpecializationType 0x55adbc4e4580 'char_array<16UL>' sugar char_array
|       |-TemplateArgument expr
|       | `-ConstantExpr 0x55adbc4e4460 <../dummy_inc/click/array_memory.hh:11:24> 'unsigned long' Int: 16
|       |   `-SubstNonTypeTemplateParmExpr 0x55adbc4e4440 <col:24> 'unsigned long'
|       |     `-IntegerLiteral 0x55adbc4e4420 <col:24> 'unsigned long' 16
|       `-RecordType 0x55adbc4e4560 'char_array<16>'
|         `-ClassTemplateSpecialization 0x55adbc4e4480 'char_array'
|-TypedefDecl 0x55adbc4e5ec8 <../dummy_inc/click/vector.hh:14:5, col:19> col:19 iterator 'vector_memory<sized_array_memory<16> >::type *'
| `-PointerType 0x55adbc4e5e90 'vector_memory<sized_array_memory<16> >::type *'
|   `-TypedefType 0x55adbc4e5e70 'vector_memory<sized_array_memory<16> >::type' sugar
|     |-Typedef 0x55adbc4e5e10 'type'
|     `-ElaboratedType 0x55adbc4e5dc0 'typename sized_array_memory<16>::type' sugar
|       `-TypedefType 0x55adbc4e46f0 'sized_array_memory<16>::type' sugar
|         |-Typedef 0x55adbc4e45f0 'type'
|         `-TemplateSpecializationType 0x55adbc4e4580 'char_array<16UL>' sugar char_array
|           |-TemplateArgument expr
|           | `-ConstantExpr 0x55adbc4e4460 <../dummy_inc/click/array_memory.hh:11:24> 'unsigned long' Int: 16
|           |   `-SubstNonTypeTemplateParmExpr 0x55adbc4e4440 <col:24> 'unsigned long'
|           |     `-IntegerLiteral 0x55adbc4e4420 <col:24> 'unsigned long' 16
|           `-RecordType 0x55adbc4e4560 'char_array<16>'
|             `-ClassTemplateSpecialization 0x55adbc4e4480 'char_array'
|-CXXMethodDecl 0x55adbc4e6048 <../dummy_inc/click/vector.hh:15:5, line:18:5> line:15:17 need_argument_copy 'bool (const vector_memory<sized_array_memory<16> >::type *) const' inline
| `-ParmVarDecl 0x55adbc4e5f58 <col:36, col:48> col:48 argp 'const vector_memory<sized_array_memory<16> >::type *'
|-CXXConstructorDecl 0x55adbc4e6138 <line:20:5, line:22:5> line:20:5 vector_memory 'void ()'
|-CXXDestructorDecl 0x55adbc4e6218 <line:23:5, col:20> col:5 ~vector_memory 'void ()' noexcept-unevaluated 0x55adbc4e6218
|-CXXMethodDecl 0x55adbc4e64e8 <line:25:5, col:43> col:10 assign 'void (const vector_memory<sized_array_memory<16> > &)'
| `-ParmVarDecl 0x55adbc4e63f0 <col:17, col:42> col:42 x 'const vector_memory<sized_array_memory<16> > &'
|-CXXMethodDecl 0x55adbc4e6728 <line:26:5, col:44> col:10 assign 'void (vector_memory::size_type, const vector_memory<sized_array_memory<16> >::type *)'
| |-ParmVarDecl 0x55adbc4e65a0 <col:17, col:27> col:27 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55adbc4e6618 <col:30, col:42> col:42 vp 'const vector_memory<sized_array_memory<16> >::type *'
|-CXXMethodDecl 0x55adbc4e68f8 <line:27:5, col:44> col:10 resize 'void (vector_memory::size_type, const vector_memory<sized_array_memory<16> >::type *)'
| |-ParmVarDecl 0x55adbc4e67e8 <col:17, col:27> col:27 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55adbc4e6860 <col:30, col:42> col:42 vp 'const vector_memory<sized_array_memory<16> >::type *'
|-CXXMethodDecl 0x55adbc4e6a58 <line:28:5, line:30:5> line:28:14 begin 'vector_memory<sized_array_memory<16> >::iterator ()'
|-CXXMethodDecl 0x55adbc4e6b28 <line:31:5, line:33:5> line:31:14 end 'vector_memory<sized_array_memory<16> >::iterator ()'
|-CXXMethodDecl 0x55adbc4e6d78 <line:34:5, col:48> col:14 insert 'vector_memory<sized_array_memory<16> >::iterator (vector_memory<sized_array_memory<16> >::iterator, const vector_memory<sized_array_memory<16> >::type *)'
| |-ParmVarDecl 0x55adbc4e6be8 <col:21, col:30> col:30 it 'vector_memory<sized_array_memory<16> >::iterator':'vector_memory<sized_array_memory<16> >::type *'
| `-ParmVarDecl 0x55adbc4e6c60 <col:34, col:46> col:46 vp 'const vector_memory<sized_array_memory<16> >::type *'
|-CXXMethodDecl 0x55adbc4e6fd8 <line:35:5, col:42> col:14 erase 'vector_memory<sized_array_memory<16> >::iterator (vector_memory<sized_array_memory<16> >::iterator, vector_memory<sized_array_memory<16> >::iterator)'
| |-ParmVarDecl 0x55adbc4e6e48 <col:20, col:29> col:29 a 'vector_memory<sized_array_memory<16> >::iterator':'vector_memory<sized_array_memory<16> >::type *'
| `-ParmVarDecl 0x55adbc4e6ec0 <col:32, col:41> col:41 b 'vector_memory<sized_array_memory<16> >::iterator':'vector_memory<sized_array_memory<16> >::type *'
|-CXXMethodDecl 0x55adbc4e7198 <line:36:5, line:43:5> line:36:17 push_back 'void (const vector_memory<sized_array_memory<16> >::type *)' inline
| `-ParmVarDecl 0x55adbc4e70a8 <col:27, col:39> col:39 vp 'const vector_memory<sized_array_memory<16> >::type *'
|-CXXMethodDecl 0x55adbc4e7358 <line:45:5, line:52:5> line:45:17 move_construct_back 'void (vector_memory<sized_array_memory<16> >::type *)' inline
| `-ParmVarDecl 0x55adbc4e7260 <col:37, col:43> col:43 vp 'vector_memory<sized_array_memory<16> >::type *'
|-CXXMethodDecl 0x55adbc4e7410 <line:54:5, line:59:5> line:54:17 pop_back 'void ()' inline
|-CXXMethodDecl 0x55adbc4e74c0 <line:60:5, line:64:5> line:60:17 clear 'void ()' inline
|-CXXMethodDecl 0x55adbc4e76f8 <line:65:5, col:59> col:10 reserve_and_push_back 'bool (vector_memory::size_type, const vector_memory<sized_array_memory<16> >::type *)'
| |-ParmVarDecl 0x55adbc4e7570 <col:32, col:42> col:42 n 'vector_memory::size_type':'int'
| `-ParmVarDecl 0x55adbc4e75e8 <col:45, col:57> col:57 vp 'const vector_memory<sized_array_memory<16> >::type *'
|-CXXMethodDecl 0x55adbc4e7998 <line:66:5, col:35> col:10 swap 'void (vector_memory<sized_array_memory<16> > &)'
| `-ParmVarDecl 0x55adbc4e78a0 <col:15, col:34> col:34 x 'vector_memory<sized_array_memory<16> > &'
|-FieldDecl 0x55adbc4e7a60 <line:68:5, col:11> col:11 l_ 'vector_memory<sized_array_memory<16> >::type *'
|-FieldDecl 0x55adbc4e7ab0 <line:69:5, col:15> col:15 n_ 'vector_memory::size_type':'int'
`-FieldDecl 0x55adbc4e7b00 <line:70:5, col:15> col:15 capacity_ 'vector_memory::size_type':'int'

Layout: <CGRecordLayout
  LLVMType:%class.vector_memory.9 = type { %struct.char_array.10*, i32, i32 }
  NonVirtualBaseLLVMType:%class.vector_memory.9 = type { %struct.char_array.10*, i32, i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x55adbc58e570 <../dummy_inc/click/ipaddress.hh:13:1, col:29> ../dummy_inc/click/vector.hh:111:7 class Vector definition
|-DefinitionData standard_layout has_user_declared_ctor has_mutable_fields can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor non_trivial user_declared has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveConstructor exists non_trivial user_declared needs_overload_resolution
| |-CopyAssignment non_trivial has_const_param user_declared needs_overload_resolution implicit_has_const_param
| |-MoveAssignment exists non_trivial user_declared needs_overload_resolution
| `-Destructor simple non_trivial needs_overload_resolution
|-TemplateArgument type 'Router::Connection'
|-CXXRecordDecl 0x55adbc58e778 prev 0x55adbc58e570 <col:1, col:7> col:7 implicit class Vector
|-TypedefDecl 0x55adbc592d70 <line:113:5, col:44> col:44 array_memory_type 'typename array_memory<Connection>::type':'sized_array_memory<16>'
| `-ElaboratedType 0x55adbc592d20 'typename array_memory<Connection>::type' sugar
|   `-TypedefType 0x55adbc592d00 'conditional<true, sized_array_memory<16>, typed_array_memory<Router::Connection> >::type' sugar
|     |-Typedef 0x55adbc592bb0 'type'
|     `-SubstTemplateTypeParmType 0x55adbc4e3b80 'sized_array_memory<16>' sugar
|       |-TemplateTypeParmType 0x55adbbfc9040 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55adbbfc8fe8 'T'
|       `-RecordType 0x55adbc4e36d0 'sized_array_memory<16>'
|         `-ClassTemplateSpecialization 0x55adbc4e35e8 'sized_array_memory'
|-FieldDecl 0x55adbc592e70 <line:114:5, col:46> col:46 vm_ 'vector_memory<Vector<Router::Connection>::array_memory_type>':'vector_memory<sized_array_memory<16> >' mutable
|-AccessSpecDecl 0x55adbc592ec0 <line:116:3, col:9> col:3 public
|-TypedefDecl 0x55adbc592ef8 <line:118:5, col:15> col:15 value_type 'Router::Connection':'Router::Connection'
| `-SubstTemplateTypeParmType 0x55adbc58e810 'Router::Connection' sugar
|   |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|   `-RecordType 0x55adbc56dc00 'Router::Connection'
|     `-CXXRecord 0x55adbc56db70 'Connection'
|-TypedefDecl 0x55adbc592fb8 <line:119:5, col:16> col:16 reference 'Router::Connection &'
| `-LValueReferenceType 0x55adbc592f80 'Router::Connection &'
|   `-SubstTemplateTypeParmType 0x55adbc58e810 'Router::Connection' sugar
|     |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|     `-RecordType 0x55adbc56dc00 'Router::Connection'
|       `-CXXRecord 0x55adbc56db70 'Connection'
|-TypedefDecl 0x55adbc593048 <line:120:5, col:22> col:22 const_reference 'const Router::Connection &'
| `-LValueReferenceType 0x55adbc593010 'const Router::Connection &'
|   `-QualType 0x55adbc58e811 'const Router::Connection' const
|     `-SubstTemplateTypeParmType 0x55adbc58e810 'Router::Connection' sugar
|       |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|       `-RecordType 0x55adbc56dc00 'Router::Connection'
|         `-CXXRecord 0x55adbc56db70 'Connection'
|-TypedefDecl 0x55adbc5930d8 <line:121:5, col:16> col:16 pointer 'Router::Connection *'
| `-PointerType 0x55adbc5930a0 'Router::Connection *'
|   `-SubstTemplateTypeParmType 0x55adbc58e810 'Router::Connection' sugar
|     |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|     `-RecordType 0x55adbc56dc00 'Router::Connection'
|       `-CXXRecord 0x55adbc56db70 'Connection'
|-TypedefDecl 0x55adbc593168 <line:122:5, col:22> col:22 const_pointer 'const Router::Connection *'
| `-PointerType 0x55adbc593130 'const Router::Connection *'
|   `-QualType 0x55adbc58e811 'const Router::Connection' const
|     `-SubstTemplateTypeParmType 0x55adbc58e810 'Router::Connection' sugar
|       |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|       `-RecordType 0x55adbc56dc00 'Router::Connection'
|         `-CXXRecord 0x55adbc56db70 'Connection'
|-TypedefDecl 0x55adbc593dc0 <line:125:5, col:45> col:45 value_argument_type 'typename fast_argument<Connection>::type':'const Router::Connection &'
| `-ElaboratedType 0x55adbc593d70 'typename fast_argument<Connection>::type' sugar
|   `-TypedefType 0x55adbc593d50 'fast_argument<Router::Connection, true>::type' sugar
|     |-Typedef 0x55adbc593c88 'type'
|     `-LValueReferenceType 0x55adbc593c50 'const Router::Connection &'
|       `-QualType 0x55adbc5939f1 'const Router::Connection' const
|         `-SubstTemplateTypeParmType 0x55adbc5939f0 'Router::Connection' sugar
|           |-TemplateTypeParmType 0x55adbbfd0b10 'T' dependent depth 0 index 0
|           | `-TemplateTypeParm 0x55adbbfd0ab8 'T'
|           `-RecordType 0x55adbc56dc00 'Router::Connection'
|             `-CXXRecord 0x55adbc56db70 'Connection'
|-TypedefDecl 0x55adbc593e28 <line:126:5, col:22> col:22 const_access_type 'const Router::Connection &'
| `-LValueReferenceType 0x55adbc593010 'const Router::Connection &'
|   `-QualType 0x55adbc58e811 'const Router::Connection' const
|     `-SubstTemplateTypeParmType 0x55adbc58e810 'Router::Connection' sugar
|       |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|       `-RecordType 0x55adbc56dc00 'Router::Connection'
|         `-CXXRecord 0x55adbc56db70 'Connection'
|-TypedefDecl 0x55adbc593e80 <line:128:5, col:17> col:17 size_type 'int'
| `-BuiltinType 0x55adbbce2370 'int'
|-TypedefDecl 0x55adbc593ee8 <line:130:5, col:16> col:16 iterator 'Router::Connection *'
| `-PointerType 0x55adbc5930a0 'Router::Connection *'
|   `-SubstTemplateTypeParmType 0x55adbc58e810 'Router::Connection' sugar
|     |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|     `-RecordType 0x55adbc56dc00 'Router::Connection'
|       `-CXXRecord 0x55adbc56db70 'Connection'
|-TypedefDecl 0x55adbc593f50 <line:131:5, col:22> col:22 const_iterator 'const Router::Connection *'
| `-PointerType 0x55adbc593130 'const Router::Connection *'
|   `-QualType 0x55adbc58e811 'const Router::Connection' const
|     `-SubstTemplateTypeParmType 0x55adbc58e810 'Router::Connection' sugar
|       |-TemplateTypeParmType 0x55adbbfff200 'T' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x55adbbfff1a8 'T'
|       `-RecordType 0x55adbc56dc00 'Router::Connection'
|         `-CXXRecord 0x55adbc56db70 'Connection'
|-EnumDecl 0x55adbc593fa8 <line:134:5> col:5
| `-EnumConstantDecl 0x55adbc5940a0 <col:12, col:40> col:12 RESERVE_GROW 'Vector<Router::Connection>::(anonymous enum at ../dummy_inc/click/vector.hh:134:5)'
|   `-ConstantExpr 0x55adbc594080 <col:27, col:40> 'Vector::size_type':'int' Int: -1
|     `-CStyleCastExpr 0x55adbc0003c8 <col:27, col:40> 'Vector::size_type':'int' <NoOp>
|       `-UnaryOperator 0x55adbc0003a0 <col:39, col:40> 'int' prefix '-'
|         `-IntegerLiteral 0x55adbc000380 <col:40> 'int' 1
|-CXXConstructorDecl 0x55adbc594128 <line:137:5, col:28> col:21 Vector 'void ()' inline
|-CXXConstructorDecl 0x55adbc5943b8 <line:138:5, col:62> col:21 Vector 'void (Vector::size_type, Vector<Router::Connection>::value_argument_type)' inline
| |-ParmVarDecl 0x55adbc5941e0 <col:28, col:38> col:38 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55adbc594280 <col:41, col:61> col:61 v 'Vector<Router::Connection>::value_argument_type':'const Router::Connection &'
|-CXXConstructorDecl 0x55adbc594678 <line:139:5, col:37> col:12 Vector 'void (const Vector<Router::Connection> &)' inline
| `-ParmVarDecl 0x55adbc594560 <col:19, col:36> col:36 x 'const Vector<Router::Connection> &'
|-CXXConstructorDecl 0x55adbc594938 <line:141:5, col:32> col:12 Vector 'void (Vector<Router::Connection> &&)' inline
| `-ParmVarDecl 0x55adbc594820 <col:19, col:31> col:31 x 'Vector<Router::Connection> &&'
|-CXXMethodDecl 0x55adbc594c80 <line:144:5, col:51> col:23 operator= 'Vector<Router::Connection> &(const Vector<Router::Connection> &)' inline
| `-ParmVarDecl 0x55adbc594b60 <col:33, col:50> col:50 x 'const Vector<Router::Connection> &'
|-CXXMethodDecl 0x55adbc594f90 <line:146:5, col:46> col:23 operator= 'Vector<Router::Connection> &(Vector<Router::Connection> &&)' inline
| `-ParmVarDecl 0x55adbc594e70 <col:33, col:45> col:45 x 'Vector<Router::Connection> &&'
|-CXXMethodDecl 0x55adbc595280 <line:148:5, col:70> col:23 assign 'Vector<Router::Connection> &(Vector::size_type, Vector<Router::Connection>::value_argument_type)' inline
| |-ParmVarDecl 0x55adbc5950c8 <col:30, col:40> col:40 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55adbc595140 <col:43, col:69> col:63 v 'Vector<Router::Connection>::value_argument_type':'const Router::Connection &'
|-CXXMethodDecl 0x55adbc5953d8 <line:150:5, col:55> col:49 begin 'Vector<Router::Connection>::iterator ()'
| |-NoInlineAttr 0x55adbc5954b8 <col:20> Inherited
| `-OptimizeNoneAttr 0x55adbc595510 <col:30> Inherited
|-CXXMethodDecl 0x55adbc595558 <line:151:5, col:53> col:49 end 'Vector<Router::Connection>::iterator ()'
| |-NoInlineAttr 0x55adbc595608 <col:20> Inherited
| `-OptimizeNoneAttr 0x55adbc595660 <col:30> Inherited
|-CXXMethodDecl 0x55adbc595728 <line:152:5, col:63> col:55 begin 'Vector<Router::Connection>::const_iterator () const'
| |-NoInlineAttr 0x55adbc5957d8 <col:20> Inherited
| `-OptimizeNoneAttr 0x55adbc595830 <col:30> Inherited
|-CXXMethodDecl 0x55adbc595878 <line:153:5, col:61> col:55 end 'Vector<Router::Connection>::const_iterator () const'
| |-NoInlineAttr 0x55adbc595928 <col:20> Inherited
| `-OptimizeNoneAttr 0x55adbc595980 <col:30> Inherited
|-CXXMethodDecl 0x55adbc5959c8 <line:154:5, col:64> col:55 cbegin 'Vector<Router::Connection>::const_iterator () const'
| |-NoInlineAttr 0x55adbc595a78 <col:20> Inherited
| `-OptimizeNoneAttr 0x55adbc595ad0 <col:30> Inherited
|-CXXMethodDecl 0x55adbc595b18 <line:155:5, col:62> col:55 cend 'Vector<Router::Connection>::const_iterator () const'
| |-NoInlineAttr 0x55adbc595bc8 <col:20> Inherited
| `-OptimizeNoneAttr 0x55adbc595c20 <col:30> Inherited
|-CXXMethodDecl 0x55adbc595c48 <line:157:5, col:29> col:22 size 'Vector::size_type () const' inline
|-CXXMethodDecl 0x55adbc595cf8 <line:158:5, col:33> col:22 capacity 'Vector::size_type () const' inline
|-CXXMethodDecl 0x55adbc595da8 <line:159:5, col:25> col:17 empty 'bool () const' inline
|-CXXMethodDecl 0x55adbc595f68 <line:160:5, col:64> col:17 resize 'void (Vector::size_type, Vector<Router::Connection>::value_argument_type)' inline
| |-ParmVarDecl 0x55adbc595e58 <col:24, col:34> col:34 n 'Vector::size_type':'int'
| `-ParmVarDecl 0x55adbc595ed0 <col:37, col:63> col:57 v 'Vector<Router::Connection>::value_argument_type':'const Router::Connection &'
|-CXXMethodDecl 0x55adbc5960b8 <line:161:5, col:36> col:17 reserve 'bool (Vector::size_type)' inline
| `-ParmVarDecl 0x55adbc596028 <col:25, col:35> col:35 n 'Vector::size_type':'int'
|-CXXMethodDecl 0x55adbc596268 <line:163:5, col:65> col:43 operator[] 'Router::Connection &(Vector::size_type)'
| |-ParmVarDecl 0x55adbc596170 <col:54, col:64> col:64 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x55adbc596320 <col:20>
| `-OptimizeNoneAttr 0x55adbc596378 <col:30>
|-CXXMethodDecl 0x55adbc596498 <line:164:5, col:73> col:49 operator[] 'const Router::Connection &(Vector::size_type) const'
| |-ParmVarDecl 0x55adbc5963a0 <col:60, col:70> col:70 i 'Vector::size_type':'int'
| |-NoInlineAttr 0x55adbc596550 <col:20>
| `-OptimizeNoneAttr 0x55adbc5965a8 <col:30>
|-CXXMethodDecl 0x55adbc596660 <line:165:5, col:29> col:15 at 'Router::Connection &(Vector::size_type)' inline
| `-ParmVarDecl 0x55adbc5965d0 <col:18, col:28> col:28 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55adbc5967a8 <line:166:5, col:37> col:21 at 'const Router::Connection &(Vector::size_type) const' inline
| `-ParmVarDecl 0x55adbc596718 <col:24, col:34> col:34 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55adbc5968d8 <line:167:5, col:21> col:15 front 'Router::Connection &()' inline
|-CXXMethodDecl 0x55adbc596a08 <line:168:5, col:29> col:21 front 'const Router::Connection &() const' inline
|-CXXMethodDecl 0x55adbc596ad8 <line:169:5, col:20> col:15 back 'Router::Connection &()' inline
|-CXXMethodDecl 0x55adbc596ba8 <line:170:5, col:28> col:21 back 'const Router::Connection &() const' inline
|-CXXMethodDecl 0x55adbc596ce8 <line:172:5, col:39> col:15 unchecked_at 'Router::Connection &(Vector::size_type)' inline
| `-ParmVarDecl 0x55adbc596c58 <col:28, col:38> col:38 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55adbc596e30 <line:173:5, col:47> col:21 unchecked_at 'const Router::Connection &(Vector::size_type) const' inline
| `-ParmVarDecl 0x55adbc596da0 <col:34, col:44> col:44 i 'Vector::size_type':'int'
|-CXXMethodDecl 0x55adbc596f78 <line:174:5, col:59> col:15 at_u 'Router::Connection &(Vector::size_type)' inline
| |-ParmVarDecl 0x55adbc596ee8 <col:20, col:30> col:30 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x55adbc597030 <col:48> Inherited "" ""
|-CXXMethodDecl 0x55adbc597130 <line:175:5, col:71> col:21 at_u 'const Router::Connection &(Vector::size_type) const' inline
| |-ParmVarDecl 0x55adbc5970a0 <col:26, col:36> col:36 i 'Vector::size_type':'int'
| `-DeprecatedAttr 0x55adbc5971e8 <col:60> Inherited "" ""
|-CXXMethodDecl 0x55adbc5972a8 <line:177:5, col:20> col:15 data 'Router::Connection *()' inline
|-CXXMethodDecl 0x55adbc5973a8 <line:178:5, col:28> col:21 data 'const Router::Connection *() const' inline
|-CXXMethodDecl 0x55adbc597558 <line:180:5, col:48> col:17 push_back 'void (Vector<Router::Connection>::value_argument_type)' inline
| `-ParmVarDecl 0x55adbc597468 <col:27, col:47> col:47 v 'Vector<Router::Connection>::value_argument_type':'const Router::Connection &'
|-FunctionTemplateDecl 0x55adbc597d18 <line:182:5, line:183:63> col:48 push_back
| |-TemplateTypeParmDecl 0x55adbc597610 <line:182:15, col:43> col:24 typename depth 0 index 0 A
| | `-TemplateArgument type 'fast_argument<Router::Connection>':'fast_argument<Router::Connection, true>'
| `-CXXMethodDecl 0x55adbc597c78 <line:183:5, col:63> col:48 push_back 'typename A::enable_rvalue_reference (Router::Connection &&)' inline
|   `-ParmVarDecl 0x55adbc597b78 <col:58, col:62> col:62 v 'Router::Connection &&'
|-CXXMethodDecl 0x55adbc597df8 <line:185:5, col:26> col:17 pop_back 'void ()' inline
|-CXXMethodDecl 0x55adbc597f48 <line:186:5, col:49> col:17 push_front 'void (Vector<Router::Connection>::value_argument_type)' inline
| `-ParmVarDecl 0x55adbc597eb8 <col:28, col:48> col:48 v 'Vector<Router::Connection>::value_argument_type':'const Router::Connection &'
|-CXXMethodDecl 0x55adbc598000 <line:187:5, col:27> col:17 pop_front 'void ()' inline
|-CXXMethodDecl 0x55adbc598248 <line:189:5, col:62> col:21 insert 'Vector<Router::Connection>::iterator (Vector<Router::Connection>::iterator, Vector<Router::Connection>::value_argument_type)' inline
| |-ParmVarDecl 0x55adbc5980c0 <col:28, col:37> col:37 it 'Vector<Router::Connection>::iterator':'Router::Connection *'
| `-ParmVarDecl 0x55adbc598138 <col:41, col:61> col:61 v 'Vector<Router::Connection>::value_argument_type':'const Router::Connection &'
|-CXXMethodDecl 0x55adbc598408 <line:190:5, col:38> col:21 erase 'Vector<Router::Connection>::iterator (Vector<Router::Connection>::iterator)' inline
| `-ParmVarDecl 0x55adbc598318 <col:27, col:36> col:36 it 'Vector<Router::Connection>::iterator':'Router::Connection *'
|-CXXMethodDecl 0x55adbc598658 <line:191:5, col:49> col:21 erase 'Vector<Router::Connection>::iterator (Vector<Router::Connection>::iterator, Vector<Router::Connection>::iterator)' inline
| |-ParmVarDecl 0x55adbc5984d0 <col:27, col:36> col:36 a 'Vector<Router::Connection>::iterator':'Router::Connection *'
| `-ParmVarDecl 0x55adbc598548 <col:39, col:48> col:48 b 'Vector<Router::Connection>::iterator':'Router::Connection *'
|-CXXMethodDecl 0x55adbc598718 <line:193:5, col:23> col:17 clear 'void ()' inline
|-CXXMethodDecl 0x55adbc598978 <line:195:5, col:34> col:17 swap 'void (Vector<Router::Connection> &)' inline
| `-ParmVarDecl 0x55adbc598880 <col:22, col:33> col:33 x 'Vector<Router::Connection> &'
`-CXXDestructorDecl 0x55adbc598a48 <../dummy_inc/click/ipaddress.hh:13:29> col:29 implicit ~Vector 'void ()' inline default noexcept-unevaluated 0x55adbc598a48

Layout: <CGRecordLayout
  LLVMType:%class.Vector.8 = type { %class.vector_memory.9 }
  NonVirtualBaseLLVMType:%class.Vector.8 = type { %class.vector_memory.9 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | union Handler::(anonymous at ../dummy_inc/click/handler.hh:290:5)
         0 |   HandlerCallback h
         0 |   ReadHandlerCallback r
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union Handler::(anonymous at ../dummy_inc/click/handler.hh:294:5)
         0 |   HandlerCallback h
         0 |   WriteHandlerCallback w
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class Handler
         0 |   class String _name
         0 |     struct String::rep_t _r
         0 |       const char * data
         8 |       int length
        16 |       struct String::memo_t * memo
        24 |   union Handler::(anonymous at ../dummy_inc/click/handler.hh:290:5) _read_hook
        24 |     HandlerCallback h
        24 |     ReadHandlerCallback r
        32 |   union Handler::(anonymous at ../dummy_inc/click/handler.hh:294:5) _write_hook
        32 |     HandlerCallback h
        32 |     WriteHandlerCallback w
        40 |   void * _read_user_data
        48 |   void * _write_user_data
        56 |   uint32_t _flags
        60 |   int _use_count
        64 |   int _next_by_name
           | [sizeof=72, dsize=68, align=8,
           |  nvsize=68, nvalign=8]

*** Dumping AST Record Layout
         0 | class ErrorHandler
         0 |   (ErrorHandler vtable pointer)
         8 |   int _nerrors
           | [sizeof=16, dsize=12, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x55adbc4c6d88 prev 0x55adbc446988 <../dummy_inc/click/error.hh:90:1, line:592:1> line:90:7 referenced class ErrorHandler definition
|-DefinitionData polymorphic has_user_declared_ctor can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor simple non_trivial has_const_param implicit_has_const_param
| |-MoveConstructor
| |-CopyAssignment non_trivial has_const_param implicit_has_const_param
| |-MoveAssignment
| `-Destructor non_trivial user_declared
|-CXXRecordDecl 0x55adbc4c6e80 <col:1, col:7> col:7 implicit referenced class ErrorHandler
|-AccessSpecDecl 0x55adbc4c6f10 <col:22, col:28> col:22 public
|-EnumDecl 0x55adbc4c6f38 <line:98:5, line:111:5> line:98:10 Level
| |-EnumConstantDecl 0x55adbc4c7058 <line:99:2, col:14> col:2 el_abort 'ErrorHandler::Level'
| | `-ConstantExpr 0x55adbc4c7038 <col:13, col:14> 'int' Int: -999
| |   `-UnaryOperator 0x55adbc4c7020 <col:13, col:14> 'int' prefix '-'
| |     `-IntegerLiteral 0x55adbc4c7000 <col:14> 'int' 999
| |-EnumConstantDecl 0x55adbc4c7100 <line:100:2, col:14> col:2 el_fatal 'ErrorHandler::Level'
| | `-ConstantExpr 0x55adbc4c70e0 <col:13, col:14> 'int' Int: -1
| |   `-UnaryOperator 0x55adbc4c70c8 <col:13, col:14> 'int' prefix '-'
| |     `-IntegerLiteral 0x55adbc4c70a8 <col:14> 'int' 1
| |-EnumConstantDecl 0x55adbc4c71d0 <line:102:2, col:17> col:2 el_emergency 'ErrorHandler::Level'
| | `-ConstantExpr 0x55adbc4c7170 <col:17> 'int' Int: 0
| |   `-IntegerLiteral 0x55adbc4c7150 <col:17> 'int' 0
| |-EnumConstantDecl 0x55adbc4c7260 <line:103:2, col:13> col:2 el_alert 'ErrorHandler::Level'
| | `-ConstantExpr 0x55adbc4c7240 <col:13> 'int' Int: 1
| |   `-IntegerLiteral 0x55adbc4c7220 <col:13> 'int' 1
| |-EnumConstantDecl 0x55adbc4c72f0 <line:104:2, col:16> col:2 el_critical 'ErrorHandler::Level'
| | `-ConstantExpr 0x55adbc4c72d0 <col:16> 'int' Int: 2
| |   `-IntegerLiteral 0x55adbc4c72b0 <col:16> 'int' 2
| |-EnumConstantDecl 0x55adbc4c7380 <line:105:2, col:13> col:2 referenced el_error 'ErrorHandler::Level'
| | `-ConstantExpr 0x55adbc4c7360 <col:13> 'int' Int: 3
| |   `-IntegerLiteral 0x55adbc4c7340 <col:13> 'int' 3
| |-EnumConstantDecl 0x55adbc4c7410 <line:106:2, col:15> col:2 el_warning 'ErrorHandler::Level'
| | `-ConstantExpr 0x55adbc4c73f0 <col:15> 'int' Int: 4
| |   `-IntegerLiteral 0x55adbc4c73d0 <col:15> 'int' 4
| |-EnumConstantDecl 0x55adbc4c74a0 <line:107:2, col:14> col:2 el_notice 'ErrorHandler::Level'
| | `-ConstantExpr 0x55adbc4c7480 <col:14> 'int' Int: 5
| |   `-IntegerLiteral 0x55adbc4c7460 <col:14> 'int' 5
| |-EnumConstantDecl 0x55adbc4c7530 <line:109:2, col:12> col:2 el_info 'ErrorHandler::Level'
| | `-ConstantExpr 0x55adbc4c7510 <col:12> 'int' Int: 6
| |   `-IntegerLiteral 0x55adbc4c74f0 <col:12> 'int' 6
| `-EnumConstantDecl 0x55adbc4c75c0 <line:110:2, col:13> col:2 el_debug 'ErrorHandler::Level'
|   `-ConstantExpr 0x55adbc4c75a0 <col:13> 'int' Int: 7
|     `-IntegerLiteral 0x55adbc4c7580 <col:13> 'int' 7
|-VarDecl 0x55adbc4c7630 <line:114:5, col:31> col:23 e_abort 'const char []' static
|-VarDecl 0x55adbc4c76b8 <col:5, line:115:10> col:2 e_fatal 'const char []' static
|-VarDecl 0x55adbc4c7740 <line:114:5, line:116:14> col:2 e_emergency 'const char []' static
|-VarDecl 0x55adbc4c77c8 <line:114:5, line:117:10> col:2 e_alert 'const char []' static
|-VarDecl 0x55adbc4c7850 <line:114:5, line:118:13> col:2 e_critical 'const char []' static
|-VarDecl 0x55adbc4c78d8 <line:114:5, line:119:10> col:2 e_error 'const char []' static
|-VarDecl 0x55adbc4c7960 <line:114:5, line:120:12> col:2 e_warning 'const char []' static
|-VarDecl 0x55adbc4c79e8 <line:114:5, line:121:22> col:2 e_warning_annotated 'const char []' static
|-VarDecl 0x55adbc4c7a70 <line:114:5, line:122:11> col:2 e_notice 'const char []' static
|-VarDecl 0x55adbc4c7af8 <line:114:5, line:123:9> col:2 e_info 'const char []' static
|-VarDecl 0x55adbc4c7b80 <line:114:5, line:124:10> col:2 e_debug 'const char []' static
|-CXXConstructorDecl 0x55adbc4c7c80 <line:127:5, line:129:5> line:127:5 used ErrorHandler 'void ()'
| |-CXXCtorInitializer Field 0x55adbc4ccf68 '_nerrors' 'int'
| | `-IntegerLiteral 0x55adbc4cd6f8 <line:128:13> 'int' 0
| `-CompoundStmt 0x55adbc4cd768 <col:16, line:129:5>
|-CXXDestructorDecl 0x55adbc4c7d70 <line:131:5, line:132:5> line:131:13 used ~ErrorHandler 'void () noexcept' virtual
| `-CompoundStmt 0x55adbc4cd778 <col:29, line:132:5>
|-CXXMethodDecl 0x55adbc4c7f28 <line:148:5, col:62> col:26 static_initialize 'ErrorHandler *(ErrorHandler *)' static
| `-ParmVarDecl 0x55adbc4c7e60 <col:44, col:58> col:58 errh 'ErrorHandler *'
|-CXXMethodDecl 0x55adbc4c7ff0 <line:154:5, col:32> col:17 static_cleanup 'void ()' static
|-CXXMethodDecl 0x55adbc4c80d8 <line:159:5, line:161:5> line:159:26 default_handler 'ErrorHandler *()' static
| `-CompoundStmt 0x55adbc4cd7d0 <col:44, line:161:5>
|   `-ReturnStmt 0x55adbc4cd7c0 <line:160:2, col:9>
|     `-ImplicitCastExpr 0x55adbc4cd7a8 <col:9> 'ErrorHandler *' <LValueToRValue>
|       `-DeclRefExpr 0x55adbc4cd788 <col:9> 'ErrorHandler *' lvalue Var 0x55adbc4ccfc8 'the_default_handler' 'ErrorHandler *'
|-CXXMethodDecl 0x55adbc4c8218 <line:168:5, col:55> col:17 set_default_handler 'void (ErrorHandler *)' static
| `-ParmVarDecl 0x55adbc4c8188 <col:37, col:51> col:51 errh 'ErrorHandler *'
|-CXXMethodDecl 0x55adbc4c82e0 <line:171:5, line:173:5> line:171:26 silent_handler 'ErrorHandler *()' static
| `-CompoundStmt 0x55adbc4cd830 <col:43, line:173:5>
|   `-ReturnStmt 0x55adbc4cd820 <line:172:2, col:9>
|     `-ImplicitCastExpr 0x55adbc4cd808 <col:9> 'ErrorHandler *' <LValueToRValue>
|       `-DeclRefExpr 0x55adbc4cd7e8 <col:9> 'ErrorHandler *' lvalue Var 0x55adbc4cd040 'the_silent_handler' 'ErrorHandler *'
|-VarDecl 0x55adbc4c8398 <line:176:5, col:22> col:22 ok_result 'const int' static
|-VarDecl 0x55adbc4c8418 <line:178:5, col:22> col:22 error_result 'const int' static
|-CXXMethodDecl 0x55adbc4c8528 <line:186:5, col:36> col:10 debug 'void (const char *, ...)'
| `-ParmVarDecl 0x55adbc4c8498 <col:16, col:28> col:28 fmt 'const char *'
|-CXXMethodDecl 0x55adbc4c8678 <line:188:5, col:38> col:10 message 'void (const char *, ...)'
| `-ParmVarDecl 0x55adbc4c85e8 <col:18, col:30> col:30 fmt 'const char *'
|-CXXMethodDecl 0x55adbc4c87d0 <line:193:5, col:37> col:9 warning 'int (const char *, ...)'
| `-ParmVarDecl 0x55adbc4c8738 <col:17, col:29> col:29 fmt 'const char *'
|-CXXMethodDecl 0x55adbc4c8928 <line:196:5, col:35> col:9 error 'int (const char *, ...)'
| `-ParmVarDecl 0x55adbc4c8890 <col:15, col:27> col:27 fmt 'const char *'
|-CXXMethodDecl 0x55adbc4c8a80 <line:201:5, col:35> col:9 fatal 'int (const char *, ...)'
| `-ParmVarDecl 0x55adbc4c89e8 <col:15, col:27> col:27 fmt 'const char *'
|-CXXMethodDecl 0x55adbc4c8c90 <line:204:5, col:61> col:10 ldebug 'void (const String &, const char *, ...)'
| |-ParmVarDecl 0x55adbc4c8b38 <col:17, col:31> col:31 landmark 'const String &'
| `-ParmVarDecl 0x55adbc4c8bb8 <col:41, col:53> col:53 fmt 'const char *'
|-CXXMethodDecl 0x55adbc4c8e68 <line:206:5, col:63> col:10 lmessage 'void (const String &, const char *, ...)'
| |-ParmVarDecl 0x55adbc4c8d50 <col:19, col:33> col:33 landmark 'const String &'
| `-ParmVarDecl 0x55adbc4c8dd0 <col:43, col:55> col:55 fmt 'const char *'
|-CXXMethodDecl 0x55adbc4c9088 <line:208:5, col:62> col:9 lwarning 'int (const String &, const char *, ...)'
| |-ParmVarDecl 0x55adbc4c8f28 <col:18, col:32> col:32 landmark 'const String &'
| `-ParmVarDecl 0x55adbc4c8fa8 <col:42, col:54> col:54 fmt 'const char *'
|-CXXMethodDecl 0x55adbc4c9268 <line:210:5, col:60> col:9 lerror 'int (const String &, const char *, ...)'
| |-ParmVarDecl 0x55adbc4c9148 <col:16, col:30> col:30 landmark 'const String &'
| `-ParmVarDecl 0x55adbc4c91c8 <col:40, col:52> col:52 fmt 'const char *'
|-CXXMethodDecl 0x55adbc4c9448 <line:212:5, col:60> col:9 lfatal 'int (const String &, const char *, ...)'
| |-ParmVarDecl 0x55adbc4c9328 <col:16, col:30> col:30 landmark 'const String &'
| `-ParmVarDecl 0x55adbc4c93a8 <col:40, col:52> col:52 fmt 'const char *'
|-CXXMethodDecl 0x55adbc4c95d0 <line:226:5, col:35> col:9 used xmessage 'int (const String &)'
| `-ParmVarDecl 0x55adbc4c9508 <col:18, col:32> col:32 str 'const String &'
|-CXXMethodDecl 0x55adbc4c97a0 <line:232:5, line:234:5> line:232:9 used xmessage 'int (const String &, const String &)'
| |-ParmVarDecl 0x55adbc4c9688 <col:18, col:32> col:32 used anno 'const String &'
| |-ParmVarDecl 0x55adbc4c9700 <col:38, col:52> col:52 used str 'const String &'
| `-CompoundStmt 0x55adbc4cda88 <col:57, line:234:5>
|   `-ReturnStmt 0x55adbc4cda78 <line:233:2, col:41>
|     `-ExprWithCleanups 0x55adbc4cda60 <col:9, col:41> 'int'
|       `-CXXMemberCallExpr 0x55adbc4cda08 <col:9, col:41> 'int'
|         |-MemberExpr 0x55adbc4cd9d8 <col:9> '<bound member function type>' ->xmessage 0x55adbc4c95d0
|         | `-CXXThisExpr 0x55adbc4cd9c8 <col:9> 'ErrorHandler *' implicit this
|         `-MaterializeTemporaryExpr 0x55adbc4cda48 <col:18, col:40> 'const String' lvalue
|           `-ImplicitCastExpr 0x55adbc4cda30 <col:18, col:40> 'const String' <NoOp>
|             `-CXXBindTemporaryExpr 0x55adbc4cd9a8 <col:18, col:40> 'String' (CXXTemporary 0x55adbc4cd9a8)
|               `-CallExpr 0x55adbc4cd970 <col:18, col:40> 'String'
|                 |-ImplicitCastExpr 0x55adbc4cd958 <col:18> 'String (*)(const String &, const String &)' <FunctionToPointerDecay>
|                 | `-DeclRefExpr 0x55adbc4cd8d0 <col:18> 'String (const String &, const String &)' lvalue CXXMethod 0x55adbc4cb798 'combine_anno' 'String (const String &, const String &)'
|                 |-DeclRefExpr 0x55adbc4cd8f0 <col:31> 'const String' lvalue ParmVar 0x55adbc4c9700 'str' 'const String &'
|                 `-DeclRefExpr 0x55adbc4cd910 <col:36> 'const String' lvalue ParmVar 0x55adbc4c9688 'anno' 'const String &'
|-CXXMethodDecl 0x55adbc4c9a80 <line:241:5, line:243:5> line:241:9 xmessage 'int (const String &, const char *, __va_list_tag *)'
| |-ParmVarDecl 0x55adbc4c9860 <col:18, col:32> col:32 used anno 'const String &'
| |-ParmVarDecl 0x55adbc4c98e0 <col:38, col:50> col:50 used fmt 'const char *'
| |-ParmVarDecl 0x55adbc4c9958 <col:55, col:63> col:63 used val '__va_list_tag *':'__va_list_tag *'
| `-CompoundStmt 0x55adbc4cdd18 <col:68, line:243:5>
|   `-ReturnStmt 0x55adbc4cdd08 <line:242:2, col:41>
|     `-ExprWithCleanups 0x55adbc4cdcf0 <col:9, col:41> 'int'
|       `-CXXMemberCallExpr 0x55adbc4cdc90 <col:9, col:41> 'int'
|         |-MemberExpr 0x55adbc4cdc60 <col:9> '<bound member function type>' ->xmessage 0x55adbc4c97a0
|         | `-CXXThisExpr 0x55adbc4cdc50 <col:9> 'ErrorHandler *' implicit this
|         |-DeclRefExpr 0x55adbc4cdb28 <col:18> 'const String' lvalue ParmVar 0x55adbc4c9860 'anno' 'const String &'
|         `-MaterializeTemporaryExpr 0x55adbc4cdcd8 <col:24, col:40> 'const String' lvalue
|           `-ImplicitCastExpr 0x55adbc4cdcc0 <col:24, col:40> 'const String' <NoOp>
|             `-CXXBindTemporaryExpr 0x55adbc4cdc30 <col:24, col:40> 'String' (CXXTemporary 0x55adbc4cdc30)
|               `-CXXMemberCallExpr 0x55adbc4cdbc8 <col:24, col:40> 'String'
|                 |-MemberExpr 0x55adbc4cdb58 <col:24> '<bound member function type>' ->vformat 0x55adbc4cac60
|                 | `-CXXThisExpr 0x55adbc4cdb48 <col:24> 'ErrorHandler *' implicit this
|                 |-ImplicitCastExpr 0x55adbc4cdbf8 <col:32> 'const char *' <LValueToRValue>
|                 | `-DeclRefExpr 0x55adbc4cdb88 <col:32> 'const char *' lvalue ParmVar 0x55adbc4c98e0 'fmt' 'const char *'
|                 `-ImplicitCastExpr 0x55adbc4cdc10 <col:37> '__va_list_tag *':'__va_list_tag *' <LValueToRValue>
|                   `-DeclRefExpr 0x55adbc4cdba8 <col:37> '__va_list_tag *':'__va_list_tag *' lvalue ParmVar 0x55adbc4c9958 'val' '__va_list_tag *':'__va_list_tag *'
|-CXXMethodDecl 0x55adbc4c9d20 <line:251:5, line:254:5> line:251:9 used xmessage 'int (const String &, const String &, const String &)'
| |-ParmVarDecl 0x55adbc4c9b48 <col:18, col:32> col:32 used landmark 'const String &'
| |-ParmVarDecl 0x55adbc4c9bc0 <col:42, col:56> col:56 used anno 'const String &'
| |-ParmVarDecl 0x55adbc4c9c38 <line:252:4, col:18> col:18 used str 'const String &'
| `-CompoundStmt 0x55adbc4ce058 <col:23, line:254:5>
|   `-ReturnStmt 0x55adbc4ce048 <line:253:2, col:71>
|     `-ExprWithCleanups 0x55adbc4ce030 <col:9, col:71> 'int'
|       `-CXXMemberCallExpr 0x55adbc4cdfd0 <col:9, col:71> 'int'
|         |-MemberExpr 0x55adbc4cdfa0 <col:9> '<bound member function type>' ->xmessage 0x55adbc4c97a0
|         | `-CXXThisExpr 0x55adbc4cdf90 <col:9> 'ErrorHandler *' implicit this
|         |-MaterializeTemporaryExpr 0x55adbc4ce018 <col:18, col:65> 'const String' lvalue
|         | `-ImplicitCastExpr 0x55adbc4ce000 <col:18, col:65> 'const String' <NoOp>
|         |   `-CXXBindTemporaryExpr 0x55adbc4cdf50 <col:18, col:65> 'String' (CXXTemporary 0x55adbc4cdf50)
|         |     `-CallExpr 0x55adbc4cdee8 <col:18, col:65> 'String'
|         |       |-ImplicitCastExpr 0x55adbc4cded0 <col:18> 'String (*)(const String &, const String &)' <FunctionToPointerDecay>
|         |       | `-DeclRefExpr 0x55adbc4cddb8 <col:18> 'String (const String &, const String &)' lvalue CXXMethod 0x55adbc4cb798 'combine_anno' 'String (const String &, const String &)'
|         |       |-DeclRefExpr 0x55adbc4cddd8 <col:31> 'const String' lvalue ParmVar 0x55adbc4c9bc0 'anno' 'const String &'
|         |       `-MaterializeTemporaryExpr 0x55adbc4cdf30 <col:37, col:64> 'const String' lvalue
|         |         `-ImplicitCastExpr 0x55adbc4cdf18 <col:37, col:64> 'const String' <NoOp>
|         |           `-CXXBindTemporaryExpr 0x55adbc4cdeb0 <col:37, col:64> 'String' (CXXTemporary 0x55adbc4cdeb0)
|         |             `-CallExpr 0x55adbc4cde80 <col:37, col:64> 'String'
|         |               |-ImplicitCastExpr 0x55adbc4cde68 <col:37> 'String (*)(const String &)' <FunctionToPointerDecay>
|         |               | `-DeclRefExpr 0x55adbc4cddf8 <col:37> 'String (const String &)' lvalue CXXMethod 0x55adbc4cbde8 'make_landmark_anno' 'String (const String &)'
|         |               `-DeclRefExpr 0x55adbc4cde18 <col:56> 'const String' lvalue ParmVar 0x55adbc4c9b48 'landmark' 'const String &'
|         `-DeclRefExpr 0x55adbc4cdf70 <col:68> 'const String' lvalue ParmVar 0x55adbc4c9c38 'str' 'const String &'
|-CXXMethodDecl 0x55adbc4ca0a0 <line:264:5, line:267:5> line:264:9 xmessage 'int (const String &, const String &, const char *, __va_list_tag *)'
| |-ParmVarDecl 0x55adbc4c9de8 <col:18, col:32> col:32 used landmark 'const String &'
| |-ParmVarDecl 0x55adbc4c9e60 <col:42, col:56> col:56 used anno 'const String &'
| |-ParmVarDecl 0x55adbc4c9ee0 <line:265:4, col:16> col:16 used fmt 'const char *'
| |-ParmVarDecl 0x55adbc4c9f58 <col:21, col:29> col:29 used val '__va_list_tag *':'__va_list_tag *'
| `-CompoundStmt 0x55adbc4ce310 <col:34, line:267:5>
|   `-ReturnStmt 0x55adbc4ce300 <line:266:2, col:51>
|     `-ExprWithCleanups 0x55adbc4ce2e8 <col:9, col:51> 'int'
|       `-CXXMemberCallExpr 0x55adbc4ce280 <col:9, col:51> 'int'
|         |-MemberExpr 0x55adbc4ce250 <col:9> '<bound member function type>' ->xmessage 0x55adbc4c9d20
|         | `-CXXThisExpr 0x55adbc4ce240 <col:9> 'ErrorHandler *' implicit this
|         |-DeclRefExpr 0x55adbc4ce0f8 <col:18> 'const String' lvalue ParmVar 0x55adbc4c9de8 'landmark' 'const String &'
|         |-DeclRefExpr 0x55adbc4ce118 <col:28> 'const String' lvalue ParmVar 0x55adbc4c9e60 'anno' 'const String &'
|         `-MaterializeTemporaryExpr 0x55adbc4ce2d0 <col:34, col:50> 'const String' lvalue
|           `-ImplicitCastExpr 0x55adbc4ce2b8 <col:34, col:50> 'const String' <NoOp>
|             `-CXXBindTemporaryExpr 0x55adbc4ce220 <col:34, col:50> 'String' (CXXTemporary 0x55adbc4ce220)
|               `-CXXMemberCallExpr 0x55adbc4ce1b8 <col:34, col:50> 'String'
|                 |-MemberExpr 0x55adbc4ce148 <col:34> '<bound member function type>' ->vformat 0x55adbc4cac60
|                 | `-CXXThisExpr 0x55adbc4ce138 <col:34> 'ErrorHandler *' implicit this
|                 |-ImplicitCastExpr 0x55adbc4ce1e8 <col:42> 'const char *' <LValueToRValue>
|                 | `-DeclRefExpr 0x55adbc4ce178 <col:42> 'const char *' lvalue ParmVar 0x55adbc4c9ee0 'fmt' 'const char *'
|                 `-ImplicitCastExpr 0x55adbc4ce200 <col:47> '__va_list_tag *':'__va_list_tag *' <LValueToRValue>
|                   `-DeclRefExpr 0x55adbc4ce198 <col:47> '__va_list_tag *':'__va_list_tag *' lvalue ParmVar 0x55adbc4c9f58 'val' '__va_list_tag *':'__va_list_tag *'
|-CXXMethodDecl 0x55adbc4ca1b0 <line:286:5, line:288:5> line:286:9 nerrors 'int () const'
| `-CompoundStmt 0x55adbc4ce390 <col:25, line:288:5>
|   `-ReturnStmt 0x55adbc4ce380 <line:287:2, col:9>
|     `-ImplicitCastExpr 0x55adbc4ce368 <col:9> 'int' <LValueToRValue>
|       `-MemberExpr 0x55adbc4ce338 <col:9> 'const int' lvalue ->_nerrors 0x55adbc4ccf68
|         `-CXXThisExpr 0x55adbc4ce328 <col:9> 'const ErrorHandler *' implicit this
|-CXXMethodDecl 0x55adbc4ca3c0 <line:349:5, col:66> col:19 xformat 'String (int, const char *, ...)' static
| |-ParmVarDecl 0x55adbc4ca268 <col:27, col:31> col:31 default_flags 'int'
| `-ParmVarDecl 0x55adbc4ca2e8 <col:46, col:58> col:58 fmt 'const char *'
|-CXXMethodDecl 0x55adbc4ca6a8 <line:351:5, col:75> col:19 used vxformat 'String (int, const char *, __va_list_tag *)' static
| |-ParmVarDecl 0x55adbc4ca488 <col:28, col:32> col:32 default_flags 'int'
| |-ParmVarDecl 0x55adbc4ca508 <col:47, col:59> col:59 fmt 'const char *'
| `-ParmVarDecl 0x55adbc4ca580 <col:64, col:72> col:72 val '__va_list_tag *':'__va_list_tag *'
|-CXXMethodDecl 0x55adbc4ca840 <line:353:5, col:47> col:19 xformat 'String (const char *, ...)' static
| `-ParmVarDecl 0x55adbc4ca778 <col:27, col:39> col:39 fmt 'const char *'
|-CXXMethodDecl 0x55adbc4caa88 <line:355:5, line:357:5> line:355:19 vxformat 'String (const char *, __va_list_tag *)' static
| |-ParmVarDecl 0x55adbc4ca900 <col:28, col:40> col:40 used fmt 'const char *'
| |-ParmVarDecl 0x55adbc4ca978 <col:45, col:53> col:53 used val '__va_list_tag *':'__va_list_tag *'
| `-CompoundStmt 0x55adbc4ce5f0 <col:58, line:357:5>
|   `-ReturnStmt 0x55adbc4ce5e0 <line:356:2, col:29>
|     `-ExprWithCleanups 0x55adbc4ce5c8 <col:9, col:29> 'String'
|       `-CXXConstructExpr 0x55adbc4ce598 <col:9, col:29> 'String' 'void (String &&)' elidable
|         `-MaterializeTemporaryExpr 0x55adbc4ce580 <col:9, col:29> 'String' xvalue
|           `-CXXBindTemporaryExpr 0x55adbc4ce560 <col:9, col:29> 'String' (CXXTemporary 0x55adbc4ce560)
|             `-CallExpr 0x55adbc4ce4f0 <col:9, col:29> 'String'
|               |-ImplicitCastExpr 0x55adbc4ce4d8 <col:9> 'String (*)(int, const char *, __va_list_tag *)' <FunctionToPointerDecay>
|               | `-DeclRefExpr 0x55adbc4ce458 <col:9> 'String (int, const char *, __va_list_tag *)' lvalue CXXMethod 0x55adbc4ca6a8 'vxformat' 'String (int, const char *, __va_list_tag *)'
|               |-IntegerLiteral 0x55adbc4ce3f8 <col:18> 'int' 0
|               |-ImplicitCastExpr 0x55adbc4ce528 <col:21> 'const char *' <LValueToRValue>
|               | `-DeclRefExpr 0x55adbc4ce418 <col:21> 'const char *' lvalue ParmVar 0x55adbc4ca900 'fmt' 'const char *'
|               `-ImplicitCastExpr 0x55adbc4ce540 <col:26> '__va_list_tag *':'__va_list_tag *' <LValueToRValue>
|                 `-DeclRefExpr 0x55adbc4ce438 <col:26> '__va_list_tag *':'__va_list_tag *' lvalue ParmVar 0x55adbc4ca978 'val' '__va_list_tag *':'__va_list_tag *'
|-CXXMethodDecl 0x55adbc4cac60 <line:369:5, col:56> col:20 used vformat 'String (const char *, __va_list_tag *)' virtual
| |-ParmVarDecl 0x55adbc4cab50 <col:28, col:40> col:40 fmt 'const char *'
| `-ParmVarDecl 0x55adbc4cabc8 <col:45, col:53> col:53 val '__va_list_tag *':'__va_list_tag *'
|-CXXMethodDecl 0x55adbc4cadb8 <line:379:5, col:39> col:12 format 'String (const char *, ...)'
| `-ParmVarDecl 0x55adbc4cad28 <col:19, col:31> col:31 fmt 'const char *'
|-CXXMethodDecl 0x55adbc4caf00 <line:393:5, col:46> col:20 decorate 'String (const String &)' virtual
| `-ParmVarDecl 0x55adbc4cae70 <col:29, col:43> col:43 str 'const String &'
|-CXXMethodDecl 0x55adbc4cb1a0 <line:424:5, col:69> col:19 emit 'void *(const String &, void *, bool)' virtual
| |-ParmVarDecl 0x55adbc4cafb8 <col:24, col:38> col:38 str 'const String &'
| |-ParmVarDecl 0x55adbc4cb038 <col:43, col:49> col:49 user_data 'void *'
| `-ParmVarDecl 0x55adbc4cb0b0 <col:60, col:65> col:65 more 'bool'
|-CXXMethodDecl 0x55adbc4cb300 <line:438:5, line:441:5> line:438:18 account 'void (int)' virtual
| |-ParmVarDecl 0x55adbc4cb270 <col:26, col:30> col:30 used level 'int'
| `-CompoundStmt 0x55adbc4ce708 <col:37, line:441:5>
|   `-IfStmt 0x55adbc4ce6f0 <line:439:2, line:440:8>
|     |-BinaryOperator 0x55adbc4ce678 <line:439:6, col:15> 'bool' '<='
|     | |-ImplicitCastExpr 0x55adbc4ce648 <col:6> 'int' <LValueToRValue>
|     | | `-DeclRefExpr 0x55adbc4ce608 <col:6> 'int' lvalue ParmVar 0x55adbc4cb270 'level' 'int'
|     | `-ImplicitCastExpr 0x55adbc4ce660 <col:15> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x55adbc4ce628 <col:15> 'ErrorHandler::Level' EnumConstant 0x55adbc4c7380 'el_error' 'ErrorHandler::Level'
|     `-UnaryOperator 0x55adbc4ce6d8 <line:440:6, col:8> 'int' lvalue prefix '++'
|       `-MemberExpr 0x55adbc4ce6a8 <col:8> 'int' lvalue ->_nerrors 0x55adbc4ccf68
|         `-CXXThisExpr 0x55adbc4ce698 <col:8> 'ErrorHandler *' implicit this
|-CXXMethodDecl 0x55adbc4cb3c8 <line:446:5, line:448:5> line:446:18 clear 'void ()' virtual
| `-CompoundStmt 0x55adbc4ce7a0 <col:26, line:448:5>
|   `-BinaryOperator 0x55adbc4ce780 <line:447:2, col:13> 'int' lvalue '='
|     |-MemberExpr 0x55adbc4ce730 <col:2> 'int' lvalue ->_nerrors 0x55adbc4ccf68
|     | `-CXXThisExpr 0x55adbc4ce720 <col:2> 'ErrorHandler *' implicit this
|     `-IntegerLiteral 0x55adbc4ce760 <col:13> 'int' 0
|-CXXMethodDecl 0x55adbc4cb590 <line:466:5, col:66> col:19 used make_anno 'String (const char *, const String &)' static
| |-ParmVarDecl 0x55adbc4cb480 <col:29, col:41> col:41 name 'const char *'
| `-ParmVarDecl 0x55adbc4cb4f8 <col:47, col:61> col:61 value 'const String &'
|-CXXMethodDecl 0x55adbc4cb798 <line:482:5, col:69> col:19 used combine_anno 'String (const String &, const String &)' static
| |-ParmVarDecl 0x55adbc4cb650 <col:32, col:46> col:46 str 'const String &'
| `-ParmVarDecl 0x55adbc4cb6c8 <col:51, col:65> col:65 anno 'const String &'
|-CXXMethodDecl 0x55adbc4cba48 <line:516:5, line:517:68> line:516:24 parse_anno 'const char *(const String &, const char *, const char *, ...)' static
| |-ParmVarDecl 0x55adbc4cb858 <col:35, col:49> col:49 str 'const String &'
| |-ParmVarDecl 0x55adbc4cb8d8 <line:517:3, col:15> col:15 begin 'const char *'
| |-ParmVarDecl 0x55adbc4cb958 <col:22, col:34> col:34 end 'const char *'
| `-SentinelAttr 0x55adbc4cbb00 <col:59> 0 0
|-CXXMethodDecl 0x55adbc4cbc98 <line:527:5, line:534:5> line:527:24 skip_anno 'const char *(const char *, const char *)' static
| |-ParmVarDecl 0x55adbc4cbb78 <col:34, col:46> col:46 used begin 'const char *'
| |-ParmVarDecl 0x55adbc4cbbf8 <col:53, col:65> col:65 used end 'const char *'
| `-CompoundStmt 0x55adbc4cee10 <col:70, line:534:5>
|   |-DeclStmt 0x55adbc4ce910 <line:528:2, col:20>
|   | |-VarDecl 0x55adbc4ce7c8 <col:2, col:9> col:9 used name 'String' callinit destroyed
|   | | `-CXXConstructExpr 0x55adbc4ce830 <col:9> 'String' 'void ()'
|   | `-VarDecl 0x55adbc4ce868 <col:2, col:15> col:15 used value 'String' callinit destroyed
|   |   `-CXXConstructExpr 0x55adbc4ce8d0 <col:15> 'String' 'void ()'
|   |-DeclStmt 0x55adbc4ce9e0 <line:529:2, col:23>
|   | `-VarDecl 0x55adbc4ce940 <col:2, col:18> col:14 used x 'const char *' cinit
|   |   `-ImplicitCastExpr 0x55adbc4ce9c8 <col:18> 'const char *' <LValueToRValue>
|   |     `-DeclRefExpr 0x55adbc4ce9a8 <col:18> 'const char *' lvalue ParmVar 0x55adbc4cbb78 'begin' 'const char *'
|   |-DoStmt 0x55adbc4ceda8 <line:530:2, line:532:15>
|   | |-CompoundStmt 0x55adbc4cecd8 <line:530:5, line:532:2>
|   | | `-ExprWithCleanups 0x55adbc4cecc0 <line:531:6, col:58> 'const char *' lvalue
|   | |   `-BinaryOperator 0x55adbc4ceca0 <col:6, col:58> 'const char *' lvalue '='
|   | |     |-DeclRefExpr 0x55adbc4ce9f8 <col:6> 'const char *' lvalue Var 0x55adbc4ce940 'x' 'const char *'
|   | |     `-CallExpr 0x55adbc4cebf0 <col:10, col:58> 'const char *'
|   | |       |-ImplicitCastExpr 0x55adbc4cebd8 <col:10> 'const char *(*)(const String &, const char *, const char *, String *, String *, bool)' <FunctionToPointerDecay>
|   | |       | `-DeclRefExpr 0x55adbc4ceb90 <col:10> 'const char *(const String &, const char *, const char *, String *, String *, bool)' lvalue CXXMethod 0x55adbc4cd440 'skip_anno' 'const char *(const String &, const char *, const char *, String *, String *, bool)'
|   | |       |-MaterializeTemporaryExpr 0x55adbc4cec58 <col:20, col:27> 'const String' lvalue
|   | |       | `-ImplicitCastExpr 0x55adbc4cec40 <col:20, col:27> 'const String' <NoOp>
|   | |       |   `-CXXBindTemporaryExpr 0x55adbc4ceab0 <col:20, col:27> 'String' (CXXTemporary 0x55adbc4ceab0)
|   | |       |     `-CXXTemporaryObjectExpr 0x55adbc4cea78 <col:20, col:27> 'String' 'void ()'
|   | |       |-ImplicitCastExpr 0x55adbc4cec70 <col:30> 'const char *' <LValueToRValue>
|   | |       | `-DeclRefExpr 0x55adbc4cead0 <col:30> 'const char *' lvalue Var 0x55adbc4ce940 'x' 'const char *'
|   | |       |-ImplicitCastExpr 0x55adbc4cec88 <col:33> 'const char *' <LValueToRValue>
|   | |       | `-DeclRefExpr 0x55adbc4ceaf0 <col:33> 'const char *' lvalue ParmVar 0x55adbc4cbbf8 'end' 'const char *'
|   | |       |-UnaryOperator 0x55adbc4ceb30 <col:38, col:39> 'String *' prefix '&' cannot overflow
|   | |       | `-DeclRefExpr 0x55adbc4ceb10 <col:39> 'String' lvalue Var 0x55adbc4ce7c8 'name' 'String'
|   | |       |-UnaryOperator 0x55adbc4ceb68 <col:45, col:46> 'String *' prefix '&' cannot overflow
|   | |       | `-DeclRefExpr 0x55adbc4ceb48 <col:46> 'String' lvalue Var 0x55adbc4ce868 'value' 'String'
|   | |       `-CXXBoolLiteralExpr 0x55adbc4ceb80 <col:53> 'bool' false
|   | `-ImplicitCastExpr 0x55adbc4ced90 <line:532:11> 'bool' <MemberPointerToBoolean>
|   |   `-ImplicitCastExpr 0x55adbc4ced78 <col:11> 'String::unspecified_bool_type':'int (String::*)() const' <UserDefinedConversion>
|   |     `-CXXMemberCallExpr 0x55adbc4ced58 <col:11> 'String::unspecified_bool_type':'int (String::*)() const'
|   |       `-MemberExpr 0x55adbc4ced28 <col:11> '<bound member function type>' .operator int (String::*)() const 0x55adbc022df8
|   |         `-ImplicitCastExpr 0x55adbc4ced10 <col:11> 'const String' lvalue <NoOp>
|   |           `-DeclRefExpr 0x55adbc4cecf0 <col:11> 'String' lvalue Var 0x55adbc4ce7c8 'name' 'String'
|   `-ReturnStmt 0x55adbc4cee00 <line:533:2, col:9>
|     `-ImplicitCastExpr 0x55adbc4cede8 <col:9> 'const char *' <LValueToRValue>
|       `-DeclRefExpr 0x55adbc4cedc8 <col:9> 'const char *' lvalue Var 0x55adbc4ce940 'x' 'const char *'
|-CXXMethodDecl 0x55adbc4cbde8 <line:543:5, line:550:5> line:543:19 used make_landmark_anno 'String (const String &)' static
| |-ParmVarDecl 0x55adbc4cbd58 <col:38, col:52> col:52 used x 'const String &'
| `-CompoundStmt 0x55adbc4d0938 <col:55, line:550:5>
|   `-IfStmt 0x55adbc4d0910 <line:544:2, line:549:20> has_else
|     |-BinaryOperator 0x55adbc4cf050 <line:544:6, col:19> 'bool' '&&'
|     | |-ImplicitCastExpr 0x55adbc4cf038 <col:6> 'bool' <MemberPointerToBoolean>
|     | | `-ImplicitCastExpr 0x55adbc4cf020 <col:6> 'String::unspecified_bool_type':'int (String::*)() const' <UserDefinedConversion>
|     | |   `-CXXMemberCallExpr 0x55adbc4cf000 <col:6> 'String::unspecified_bool_type':'int (String::*)() const'
|     | |     `-MemberExpr 0x55adbc4cefd0 <col:6> '<bound member function type>' .operator int (String::*)() const 0x55adbc022df8
|     | |       `-DeclRefExpr 0x55adbc4cee70 <col:6> 'const String' lvalue ParmVar 0x55adbc4cbd58 'x' 'const String &'
|     | `-BinaryOperator 0x55adbc4cefb0 <col:11, col:19> 'bool' '=='
|     |   |-ImplicitCastExpr 0x55adbc4cef80 <col:11, col:14> 'int' <IntegralCast>
|     |   | `-CXXOperatorCallExpr 0x55adbc4cef30 <col:11, col:14> 'char'
|     |   |   |-ImplicitCastExpr 0x55adbc4cef18 <col:12, col:14> 'char (*)(int) const' <FunctionToPointerDecay>
|     |   |   | `-DeclRefExpr 0x55adbc4ceed0 <col:12, col:14> 'char (int) const' lvalue CXXMethod 0x55adbc03a650 'operator[]' 'char (int) const'
|     |   |   |-DeclRefExpr 0x55adbc4cee90 <col:11> 'const String' lvalue ParmVar 0x55adbc4cbd58 'x' 'const String &'
|     |   |   `-IntegerLiteral 0x55adbc4ceeb0 <col:13> 'int' 0
|     |   `-ImplicitCastExpr 0x55adbc4cef98 <col:19> 'int' <IntegralCast>
|     |     `-CharacterLiteral 0x55adbc4cef68 <col:19> 'char' 123
|     |-ReturnStmt 0x55adbc4cf0c0 <line:545:6, col:13>
|     | `-CXXConstructExpr 0x55adbc4cf090 <col:13> 'String' 'void (const String &)'
|     |   `-DeclRefExpr 0x55adbc4cf070 <col:13> 'const String' lvalue ParmVar 0x55adbc4cbd58 'x' 'const String &'
|     `-IfStmt 0x55adbc4d08e8 <line:546:7, line:549:20> has_else
|       |-ImplicitCastExpr 0x55adbc4cf158 <line:546:11> 'bool' <MemberPointerToBoolean>
|       | `-ImplicitCastExpr 0x55adbc4cf140 <col:11> 'String::unspecified_bool_type':'int (String::*)() const' <UserDefinedConversion>
|       |   `-CXXMemberCallExpr 0x55adbc4cf120 <col:11> 'String::unspecified_bool_type':'int (String::*)() const'
|       |     `-MemberExpr 0x55adbc4cf0f0 <col:11> '<bound member function type>' .operator int (String::*)() const 0x55adbc022df8
|       |       `-DeclRefExpr 0x55adbc4cf0d0 <col:11> 'const String' lvalue ParmVar 0x55adbc4cbd58 'x' 'const String &'
|       |-ReturnStmt 0x55adbc4d0800 <line:547:6, col:29>
|       | `-ExprWithCleanups 0x55adbc4d07e8 <col:13, col:29> 'String'
|       |   `-CXXConstructExpr 0x55adbc4d07b8 <col:13, col:29> 'String' 'void (String &&)' elidable
|       |     `-MaterializeTemporaryExpr 0x55adbc4d07a0 <col:13, col:29> 'String' xvalue
|       |       `-CXXBindTemporaryExpr 0x55adbc4d0780 <col:13, col:29> 'String' (CXXTemporary 0x55adbc4d0780)
|       |         `-CallExpr 0x55adbc4d0730 <col:13, col:29> 'String'
|       |           |-ImplicitCastExpr 0x55adbc4d0718 <col:13> 'String (*)(const char *, const String &)' <FunctionToPointerDecay>
|       |           | `-DeclRefExpr 0x55adbc4cf170 <col:13> 'String (const char *, const String &)' lvalue CXXMethod 0x55adbc4cb590 'make_anno' 'String (const char *, const String &)'
|       |           |-ImplicitCastExpr 0x55adbc4d0760 <col:23> 'const char *' <ArrayToPointerDecay>
|       |           | `-StringLiteral 0x55adbc4cf190 <col:23> 'const char [2]' lvalue "l"
|       |           `-DeclRefExpr 0x55adbc4cf1b0 <col:28> 'const String' lvalue ParmVar 0x55adbc4cbd58 'x' 'const String &'
|       `-ReturnStmt 0x55adbc4d08d8 <line:549:6, col:20>
|         `-ExprWithCleanups 0x55adbc4d08c0 <col:13, col:20> 'String'
|           `-CXXConstructExpr 0x55adbc4d0890 <col:13, col:20> 'String' 'void (String &&)' elidable
|             `-MaterializeTemporaryExpr 0x55adbc4d0878 <col:13, col:20> 'String' xvalue
|               `-CXXBindTemporaryExpr 0x55adbc4d0858 <col:13, col:20> 'String' (CXXTemporary 0x55adbc4d0858)
|                 `-CXXTemporaryObjectExpr 0x55adbc4d0820 <col:13, col:20> 'String' 'void ()'
|-CXXMethodDecl 0x55adbc4cbfb0 <line:559:5, col:76> col:19 clean_landmark 'String (const String &, bool)' static
| |-ParmVarDecl 0x55adbc4cbea0 <col:34, col:48> col:48 landmark 'const String &'
| `-ParmVarDecl 0x55adbc4cbf18 <col:58, col:71> col:63 colon 'bool' cinit
|   `-CXXBoolLiteralExpr 0x55adbc4cd6e8 <col:71> 'bool' false
|-CXXRecordDecl 0x55adbc4cc060 <line:563:5, col:12> col:12 referenced struct Conversion
|-TypedefDecl 0x55adbc4cc358 <line:564:5, col:60> col:22 referenced ConversionFunction 'String (*)(int, __va_list_tag *)'
| `-PointerType 0x55adbc4cc2f0 'String (*)(int, __va_list_tag *)'
|   `-ParenType 0x55adbc4cc290 'String (int, __va_list_tag *)' sugar
|     `-FunctionProtoType 0x55adbc4cc250 'String (int, __va_list_tag *)' cdecl
|       |-RecordType 0x55adbc01f670 'String'
|       | `-CXXRecord 0x55adbc01f5e0 'String'
|       |-BuiltinType 0x55adbbce2370 'int'
|       `-DecayedType 0x55adbc4479d0 '__va_list_tag *' sugar
|         |-TypedefType 0x55adbc4479a0 'va_list' sugar
|         | |-Typedef 0x55adbbf09470 'va_list'
|         | `-TypedefType 0x55adbbf09420 '__gnuc_va_list' sugar
|         |   |-Typedef 0x55adbbe41038 '__gnuc_va_list'
|         |   `-TypedefType 0x55adbbe40fa0 '__builtin_va_list' sugar
|         |     |-Typedef 0x55adbbd23bd8 '__builtin_va_list'
|         |     `-ConstantArrayType 0x55adbbd23b80 '__va_list_tag [1]' 1 
|         |       `-RecordType 0x55adbbce30c0 '__va_list_tag'
|         |         `-CXXRecord 0x55adbbce3028 '__va_list_tag'
|         `-PointerType 0x55adbbf0f570 '__va_list_tag *'
|           `-RecordType 0x55adbbce30c0 '__va_list_tag'
|             `-CXXRecord 0x55adbbce3028 '__va_list_tag'
|-EnumDecl 0x55adbc4cc3b0 <line:565:5, line:576:5> line:565:10 ConversionFlags
| |-EnumConstantDecl 0x55adbc4cc4b0 <line:566:2, col:16> col:2 cf_zero_pad 'ErrorHandler::ConversionFlags'
| | `-ImplicitCastExpr 0x55adbc4cca10 <col:16> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc4cc490 <col:16> 'int' Int: 1
| |     `-IntegerLiteral 0x55adbc4cc470 <col:16> 'int' 1
| |-EnumConstantDecl 0x55adbc4cc540 <line:567:2, col:21> col:2 cf_plus_positive 'ErrorHandler::ConversionFlags'
| | `-ImplicitCastExpr 0x55adbc4cca28 <col:21> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc4cc520 <col:21> 'int' Int: 2
| |     `-IntegerLiteral 0x55adbc4cc500 <col:21> 'int' 2
| |-EnumConstantDecl 0x55adbc4cc5d0 <line:568:2, col:22> col:2 cf_space_positive 'ErrorHandler::ConversionFlags'
| | `-ImplicitCastExpr 0x55adbc4cca40 <col:22> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc4cc5b0 <col:22> 'int' Int: 4
| |     `-IntegerLiteral 0x55adbc4cc590 <col:22> 'int' 4
| |-EnumConstantDecl 0x55adbc4cc660 <line:569:2, col:17> col:2 cf_left_just 'ErrorHandler::ConversionFlags'
| | `-ImplicitCastExpr 0x55adbc4cca58 <col:17> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc4cc640 <col:17> 'int' Int: 8
| |     `-IntegerLiteral 0x55adbc4cc620 <col:17> 'int' 8
| |-EnumConstantDecl 0x55adbc4cc6f0 <line:570:2, col:22> col:2 cf_alternate_form 'ErrorHandler::ConversionFlags'
| | `-ImplicitCastExpr 0x55adbc4cca70 <col:22> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc4cc6d0 <col:22> 'int' Int: 16
| |     `-IntegerLiteral 0x55adbc4cc6b0 <col:22> 'int' 16
| |-EnumConstantDecl 0x55adbc4cc780 <line:571:2, col:19> col:2 cf_singlequote 'ErrorHandler::ConversionFlags'
| | `-ImplicitCastExpr 0x55adbc4cca88 <col:19> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc4cc760 <col:19> 'int' Int: 32
| |     `-IntegerLiteral 0x55adbc4cc740 <col:19> 'int' 32
| |-EnumConstantDecl 0x55adbc4cc810 <line:572:2, col:17> col:2 cf_uppercase 'ErrorHandler::ConversionFlags'
| | `-ImplicitCastExpr 0x55adbc4ccaa0 <col:17> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc4cc7f0 <col:17> 'int' Int: 64
| |     `-IntegerLiteral 0x55adbc4cc7d0 <col:17> 'int' 64
| |-EnumConstantDecl 0x55adbc4cc8a0 <line:573:2, col:14> col:2 cf_signed 'ErrorHandler::ConversionFlags'
| | `-ImplicitCastExpr 0x55adbc4ccab8 <col:14> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc4cc880 <col:14> 'int' Int: 128
| |     `-IntegerLiteral 0x55adbc4cc860 <col:14> 'int' 128
| |-EnumConstantDecl 0x55adbc4cc930 <line:574:2, col:16> col:2 cf_negative 'ErrorHandler::ConversionFlags'
| | `-ImplicitCastExpr 0x55adbc4ccad0 <col:16> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc4cc910 <col:16> 'int' Int: 256
| |     `-IntegerLiteral 0x55adbc4cc8f0 <col:16> 'int' 256
| `-EnumConstantDecl 0x55adbc4cc9c0 <line:575:2, col:12> col:2 cf_utf8 'ErrorHandler::ConversionFlags'
|   `-ImplicitCastExpr 0x55adbc4ccae8 <col:12> 'unsigned int' <IntegralCast>
|     `-ConstantExpr 0x55adbc4cc9a0 <col:12> 'int' Int: 1024
|       `-IntegerLiteral 0x55adbc4cc980 <col:12> 'int' 1024
|-CXXMethodDecl 0x55adbc4cccf8 <line:577:5, col:82> col:24 add_conversion 'ErrorHandler::Conversion *(const String &, ErrorHandler::ConversionFunction)' static
| |-ParmVarDecl 0x55adbc4ccb10 <col:39, col:53> col:53 name 'const String &'
| `-ParmVarDecl 0x55adbc4ccbb0 <col:59, col:78> col:78 func 'ErrorHandler::ConversionFunction':'String (*)(int, __va_list_tag *)'
|-CXXMethodDecl 0x55adbc4cce80 <line:578:5, col:56> col:16 remove_conversion 'int (ErrorHandler::Conversion *)' static
| `-ParmVarDecl 0x55adbc4ccdb8 <col:34, col:46> col:46 conversion 'ErrorHandler::Conversion *'
|-AccessSpecDecl 0x55adbc4ccf28 <line:580:3, col:10> col:3 private
|-FieldDecl 0x55adbc4ccf68 <line:582:5, col:9> col:9 referenced _nerrors 'int'
|-VarDecl 0x55adbc4ccfc8 <line:584:5, col:26> col:26 used the_default_handler 'ErrorHandler *' static
|-VarDecl 0x55adbc4cd040 <line:585:5, col:26> col:26 used the_silent_handler 'ErrorHandler *' static
|-CXXMethodDecl 0x55adbc4cd440 <line:587:5, line:590:14> line:587:24 used skip_anno 'const char *(const String &, const char *, const char *, String *, String *, bool)' static
| |-ParmVarDecl 0x55adbc4cd0b8 <col:34, col:48> col:48 str 'const String &'
| |-ParmVarDecl 0x55adbc4cd138 <line:588:6, col:18> col:18 begin 'const char *'
| |-ParmVarDecl 0x55adbc4cd1b8 <col:25, col:37> col:37 end 'const char *'
| |-ParmVarDecl 0x55adbc4cd230 <line:589:6, col:14> col:14 name_result 'String *'
| |-ParmVarDecl 0x55adbc4cd2a8 <col:27, col:35> col:35 value_result 'String *'
| `-ParmVarDecl 0x55adbc4cd320 <line:590:6, col:11> col:11 raw 'bool'
|-CXXMethodDecl 0x55adbc4cd568 <line:90:7> col:7 implicit operator= 'ErrorHandler &(const ErrorHandler &)' inline default noexcept-unevaluated 0x55adbc4cd568
| `-ParmVarDecl 0x55adbc4cd678 <col:7> col:7 'const ErrorHandler &'
`-CXXConstructorDecl 0x55adbc4d0c98 <col:7> col:7 implicit constexpr ErrorHandler 'void (const ErrorHandler &)' inline default noexcept-unevaluated 0x55adbc4d0c98
  `-ParmVarDecl 0x55adbc4d0da8 <col:7> col:7 'const ErrorHandler &'

Layout: <CGRecordLayout
  LLVMType:%class.ErrorHandler = type <{ i32 (...)**, i32, [4 x i8] }>
  NonVirtualBaseLLVMType:%class.ErrorHandler.base = type <{ i32 (...)**, i32 }>
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x55adbc252810 <../dummy_inc/click/handler.hh:290:5, line:293:5> line:290:5 union definition
|-DefinitionData pass_in_registers aggregate standard_layout trivially_copyable pod trivial literal has_variant_members
| |-DefaultConstructor exists trivial
| |-CopyConstructor simple trivial has_const_param implicit_has_const_param
| |-MoveConstructor exists simple trivial
| |-CopyAssignment trivial has_const_param implicit_has_const_param
| |-MoveAssignment exists simple trivial
| `-Destructor simple irrelevant trivial
|-FieldDecl 0x55adbc252960 <line:291:2, col:18> col:18 h 'HandlerCallback':'int (*)(int, String &, Element *, const Handler *, ErrorHandler *)'
|-FieldDecl 0x55adbc2529e0 <line:292:2, col:22> col:22 referenced r 'ReadHandlerCallback':'String (*)(Element *, void *)'
|-CXXConstructorDecl 0x55adbc2537d8 <line:290:5> col:5 implicit constexpr  'void (const Handler::(anonymous union at ../dummy_inc/click/handler.hh:290:5) &)' inline default trivial noexcept-unevaluated 0x55adbc2537d8
| `-ParmVarDecl 0x55adbc2538e8 <col:5> col:5 'const Handler::(anonymous union at ../dummy_inc/click/handler.hh:290:5) &'
|-CXXConstructorDecl 0x55adbc253988 <col:5> col:5 implicit constexpr  'void (Handler::(anonymous union at ../dummy_inc/click/handler.hh:290:5) &&)' inline default trivial noexcept-unevaluated 0x55adbc253988
| `-ParmVarDecl 0x55adbc253a98 <col:5> col:5 'Handler::(anonymous union at ../dummy_inc/click/handler.hh:290:5) &&'
|-CXXDestructorDecl 0x55adbc253b08 <col:5> col:5 implicit ~ 'void ()' inline default trivial noexcept-unevaluated 0x55adbc253b08
|-CXXMethodDecl 0x55adbc2543d8 <col:5> col:5 implicit constexpr operator= 'Handler::(anonymous union at ../dummy_inc/click/handler.hh:290:5) &(const Handler::(anonymous union at ../dummy_inc/click/handler.hh:290:5) &)' inline default trivial noexcept-unevaluated 0x55adbc2543d8
| `-ParmVarDecl 0x55adbc2544e8 <col:5> col:5 'const Handler::(anonymous union at ../dummy_inc/click/handler.hh:290:5) &'
|-CXXMethodDecl 0x55adbc254558 <col:5> col:5 implicit constexpr operator= 'Handler::(anonymous union at ../dummy_inc/click/handler.hh:290:5) &(Handler::(anonymous union at ../dummy_inc/click/handler.hh:290:5) &&)' inline default trivial noexcept-unevaluated 0x55adbc254558
| `-ParmVarDecl 0x55adbc254668 <col:5> col:5 'Handler::(anonymous union at ../dummy_inc/click/handler.hh:290:5) &&'
`-CXXConstructorDecl 0x55adbc5b3268 <col:5> col:5 implicit used  'void () noexcept' inline default trivial
  `-CompoundStmt 0x55adbc5b3340 <col:5>

Layout: <CGRecordLayout
  LLVMType:%union.anon = type { i32 (i32, %class.String*, %class.Element*, %class.Handler*, %class.ErrorHandler*)* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x55adbc252b10 <../dummy_inc/click/handler.hh:294:5, line:297:5> line:294:5 union definition
|-DefinitionData pass_in_registers aggregate standard_layout trivially_copyable pod trivial literal has_variant_members
| |-DefaultConstructor exists trivial
| |-CopyConstructor simple trivial has_const_param implicit_has_const_param
| |-MoveConstructor exists simple trivial
| |-CopyAssignment trivial has_const_param implicit_has_const_param
| |-MoveAssignment exists simple trivial
| `-Destructor simple irrelevant trivial
|-FieldDecl 0x55adbc252c38 <line:295:2, col:18> col:18 h 'HandlerCallback':'int (*)(int, String &, Element *, const Handler *, ErrorHandler *)'
|-FieldDecl 0x55adbc252cc0 <line:296:2, col:23> col:23 referenced w 'WriteHandlerCallback':'int (*)(const String &, Element *, void *, ErrorHandler *)'
|-CXXConstructorDecl 0x55adbc253c38 <line:294:5> col:5 implicit constexpr  'void (const Handler::(anonymous union at ../dummy_inc/click/handler.hh:294:5) &)' inline default trivial noexcept-unevaluated 0x55adbc253c38
| `-ParmVarDecl 0x55adbc253d48 <col:5> col:5 'const Handler::(anonymous union at ../dummy_inc/click/handler.hh:294:5) &'
|-CXXConstructorDecl 0x55adbc253de8 <col:5> col:5 implicit constexpr  'void (Handler::(anonymous union at ../dummy_inc/click/handler.hh:294:5) &&)' inline default trivial noexcept-unevaluated 0x55adbc253de8
| `-ParmVarDecl 0x55adbc253ef8 <col:5> col:5 'Handler::(anonymous union at ../dummy_inc/click/handler.hh:294:5) &&'
|-CXXDestructorDecl 0x55adbc253f68 <col:5> col:5 implicit ~ 'void ()' inline default trivial noexcept-unevaluated 0x55adbc253f68
|-CXXMethodDecl 0x55adbc254708 <col:5> col:5 implicit constexpr operator= 'Handler::(anonymous union at ../dummy_inc/click/handler.hh:294:5) &(const Handler::(anonymous union at ../dummy_inc/click/handler.hh:294:5) &)' inline default trivial noexcept-unevaluated 0x55adbc254708
| `-ParmVarDecl 0x55adbc254818 <col:5> col:5 'const Handler::(anonymous union at ../dummy_inc/click/handler.hh:294:5) &'
|-CXXMethodDecl 0x55adbc254888 <col:5> col:5 implicit constexpr operator= 'Handler::(anonymous union at ../dummy_inc/click/handler.hh:294:5) &(Handler::(anonymous union at ../dummy_inc/click/handler.hh:294:5) &&)' inline default trivial noexcept-unevaluated 0x55adbc254888
| `-ParmVarDecl 0x55adbc254998 <col:5> col:5 'Handler::(anonymous union at ../dummy_inc/click/handler.hh:294:5) &&'
`-CXXConstructorDecl 0x55adbc5b33a0 <col:5> col:5 implicit used  'void () noexcept' inline default trivial
  `-CompoundStmt 0x55adbc5b3480 <col:5>

Layout: <CGRecordLayout
  LLVMType:%union.anon.11 = type { i32 (i32, %class.String*, %class.Element*, %class.Handler*, %class.ErrorHandler*)* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x55adbc24e198 prev 0x55adbc24d6a0 <../dummy_inc/click/handler.hh:19:1, line:313:1> line:19:7 referenced class Handler definition
|-DefinitionData standard_layout has_user_declared_ctor has_mutable_fields can_const_default_init
| |-DefaultConstructor exists non_trivial user_provided
| |-CopyConstructor simple non_trivial has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveConstructor exists simple non_trivial needs_overload_resolution
| |-CopyAssignment non_trivial has_const_param needs_overload_resolution implicit_has_const_param
| |-MoveAssignment exists simple non_trivial needs_overload_resolution
| `-Destructor simple non_trivial needs_overload_resolution
|-CXXRecordDecl 0x55adbc24e290 <col:1, col:7> col:7 implicit referenced class Handler
|-AccessSpecDecl 0x55adbc24e320 <col:17, col:23> col:17 public
|-EnumDecl 0x55adbc24e348 <line:21:5, line:59:5> line:21:10 Flags
| |-EnumConstantDecl 0x55adbc24e450 <line:22:2, col:11> col:2 referenced f_read 'Handler::Flags'
| | `-ImplicitCastExpr 0x55adbc24f1a0 <col:11> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc24e430 <col:11> 'int' Int: 1
| |     `-IntegerLiteral 0x55adbc24e410 <col:11> 'int' 1
| |-EnumConstantDecl 0x55adbc24e4e0 <line:23:2, col:12> col:2 referenced f_write 'Handler::Flags'
| | `-ImplicitCastExpr 0x55adbc24f1b8 <col:12> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc24e4c0 <col:12> 'int' Int: 2
| |     `-IntegerLiteral 0x55adbc24e4a0 <col:12> 'int' 2
| |-EnumConstantDecl 0x55adbc24e570 <line:24:2, col:17> col:2 referenced f_read_param 'Handler::Flags'
| | `-ImplicitCastExpr 0x55adbc24f1d0 <col:17> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc24e550 <col:17> 'int' Int: 4
| |     `-IntegerLiteral 0x55adbc24e530 <col:17> 'int' 4
| |-EnumConstantDecl 0x55adbc24e600 <line:25:2, col:16> col:2 referenced f_exclusive 'Handler::Flags'
| | `-ImplicitCastExpr 0x55adbc24f1e8 <col:16> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc24e5e0 <col:16> 'int' Int: 0
| |     `-IntegerLiteral 0x55adbc24e5c0 <col:16> 'int' 0
| |-EnumConstantDecl 0x55adbc24e690 <line:28:2, col:19> col:2 referenced f_nonexclusive 'Handler::Flags'
| | `-ImplicitCastExpr 0x55adbc24f200 <col:19> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc24e670 <col:19> 'int' Int: 32
| |     `-IntegerLiteral 0x55adbc24e650 <col:19> 'int' 32
| |-EnumConstantDecl 0x55adbc24e720 <line:31:2, col:10> col:2 referenced f_raw 'Handler::Flags'
| | `-ImplicitCastExpr 0x55adbc24f218 <col:10> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc24e700 <col:10> 'int' Int: 64
| |     `-IntegerLiteral 0x55adbc24e6e0 <col:10> 'int' 64
| |-EnumConstantDecl 0x55adbc24e7b0 <line:32:2, col:19> col:2 referenced f_read_private 'Handler::Flags'
| | `-ImplicitCastExpr 0x55adbc24f230 <col:19> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc24e790 <col:19> 'int' Int: 128
| |     `-IntegerLiteral 0x55adbc24e770 <col:19> 'int' 128
| |-EnumConstantDecl 0x55adbc24e840 <line:34:2, col:20> col:2 referenced f_write_private 'Handler::Flags'
| | `-ImplicitCastExpr 0x55adbc24f248 <col:20> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc24e820 <col:20> 'int' Int: 256
| |     `-IntegerLiteral 0x55adbc24e800 <col:20> 'int' 256
| |-EnumConstantDecl 0x55adbc24e8d0 <line:36:2, col:17> col:2 referenced f_deprecated 'Handler::Flags'
| | `-ImplicitCastExpr 0x55adbc24f260 <col:17> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc24e8b0 <col:17> 'int' Int: 512
| |     `-IntegerLiteral 0x55adbc24e890 <col:17> 'int' 512
| |-EnumConstantDecl 0x55adbc24e960 <line:38:2, col:15> col:2 referenced f_uncommon 'Handler::Flags'
| | `-ImplicitCastExpr 0x55adbc24f278 <col:15> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc24e940 <col:15> 'int' Int: 1024
| |     `-IntegerLiteral 0x55adbc24e920 <col:15> 'int' 1024
| |-EnumConstantDecl 0x55adbc24e9f0 <line:40:2, col:11> col:2 referenced f_calm 'Handler::Flags'
| | `-ImplicitCastExpr 0x55adbc24f290 <col:11> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc24e9d0 <col:11> 'int' Int: 2048
| |     `-IntegerLiteral 0x55adbc24e9b0 <col:11> 'int' 2048
| |-EnumConstantDecl 0x55adbc24ea80 <line:41:2, col:16> col:2 referenced f_expensive 'Handler::Flags'
| | `-ImplicitCastExpr 0x55adbc24f2a8 <col:16> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc24ea60 <col:16> 'int' Int: 4096
| |     `-IntegerLiteral 0x55adbc24ea40 <col:16> 'int' 4096
| |-EnumConstantDecl 0x55adbc24eb10 <line:42:2, col:13> col:2 referenced f_button 'Handler::Flags'
| | `-ImplicitCastExpr 0x55adbc24f2c0 <col:13> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc24eaf0 <col:13> 'int' Int: 8192
| |     `-IntegerLiteral 0x55adbc24ead0 <col:13> 'int' 8192
| |-EnumConstantDecl 0x55adbc24eba0 <line:43:2, col:15> col:2 referenced f_checkbox 'Handler::Flags'
| | `-ImplicitCastExpr 0x55adbc24f2d8 <col:15> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc24eb80 <col:15> 'int' Int: 16384
| |     `-IntegerLiteral 0x55adbc24eb60 <col:15> 'int' 16384
| |-EnumConstantDecl 0x55adbc24ec70 <line:45:2, col:20> col:2 referenced f_driver0 'Handler::Flags'
| | `-ConstantExpr 0x55adbc24ec50 <col:14, col:20> 'unsigned int' Int: 67108864
| |   `-BinaryOperator 0x55adbc24ec30 <col:14, col:20> 'unsigned int' '<<'
| |     |-IntegerLiteral 0x55adbc24ebf0 <col:14> 'unsigned int' 1
| |     `-IntegerLiteral 0x55adbc24ec10 <col:20> 'int' 26
| |-EnumConstantDecl 0x55adbc24ed40 <line:46:9, col:27> col:9 referenced f_driver1 'Handler::Flags'
| | `-ConstantExpr 0x55adbc24ed20 <col:21, col:27> 'unsigned int' Int: 134217728
| |   `-BinaryOperator 0x55adbc24ed00 <col:21, col:27> 'unsigned int' '<<'
| |     |-IntegerLiteral 0x55adbc24ecc0 <col:21> 'unsigned int' 1
| |     `-IntegerLiteral 0x55adbc24ece0 <col:27> 'int' 27
| |-EnumConstantDecl 0x55adbc24edd0 <line:48:2, col:17> col:2 referenced f_user_shift 'Handler::Flags'
| | `-ImplicitCastExpr 0x55adbc24f2f0 <col:17> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc24edb0 <col:17> 'int' Int: 28
| |     `-IntegerLiteral 0x55adbc24ed90 <col:17> 'int' 28
| |-EnumConstantDecl 0x55adbc24eea0 <line:49:2, col:18> col:2 referenced f_user0 'Handler::Flags'
| | `-ConstantExpr 0x55adbc24ee80 <col:12, col:18> 'unsigned int' Int: 268435456
| |   `-BinaryOperator 0x55adbc24ee60 <col:12, col:18> 'unsigned int' '<<'
| |     |-IntegerLiteral 0x55adbc24ee20 <col:12> 'unsigned int' 1
| |     `-DeclRefExpr 0x55adbc24ee40 <col:18> 'int' EnumConstant 0x55adbc24edd0 'f_user_shift' 'Handler::Flags'
| |-EnumConstantDecl 0x55adbc24ef30 <line:54:2, col:25> col:2 referenced f_read_comprehensive 'Handler::Flags'
| | `-ImplicitCastExpr 0x55adbc24f308 <col:25> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc24ef10 <col:25> 'int' Int: 8
| |     `-IntegerLiteral 0x55adbc24eef0 <col:25> 'int' 8
| |-EnumConstantDecl 0x55adbc24efc0 <line:55:2, col:26> col:2 referenced f_write_comprehensive 'Handler::Flags'
| | `-ImplicitCastExpr 0x55adbc24f320 <col:26> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc24efa0 <col:26> 'int' Int: 16
| |     `-IntegerLiteral 0x55adbc24ef80 <col:26> 'int' 16
| `-EnumConstantDecl 0x55adbc24f150 <line:56:2, col:71> col:2 referenced f_special 'Handler::Flags'
|   `-ImplicitCastExpr 0x55adbc24f338 <col:14, col:71> 'unsigned int' <IntegralCast>
|     `-ConstantExpr 0x55adbc24f130 <col:14, col:71> 'int' Int: 31
|       `-BinaryOperator 0x55adbc24f110 <col:14, col:71> 'int' '|'
|         |-BinaryOperator 0x55adbc24f0d0 <col:14, col:48> 'int' '|'
|         | |-BinaryOperator 0x55adbc24f090 <col:14, col:33> 'int' '|'
|         | | |-BinaryOperator 0x55adbc24f050 <col:14, col:23> 'int' '|'
|         | | | |-DeclRefExpr 0x55adbc24f010 <col:14> 'int' EnumConstant 0x55adbc24e450 'f_read' 'Handler::Flags'
|         | | | `-DeclRefExpr 0x55adbc24f030 <col:23> 'int' EnumConstant 0x55adbc24e4e0 'f_write' 'Handler::Flags'
|         | | `-DeclRefExpr 0x55adbc24f070 <col:33> 'int' EnumConstant 0x55adbc24e570 'f_read_param' 'Handler::Flags'
|         | `-DeclRefExpr 0x55adbc24f0b0 <col:48> 'int' EnumConstant 0x55adbc24ef30 'f_read_comprehensive' 'Handler::Flags'
|         `-DeclRefExpr 0x55adbc24f0f0 <col:71> 'int' EnumConstant 0x55adbc24efc0 'f_write_comprehensive' 'Handler::Flags'
|-CXXMethodDecl 0x55adbc24f398 <line:62:5, line:64:5> line:62:26 name 'const String &() const' inline
| `-CompoundStmt 0x55adbc254dc8 <col:39, line:64:5>
|   `-ReturnStmt 0x55adbc254db8 <line:63:2, col:9>
|     `-MemberExpr 0x55adbc254d88 <col:9> 'const String' lvalue ->_name 0x55adbc2527c0
|       `-CXXThisExpr 0x55adbc254d78 <col:9> 'const Handler *' implicit this
|-CXXMethodDecl 0x55adbc24f458 <line:69:5, line:71:5> line:69:21 flags 'uint32_t () const' inline
| `-CompoundStmt 0x55adbc254e48 <col:35, line:71:5>
|   `-ReturnStmt 0x55adbc254e38 <line:70:2, col:9>
|     `-ImplicitCastExpr 0x55adbc254e20 <col:9> 'uint32_t':'unsigned int' <LValueToRValue>
|       `-MemberExpr 0x55adbc254df0 <col:9> 'const uint32_t':'const unsigned int' lvalue ->_flags 0x55adbc252ed0
|         `-CXXThisExpr 0x55adbc254de0 <col:9> 'const Handler *' implicit this
|-CXXMethodDecl 0x55adbc24f5a8 <line:75:5, line:77:5> line:75:18 user_data 'void *(int) const' inline
| |-ParmVarDecl 0x55adbc24f510 <col:28, col:32> col:32 used op 'int'
| `-CompoundStmt 0x55adbc254fc8 <col:42, line:77:5>
|   `-ReturnStmt 0x55adbc254fb8 <line:76:2, col:44>
|     `-ImplicitCastExpr 0x55adbc254fa0 <col:9, col:44> 'void *' <LValueToRValue>
|       `-ConditionalOperator 0x55adbc254f70 <col:9, col:44> 'void *const' lvalue
|         |-BinaryOperator 0x55adbc254ed0 <col:9, col:15> 'bool' '=='
|         | |-ImplicitCastExpr 0x55adbc254ea0 <col:9> 'int' <LValueToRValue>
|         | | `-DeclRefExpr 0x55adbc254e60 <col:9> 'int' lvalue ParmVar 0x55adbc24f510 'op' 'int'
|         | `-ImplicitCastExpr 0x55adbc254eb8 <col:15> 'int' <IntegralCast>
|         |   `-DeclRefExpr 0x55adbc254e80 <col:15> 'Handler::Flags' EnumConstant 0x55adbc24e4e0 'f_write' 'Handler::Flags'
|         |-MemberExpr 0x55adbc254f00 <col:25> 'void *const' lvalue ->_write_user_data 0x55adbc252e70
|         | `-CXXThisExpr 0x55adbc254ef0 <col:25> 'const Handler *' implicit this
|         `-MemberExpr 0x55adbc254f40 <col:44> 'void *const' lvalue ->_read_user_data 0x55adbc252e08
|           `-CXXThisExpr 0x55adbc254f30 <col:44> 'const Handler *' implicit this
|-CXXMethodDecl 0x55adbc24f678 <line:80:5, line:82:5> line:80:18 read_user_data 'void *() const' inline
| `-CompoundStmt 0x55adbc255048 <col:41, line:82:5>
|   `-ReturnStmt 0x55adbc255038 <line:81:2, col:9>
|     `-ImplicitCastExpr 0x55adbc255020 <col:9> 'void *' <LValueToRValue>
|       `-MemberExpr 0x55adbc254ff0 <col:9> 'void *const' lvalue ->_read_user_data 0x55adbc252e08
|         `-CXXThisExpr 0x55adbc254fe0 <col:9> 'const Handler *' implicit this
|-CXXMethodDecl 0x55adbc24f740 <line:85:5, line:87:5> line:85:18 write_user_data 'void *() const' inline
| `-CompoundStmt 0x55adbc2550c8 <col:42, line:87:5>
|   `-ReturnStmt 0x55adbc2550b8 <line:86:2, col:9>
|     `-ImplicitCastExpr 0x55adbc2550a0 <col:9> 'void *' <LValueToRValue>
|       `-MemberExpr 0x55adbc255070 <col:9> 'void *const' lvalue ->_write_user_data 0x55adbc252e70
|         `-CXXThisExpr 0x55adbc255060 <col:9> 'const Handler *' implicit this
|-CXXMethodDecl 0x55adbc24f808 <line:90:5, col:63> col:18 user_data1 'void *() const' inline
| `-DeprecatedAttr 0x55adbc24f8a8 <col:52> "" ""
|-CXXMethodDecl 0x55adbc24f940 <line:91:5, col:63> col:18 user_data2 'void *() const' inline
| `-DeprecatedAttr 0x55adbc24f9e0 <col:52> "" ""
|-CXXMethodDecl 0x55adbc24fa70 <line:96:5, line:98:5> line:96:17 readable 'bool () const' inline
| `-CompoundStmt 0x55adbc2551b8 <col:34, line:98:5>
|   `-ReturnStmt 0x55adbc2551a8 <line:97:2, col:18>
|     `-ImplicitCastExpr 0x55adbc255190 <col:9, col:18> 'bool' <IntegralToBoolean>
|       `-BinaryOperator 0x55adbc255170 <col:9, col:18> 'unsigned int' '&'
|         |-ImplicitCastExpr 0x55adbc255140 <col:9> 'uint32_t':'unsigned int' <LValueToRValue>
|         | `-MemberExpr 0x55adbc2550f0 <col:9> 'const uint32_t':'const unsigned int' lvalue ->_flags 0x55adbc252ed0
|         |   `-CXXThisExpr 0x55adbc2550e0 <col:9> 'const Handler *' implicit this
|         `-ImplicitCastExpr 0x55adbc255158 <col:18> 'unsigned int' <IntegralCast>
|           `-DeclRefExpr 0x55adbc255120 <col:18> 'Handler::Flags' EnumConstant 0x55adbc24e450 'f_read' 'Handler::Flags'
|-CXXMethodDecl 0x55adbc24fb30 <line:102:5, line:104:5> line:102:17 read_param 'bool () const' inline
| `-CompoundStmt 0x55adbc2552a8 <col:36, line:104:5>
|   `-ReturnStmt 0x55adbc255298 <line:103:2, col:18>
|     `-ImplicitCastExpr 0x55adbc255280 <col:9, col:18> 'bool' <IntegralToBoolean>
|       `-BinaryOperator 0x55adbc255260 <col:9, col:18> 'unsigned int' '&'
|         |-ImplicitCastExpr 0x55adbc255230 <col:9> 'uint32_t':'unsigned int' <LValueToRValue>
|         | `-MemberExpr 0x55adbc2551e0 <col:9> 'const uint32_t':'const unsigned int' lvalue ->_flags 0x55adbc252ed0
|         |   `-CXXThisExpr 0x55adbc2551d0 <col:9> 'const Handler *' implicit this
|         `-ImplicitCastExpr 0x55adbc255248 <col:18> 'unsigned int' <IntegralCast>
|           `-DeclRefExpr 0x55adbc255210 <col:18> 'Handler::Flags' EnumConstant 0x55adbc24e570 'f_read_param' 'Handler::Flags'
|-CXXMethodDecl 0x55adbc24fbf0 <line:111:5, line:113:5> line:111:17 used read_visible 'bool () const' inline
| `-CompoundStmt 0x55adbc255488 <col:38, line:113:5>
|   `-ReturnStmt 0x55adbc255478 <line:112:2, col:49>
|     `-BinaryOperator 0x55adbc255458 <col:9, col:49> 'bool' '=='
|       |-ParenExpr 0x55adbc255400 <col:9, col:44> 'unsigned int'
|       | `-BinaryOperator 0x55adbc2553e0 <col:10, col:43> 'unsigned int' '&'
|       |   |-ImplicitCastExpr 0x55adbc2553b0 <col:10> 'uint32_t':'unsigned int' <LValueToRValue>
|       |   | `-MemberExpr 0x55adbc2552d0 <col:10> 'const uint32_t':'const unsigned int' lvalue ->_flags 0x55adbc252ed0
|       |   |   `-CXXThisExpr 0x55adbc2552c0 <col:10> 'const Handler *' implicit this
|       |   `-ImplicitCastExpr 0x55adbc2553c8 <col:19, col:43> 'unsigned int' <IntegralCast>
|       |     `-ParenExpr 0x55adbc255390 <col:19, col:43> 'int'
|       |       `-BinaryOperator 0x55adbc255370 <col:20, col:29> 'int' '|'
|       |         |-ImplicitCastExpr 0x55adbc255340 <col:20> 'int' <IntegralCast>
|       |         | `-DeclRefExpr 0x55adbc255300 <col:20> 'Handler::Flags' EnumConstant 0x55adbc24e450 'f_read' 'Handler::Flags'
|       |         `-ImplicitCastExpr 0x55adbc255358 <col:29> 'int' <IntegralCast>
|       |           `-DeclRefExpr 0x55adbc255320 <col:29> 'Handler::Flags' EnumConstant 0x55adbc24e7b0 'f_read_private' 'Handler::Flags'
|       `-ImplicitCastExpr 0x55adbc255440 <col:49> 'unsigned int' <IntegralCast>
|         `-DeclRefExpr 0x55adbc255420 <col:49> 'Handler::Flags' EnumConstant 0x55adbc24e450 'f_read' 'Handler::Flags'
|-CXXMethodDecl 0x55adbc24fcb0 <line:116:5, line:118:5> line:116:17 writable 'bool () const' inline
| `-CompoundStmt 0x55adbc255578 <col:34, line:118:5>
|   `-ReturnStmt 0x55adbc255568 <line:117:2, col:18>
|     `-ImplicitCastExpr 0x55adbc255550 <col:9, col:18> 'bool' <IntegralToBoolean>
|       `-BinaryOperator 0x55adbc255530 <col:9, col:18> 'unsigned int' '&'
|         |-ImplicitCastExpr 0x55adbc255500 <col:9> 'uint32_t':'unsigned int' <LValueToRValue>
|         | `-MemberExpr 0x55adbc2554b0 <col:9> 'const uint32_t':'const unsigned int' lvalue ->_flags 0x55adbc252ed0
|         |   `-CXXThisExpr 0x55adbc2554a0 <col:9> 'const Handler *' implicit this
|         `-ImplicitCastExpr 0x55adbc255518 <col:18> 'unsigned int' <IntegralCast>
|           `-DeclRefExpr 0x55adbc2554e0 <col:18> 'Handler::Flags' EnumConstant 0x55adbc24e4e0 'f_write' 'Handler::Flags'
|-CXXMethodDecl 0x55adbc24fd70 <line:125:5, line:127:5> line:125:17 used write_visible 'bool () const' inline
| `-CompoundStmt 0x55adbc255758 <col:39, line:127:5>
|   `-ReturnStmt 0x55adbc255748 <line:126:2, col:51>
|     `-BinaryOperator 0x55adbc255728 <col:9, col:51> 'bool' '=='
|       |-ParenExpr 0x55adbc2556d0 <col:9, col:46> 'unsigned int'
|       | `-BinaryOperator 0x55adbc2556b0 <col:10, col:45> 'unsigned int' '&'
|       |   |-ImplicitCastExpr 0x55adbc255680 <col:10> 'uint32_t':'unsigned int' <LValueToRValue>
|       |   | `-MemberExpr 0x55adbc2555a0 <col:10> 'const uint32_t':'const unsigned int' lvalue ->_flags 0x55adbc252ed0
|       |   |   `-CXXThisExpr 0x55adbc255590 <col:10> 'const Handler *' implicit this
|       |   `-ImplicitCastExpr 0x55adbc255698 <col:19, col:45> 'unsigned int' <IntegralCast>
|       |     `-ParenExpr 0x55adbc255660 <col:19, col:45> 'int'
|       |       `-BinaryOperator 0x55adbc255640 <col:20, col:30> 'int' '|'
|       |         |-ImplicitCastExpr 0x55adbc255610 <col:20> 'int' <IntegralCast>
|       |         | `-DeclRefExpr 0x55adbc2555d0 <col:20> 'Handler::Flags' EnumConstant 0x55adbc24e4e0 'f_write' 'Handler::Flags'
|       |         `-ImplicitCastExpr 0x55adbc255628 <col:30> 'int' <IntegralCast>
|       |           `-DeclRefExpr 0x55adbc2555f0 <col:30> 'Handler::Flags' EnumConstant 0x55adbc24e840 'f_write_private' 'Handler::Flags'
|       `-ImplicitCastExpr 0x55adbc255710 <col:51> 'unsigned int' <IntegralCast>
|         `-DeclRefExpr 0x55adbc2556f0 <col:51> 'Handler::Flags' EnumConstant 0x55adbc24e4e0 'f_write' 'Handler::Flags'
|-CXXMethodDecl 0x55adbc24fe30 <line:130:5, line:132:5> line:130:17 visible 'bool () const' inline
| `-CompoundStmt 0x55adbc255860 <col:33, line:132:5>
|   `-ReturnStmt 0x55adbc255850 <line:131:2, col:41>
|     `-BinaryOperator 0x55adbc255830 <col:9, col:41> 'bool' '||'
|       |-CXXMemberCallExpr 0x55adbc2557b0 <col:9, col:22> 'bool'
|       | `-MemberExpr 0x55adbc255780 <col:9> '<bound member function type>' ->read_visible 0x55adbc24fbf0
|       |   `-CXXThisExpr 0x55adbc255770 <col:9> 'const Handler *' implicit this
|       `-CXXMemberCallExpr 0x55adbc255810 <col:27, col:41> 'bool'
|         `-MemberExpr 0x55adbc2557e0 <col:27> '<bound member function type>' ->write_visible 0x55adbc24fd70
|           `-CXXThisExpr 0x55adbc2557d0 <col:27> 'const Handler *' implicit this
|-CXXMethodDecl 0x55adbc24fef0 <line:136:5, line:138:5> line:136:17 allow_concurrent_handlers 'bool () const' inline
| `-CompoundStmt 0x55adbc255970 <col:51, line:138:5>
|   `-ReturnStmt 0x55adbc255960 <line:137:9, col:40>
|     `-ImplicitCastExpr 0x55adbc255948 <col:16, col:40> 'bool' <IntegralToBoolean>
|       `-ParenExpr 0x55adbc255928 <col:16, col:40> 'unsigned int'
|         `-BinaryOperator 0x55adbc255908 <col:17, col:26> 'unsigned int' '&'
|           |-ImplicitCastExpr 0x55adbc2558d8 <col:17> 'uint32_t':'unsigned int' <LValueToRValue>
|           | `-MemberExpr 0x55adbc255888 <col:17> 'const uint32_t':'const unsigned int' lvalue ->_flags 0x55adbc252ed0
|           |   `-CXXThisExpr 0x55adbc255878 <col:17> 'const Handler *' implicit this
|           `-ImplicitCastExpr 0x55adbc2558f0 <col:26> 'unsigned int' <IntegralCast>
|             `-DeclRefExpr 0x55adbc2558b8 <col:26> 'Handler::Flags' EnumConstant 0x55adbc24e690 'f_nonexclusive' 'Handler::Flags'
|-CXXMethodDecl 0x55adbc24ffb0 <line:142:5, line:144:5> line:142:17 allow_concurrent_threads 'bool () const' inline
| `-CompoundStmt 0x55adbc255a80 <col:50, line:144:5>
|   `-ReturnStmt 0x55adbc255a70 <line:143:9, col:40>
|     `-ImplicitCastExpr 0x55adbc255a58 <col:16, col:40> 'bool' <IntegralToBoolean>
|       `-ParenExpr 0x55adbc255a38 <col:16, col:40> 'unsigned int'
|         `-BinaryOperator 0x55adbc255a18 <col:17, col:26> 'unsigned int' '&'
|           |-ImplicitCastExpr 0x55adbc2559e8 <col:17> 'uint32_t':'unsigned int' <LValueToRValue>
|           | `-MemberExpr 0x55adbc255998 <col:17> 'const uint32_t':'const unsigned int' lvalue ->_flags 0x55adbc252ed0
|           |   `-CXXThisExpr 0x55adbc255988 <col:17> 'const Handler *' implicit this
|           `-ImplicitCastExpr 0x55adbc255a00 <col:26> 'unsigned int' <IntegralCast>
|             `-DeclRefExpr 0x55adbc2559c8 <col:26> 'Handler::Flags' EnumConstant 0x55adbc24e690 'f_nonexclusive' 'Handler::Flags'
|-CXXMethodDecl 0x55adbc250070 <line:164:5, line:166:5> line:164:17 raw 'bool () const' inline
| `-CompoundStmt 0x55adbc255b70 <col:29, line:166:5>
|   `-ReturnStmt 0x55adbc255b60 <line:165:2, col:18>
|     `-ImplicitCastExpr 0x55adbc255b48 <col:9, col:18> 'bool' <IntegralToBoolean>
|       `-BinaryOperator 0x55adbc255b28 <col:9, col:18> 'unsigned int' '&'
|         |-ImplicitCastExpr 0x55adbc255af8 <col:9> 'uint32_t':'unsigned int' <LValueToRValue>
|         | `-MemberExpr 0x55adbc255aa8 <col:9> 'const uint32_t':'const unsigned int' lvalue ->_flags 0x55adbc252ed0
|         |   `-CXXThisExpr 0x55adbc255a98 <col:9> 'const Handler *' implicit this
|         `-ImplicitCastExpr 0x55adbc255b10 <col:18> 'unsigned int' <IntegralCast>
|           `-DeclRefExpr 0x55adbc255ad8 <col:18> 'Handler::Flags' EnumConstant 0x55adbc24e720 'f_raw' 'Handler::Flags'
|-CXXMethodDecl 0x55adbc2502f8 <line:177:5, col:75> col:12 used call_read 'String (Element *, const String &, ErrorHandler *) const'
| |-ParmVarDecl 0x55adbc250120 <col:22, col:31> col:31 e 'Element *'
| |-ParmVarDecl 0x55adbc250198 <col:34, col:48> col:48 param 'const String &'
| `-ParmVarDecl 0x55adbc250210 <col:55, col:69> col:69 errh 'ErrorHandler *'
|-CXXMethodDecl 0x55adbc250508 <line:186:5, line:188:5> line:186:19 call_read 'String (Element *, ErrorHandler *) const' inline
| |-ParmVarDecl 0x55adbc2503c0 <col:29, col:38> col:38 used e 'Element *'
| |-ParmVarDecl 0x55adbc250438 <col:41, col:62> col:55 used errh 'ErrorHandler *' cinit
| | `-ImplicitCastExpr 0x55adbc254cb0 <col:62> 'ErrorHandler *' <NullToPointer>
| |   `-IntegerLiteral 0x55adbc254c90 <col:62> 'int' 0
| `-CompoundStmt 0x55adbc255e10 <col:71, line:188:5>
|   `-ReturnStmt 0x55adbc255e00 <line:187:2, col:36>
|     `-ExprWithCleanups 0x55adbc255de8 <col:9, col:36> 'String'
|       `-CXXConstructExpr 0x55adbc255db8 <col:9, col:36> 'String' 'void (String &&)' elidable
|         `-MaterializeTemporaryExpr 0x55adbc255da0 <col:9, col:36> 'String' xvalue
|           `-CXXBindTemporaryExpr 0x55adbc255d80 <col:9, col:36> 'String' (CXXTemporary 0x55adbc255d80)
|             `-CXXMemberCallExpr 0x55adbc255ce0 <col:9, col:36> 'String'
|               |-MemberExpr 0x55adbc255cb0 <col:9> '<bound member function type>' ->call_read 0x55adbc2502f8
|               | `-CXXThisExpr 0x55adbc255ca0 <col:9> 'const Handler *' implicit this
|               |-ImplicitCastExpr 0x55adbc255d18 <col:19> 'Element *' <LValueToRValue>
|               | `-DeclRefExpr 0x55adbc255bf8 <col:19> 'Element *' lvalue ParmVar 0x55adbc2503c0 'e' 'Element *'
|               |-MaterializeTemporaryExpr 0x55adbc255d48 <col:22, col:29> 'const String' lvalue
|               | `-ImplicitCastExpr 0x55adbc255d30 <col:22, col:29> 'const String' <NoOp>
|               |   `-CXXBindTemporaryExpr 0x55adbc255c60 <col:22, col:29> 'String' (CXXTemporary 0x55adbc255c60)
|               |     `-CXXTemporaryObjectExpr 0x55adbc255c28 <col:22, col:29> 'String' 'void ()'
|               `-ImplicitCastExpr 0x55adbc255d60 <col:32> 'ErrorHandler *' <LValueToRValue>
|                 `-DeclRefExpr 0x55adbc255c80 <col:32> 'ErrorHandler *' lvalue ParmVar 0x55adbc250438 'errh' 'ErrorHandler *'
|-CXXMethodDecl 0x55adbc2507a0 <line:198:5, col:73> col:9 call_write 'int (const String &, Element *, ErrorHandler *) const'
| |-ParmVarDecl 0x55adbc2505c8 <col:20, col:34> col:34 value 'const String &'
| |-ParmVarDecl 0x55adbc250640 <col:41, col:50> col:50 e 'Element *'
| `-ParmVarDecl 0x55adbc2506b8 <col:53, col:67> col:67 errh 'ErrorHandler *'
|-CXXMethodDecl 0x55adbc250928 <line:207:5, col:37> col:12 unparse_name 'String (Element *) const'
| `-ParmVarDecl 0x55adbc250868 <col:25, col:34> col:34 e 'Element *'
|-CXXMethodDecl 0x55adbc250b58 <line:216:5, col:63> col:19 unparse_name 'String (Element *, const String &)' static
| |-ParmVarDecl 0x55adbc2509e0 <col:32, col:41> col:41 e 'Element *'
| `-ParmVarDecl 0x55adbc250a58 <col:44, col:58> col:58 hname 'const String &'
|-CXXMethodDecl 0x55adbc250c70 <line:223:5, line:225:5> line:223:34 blank_handler 'const Handler *()' static inline
| `-CompoundStmt 0x55adbc255e70 <col:50, line:225:5>
|   `-ReturnStmt 0x55adbc255e60 <line:224:2, col:9>
|     `-ImplicitCastExpr 0x55adbc255e48 <col:9> 'const Handler *' <LValueToRValue>
|       `-DeclRefExpr 0x55adbc255e28 <col:9> 'const Handler *' lvalue Var 0x55adbc253000 'the_blank_handler' 'const Handler *'
|-EnumDecl 0x55adbc250d10 <line:229:5, line:251:5> line:229:5
| |-EnumConstantDecl 0x55adbc250e10 <line:230:2, col:11> col:2 h_read 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55adbc2519a0 <col:11> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc250df0 <col:11> 'Handler::Flags' Int: 1
| |     `-DeclRefExpr 0x55adbc250dd0 <col:11> 'Handler::Flags' EnumConstant 0x55adbc24e450 'f_read' 'Handler::Flags'
| |-EnumConstantDecl 0x55adbc250ea0 <line:231:2, col:12> col:2 h_write 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55adbc2519b8 <col:12> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc250e80 <col:12> 'Handler::Flags' Int: 2
| |     `-DeclRefExpr 0x55adbc250e60 <col:12> 'Handler::Flags' EnumConstant 0x55adbc24e4e0 'f_write' 'Handler::Flags'
| |-EnumConstantDecl 0x55adbc250f30 <line:232:2, col:17> col:2 h_read_param 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55adbc2519d0 <col:17> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc250f10 <col:17> 'Handler::Flags' Int: 4
| |     `-DeclRefExpr 0x55adbc250ef0 <col:17> 'Handler::Flags' EnumConstant 0x55adbc24e570 'f_read_param' 'Handler::Flags'
| |-EnumConstantDecl 0x55adbc250fc0 <line:233:2, col:16> col:2 h_exclusive 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55adbc2519e8 <col:16> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc250fa0 <col:16> 'Handler::Flags' Int: 0
| |     `-DeclRefExpr 0x55adbc250f80 <col:16> 'Handler::Flags' EnumConstant 0x55adbc24e600 'f_exclusive' 'Handler::Flags'
| |-EnumConstantDecl 0x55adbc251050 <line:234:2, col:19> col:2 h_nonexclusive 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55adbc251a00 <col:19> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc251030 <col:19> 'Handler::Flags' Int: 32
| |     `-DeclRefExpr 0x55adbc251010 <col:19> 'Handler::Flags' EnumConstant 0x55adbc24e690 'f_nonexclusive' 'Handler::Flags'
| |-EnumConstantDecl 0x55adbc2510e0 <line:235:2, col:10> col:2 h_raw 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55adbc251a18 <col:10> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc2510c0 <col:10> 'Handler::Flags' Int: 64
| |     `-DeclRefExpr 0x55adbc2510a0 <col:10> 'Handler::Flags' EnumConstant 0x55adbc24e720 'f_raw' 'Handler::Flags'
| |-EnumConstantDecl 0x55adbc251170 <line:236:2, col:19> col:2 h_read_private 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55adbc251a30 <col:19> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc251150 <col:19> 'Handler::Flags' Int: 128
| |     `-DeclRefExpr 0x55adbc251130 <col:19> 'Handler::Flags' EnumConstant 0x55adbc24e7b0 'f_read_private' 'Handler::Flags'
| |-EnumConstantDecl 0x55adbc251200 <line:237:2, col:20> col:2 h_write_private 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55adbc251a48 <col:20> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc2511e0 <col:20> 'Handler::Flags' Int: 256
| |     `-DeclRefExpr 0x55adbc2511c0 <col:20> 'Handler::Flags' EnumConstant 0x55adbc24e840 'f_write_private' 'Handler::Flags'
| |-EnumConstantDecl 0x55adbc251290 <line:238:2, col:17> col:2 h_deprecated 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55adbc251a60 <col:17> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc251270 <col:17> 'Handler::Flags' Int: 512
| |     `-DeclRefExpr 0x55adbc251250 <col:17> 'Handler::Flags' EnumConstant 0x55adbc24e8d0 'f_deprecated' 'Handler::Flags'
| |-EnumConstantDecl 0x55adbc251320 <line:239:2, col:15> col:2 h_uncommon 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55adbc251a78 <col:15> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc251300 <col:15> 'Handler::Flags' Int: 1024
| |     `-DeclRefExpr 0x55adbc2512e0 <col:15> 'Handler::Flags' EnumConstant 0x55adbc24e960 'f_uncommon' 'Handler::Flags'
| |-EnumConstantDecl 0x55adbc2513b0 <line:240:2, col:11> col:2 h_calm 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55adbc251a90 <col:11> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc251390 <col:11> 'Handler::Flags' Int: 2048
| |     `-DeclRefExpr 0x55adbc251370 <col:11> 'Handler::Flags' EnumConstant 0x55adbc24e9f0 'f_calm' 'Handler::Flags'
| |-EnumConstantDecl 0x55adbc251440 <line:241:2, col:16> col:2 h_expensive 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55adbc251aa8 <col:16> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc251420 <col:16> 'Handler::Flags' Int: 4096
| |     `-DeclRefExpr 0x55adbc251400 <col:16> 'Handler::Flags' EnumConstant 0x55adbc24ea80 'f_expensive' 'Handler::Flags'
| |-EnumConstantDecl 0x55adbc2514d0 <line:242:2, col:13> col:2 h_button 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55adbc251ac0 <col:13> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc2514b0 <col:13> 'Handler::Flags' Int: 8192
| |     `-DeclRefExpr 0x55adbc251490 <col:13> 'Handler::Flags' EnumConstant 0x55adbc24eb10 'f_button' 'Handler::Flags'
| |-EnumConstantDecl 0x55adbc251560 <line:243:2, col:15> col:2 h_checkbox 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55adbc251ad8 <col:15> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc251540 <col:15> 'Handler::Flags' Int: 16384
| |     `-DeclRefExpr 0x55adbc251520 <col:15> 'Handler::Flags' EnumConstant 0x55adbc24eba0 'f_checkbox' 'Handler::Flags'
| |-EnumConstantDecl 0x55adbc2515f0 <line:244:2, col:20> col:2 h_driver_flag_0 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55adbc251af0 <col:20> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc2515d0 <col:20> 'Handler::Flags' Int: 67108864
| |     `-DeclRefExpr 0x55adbc2515b0 <col:20> 'Handler::Flags' EnumConstant 0x55adbc24ec70 'f_driver0' 'Handler::Flags'
| |-EnumConstantDecl 0x55adbc251680 <line:245:9, col:27> col:9 h_driver_flag_1 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55adbc251b08 <col:27> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc251660 <col:27> 'Handler::Flags' Int: 134217728
| |     `-DeclRefExpr 0x55adbc251640 <col:27> 'Handler::Flags' EnumConstant 0x55adbc24ed40 'f_driver1' 'Handler::Flags'
| |-EnumConstantDecl 0x55adbc251710 <line:246:2, col:22> col:2 h_user_flag_shift 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55adbc251b20 <col:22> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc2516f0 <col:22> 'Handler::Flags' Int: 28
| |     `-DeclRefExpr 0x55adbc2516d0 <col:22> 'Handler::Flags' EnumConstant 0x55adbc24edd0 'f_user_shift' 'Handler::Flags'
| |-EnumConstantDecl 0x55adbc2517a0 <line:247:2, col:18> col:2 h_user_flag_0 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55adbc251b38 <col:18> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc251780 <col:18> 'Handler::Flags' Int: 268435456
| |     `-DeclRefExpr 0x55adbc251760 <col:18> 'Handler::Flags' EnumConstant 0x55adbc24eea0 'f_user0' 'Handler::Flags'
| |-EnumConstantDecl 0x55adbc251830 <line:248:2, col:25> col:2 h_read_comprehensive 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55adbc251b50 <col:25> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc251810 <col:25> 'Handler::Flags' Int: 8
| |     `-DeclRefExpr 0x55adbc2517f0 <col:25> 'Handler::Flags' EnumConstant 0x55adbc24ef30 'f_read_comprehensive' 'Handler::Flags'
| |-EnumConstantDecl 0x55adbc2518c0 <line:249:2, col:26> col:2 h_write_comprehensive 'Handler::(anonymous enum at ../dummy_inc/click/handler.hh:229:5)'
| | `-ImplicitCastExpr 0x55adbc251b68 <col:26> 'unsigned int' <IntegralCast>
| |   `-ConstantExpr 0x55adbc2518a0 <col:26> 'Handler::Flags' Int: 16
| |     `-DeclRefExpr 0x55adbc251880 <col:26> 'Handler::Flags' EnumConstant 0x55adbc24efc0 'f_write_comprehensive' 'Handler::Flags'
