; ModuleID = '../elements/ip/ipratemon.cc'
source_filename = "../elements/ip/ipratemon.cc"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%class.ArgContext = type <{ %class.Element*, %class.ErrorHandler*, i8*, i8, [7 x i8] }>
%class.Element = type <{ i32 (...)**, [2 x %"class.Element::Port"*], [4 x %"class.Element::Port"], [2 x i32], %class.Router*, i32, [4 x i8] }>
%"class.Element::Port" = type <{ %class.Element*, i32, [4 x i8] }>
%class.Router = type opaque
%class.ErrorHandler = type <{ i32 (...)**, i32, [4 x i8] }>
%class.IPRateMonitor = type { %class.Element.base, i8, i8, i32, i64, i32, %class.Spinlock*, %"struct.IPRateMonitor::Stats"*, i64, i64, %"struct.IPRateMonitor::Stats"*, %"struct.IPRateMonitor::Stats"*, %"struct.IPRateMonitor::Stats"*, %"struct.IPRateMonitor::Stats"* }
%class.Element.base = type <{ i32 (...)**, [2 x %"class.Element::Port"*], [4 x %"class.Element::Port"], [2 x i32], %class.Router*, i32 }>
%class.Spinlock = type { i8 }
%"struct.IPRateMonitor::Stats" = type { %"struct.IPRateMonitor::Counter"*, %"struct.IPRateMonitor::Stats"*, %"struct.IPRateMonitor::Stats"*, [256 x %"struct.IPRateMonitor::Counter"*], %class.IPRateMonitor* }
%"struct.IPRateMonitor::Counter" = type <{ %class.RateEWMAX, [4 x i8], %"struct.IPRateMonitor::Stats"*, i32, [4 x i8] }>
%class.RateEWMAX = type { i32, [2 x i32], [2 x %class.DirectEWMAX] }
%class.DirectEWMAX = type { i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "prev_fold_time", scope: !2, file: !3, line: 236, type: !19, isLocal: false, isDefinition: true)
!2 = distinct !DISubprogram(name: "update", linkageName: "_ZN13IPRateMonitor6updateEjiP6Packetbb", scope: !4, file: !3, line: 230, type: !1581, scopeLine: 232, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1606, declaration: !1580, retainedNodes: !2849)
!3 = !DIFile(filename: "../elements/ip/ipratemon.hh", directory: "/home/john/projects/click/ir-dir")
!4 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "IPRateMonitor", file: !3, line: 70, size: 1600, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !5, vtableHolder: !7)
!5 = !{!6, !9, !11, !12, !14, !18, !20, !40, !471, !472, !473, !474, !475, !476, !477, !481, !482, !487, !488, !689, !692, !705, !706, !709, !1559, !1562, !1565, !1568, !1569, !1570, !1571, !1577, !1580, !1583, !1584, !1587, !1591, !1592, !1595, !1596, !1600, !1601, !1604, !1605}
!6 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !4, baseType: !7, flags: DIFlagPublic, extraData: i32 0)
!7 = !DICompositeType(tag: DW_TAG_class_type, name: "Element", file: !8, line: 29, flags: DIFlagFwdDecl, identifier: "_ZTS7Element")
!8 = !DIFile(filename: "../dummy_inc/click/element.hh", directory: "/home/john/projects/click/ir-dir")
!9 = !DIDerivedType(tag: DW_TAG_member, name: "_count_packets", scope: !4, file: !3, line: 160, baseType: !10, size: 8, offset: 864)
!10 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "_anno_packets", scope: !4, file: !3, line: 161, baseType: !10, size: 8, offset: 872)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "_thresh", scope: !4, file: !3, line: 162, baseType: !13, size: 32, offset: 896)
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "_memmax", scope: !4, file: !3, line: 163, baseType: !15, size: 64, offset: 960)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !16, line: 46, baseType: !17)
!16 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!17 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_ratio", scope: !4, file: !3, line: 164, baseType: !19, size: 32, offset: 1024)
!19 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !4, file: !3, line: 165, baseType: !21, size: 64, offset: 1088)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Spinlock", file: !23, line: 46, size: 8, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !24, identifier: "_ZTS8Spinlock")
!23 = !DIFile(filename: "../dummy_inc/click/sync.hh", directory: "/home/john/projects/click/ir-dir")
!24 = !{!25, !29, !30, !31, !32, !35}
!25 = !DISubprogram(name: "Spinlock", scope: !22, file: !23, line: 48, type: !26, scopeLine: 48, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!26 = !DISubroutineType(types: !27)
!27 = !{null, !28}
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!29 = !DISubprogram(name: "~Spinlock", scope: !22, file: !23, line: 49, type: !26, scopeLine: 49, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!30 = !DISubprogram(name: "acquire", linkageName: "_ZN8Spinlock7acquireEv", scope: !22, file: !23, line: 51, type: !26, scopeLine: 51, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!31 = !DISubprogram(name: "release", linkageName: "_ZN8Spinlock7releaseEv", scope: !22, file: !23, line: 52, type: !26, scopeLine: 52, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!32 = !DISubprogram(name: "attempt", linkageName: "_ZN8Spinlock7attemptEv", scope: !22, file: !23, line: 53, type: !33, scopeLine: 53, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!33 = !DISubroutineType(types: !34)
!34 = !{!10, !28}
!35 = !DISubprogram(name: "nested", linkageName: "_ZNK8Spinlock6nestedEv", scope: !22, file: !23, line: 54, type: !36, scopeLine: 54, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!36 = !DISubroutineType(types: !37)
!37 = !{!10, !38}
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !4, file: !3, line: 167, baseType: !41, size: 64, offset: 1152)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Stats", scope: !4, file: !3, line: 130, size: 16640, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !43, identifier: "_ZTSN13IPRateMonitor5StatsE")
!43 = !{!44, !456, !457, !458, !462, !464, !468}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_parent", scope: !42, file: !3, line: 134, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Counter", scope: !4, file: !3, line: 116, size: 320, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !47, identifier: "_ZTSN13IPRateMonitor7CounterE")
!47 = !{!48, !445, !446, !447, !451}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "fwd_and_rev_rate", scope: !46, file: !3, line: 119, baseType: !49, size: 160)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "MyEWMA", scope: !4, file: !3, line: 113, baseType: !50)
!50 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "RateEWMAX<IPRateMonitor::EWMAParameters>", file: !51, line: 373, size: 160, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !52, templateParams: !417, identifier: "_ZTS9RateEWMAXIN13IPRateMonitor14EWMAParametersEE")
!51 = !DIFile(filename: "../dummy_inc/click/ewma.hh", directory: "/home/john/projects/click/ir-dir")
!52 = !{!53, !75, !76, !81, !419, !423, !430, !433, !436, !439, !442}
!53 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !50, baseType: !54, flags: DIFlagPublic, extraData: i32 0)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EWMAParameters", scope: !4, file: !3, line: 78, size: 8, flags: DIFlagTypePassByValue, elements: !55, identifier: "_ZTSN13IPRateMonitor14EWMAParametersE")
!55 = !{!56, !73, !74}
!56 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !54, baseType: !57, extraData: i32 0)
!57 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "FixedEWMAXParameters<5, 10, unsigned int, int>", file: !51, line: 213, size: 8, flags: DIFlagTypePassByValue, elements: !58, templateParams: !68, identifier: "_ZTS20FixedEWMAXParametersILj5ELj10EjiE")
!58 = !{!59, !62, !63, !67}
!59 = !DISubprogram(name: "stability_shift", linkageName: "_ZN20FixedEWMAXParametersILj5ELj10EjiE15stability_shiftEv", scope: !57, file: !51, line: 220, type: !60, scopeLine: 220, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!60 = !DISubroutineType(types: !61)
!61 = !{!19}
!62 = !DISubprogram(name: "scale", linkageName: "_ZN20FixedEWMAXParametersILj5ELj10EjiE5scaleEv", scope: !57, file: !51, line: 226, type: !60, scopeLine: 226, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!63 = !DISubprogram(name: "scaled_one", linkageName: "_ZN20FixedEWMAXParametersILj5ELj10EjiE10scaled_oneEv", scope: !57, file: !51, line: 232, type: !64, scopeLine: 232, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!64 = !DISubroutineType(types: !65)
!65 = !{!66}
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "value_type", scope: !57, file: !51, line: 215, baseType: !19)
!67 = !DISubprogram(name: "compensation", linkageName: "_ZN20FixedEWMAXParametersILj5ELj10EjiE12compensationEv", scope: !57, file: !51, line: 238, type: !60, scopeLine: 238, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!68 = !{!69, !70, !71, !72}
!69 = !DITemplateValueParameter(name: "STABILITY", type: !19, value: i32 5)
!70 = !DITemplateValueParameter(name: "SCALE", type: !19, value: i32 10)
!71 = !DITemplateTypeParameter(name: "T", type: !19)
!72 = !DITemplateTypeParameter(name: "U", type: !13)
!73 = !DISubprogram(name: "epoch", linkageName: "_ZN13IPRateMonitor14EWMAParameters5epochEv", scope: !54, file: !3, line: 83, type: !60, scopeLine: 83, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!74 = !DISubprogram(name: "epoch_frequency", linkageName: "_ZN13IPRateMonitor14EWMAParameters15epoch_frequencyEv", scope: !54, file: !3, line: 87, type: !60, scopeLine: 87, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_current_epoch", scope: !50, file: !51, line: 434, baseType: !19, size: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_current", scope: !50, file: !51, line: 435, baseType: !77, size: 64, offset: 32)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 64, elements: !79)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "value_type", scope: !50, file: !51, line: 375, baseType: !66)
!79 = !{!80}
!80 = !DISubrange(count: 2)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_avg", scope: !50, file: !51, line: 436, baseType: !82, size: 64, offset: 96)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 64, elements: !79)
!83 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "DirectEWMAX<IPRateMonitor::EWMAParameters>", file: !51, line: 74, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !84, templateParams: !417, identifier: "_ZTS11DirectEWMAXIN13IPRateMonitor14EWMAParametersEE")
!84 = !{!85, !86, !88, !92, !95, !100, !101, !102, !103, !104, !107, !416}
!85 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !83, baseType: !54, flags: DIFlagPublic, extraData: i32 0)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_avg", scope: !83, file: !51, line: 133, baseType: !87, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "value_type", scope: !83, file: !51, line: 76, baseType: !66)
!88 = !DISubprogram(name: "DirectEWMAX", scope: !83, file: !51, line: 79, type: !89, scopeLine: 79, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!89 = !DISubroutineType(types: !90)
!90 = !{null, !91}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!92 = !DISubprogram(name: "DirectEWMAX", scope: !83, file: !51, line: 84, type: !93, scopeLine: 84, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!93 = !DISubroutineType(types: !94)
!94 = !{null, !91, !87}
!95 = !DISubprogram(name: "scaled_average", linkageName: "_ZNK11DirectEWMAXIN13IPRateMonitor14EWMAParametersEE14scaled_averageEv", scope: !83, file: !51, line: 90, type: !96, scopeLine: 90, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!96 = !DISubroutineType(types: !97)
!97 = !{!87, !98}
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!99 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !83)
!100 = !DISubprogram(name: "unscaled_average", linkageName: "_ZNK11DirectEWMAXIN13IPRateMonitor14EWMAParametersEE16unscaled_averageEv", scope: !83, file: !51, line: 96, type: !96, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!101 = !DISubprogram(name: "clear", linkageName: "_ZN11DirectEWMAXIN13IPRateMonitor14EWMAParametersEE5clearEv", scope: !83, file: !51, line: 101, type: !89, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!102 = !DISubprogram(name: "assign", linkageName: "_ZN11DirectEWMAXIN13IPRateMonitor14EWMAParametersEE6assignEj", scope: !83, file: !51, line: 106, type: !93, scopeLine: 106, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!103 = !DISubprogram(name: "update", linkageName: "_ZN11DirectEWMAXIN13IPRateMonitor14EWMAParametersEE6updateEj", scope: !83, file: !51, line: 112, type: !93, scopeLine: 112, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!104 = !DISubprogram(name: "update_n", linkageName: "_ZN11DirectEWMAXIN13IPRateMonitor14EWMAParametersEE8update_nEjj", scope: !83, file: !51, line: 119, type: !105, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!105 = !DISubroutineType(types: !106)
!106 = !{null, !91, !87, !19}
!107 = !DISubprogram(name: "unparse", linkageName: "_ZNK11DirectEWMAXIN13IPRateMonitor14EWMAParametersEE7unparseEv", scope: !83, file: !51, line: 124, type: !108, scopeLine: 124, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!108 = !DISubroutineType(types: !109)
!109 = !{!110, !98}
!110 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "String", file: !111, line: 19, size: 192, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !112, identifier: "_ZTS6String")
!111 = !DIFile(filename: "../dummy_inc/click/string.hh", directory: "/home/john/projects/click/ir-dir")
!112 = !{!113, !119, !141, !142, !146, !150, !152, !153, !157, !162, !166, !169, !172, !178, !181, !184, !187, !190, !193, !196, !199, !203, !206, !210, !214, !218, !219, !222, !225, !226, !229, !232, !235, !242, !248, !252, !255, !256, !261, !264, !265, !269, !270, !273, !274, !277, !278, !281, !284, !287, !290, !293, !296, !299, !302, !305, !308, !311, !314, !315, !316, !317, !320, !323, !324, !325, !326, !327, !328, !329, !333, !336, !339, !342, !343, !344, !345, !346, !347, !350, !354, !355, !356, !357, !360, !361, !362, !363, !364, !365, !368, !369, !370, !371, !374, !377, !378, !381, !384, !387, !390, !393, !396, !399, !400, !401, !402, !405, !408, !411, !412, !413}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "bool_data", scope: !110, file: !111, line: 184, baseType: !114, flags: DIFlagPublic | DIFlagStaticMember)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 88, elements: !117)
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!116 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!117 = !{!118}
!118 = !DISubrange(count: 11)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !110, file: !111, line: 211, baseType: !120, size: 192)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rep_t", scope: !110, file: !111, line: 204, size: 192, flags: DIFlagTypePassByValue, elements: !121, identifier: "_ZTSN6String5rep_tE")
!121 = !{!122, !124, !125}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !120, file: !111, line: 205, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !120, file: !111, line: 206, baseType: !13, size: 32, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "memo", scope: !120, file: !111, line: 207, baseType: !126, size: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "memo_t", scope: !110, file: !111, line: 189, size: 160, flags: DIFlagTypePassByValue, elements: !128, identifier: "_ZTSN6String6memo_tE")
!128 = !{!129, !135, !136, !137}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !127, file: !111, line: 190, baseType: !130, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !132, line: 26, baseType: !133)
!132 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "")
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !134, line: 42, baseType: !19)
!134 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!135 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !127, file: !111, line: 191, baseType: !131, size: 32, offset: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !127, file: !111, line: 192, baseType: !130, size: 32, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "real_data", scope: !127, file: !111, line: 197, baseType: !138, size: 64, offset: 96)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 64, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 8)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "null_data", scope: !110, file: !111, line: 292, baseType: !115, flags: DIFlagStaticMember)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "oom_data", scope: !110, file: !111, line: 293, baseType: !143, flags: DIFlagStaticMember)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 120, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 15)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "int_data", scope: !110, file: !111, line: 294, baseType: !147, flags: DIFlagStaticMember)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 160, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 20)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "null_string_rep", scope: !110, file: !111, line: 295, baseType: !151, flags: DIFlagStaticMember)
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "oom_string_rep", scope: !110, file: !111, line: 296, baseType: !151, flags: DIFlagStaticMember)
!153 = !DISubprogram(name: "String", scope: !110, file: !111, line: 39, type: !154, scopeLine: 39, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!154 = !DISubroutineType(types: !155)
!155 = !{null, !156}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!157 = !DISubprogram(name: "String", scope: !110, file: !111, line: 40, type: !158, scopeLine: 40, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!158 = !DISubroutineType(types: !159)
!159 = !{null, !156, !160}
!160 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!162 = !DISubprogram(name: "String", scope: !110, file: !111, line: 42, type: !163, scopeLine: 42, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!163 = !DISubroutineType(types: !164)
!164 = !{null, !156, !165}
!165 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !110, size: 64)
!166 = !DISubprogram(name: "String", scope: !110, file: !111, line: 44, type: !167, scopeLine: 44, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!167 = !DISubroutineType(types: !168)
!168 = !{null, !156, !123}
!169 = !DISubprogram(name: "String", scope: !110, file: !111, line: 45, type: !170, scopeLine: 45, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!170 = !DISubroutineType(types: !171)
!171 = !{null, !156, !123, !13}
!172 = !DISubprogram(name: "String", scope: !110, file: !111, line: 46, type: !173, scopeLine: 46, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!173 = !DISubroutineType(types: !174)
!174 = !{null, !156, !175, !13}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !177)
!177 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!178 = !DISubprogram(name: "String", scope: !110, file: !111, line: 47, type: !179, scopeLine: 47, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!179 = !DISubroutineType(types: !180)
!180 = !{null, !156, !123, !123}
!181 = !DISubprogram(name: "String", scope: !110, file: !111, line: 48, type: !182, scopeLine: 48, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!182 = !DISubroutineType(types: !183)
!183 = !{null, !156, !175, !175}
!184 = !DISubprogram(name: "String", scope: !110, file: !111, line: 49, type: !185, scopeLine: 49, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!185 = !DISubroutineType(types: !186)
!186 = !{null, !156, !10}
!187 = !DISubprogram(name: "String", scope: !110, file: !111, line: 50, type: !188, scopeLine: 50, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!188 = !DISubroutineType(types: !189)
!189 = !{null, !156, !116}
!190 = !DISubprogram(name: "String", scope: !110, file: !111, line: 51, type: !191, scopeLine: 51, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!191 = !DISubroutineType(types: !192)
!192 = !{null, !156, !177}
!193 = !DISubprogram(name: "String", scope: !110, file: !111, line: 52, type: !194, scopeLine: 52, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!194 = !DISubroutineType(types: !195)
!195 = !{null, !156, !13}
!196 = !DISubprogram(name: "String", scope: !110, file: !111, line: 53, type: !197, scopeLine: 53, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!197 = !DISubroutineType(types: !198)
!198 = !{null, !156, !19}
!199 = !DISubprogram(name: "String", scope: !110, file: !111, line: 54, type: !200, scopeLine: 54, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!200 = !DISubroutineType(types: !201)
!201 = !{null, !156, !202}
!202 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!203 = !DISubprogram(name: "String", scope: !110, file: !111, line: 55, type: !204, scopeLine: 55, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!204 = !DISubroutineType(types: !205)
!205 = !{null, !156, !17}
!206 = !DISubprogram(name: "String", scope: !110, file: !111, line: 57, type: !207, scopeLine: 57, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!207 = !DISubroutineType(types: !208)
!208 = !{null, !156, !209}
!209 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!210 = !DISubprogram(name: "String", scope: !110, file: !111, line: 58, type: !211, scopeLine: 58, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!211 = !DISubroutineType(types: !212)
!212 = !{null, !156, !213}
!213 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!214 = !DISubprogram(name: "String", scope: !110, file: !111, line: 65, type: !215, scopeLine: 65, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!215 = !DISubroutineType(types: !216)
!216 = !{null, !156, !217}
!217 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!218 = !DISubprogram(name: "~String", scope: !110, file: !111, line: 67, type: !154, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!219 = !DISubprogram(name: "make_empty", linkageName: "_ZN6String10make_emptyEv", scope: !110, file: !111, line: 69, type: !220, scopeLine: 69, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!220 = !DISubroutineType(types: !221)
!221 = !{!160}
!222 = !DISubprogram(name: "make_uninitialized", linkageName: "_ZN6String18make_uninitializedEi", scope: !110, file: !111, line: 70, type: !223, scopeLine: 70, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!223 = !DISubroutineType(types: !224)
!224 = !{!110, !13}
!225 = !DISubprogram(name: "make_garbage", linkageName: "_ZN6String12make_garbageEi", scope: !110, file: !111, line: 71, type: !223, scopeLine: 71, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!226 = !DISubprogram(name: "make_stable", linkageName: "_ZN6String11make_stableEPKc", scope: !110, file: !111, line: 72, type: !227, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!227 = !DISubroutineType(types: !228)
!228 = !{!110, !123}
!229 = !DISubprogram(name: "make_stable", linkageName: "_ZN6String11make_stableEPKci", scope: !110, file: !111, line: 73, type: !230, scopeLine: 73, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!230 = !DISubroutineType(types: !231)
!231 = !{!110, !123, !13}
!232 = !DISubprogram(name: "make_stable", linkageName: "_ZN6String11make_stableEPKcS1_", scope: !110, file: !111, line: 74, type: !233, scopeLine: 74, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!233 = !DISubroutineType(types: !234)
!234 = !{!110, !123, !123}
!235 = !DISubprogram(name: "make_numeric", linkageName: "_ZN6String12make_numericElib", scope: !110, file: !111, line: 75, type: !236, scopeLine: 75, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!236 = !DISubroutineType(types: !237)
!237 = !{!110, !238, !13, !10}
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", scope: !110, file: !111, line: 27, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !240, line: 27, baseType: !241)
!240 = !DIFile(filename: "/usr/include/bits/stdint-intn.h", directory: "")
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !134, line: 44, baseType: !202)
!242 = !DISubprogram(name: "make_numeric", linkageName: "_ZN6String12make_numericEmib", scope: !110, file: !111, line: 76, type: !243, scopeLine: 76, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!243 = !DISubroutineType(types: !244)
!244 = !{!110, !245, !13, !10}
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", scope: !110, file: !111, line: 28, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !132, line: 27, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !134, line: 45, baseType: !17)
!248 = !DISubprogram(name: "data", linkageName: "_ZNK6String4dataEv", scope: !110, file: !111, line: 78, type: !249, scopeLine: 78, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!249 = !DISubroutineType(types: !250)
!250 = !{!123, !251}
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!252 = !DISubprogram(name: "length", linkageName: "_ZNK6String6lengthEv", scope: !110, file: !111, line: 79, type: !253, scopeLine: 79, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!253 = !DISubroutineType(types: !254)
!254 = !{!13, !251}
!255 = !DISubprogram(name: "c_str", linkageName: "_ZNK6String5c_strEv", scope: !110, file: !111, line: 81, type: !249, scopeLine: 81, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!256 = !DISubprogram(name: "operator int (String::*)() const", linkageName: "_ZNK6StringcvMS_KFivEEv", scope: !110, file: !111, line: 83, type: !257, scopeLine: 83, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!257 = !DISubroutineType(types: !258)
!258 = !{!259, !251}
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "unspecified_bool_type", scope: !110, file: !111, line: 24, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_ptr_to_member_type, baseType: !253, size: 128, extraData: !110)
!261 = !DISubprogram(name: "empty", linkageName: "_ZNK6String5emptyEv", scope: !110, file: !111, line: 84, type: !262, scopeLine: 84, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!262 = !DISubroutineType(types: !263)
!263 = !{!10, !251}
!264 = !DISubprogram(name: "operator!", linkageName: "_ZNK6StringntEv", scope: !110, file: !111, line: 85, type: !262, scopeLine: 85, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!265 = !DISubprogram(name: "begin", linkageName: "_ZNK6String5beginEv", scope: !110, file: !111, line: 87, type: !266, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!266 = !DISubroutineType(types: !267)
!267 = !{!268, !251}
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_iterator", scope: !110, file: !111, line: 21, baseType: !123)
!269 = !DISubprogram(name: "end", linkageName: "_ZNK6String3endEv", scope: !110, file: !111, line: 88, type: !266, scopeLine: 88, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!270 = !DISubprogram(name: "operator[]", linkageName: "_ZNK6StringixEi", scope: !110, file: !111, line: 90, type: !271, scopeLine: 90, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!271 = !DISubroutineType(types: !272)
!272 = !{!116, !251, !13}
!273 = !DISubprogram(name: "at", linkageName: "_ZNK6String2atEi", scope: !110, file: !111, line: 91, type: !271, scopeLine: 91, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!274 = !DISubprogram(name: "front", linkageName: "_ZNK6String5frontEv", scope: !110, file: !111, line: 92, type: !275, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!275 = !DISubroutineType(types: !276)
!276 = !{!116, !251}
!277 = !DISubprogram(name: "back", linkageName: "_ZNK6String4backEv", scope: !110, file: !111, line: 93, type: !275, scopeLine: 93, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!278 = !DISubprogram(name: "hashcode", linkageName: "_ZN6String8hashcodeEPKcS1_", scope: !110, file: !111, line: 95, type: !279, scopeLine: 95, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!279 = !DISubroutineType(types: !280)
!280 = !{!131, !123, !123}
!281 = !DISubprogram(name: "hashcode", linkageName: "_ZN6String8hashcodeEPKhS1_", scope: !110, file: !111, line: 96, type: !282, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!282 = !DISubroutineType(types: !283)
!283 = !{!131, !175, !175}
!284 = !DISubprogram(name: "hashcode", linkageName: "_ZNK6String8hashcodeEv", scope: !110, file: !111, line: 98, type: !285, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!285 = !DISubroutineType(types: !286)
!286 = !{!131, !251}
!287 = !DISubprogram(name: "substring", linkageName: "_ZNK6String9substringEPKcS1_", scope: !110, file: !111, line: 100, type: !288, scopeLine: 100, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!288 = !DISubroutineType(types: !289)
!289 = !{!110, !251, !123, !123}
!290 = !DISubprogram(name: "substring", linkageName: "_ZNK6String9substringEii", scope: !110, file: !111, line: 101, type: !291, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!291 = !DISubroutineType(types: !292)
!292 = !{!110, !251, !13, !13}
!293 = !DISubprogram(name: "substring", linkageName: "_ZNK6String9substringEi", scope: !110, file: !111, line: 102, type: !294, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!294 = !DISubroutineType(types: !295)
!295 = !{!110, !251, !13}
!296 = !DISubprogram(name: "trim_space", linkageName: "_ZNK6String10trim_spaceEv", scope: !110, file: !111, line: 103, type: !297, scopeLine: 103, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!297 = !DISubroutineType(types: !298)
!298 = !{!110, !251}
!299 = !DISubprogram(name: "equals", linkageName: "_ZNK6String6equalsERKS_", scope: !110, file: !111, line: 105, type: !300, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!300 = !DISubroutineType(types: !301)
!301 = !{!10, !251, !160}
!302 = !DISubprogram(name: "equals", linkageName: "_ZNK6String6equalsEPKci", scope: !110, file: !111, line: 106, type: !303, scopeLine: 106, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!303 = !DISubroutineType(types: !304)
!304 = !{!10, !251, !123, !13}
!305 = !DISubprogram(name: "compare", linkageName: "_ZN6String7compareERKS_S1_", scope: !110, file: !111, line: 107, type: !306, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!306 = !DISubroutineType(types: !307)
!307 = !{!13, !160, !160}
!308 = !DISubprogram(name: "compare", linkageName: "_ZNK6String7compareERKS_", scope: !110, file: !111, line: 108, type: !309, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!309 = !DISubroutineType(types: !310)
!310 = !{!13, !251, !160}
!311 = !DISubprogram(name: "compare", linkageName: "_ZNK6String7compareEPKci", scope: !110, file: !111, line: 109, type: !312, scopeLine: 109, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!312 = !DISubroutineType(types: !313)
!313 = !{!13, !251, !123, !13}
!314 = !DISubprogram(name: "starts_with", linkageName: "_ZNK6String11starts_withERKS_", scope: !110, file: !111, line: 110, type: !300, scopeLine: 110, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!315 = !DISubprogram(name: "starts_with", linkageName: "_ZNK6String11starts_withEPKci", scope: !110, file: !111, line: 111, type: !303, scopeLine: 111, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!316 = !DISubprogram(name: "glob_match", linkageName: "_ZNK6String10glob_matchERKS_", scope: !110, file: !111, line: 112, type: !300, scopeLine: 112, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!317 = !DISubprogram(name: "find_left", linkageName: "_ZNK6String9find_leftEci", scope: !110, file: !111, line: 125, type: !318, scopeLine: 125, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!318 = !DISubroutineType(types: !319)
!319 = !{!13, !251, !116, !13}
!320 = !DISubprogram(name: "find_left", linkageName: "_ZNK6String9find_leftERKS_i", scope: !110, file: !111, line: 126, type: !321, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!321 = !DISubroutineType(types: !322)
!322 = !{!13, !251, !160, !13}
!323 = !DISubprogram(name: "find_right", linkageName: "_ZNK6String10find_rightEci", scope: !110, file: !111, line: 127, type: !318, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!324 = !DISubprogram(name: "lower", linkageName: "_ZNK6String5lowerEv", scope: !110, file: !111, line: 129, type: !297, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!325 = !DISubprogram(name: "upper", linkageName: "_ZNK6String5upperEv", scope: !110, file: !111, line: 130, type: !297, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!326 = !DISubprogram(name: "printable", linkageName: "_ZNK6String9printableEv", scope: !110, file: !111, line: 131, type: !297, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!327 = !DISubprogram(name: "quoted_hex", linkageName: "_ZNK6String10quoted_hexEv", scope: !110, file: !111, line: 132, type: !297, scopeLine: 132, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!328 = !DISubprogram(name: "encode_json", linkageName: "_ZNK6String11encode_jsonEv", scope: !110, file: !111, line: 133, type: !297, scopeLine: 133, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!329 = !DISubprogram(name: "operator=", linkageName: "_ZN6StringaSERKS_", scope: !110, file: !111, line: 135, type: !330, scopeLine: 135, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!330 = !DISubroutineType(types: !331)
!331 = !{!332, !156, !160}
!332 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !110, size: 64)
!333 = !DISubprogram(name: "operator=", linkageName: "_ZN6StringaSEOS_", scope: !110, file: !111, line: 137, type: !334, scopeLine: 137, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!334 = !DISubroutineType(types: !335)
!335 = !{!332, !156, !165}
!336 = !DISubprogram(name: "operator=", linkageName: "_ZN6StringaSEPKc", scope: !110, file: !111, line: 139, type: !337, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!337 = !DISubroutineType(types: !338)
!338 = !{!332, !156, !123}
!339 = !DISubprogram(name: "swap", linkageName: "_ZN6String4swapERS_", scope: !110, file: !111, line: 141, type: !340, scopeLine: 141, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!340 = !DISubroutineType(types: !341)
!341 = !{null, !156, !332}
!342 = !DISubprogram(name: "append", linkageName: "_ZN6String6appendERKS_", scope: !110, file: !111, line: 143, type: !158, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!343 = !DISubprogram(name: "append", linkageName: "_ZN6String6appendEPKc", scope: !110, file: !111, line: 144, type: !167, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!344 = !DISubprogram(name: "append", linkageName: "_ZN6String6appendEPKci", scope: !110, file: !111, line: 145, type: !170, scopeLine: 145, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!345 = !DISubprogram(name: "append", linkageName: "_ZN6String6appendEPKcS1_", scope: !110, file: !111, line: 146, type: !179, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!346 = !DISubprogram(name: "append", linkageName: "_ZN6String6appendEc", scope: !110, file: !111, line: 147, type: !188, scopeLine: 147, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!347 = !DISubprogram(name: "append_fill", linkageName: "_ZN6String11append_fillEii", scope: !110, file: !111, line: 148, type: !348, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!348 = !DISubroutineType(types: !349)
!349 = !{null, !156, !13, !13}
!350 = !DISubprogram(name: "append_uninitialized", linkageName: "_ZN6String20append_uninitializedEi", scope: !110, file: !111, line: 149, type: !351, scopeLine: 149, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!351 = !DISubroutineType(types: !352)
!352 = !{!353, !156, !13}
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!354 = !DISubprogram(name: "append_garbage", linkageName: "_ZN6String14append_garbageEi", scope: !110, file: !111, line: 150, type: !351, scopeLine: 150, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!355 = !DISubprogram(name: "operator+=", linkageName: "_ZN6StringpLERKS_", scope: !110, file: !111, line: 152, type: !330, scopeLine: 152, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!356 = !DISubprogram(name: "operator+=", linkageName: "_ZN6StringpLEPKc", scope: !110, file: !111, line: 153, type: !337, scopeLine: 153, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!357 = !DISubprogram(name: "operator+=", linkageName: "_ZN6StringpLEc", scope: !110, file: !111, line: 154, type: !358, scopeLine: 154, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!358 = !DISubroutineType(types: !359)
!359 = !{!332, !156, !116}
!360 = !DISubprogram(name: "is_shared", linkageName: "_ZNK6String9is_sharedEv", scope: !110, file: !111, line: 160, type: !262, scopeLine: 160, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!361 = !DISubprogram(name: "is_stable", linkageName: "_ZNK6String9is_stableEv", scope: !110, file: !111, line: 161, type: !262, scopeLine: 161, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!362 = !DISubprogram(name: "unique", linkageName: "_ZNK6String6uniqueEv", scope: !110, file: !111, line: 163, type: !297, scopeLine: 163, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!363 = !DISubprogram(name: "unshared", linkageName: "_ZNK6String8unsharedEv", scope: !110, file: !111, line: 164, type: !297, scopeLine: 164, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!364 = !DISubprogram(name: "compact", linkageName: "_ZNK6String7compactEv", scope: !110, file: !111, line: 165, type: !297, scopeLine: 165, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!365 = !DISubprogram(name: "mutable_data", linkageName: "_ZN6String12mutable_dataEv", scope: !110, file: !111, line: 167, type: !366, scopeLine: 167, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!366 = !DISubroutineType(types: !367)
!367 = !{!353, !156}
!368 = !DISubprogram(name: "mutable_c_str", linkageName: "_ZN6String13mutable_c_strEv", scope: !110, file: !111, line: 168, type: !366, scopeLine: 168, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!369 = !DISubprogram(name: "make_out_of_memory", linkageName: "_ZN6String18make_out_of_memoryEv", scope: !110, file: !111, line: 170, type: !220, scopeLine: 170, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!370 = !DISubprogram(name: "out_of_memory", linkageName: "_ZNK6String13out_of_memoryEv", scope: !110, file: !111, line: 171, type: !262, scopeLine: 171, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!371 = !DISubprogram(name: "out_of_memory_data", linkageName: "_ZN6String18out_of_memory_dataEv", scope: !110, file: !111, line: 172, type: !372, scopeLine: 172, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!372 = !DISubroutineType(types: !373)
!373 = !{!123}
!374 = !DISubprogram(name: "out_of_memory_length", linkageName: "_ZN6String20out_of_memory_lengthEv", scope: !110, file: !111, line: 173, type: !375, scopeLine: 173, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!375 = !DISubroutineType(types: !376)
!376 = !{!13}
!377 = !DISubprogram(name: "empty_data", linkageName: "_ZN6String10empty_dataEv", scope: !110, file: !111, line: 174, type: !372, scopeLine: 174, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!378 = !DISubprogram(name: "skip_utf8_char", linkageName: "_ZN6String14skip_utf8_charEPKcS1_", scope: !110, file: !111, line: 180, type: !379, scopeLine: 180, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!379 = !DISubroutineType(types: !380)
!380 = !{!123, !123, !123}
!381 = !DISubprogram(name: "skip_utf8_char", linkageName: "_ZN6String14skip_utf8_charEPKhS1_", scope: !110, file: !111, line: 181, type: !382, scopeLine: 181, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!382 = !DISubroutineType(types: !383)
!383 = !{!175, !175, !175}
!384 = !DISubprogram(name: "assign_memo", linkageName: "_ZNK6String11assign_memoEPKciPNS_6memo_tE", scope: !110, file: !111, line: 256, type: !385, scopeLine: 256, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!385 = !DISubroutineType(types: !386)
!386 = !{null, !251, !123, !13, !126}
!387 = !DISubprogram(name: "String", scope: !110, file: !111, line: 263, type: !388, scopeLine: 263, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!388 = !DISubroutineType(types: !389)
!389 = !{null, !156, !123, !13, !126}
!390 = !DISubprogram(name: "assign", linkageName: "_ZNK6String6assignERKS_", scope: !110, file: !111, line: 267, type: !391, scopeLine: 267, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!391 = !DISubroutineType(types: !392)
!392 = !{null, !251, !160}
!393 = !DISubprogram(name: "deref", linkageName: "_ZNK6String5derefEv", scope: !110, file: !111, line: 271, type: !394, scopeLine: 271, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!394 = !DISubroutineType(types: !395)
!395 = !{null, !251}
!396 = !DISubprogram(name: "assign", linkageName: "_ZN6String6assignEPKcib", scope: !110, file: !111, line: 280, type: !397, scopeLine: 280, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!397 = !DISubroutineType(types: !398)
!398 = !{null, !156, !123, !13, !10}
!399 = !DISubprogram(name: "assign_out_of_memory", linkageName: "_ZN6String20assign_out_of_memoryEv", scope: !110, file: !111, line: 281, type: !154, scopeLine: 281, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!400 = !DISubprogram(name: "append", linkageName: "_ZN6String6appendEPKciPNS_6memo_tE", scope: !110, file: !111, line: 282, type: !388, scopeLine: 282, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!401 = !DISubprogram(name: "hard_make_stable", linkageName: "_ZN6String16hard_make_stableEPKci", scope: !110, file: !111, line: 283, type: !230, scopeLine: 283, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!402 = !DISubprogram(name: "absent_memo", linkageName: "_ZN6String11absent_memoEv", scope: !110, file: !111, line: 284, type: !403, scopeLine: 284, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!403 = !DISubroutineType(types: !404)
!404 = !{!126}
!405 = !DISubprogram(name: "create_memo", linkageName: "_ZN6String11create_memoEPcii", scope: !110, file: !111, line: 287, type: !406, scopeLine: 287, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!406 = !DISubroutineType(types: !407)
!407 = !{!126, !353, !13, !13}
!408 = !DISubprogram(name: "delete_memo", linkageName: "_ZN6String11delete_memoEPNS_6memo_tE", scope: !110, file: !111, line: 288, type: !409, scopeLine: 288, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!409 = !DISubroutineType(types: !410)
!410 = !{null, !126}
!411 = !DISubprogram(name: "hard_c_str", linkageName: "_ZNK6String10hard_c_strEv", scope: !110, file: !111, line: 289, type: !249, scopeLine: 289, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!412 = !DISubprogram(name: "hard_equals", linkageName: "_ZNK6String11hard_equalsEPKci", scope: !110, file: !111, line: 290, type: !303, scopeLine: 290, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!413 = !DISubprogram(name: "make_claim", linkageName: "_ZN6String10make_claimEPcii", scope: !110, file: !111, line: 299, type: !414, scopeLine: 299, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!414 = !DISubroutineType(types: !415)
!415 = !{!110, !353, !13, !13}
!416 = !DISubprogram(name: "update_with", linkageName: "_ZN11DirectEWMAXIN13IPRateMonitor14EWMAParametersEE11update_withEj", scope: !83, file: !51, line: 129, type: !93, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!417 = !{!418}
!418 = !DITemplateTypeParameter(name: "P", type: !54)
!419 = !DISubprogram(name: "RateEWMAX", scope: !50, file: !51, line: 379, type: !420, scopeLine: 379, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!420 = !DISubroutineType(types: !421)
!421 = !{null, !422}
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!423 = !DISubprogram(name: "scaled_average", linkageName: "_ZNK9RateEWMAXIN13IPRateMonitor14EWMAParametersEE14scaled_averageEj", scope: !50, file: !51, line: 392, type: !424, scopeLine: 392, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!424 = !DISubroutineType(types: !425)
!425 = !{!426, !428, !19}
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "signed_value_type", scope: !50, file: !51, line: 376, baseType: !427)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "signed_value_type", scope: !57, file: !51, line: 216, baseType: !13)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!429 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!430 = !DISubprogram(name: "scale", linkageName: "_ZNK9RateEWMAXIN13IPRateMonitor14EWMAParametersEE5scaleEj", scope: !50, file: !51, line: 399, type: !431, scopeLine: 399, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!431 = !DISubroutineType(types: !432)
!432 = !{!19, !428, !19}
!433 = !DISubprogram(name: "rate", linkageName: "_ZNK9RateEWMAXIN13IPRateMonitor14EWMAParametersEE4rateEj", scope: !50, file: !51, line: 410, type: !434, scopeLine: 410, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!434 = !DISubroutineType(types: !435)
!435 = !{!13, !428, !19}
!436 = !DISubprogram(name: "update", linkageName: "_ZN9RateEWMAXIN13IPRateMonitor14EWMAParametersEE6updateEij", scope: !50, file: !51, line: 420, type: !437, scopeLine: 420, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!437 = !DISubroutineType(types: !438)
!438 = !{null, !422, !426, !19}
!439 = !DISubprogram(name: "unparse_rate", linkageName: "_ZNK9RateEWMAXIN13IPRateMonitor14EWMAParametersEE12unparse_rateEj", scope: !50, file: !51, line: 430, type: !440, scopeLine: 430, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!440 = !DISubroutineType(types: !441)
!441 = !{!110, !428, !19}
!442 = !DISubprogram(name: "update_time", linkageName: "_ZN9RateEWMAXIN13IPRateMonitor14EWMAParametersEE11update_timeEj", scope: !50, file: !51, line: 438, type: !443, scopeLine: 438, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!443 = !DISubroutineType(types: !444)
!444 = !{null, !422, !19}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "next_level", scope: !46, file: !3, line: 120, baseType: !41, size: 64, offset: 192)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "anno_this", scope: !46, file: !3, line: 121, baseType: !19, size: 32, offset: 256)
!447 = !DISubprogram(name: "Counter", scope: !46, file: !3, line: 122, type: !448, scopeLine: 122, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!448 = !DISubroutineType(types: !449)
!449 = !{null, !450}
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!451 = !DISubprogram(name: "Counter", scope: !46, file: !3, line: 125, type: !452, scopeLine: 125, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!452 = !DISubroutineType(types: !453)
!453 = !{null, !450, !454}
!454 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "_prev", scope: !42, file: !3, line: 135, baseType: !41, size: 64, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !42, file: !3, line: 135, baseType: !41, size: 64, offset: 128)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !42, file: !3, line: 137, baseType: !459, size: 16384, offset: 192)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 16384, elements: !460)
!460 = !{!461}
!461 = !DISubrange(count: 256)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "_rm", scope: !42, file: !3, line: 142, baseType: !463, size: 64, offset: 16576, flags: DIFlagPrivate)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!464 = !DISubprogram(name: "Stats", scope: !42, file: !3, line: 138, type: !465, scopeLine: 138, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!465 = !DISubroutineType(types: !466)
!466 = !{null, !467, !463}
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!468 = !DISubprogram(name: "~Stats", scope: !42, file: !3, line: 139, type: !469, scopeLine: 139, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!469 = !DISubroutineType(types: !470)
!470 = !{null, !467}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "_resettime", scope: !4, file: !3, line: 168, baseType: !17, size: 64, offset: 1216)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_alloced_mem", scope: !4, file: !3, line: 169, baseType: !15, size: 64, offset: 1280)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_first", scope: !4, file: !3, line: 170, baseType: !41, size: 64, offset: 1344)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_last", scope: !4, file: !3, line: 170, baseType: !41, size: 64, offset: 1408)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "_prev_deleted", scope: !4, file: !3, line: 172, baseType: !41, size: 64, offset: 1472)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "_next_deleted", scope: !4, file: !3, line: 172, baseType: !41, size: 64, offset: 1536)
!477 = !DISubprogram(name: "IPRateMonitor", scope: !4, file: !3, line: 93, type: !478, scopeLine: 93, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!478 = !DISubroutineType(types: !479)
!479 = !{null, !480}
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!481 = !DISubprogram(name: "~IPRateMonitor", scope: !4, file: !3, line: 94, type: !478, scopeLine: 94, containingType: !4, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!482 = !DISubprogram(name: "class_name", linkageName: "_ZNK13IPRateMonitor10class_nameEv", scope: !4, file: !3, line: 96, type: !483, scopeLine: 96, containingType: !4, virtualIndex: 9, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!483 = !DISubroutineType(types: !484)
!484 = !{!123, !485}
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!486 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!487 = !DISubprogram(name: "port_count", linkageName: "_ZNK13IPRateMonitor10port_countEv", scope: !4, file: !3, line: 97, type: !483, scopeLine: 97, containingType: !4, virtualIndex: 10, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!488 = !DISubprogram(name: "configure", linkageName: "_ZN13IPRateMonitor9configureER6VectorI6StringEP12ErrorHandler", scope: !4, file: !3, line: 99, type: !489, scopeLine: 99, containingType: !4, virtualIndex: 17, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!489 = !DISubroutineType(types: !490)
!490 = !{!13, !480, !491, !686}
!491 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !492, size: 64)
!492 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Vector<String>", file: !493, line: 111, size: 128, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !494, templateParams: !529, identifier: "_ZTS6VectorI6StringE")
!493 = !DIFile(filename: "../dummy_inc/click/vector.hh", directory: "/home/john/projects/click/ir-dir")
!494 = !{!495, !582, !586, !599, !604, !608, !611, !614, !617, !621, !622, !627, !628, !629, !630, !633, !634, !637, !638, !641, !644, !647, !648, !649, !652, !655, !656, !657, !658, !659, !660, !661, !664, !667, !670, !671, !672, !673, !676, !679, !682, !683}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "vm_", scope: !492, file: !493, line: 114, baseType: !496, size: 128)
!496 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "vector_memory<typed_array_memory<String> >", file: !493, line: 11, size: 128, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !497, templateParams: !580, identifier: "_ZTS13vector_memoryI18typed_array_memoryI6StringEE")
!497 = !{!498, !531, !533, !534, !541, !545, !546, !550, !553, !554, !558, !559, !562, !565, !568, !571, !572, !573, !576}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "l_", scope: !496, file: !493, line: 68, baseType: !499, size: 64, flags: DIFlagPublic)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "type", scope: !496, file: !493, line: 13, baseType: !501)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "type", scope: !503, file: !502, line: 58, baseType: !110)
!502 = !DIFile(filename: "../dummy_inc/click/array_memory.hh", directory: "/home/john/projects/click/ir-dir")
!503 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "typed_array_memory<String>", file: !502, line: 57, size: 8, flags: DIFlagTypePassByValue, elements: !504, templateParams: !529, identifier: "_ZTS18typed_array_memoryI6StringE")
!504 = !{!505, !509, !513, !516, !519, !522, !523, !524, !527, !528}
!505 = !DISubprogram(name: "cast", linkageName: "_ZN18typed_array_memoryI6StringE4castEPS0_", scope: !503, file: !502, line: 59, type: !506, scopeLine: 59, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!506 = !DISubroutineType(types: !507)
!507 = !{!508, !508}
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!509 = !DISubprogram(name: "cast", linkageName: "_ZN18typed_array_memoryI6StringE4castEPKS0_", scope: !503, file: !502, line: 62, type: !510, scopeLine: 62, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!510 = !DISubroutineType(types: !511)
!511 = !{!512, !512}
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!513 = !DISubprogram(name: "fill", linkageName: "_ZN18typed_array_memoryI6StringE4fillEPS0_mPKS0_", scope: !503, file: !502, line: 65, type: !514, scopeLine: 65, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!514 = !DISubroutineType(types: !515)
!515 = !{null, !508, !15, !512}
!516 = !DISubprogram(name: "move_construct", linkageName: "_ZN18typed_array_memoryI6StringE14move_constructEPS0_S2_", scope: !503, file: !502, line: 69, type: !517, scopeLine: 69, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!517 = !DISubroutineType(types: !518)
!518 = !{null, !508, !508}
!519 = !DISubprogram(name: "copy", linkageName: "_ZN18typed_array_memoryI6StringE4copyEPS0_PKS0_m", scope: !503, file: !502, line: 76, type: !520, scopeLine: 76, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!520 = !DISubroutineType(types: !521)
!521 = !{null, !508, !512, !15}
!522 = !DISubprogram(name: "move", linkageName: "_ZN18typed_array_memoryI6StringE4moveEPS0_PKS0_m", scope: !503, file: !502, line: 80, type: !520, scopeLine: 80, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!523 = !DISubprogram(name: "move_onto", linkageName: "_ZN18typed_array_memoryI6StringE9move_ontoEPS0_PKS0_m", scope: !503, file: !502, line: 93, type: !520, scopeLine: 93, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!524 = !DISubprogram(name: "destroy", linkageName: "_ZN18typed_array_memoryI6StringE7destroyEPS0_m", scope: !503, file: !502, line: 106, type: !525, scopeLine: 106, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!525 = !DISubroutineType(types: !526)
!526 = !{null, !508, !15}
!527 = !DISubprogram(name: "mark_noaccess", linkageName: "_ZN18typed_array_memoryI6StringE13mark_noaccessEPS0_m", scope: !503, file: !502, line: 110, type: !525, scopeLine: 110, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!528 = !DISubprogram(name: "mark_undefined", linkageName: "_ZN18typed_array_memoryI6StringE14mark_undefinedEPS0_m", scope: !503, file: !502, line: 113, type: !525, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!529 = !{!530}
!530 = !DITemplateTypeParameter(name: "T", type: !110)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "n_", scope: !496, file: !493, line: 69, baseType: !532, size: 32, offset: 64, flags: DIFlagPublic)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", file: !493, line: 12, baseType: !13)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "capacity_", scope: !496, file: !493, line: 70, baseType: !532, size: 32, offset: 96, flags: DIFlagPublic)
!534 = !DISubprogram(name: "need_argument_copy", linkageName: "_ZNK13vector_memoryI18typed_array_memoryI6StringEE18need_argument_copyEPKS1_", scope: !496, file: !493, line: 15, type: !535, scopeLine: 15, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!535 = !DISubroutineType(types: !536)
!536 = !{!10, !537, !539}
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!538 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !496)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !500)
!541 = !DISubprogram(name: "vector_memory", scope: !496, file: !493, line: 20, type: !542, scopeLine: 20, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!542 = !DISubroutineType(types: !543)
!543 = !{null, !544}
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!545 = !DISubprogram(name: "~vector_memory", scope: !496, file: !493, line: 23, type: !542, scopeLine: 23, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!546 = !DISubprogram(name: "assign", linkageName: "_ZN13vector_memoryI18typed_array_memoryI6StringEE6assignERKS3_", scope: !496, file: !493, line: 25, type: !547, scopeLine: 25, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!547 = !DISubroutineType(types: !548)
!548 = !{null, !544, !549}
!549 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !538, size: 64)
!550 = !DISubprogram(name: "assign", linkageName: "_ZN13vector_memoryI18typed_array_memoryI6StringEE6assignEiPKS1_", scope: !496, file: !493, line: 26, type: !551, scopeLine: 26, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!551 = !DISubroutineType(types: !552)
!552 = !{null, !544, !532, !539}
!553 = !DISubprogram(name: "resize", linkageName: "_ZN13vector_memoryI18typed_array_memoryI6StringEE6resizeEiPKS1_", scope: !496, file: !493, line: 27, type: !551, scopeLine: 27, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!554 = !DISubprogram(name: "begin", linkageName: "_ZN13vector_memoryI18typed_array_memoryI6StringEE5beginEv", scope: !496, file: !493, line: 28, type: !555, scopeLine: 28, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!555 = !DISubroutineType(types: !556)
!556 = !{!557, !544}
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "iterator", scope: !496, file: !493, line: 14, baseType: !499)
!558 = !DISubprogram(name: "end", linkageName: "_ZN13vector_memoryI18typed_array_memoryI6StringEE3endEv", scope: !496, file: !493, line: 31, type: !555, scopeLine: 31, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!559 = !DISubprogram(name: "insert", linkageName: "_ZN13vector_memoryI18typed_array_memoryI6StringEE6insertEPS1_PKS1_", scope: !496, file: !493, line: 34, type: !560, scopeLine: 34, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!560 = !DISubroutineType(types: !561)
!561 = !{!557, !544, !557, !539}
!562 = !DISubprogram(name: "erase", linkageName: "_ZN13vector_memoryI18typed_array_memoryI6StringEE5eraseEPS1_S4_", scope: !496, file: !493, line: 35, type: !563, scopeLine: 35, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!563 = !DISubroutineType(types: !564)
!564 = !{!557, !544, !557, !557}
!565 = !DISubprogram(name: "push_back", linkageName: "_ZN13vector_memoryI18typed_array_memoryI6StringEE9push_backEPKS1_", scope: !496, file: !493, line: 36, type: !566, scopeLine: 36, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!566 = !DISubroutineType(types: !567)
!567 = !{null, !544, !539}
!568 = !DISubprogram(name: "move_construct_back", linkageName: "_ZN13vector_memoryI18typed_array_memoryI6StringEE19move_construct_backEPS1_", scope: !496, file: !493, line: 45, type: !569, scopeLine: 45, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!569 = !DISubroutineType(types: !570)
!570 = !{null, !544, !499}
!571 = !DISubprogram(name: "pop_back", linkageName: "_ZN13vector_memoryI18typed_array_memoryI6StringEE8pop_backEv", scope: !496, file: !493, line: 54, type: !542, scopeLine: 54, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!572 = !DISubprogram(name: "clear", linkageName: "_ZN13vector_memoryI18typed_array_memoryI6StringEE5clearEv", scope: !496, file: !493, line: 60, type: !542, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!573 = !DISubprogram(name: "reserve_and_push_back", linkageName: "_ZN13vector_memoryI18typed_array_memoryI6StringEE21reserve_and_push_backEiPKS1_", scope: !496, file: !493, line: 65, type: !574, scopeLine: 65, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!574 = !DISubroutineType(types: !575)
!575 = !{!10, !544, !532, !539}
!576 = !DISubprogram(name: "swap", linkageName: "_ZN13vector_memoryI18typed_array_memoryI6StringEE4swapERS3_", scope: !496, file: !493, line: 66, type: !577, scopeLine: 66, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!577 = !DISubroutineType(types: !578)
!578 = !{null, !544, !579}
!579 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !496, size: 64)
!580 = !{!581}
!581 = !DITemplateTypeParameter(name: "AM", type: !503)
!582 = !DISubprogram(name: "Vector", scope: !492, file: !493, line: 137, type: !583, scopeLine: 137, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!583 = !DISubroutineType(types: !584)
!584 = !{null, !585}
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!586 = !DISubprogram(name: "Vector", scope: !492, file: !493, line: 138, type: !587, scopeLine: 138, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!587 = !DISubroutineType(types: !588)
!588 = !{null, !585, !589, !590}
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", file: !493, line: 128, baseType: !13)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "value_argument_type", scope: !492, file: !493, line: 125, baseType: !591)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "type", scope: !593, file: !592, line: 150, baseType: !160)
!592 = !DIFile(filename: "../dummy_inc/click/type_traits.hh", directory: "/home/john/projects/click/ir-dir")
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fast_argument<String, true>", file: !592, line: 148, size: 8, flags: DIFlagTypePassByValue, elements: !594, templateParams: !597, identifier: "_ZTS13fast_argumentI6StringLb1EE")
!594 = !{!595}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "is_reference", scope: !593, file: !592, line: 149, baseType: !596, flags: DIFlagStaticMember, extraData: i1 true)
!596 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!597 = !{!530, !598}
!598 = !DITemplateValueParameter(name: "use_reference", type: !10, value: i8 1)
!599 = !DISubprogram(name: "Vector", scope: !492, file: !493, line: 139, type: !600, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!600 = !DISubroutineType(types: !601)
!601 = !{null, !585, !602}
!602 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !492)
!604 = !DISubprogram(name: "Vector", scope: !492, file: !493, line: 141, type: !605, scopeLine: 141, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!605 = !DISubroutineType(types: !606)
!606 = !{null, !585, !607}
!607 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !492, size: 64)
!608 = !DISubprogram(name: "operator=", linkageName: "_ZN6VectorI6StringEaSERKS1_", scope: !492, file: !493, line: 144, type: !609, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!609 = !DISubroutineType(types: !610)
!610 = !{!491, !585, !602}
!611 = !DISubprogram(name: "operator=", linkageName: "_ZN6VectorI6StringEaSEOS1_", scope: !492, file: !493, line: 146, type: !612, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!612 = !DISubroutineType(types: !613)
!613 = !{!491, !585, !607}
!614 = !DISubprogram(name: "assign", linkageName: "_ZN6VectorI6StringE6assignEiRKS0_", scope: !492, file: !493, line: 148, type: !615, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!615 = !DISubroutineType(types: !616)
!616 = !{!491, !585, !589, !590}
!617 = !DISubprogram(name: "begin", linkageName: "_ZN6VectorI6StringE5beginEv", scope: !492, file: !493, line: 150, type: !618, scopeLine: 150, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!618 = !DISubroutineType(types: !619)
!619 = !{!620, !585}
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "iterator", scope: !492, file: !493, line: 130, baseType: !508)
!621 = !DISubprogram(name: "end", linkageName: "_ZN6VectorI6StringE3endEv", scope: !492, file: !493, line: 151, type: !618, scopeLine: 151, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!622 = !DISubprogram(name: "begin", linkageName: "_ZNK6VectorI6StringE5beginEv", scope: !492, file: !493, line: 152, type: !623, scopeLine: 152, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!623 = !DISubroutineType(types: !624)
!624 = !{!625, !626}
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_iterator", scope: !492, file: !493, line: 131, baseType: !512)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!627 = !DISubprogram(name: "end", linkageName: "_ZNK6VectorI6StringE3endEv", scope: !492, file: !493, line: 153, type: !623, scopeLine: 153, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!628 = !DISubprogram(name: "cbegin", linkageName: "_ZNK6VectorI6StringE6cbeginEv", scope: !492, file: !493, line: 154, type: !623, scopeLine: 154, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!629 = !DISubprogram(name: "cend", linkageName: "_ZNK6VectorI6StringE4cendEv", scope: !492, file: !493, line: 155, type: !623, scopeLine: 155, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!630 = !DISubprogram(name: "size", linkageName: "_ZNK6VectorI6StringE4sizeEv", scope: !492, file: !493, line: 157, type: !631, scopeLine: 157, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!631 = !DISubroutineType(types: !632)
!632 = !{!589, !626}
!633 = !DISubprogram(name: "capacity", linkageName: "_ZNK6VectorI6StringE8capacityEv", scope: !492, file: !493, line: 158, type: !631, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!634 = !DISubprogram(name: "empty", linkageName: "_ZNK6VectorI6StringE5emptyEv", scope: !492, file: !493, line: 159, type: !635, scopeLine: 159, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!635 = !DISubroutineType(types: !636)
!636 = !{!10, !626}
!637 = !DISubprogram(name: "resize", linkageName: "_ZN6VectorI6StringE6resizeEiRKS0_", scope: !492, file: !493, line: 160, type: !587, scopeLine: 160, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!638 = !DISubprogram(name: "reserve", linkageName: "_ZN6VectorI6StringE7reserveEi", scope: !492, file: !493, line: 161, type: !639, scopeLine: 161, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!639 = !DISubroutineType(types: !640)
!640 = !{!10, !585, !589}
!641 = !DISubprogram(name: "operator[]", linkageName: "_ZN6VectorI6StringEixEi", scope: !492, file: !493, line: 163, type: !642, scopeLine: 163, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!642 = !DISubroutineType(types: !643)
!643 = !{!332, !585, !589}
!644 = !DISubprogram(name: "operator[]", linkageName: "_ZNK6VectorI6StringEixEi", scope: !492, file: !493, line: 164, type: !645, scopeLine: 164, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!645 = !DISubroutineType(types: !646)
!646 = !{!160, !626, !589}
!647 = !DISubprogram(name: "at", linkageName: "_ZN6VectorI6StringE2atEi", scope: !492, file: !493, line: 165, type: !642, scopeLine: 165, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!648 = !DISubprogram(name: "at", linkageName: "_ZNK6VectorI6StringE2atEi", scope: !492, file: !493, line: 166, type: !645, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!649 = !DISubprogram(name: "front", linkageName: "_ZN6VectorI6StringE5frontEv", scope: !492, file: !493, line: 167, type: !650, scopeLine: 167, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!650 = !DISubroutineType(types: !651)
!651 = !{!332, !585}
!652 = !DISubprogram(name: "front", linkageName: "_ZNK6VectorI6StringE5frontEv", scope: !492, file: !493, line: 168, type: !653, scopeLine: 168, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!653 = !DISubroutineType(types: !654)
!654 = !{!160, !626}
!655 = !DISubprogram(name: "back", linkageName: "_ZN6VectorI6StringE4backEv", scope: !492, file: !493, line: 169, type: !650, scopeLine: 169, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!656 = !DISubprogram(name: "back", linkageName: "_ZNK6VectorI6StringE4backEv", scope: !492, file: !493, line: 170, type: !653, scopeLine: 170, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!657 = !DISubprogram(name: "unchecked_at", linkageName: "_ZN6VectorI6StringE12unchecked_atEi", scope: !492, file: !493, line: 172, type: !642, scopeLine: 172, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!658 = !DISubprogram(name: "unchecked_at", linkageName: "_ZNK6VectorI6StringE12unchecked_atEi", scope: !492, file: !493, line: 173, type: !645, scopeLine: 173, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!659 = !DISubprogram(name: "at_u", linkageName: "_ZN6VectorI6StringE4at_uEi", scope: !492, file: !493, line: 174, type: !642, scopeLine: 174, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!660 = !DISubprogram(name: "at_u", linkageName: "_ZNK6VectorI6StringE4at_uEi", scope: !492, file: !493, line: 175, type: !645, scopeLine: 175, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!661 = !DISubprogram(name: "data", linkageName: "_ZN6VectorI6StringE4dataEv", scope: !492, file: !493, line: 177, type: !662, scopeLine: 177, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!662 = !DISubroutineType(types: !663)
!663 = !{!508, !585}
!664 = !DISubprogram(name: "data", linkageName: "_ZNK6VectorI6StringE4dataEv", scope: !492, file: !493, line: 178, type: !665, scopeLine: 178, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!665 = !DISubroutineType(types: !666)
!666 = !{!512, !626}
!667 = !DISubprogram(name: "push_back", linkageName: "_ZN6VectorI6StringE9push_backERKS0_", scope: !492, file: !493, line: 180, type: !668, scopeLine: 180, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!668 = !DISubroutineType(types: !669)
!669 = !{null, !585, !590}
!670 = !DISubprogram(name: "pop_back", linkageName: "_ZN6VectorI6StringE8pop_backEv", scope: !492, file: !493, line: 185, type: !583, scopeLine: 185, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!671 = !DISubprogram(name: "push_front", linkageName: "_ZN6VectorI6StringE10push_frontERKS0_", scope: !492, file: !493, line: 186, type: !668, scopeLine: 186, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!672 = !DISubprogram(name: "pop_front", linkageName: "_ZN6VectorI6StringE9pop_frontEv", scope: !492, file: !493, line: 187, type: !583, scopeLine: 187, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!673 = !DISubprogram(name: "insert", linkageName: "_ZN6VectorI6StringE6insertEPS0_RKS0_", scope: !492, file: !493, line: 189, type: !674, scopeLine: 189, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!674 = !DISubroutineType(types: !675)
!675 = !{!620, !585, !620, !590}
!676 = !DISubprogram(name: "erase", linkageName: "_ZN6VectorI6StringE5eraseEPS0_", scope: !492, file: !493, line: 190, type: !677, scopeLine: 190, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!677 = !DISubroutineType(types: !678)
!678 = !{!620, !585, !620}
!679 = !DISubprogram(name: "erase", linkageName: "_ZN6VectorI6StringE5eraseEPS0_S2_", scope: !492, file: !493, line: 191, type: !680, scopeLine: 191, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!680 = !DISubroutineType(types: !681)
!681 = !{!620, !585, !620, !620}
!682 = !DISubprogram(name: "clear", linkageName: "_ZN6VectorI6StringE5clearEv", scope: !492, file: !493, line: 193, type: !583, scopeLine: 193, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!683 = !DISubprogram(name: "swap", linkageName: "_ZN6VectorI6StringE4swapERS1_", scope: !492, file: !493, line: 195, type: !684, scopeLine: 195, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!684 = !DISubroutineType(types: !685)
!685 = !{null, !585, !491}
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DICompositeType(tag: DW_TAG_class_type, name: "ErrorHandler", file: !688, line: 90, flags: DIFlagFwdDecl, identifier: "_ZTS12ErrorHandler")
!688 = !DIFile(filename: "../dummy_inc/click/error.hh", directory: "/home/john/projects/click/ir-dir")
!689 = !DISubprogram(name: "initialize", linkageName: "_ZN13IPRateMonitor10initializeEP12ErrorHandler", scope: !4, file: !3, line: 100, type: !690, scopeLine: 100, containingType: !4, virtualIndex: 19, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!690 = !DISubroutineType(types: !691)
!691 = !{!13, !480, !686}
!692 = !DISubprogram(name: "cleanup", linkageName: "_ZN13IPRateMonitor7cleanupEN7Element12CleanupStageE", scope: !4, file: !3, line: 101, type: !693, scopeLine: 101, containingType: !4, virtualIndex: 22, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!693 = !DISubroutineType(types: !694)
!694 = !{null, !480, !695}
!695 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CleanupStage", scope: !7, file: !8, line: 97, baseType: !19, size: 32, elements: !696, identifier: "_ZTSN7Element12CleanupStageE")
!696 = !{!697, !698, !699, !700, !701, !702, !703, !704}
!697 = !DIEnumerator(name: "CLEANUP_NO_ROUTER", value: 0, isUnsigned: true)
!698 = !DIEnumerator(name: "CLEANUP_BEFORE_CONFIGURE", value: 0, isUnsigned: true)
!699 = !DIEnumerator(name: "CLEANUP_CONFIGURE_FAILED", value: 1, isUnsigned: true)
!700 = !DIEnumerator(name: "CLEANUP_CONFIGURED", value: 2, isUnsigned: true)
!701 = !DIEnumerator(name: "CLEANUP_INITIALIZE_FAILED", value: 3, isUnsigned: true)
!702 = !DIEnumerator(name: "CLEANUP_INITIALIZED", value: 4, isUnsigned: true)
!703 = !DIEnumerator(name: "CLEANUP_ROUTER_INITIALIZED", value: 5, isUnsigned: true)
!704 = !DIEnumerator(name: "CLEANUP_MANUAL", value: 6, isUnsigned: true)
!705 = !DISubprogram(name: "set_resettime", linkageName: "_ZN13IPRateMonitor13set_resettimeEv", scope: !4, file: !3, line: 103, type: !478, scopeLine: 103, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!706 = !DISubprogram(name: "set_anno_level", linkageName: "_ZN13IPRateMonitor14set_anno_levelEjjj", scope: !4, file: !3, line: 106, type: !707, scopeLine: 106, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!707 = !DISubroutineType(types: !708)
!708 = !{null, !480, !19, !19, !19}
!709 = !DISubprogram(name: "push", linkageName: "_ZN13IPRateMonitor4pushEiP6Packet", scope: !4, file: !3, line: 108, type: !710, scopeLine: 108, containingType: !4, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!710 = !DISubroutineType(types: !711)
!711 = !{null, !480, !13, !712}
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Packet", file: !714, line: 35, size: 1344, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !715, identifier: "_ZTS6Packet")
!714 = !DIFile(filename: "../dummy_inc/click/packet.hh", directory: "/home/john/projects/click/ir-dir")
!715 = !{!716, !777, !778, !780, !781, !782, !783, !828, !834, !835, !924, !927, !930, !933, !936, !940, !944, !947, !950, !953, !954, !957, !958, !959, !960, !961, !962, !965, !968, !971, !972, !975, !976, !979, !982, !983, !984, !985, !988, !991, !994, !997, !998, !999, !1002, !1003, !1004, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1027, !1030, !1035, !1036, !1037, !1040, !1045, !1046, !1047, !1050, !1053, !1058, !1063, !1068, !1073, !1077, !1303, !1307, !1310, !1316, !1319, !1322, !1325, !1328, !1332, !1335, !1336, !1337, !1338, !1428, !1431, !1432, !1435, !1439, !1444, !1448, !1453, !1456, !1459, !1462, !1465, !1471, !1474, !1477, !1480, !1483, !1486, !1489, !1492, !1495, !1498, !1499, !1502, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1543, !1544, !1548, !1551, !1554, !1557, !1558}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "_use_count", scope: !713, file: !714, line: 731, baseType: !717, size: 32)
!717 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "atomic_uint32_t", file: !718, line: 52, size: 32, flags: DIFlagTypePassByValue, elements: !719, identifier: "_ZTS15atomic_uint32_t")
!718 = !DIFile(filename: "../dummy_inc/click/atomic.hh", directory: "/home/john/projects/click/ir-dir")
!719 = !{!720, !721, !726, !727, !732, !737, !738, !739, !740, !743, !746, !747, !748, !751, !752, !755, !758, !761, !765, !768, !771, !774}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "_val", scope: !717, file: !718, line: 91, baseType: !131, size: 32)
!721 = !DISubprogram(name: "value", linkageName: "_ZNK15atomic_uint32_t5valueEv", scope: !717, file: !718, line: 57, type: !722, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!722 = !DISubroutineType(types: !723)
!723 = !{!131, !724}
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!725 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !717)
!726 = !DISubprogram(name: "operator unsigned int", linkageName: "_ZNK15atomic_uint32_tcvjEv", scope: !717, file: !718, line: 58, type: !722, scopeLine: 58, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!727 = !DISubprogram(name: "operator=", linkageName: "_ZN15atomic_uint32_taSEj", scope: !717, file: !718, line: 60, type: !728, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!728 = !DISubroutineType(types: !729)
!729 = !{!730, !731, !131}
!730 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !717, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!732 = !DISubprogram(name: "operator+=", linkageName: "_ZN15atomic_uint32_tpLEi", scope: !717, file: !718, line: 62, type: !733, scopeLine: 62, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!733 = !DISubroutineType(types: !734)
!734 = !{!730, !731, !735}
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !240, line: 26, baseType: !736)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !134, line: 41, baseType: !13)
!737 = !DISubprogram(name: "operator-=", linkageName: "_ZN15atomic_uint32_tmIEi", scope: !717, file: !718, line: 63, type: !733, scopeLine: 63, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!738 = !DISubprogram(name: "operator|=", linkageName: "_ZN15atomic_uint32_toREj", scope: !717, file: !718, line: 64, type: !728, scopeLine: 64, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!739 = !DISubprogram(name: "operator&=", linkageName: "_ZN15atomic_uint32_taNEj", scope: !717, file: !718, line: 65, type: !728, scopeLine: 65, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!740 = !DISubprogram(name: "operator++", linkageName: "_ZN15atomic_uint32_tppEv", scope: !717, file: !718, line: 67, type: !741, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!741 = !DISubroutineType(types: !742)
!742 = !{null, !731}
!743 = !DISubprogram(name: "operator++", linkageName: "_ZN15atomic_uint32_tppEi", scope: !717, file: !718, line: 68, type: !744, scopeLine: 68, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!744 = !DISubroutineType(types: !745)
!745 = !{null, !731, !13}
!746 = !DISubprogram(name: "operator--", linkageName: "_ZN15atomic_uint32_tmmEv", scope: !717, file: !718, line: 69, type: !741, scopeLine: 69, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!747 = !DISubprogram(name: "operator--", linkageName: "_ZN15atomic_uint32_tmmEi", scope: !717, file: !718, line: 70, type: !744, scopeLine: 70, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!748 = !DISubprogram(name: "swap", linkageName: "_ZN15atomic_uint32_t4swapEj", scope: !717, file: !718, line: 72, type: !749, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!749 = !DISubroutineType(types: !750)
!750 = !{!131, !731, !131}
!751 = !DISubprogram(name: "fetch_and_add", linkageName: "_ZN15atomic_uint32_t13fetch_and_addEj", scope: !717, file: !718, line: 73, type: !749, scopeLine: 73, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!752 = !DISubprogram(name: "dec_and_test", linkageName: "_ZN15atomic_uint32_t12dec_and_testEv", scope: !717, file: !718, line: 74, type: !753, scopeLine: 74, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!753 = !DISubroutineType(types: !754)
!754 = !{!10, !731}
!755 = !DISubprogram(name: "compare_swap", linkageName: "_ZN15atomic_uint32_t12compare_swapEjj", scope: !717, file: !718, line: 75, type: !756, scopeLine: 75, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!756 = !DISubroutineType(types: !757)
!757 = !{!131, !731, !131, !131}
!758 = !DISubprogram(name: "compare_and_swap", linkageName: "_ZN15atomic_uint32_t16compare_and_swapEjj", scope: !717, file: !718, line: 76, type: !759, scopeLine: 76, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!759 = !DISubroutineType(types: !760)
!760 = !{!10, !731, !131, !131}
!761 = !DISubprogram(name: "swap", linkageName: "_ZN15atomic_uint32_t4swapERVjj", scope: !717, file: !718, line: 78, type: !762, scopeLine: 78, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!762 = !DISubroutineType(types: !763)
!763 = !{!131, !764, !131}
!764 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !130, size: 64)
!765 = !DISubprogram(name: "inc", linkageName: "_ZN15atomic_uint32_t3incERVj", scope: !717, file: !718, line: 79, type: !766, scopeLine: 79, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!766 = !DISubroutineType(types: !767)
!767 = !{null, !764}
!768 = !DISubprogram(name: "dec_and_test", linkageName: "_ZN15atomic_uint32_t12dec_and_testERVj", scope: !717, file: !718, line: 80, type: !769, scopeLine: 80, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!769 = !DISubroutineType(types: !770)
!770 = !{!10, !764}
!771 = !DISubprogram(name: "compare_swap", linkageName: "_ZN15atomic_uint32_t12compare_swapERVjjj", scope: !717, file: !718, line: 81, type: !772, scopeLine: 81, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!772 = !DISubroutineType(types: !773)
!773 = !{!131, !764, !131, !131}
!774 = !DISubprogram(name: "compare_and_swap", linkageName: "_ZN15atomic_uint32_t16compare_and_swapERVjjj", scope: !717, file: !718, line: 82, type: !775, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!775 = !DISubroutineType(types: !776)
!776 = !{!10, !764, !131, !131}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_data_packet", scope: !713, file: !714, line: 732, baseType: !712, size: 64, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_head", scope: !713, file: !714, line: 734, baseType: !779, size: 64, offset: 128)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !713, file: !714, line: 735, baseType: !779, size: 64, offset: 192)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_tail", scope: !713, file: !714, line: 736, baseType: !779, size: 64, offset: 256)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_end", scope: !713, file: !714, line: 737, baseType: !779, size: 64, offset: 320)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_aa", scope: !713, file: !714, line: 741, baseType: !784, size: 832, offset: 384)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AllAnno", scope: !713, file: !714, line: 716, size: 832, flags: DIFlagTypePassByValue, elements: !785, identifier: "_ZTSN6Packet7AllAnnoE")
!785 = !{!786, !812, !813, !814, !815, !825, !826, !827}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !784, file: !714, line: 717, baseType: !787, size: 384)
!787 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Anno", scope: !713, file: !714, line: 702, size: 384, flags: DIFlagTypePassByValue, elements: !788, identifier: "_ZTSN6Packet4AnnoE")
!788 = !{!789, !793, !797, !804, !808}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !787, file: !714, line: 703, baseType: !790, size: 384)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 384, elements: !791)
!791 = !{!792}
!792 = !DISubrange(count: 48)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "u8", scope: !787, file: !714, line: 704, baseType: !794, size: 384)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !795, size: 384, elements: !791)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !132, line: 24, baseType: !796)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !134, line: 38, baseType: !177)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "u16", scope: !787, file: !714, line: 705, baseType: !798, size: 384)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !799, size: 384, elements: !802)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !132, line: 25, baseType: !800)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !134, line: 40, baseType: !801)
!801 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!802 = !{!803}
!803 = !DISubrange(count: 24)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "u32", scope: !787, file: !714, line: 706, baseType: !805, size: 384)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 384, elements: !806)
!806 = !{!807}
!807 = !DISubrange(count: 12)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !787, file: !714, line: 708, baseType: !809, size: 384)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 384, elements: !810)
!810 = !{!811}
!811 = !DISubrange(count: 6)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "mac", scope: !784, file: !714, line: 718, baseType: !779, size: 64, offset: 384)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "nh", scope: !784, file: !714, line: 719, baseType: !779, size: 64, offset: 448)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !784, file: !714, line: 720, baseType: !779, size: 64, offset: 512)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !784, file: !714, line: 721, baseType: !816, size: 32, offset: 576)
!816 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PacketType", scope: !713, file: !714, line: 368, baseType: !19, size: 32, elements: !817, identifier: "_ZTSN6Packet10PacketTypeE")
!817 = !{!818, !819, !820, !821, !822, !823, !824}
!818 = !DIEnumerator(name: "HOST", value: 0, isUnsigned: true)
!819 = !DIEnumerator(name: "BROADCAST", value: 1, isUnsigned: true)
!820 = !DIEnumerator(name: "MULTICAST", value: 2, isUnsigned: true)
!821 = !DIEnumerator(name: "OTHERHOST", value: 3, isUnsigned: true)
!822 = !DIEnumerator(name: "OUTGOING", value: 4, isUnsigned: true)
!823 = !DIEnumerator(name: "LOOPBACK", value: 5, isUnsigned: true)
!824 = !DIEnumerator(name: "FASTROUTE", value: 6, isUnsigned: true)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !784, file: !714, line: 722, baseType: !138, size: 64, offset: 608)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !784, file: !714, line: 723, baseType: !712, size: 64, offset: 704)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !784, file: !714, line: 724, baseType: !712, size: 64, offset: 768)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_destructor", scope: !713, file: !714, line: 746, baseType: !829, size: 64, offset: 1216)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "buffer_destructor_type", scope: !713, file: !714, line: 65, baseType: !830)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{null, !779, !15, !833}
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_destructor_argument", scope: !713, file: !714, line: 747, baseType: !833, size: 64, offset: 1280)
!835 = !DISubprogram(name: "make", linkageName: "_ZN6Packet4makeEjPKvjj", scope: !713, file: !714, line: 52, type: !836, scopeLine: 52, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!836 = !DISubroutineType(types: !837)
!837 = !{!838, !131, !922, !131, !131}
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "WritablePacket", file: !714, line: 778, size: 1344, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !840, identifier: "_ZTS14WritablePacket")
!840 = !{!841, !842, !847, !848, !849, !850, !851, !856, !857, !880, !885, !886, !891, !896, !901, !902, !906, !907, !912, !913, !916, !919}
!841 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !839, baseType: !713, flags: DIFlagPublic, extraData: i32 0)
!842 = !DISubprogram(name: "data", linkageName: "_ZNK14WritablePacket4dataEv", scope: !839, file: !714, line: 780, type: !843, scopeLine: 780, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!843 = !DISubroutineType(types: !844)
!844 = !{!779, !845}
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!846 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !839)
!847 = !DISubprogram(name: "end_data", linkageName: "_ZNK14WritablePacket8end_dataEv", scope: !839, file: !714, line: 781, type: !843, scopeLine: 781, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!848 = !DISubprogram(name: "buffer", linkageName: "_ZNK14WritablePacket6bufferEv", scope: !839, file: !714, line: 782, type: !843, scopeLine: 782, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!849 = !DISubprogram(name: "end_buffer", linkageName: "_ZNK14WritablePacket10end_bufferEv", scope: !839, file: !714, line: 783, type: !843, scopeLine: 783, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!850 = !DISubprogram(name: "mac_header", linkageName: "_ZNK14WritablePacket10mac_headerEv", scope: !839, file: !714, line: 784, type: !843, scopeLine: 784, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!851 = !DISubprogram(name: "ether_header", linkageName: "_ZNK14WritablePacket12ether_headerEv", scope: !839, file: !714, line: 785, type: !852, scopeLine: 785, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!852 = !DISubroutineType(types: !853)
!853 = !{!854, !845}
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DICompositeType(tag: DW_TAG_structure_type, name: "click_ether", file: !714, line: 24, flags: DIFlagFwdDecl, identifier: "_ZTS11click_ether")
!856 = !DISubprogram(name: "network_header", linkageName: "_ZNK14WritablePacket14network_headerEv", scope: !839, file: !714, line: 786, type: !843, scopeLine: 786, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!857 = !DISubprogram(name: "ip_header", linkageName: "_ZNK14WritablePacket9ip_headerEv", scope: !839, file: !714, line: 787, type: !858, scopeLine: 787, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!858 = !DISubroutineType(types: !859)
!859 = !{!860, !845}
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "click_ip", file: !862, line: 23, size: 160, flags: DIFlagTypePassByValue, elements: !863, identifier: "_ZTS8click_ip")
!862 = !DIFile(filename: "../dummy_inc/clicknet/ip.h", directory: "/home/john/projects/click/ir-dir")
!863 = !{!864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !879}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "ip_hl", scope: !861, file: !862, line: 28, baseType: !19, size: 4, flags: DIFlagBitField, extraData: i64 0)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "ip_v", scope: !861, file: !862, line: 29, baseType: !19, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "ip_tos", scope: !861, file: !862, line: 33, baseType: !795, size: 8, offset: 8)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "ip_len", scope: !861, file: !862, line: 40, baseType: !799, size: 16, offset: 16)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "ip_id", scope: !861, file: !862, line: 41, baseType: !799, size: 16, offset: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "ip_off", scope: !861, file: !862, line: 42, baseType: !799, size: 16, offset: 48)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "ip_ttl", scope: !861, file: !862, line: 47, baseType: !795, size: 8, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "ip_p", scope: !861, file: !862, line: 48, baseType: !795, size: 8, offset: 72)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "ip_sum", scope: !861, file: !862, line: 49, baseType: !799, size: 16, offset: 80)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "ip_src", scope: !861, file: !862, line: 50, baseType: !874, size: 32, offset: 96)
